pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* AAR_OUT_AMOUNT: Number of bytes transferred in the last transaction */
  #define AAR_OUT_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..7 : Number of bytes written to memory after triggering the START task. */
  #define AAR_OUT_AMOUNT_AMOUNT_Pos (0UL)
  #define AAR_OUT_AMOUNT_AMOUNT_Msk (0xFFUL << AAR_OUT_AMOUNT_AMOUNT_Pos)
  #define AAR_OUT_AMOUNT_AMOUNT_Min (0x01UL)
  #define AAR_OUT_AMOUNT_AMOUNT_Max (0xFFUL)


/* ======================================================= Struct AAR ======================================================== */
/**
  * @brief Accelerated Address Resolver
  */
  typedef struct {
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start resolving addresses based on IRKs specified in
                                                                         the IRK data structure*/
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000100) Address resolution procedure complete or ended due to
                                                                         an error*/
    __IOM uint32_t EVENTS_RESOLVED;
    __IOM uint32_t EVENTS_NOTRESOLVED;
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x0000010C) Operation aborted because of a STOP task or due to an
                                                                         error*/
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_END;
    __IOM uint32_t PUBLISH_RESOLVED;
    __IOM uint32_t PUBLISH_NOTRESOLVED;
    __IOM uint32_t PUBLISH_ERROR;
    __IM uint32_t RESERVED3[93];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED4[62];
    __IM uint32_t ERRORSTATUS;
    __IM uint32_t RESERVED5[62];
    __IOM uint32_t ENABLE;
    __IM uint32_t RESERVED6;
    __IOM uint32_t MAXRESOLVED;
    __IM uint32_t RESERVED7[9];
    __IOM NRF_AAR_IN_Type IN;
    __IM uint32_t RESERVED8;
    __IOM NRF_AAR_OUT_Type OUT;
  } NRF_AAR_Type;

/* AAR_TASKS_START: Start resolving addresses based on IRKs specified in the IRK data structure */
  #define AAR_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start resolving addresses based on IRKs specified in the IRK data structure */
  #define AAR_TASKS_START_TASKS_START_Pos (0UL)
  #define AAR_TASKS_START_TASKS_START_Msk (0x1UL << AAR_TASKS_START_TASKS_START_Pos)
  #define AAR_TASKS_START_TASKS_START_Min (0x1UL)
  #define AAR_TASKS_START_TASKS_START_Max (0x1UL)
  #define AAR_TASKS_START_TASKS_START_Trigger (0x1UL)


/* AAR_TASKS_STOP: Stop resolving addresses */
  #define AAR_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop resolving addresses */
  #define AAR_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define AAR_TASKS_STOP_TASKS_STOP_Msk (0x1UL << AAR_TASKS_STOP_TASKS_STOP_Pos)
  #define AAR_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define AAR_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define AAR_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* AAR_SUBSCRIBE_START: Subscribe configuration for task START */
  #define AAR_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define AAR_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define AAR_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << AAR_SUBSCRIBE_START_CHIDX_Pos)
  #define AAR_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define AAR_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define AAR_SUBSCRIBE_START_EN_Pos (31UL)
  #define AAR_SUBSCRIBE_START_EN_Msk (0x1UL << AAR_SUBSCRIBE_START_EN_Pos)
  #define AAR_SUBSCRIBE_START_EN_Min (0x0UL)
  #define AAR_SUBSCRIBE_START_EN_Max (0x1UL)
  #define AAR_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define AAR_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* AAR_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define AAR_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define AAR_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define AAR_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << AAR_SUBSCRIBE_STOP_CHIDX_Pos)
  #define AAR_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define AAR_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define AAR_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define AAR_SUBSCRIBE_STOP_EN_Msk (0x1UL << AAR_SUBSCRIBE_STOP_EN_Pos)
  #define AAR_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define AAR_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define AAR_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define AAR_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* AAR_EVENTS_END: Address resolution procedure complete or ended due to an error */
  #define AAR_EVENTS_END_ResetValue (0x00000000UL)

/* EVENTS_END @Bit 0 : Address resolution procedure complete or ended due to an error */
  #define AAR_EVENTS_END_EVENTS_END_Pos (0UL)
  #define AAR_EVENTS_END_EVENTS_END_Msk (0x1UL << AAR_EVENTS_END_EVENTS_END_Pos)
  #define AAR_EVENTS_END_EVENTS_END_Min (0x0UL)
  #define AAR_EVENTS_END_EVENTS_END_Max (0x1UL)
  #define AAR_EVENTS_END_EVENTS_END_NotGenerated (0x0UL)
  #define AAR_EVENTS_END_EVENTS_END_Generated (0x1UL)


/* AAR_EVENTS_RESOLVED: Address resolved */
  #define AAR_EVENTS_RESOLVED_ResetValue (0x00000000UL)

/* EVENTS_RESOLVED @Bit 0 : Address resolved */
  #define AAR_EVENTS_RESOLVED_EVENTS_RESOLVED_Pos (0UL)
  #define AAR_EVENTS_RESOLVED_EVENTS_RESOLVED_Msk (0x1UL << AAR_EVENTS_RESOLVED_EVENTS_RESOLVED_Pos) /*!< Bit mask of
                                                                            EVENTS_RESOLVED field.*/
  #define AAR_EVENTS_RESOLVED_EVENTS_RESOLVED_Min (0x0UL)
  #define AAR_EVENTS_RESOLVED_EVENTS_RESOLVED_Max (0x1UL)
  #define AAR_EVENTS_RESOLVED_EVENTS_RESOLVED_NotGenerated (0x0UL)
  #define AAR_EVENTS_RESOLVED_EVENTS_RESOLVED_Generated (0x1UL)


/* AAR_EVENTS_NOTRESOLVED: Address not resolved */
  #define AAR_EVENTS_NOTRESOLVED_ResetValue (0x00000000UL)

/* EVENTS_NOTRESOLVED @Bit 0 : Address not resolved */
  #define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Pos (0UL)
  #define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Msk (0x1UL << AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Pos) /*!< Bit mask
                                                                            of EVENTS_NOTRESOLVED field.*/
  #define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Min (0x0UL)
  #define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Max (0x1UL)
  #define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_NotGenerated (0x0UL)
  #define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Generated (0x1UL)


/* AAR_EVENTS_ERROR: Operation aborted because of a STOP task or due to an error */
  #define AAR_EVENTS_ERROR_ResetValue (0x00000000UL)

