pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EVENTS_ERROR @Bit 0 : Operation aborted because of a STOP task or due to an error */
  #define AAR_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)
  #define AAR_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << AAR_EVENTS_ERROR_EVENTS_ERROR_Pos)
  #define AAR_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)
  #define AAR_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)
  #define AAR_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL)
  #define AAR_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL)


/* AAR_PUBLISH_END: Publish configuration for event END */
  #define AAR_PUBLISH_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define AAR_PUBLISH_END_CHIDX_Pos (0UL)
  #define AAR_PUBLISH_END_CHIDX_Msk (0xFFUL << AAR_PUBLISH_END_CHIDX_Pos)
  #define AAR_PUBLISH_END_CHIDX_Min (0x00UL)
  #define AAR_PUBLISH_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define AAR_PUBLISH_END_EN_Pos (31UL)
  #define AAR_PUBLISH_END_EN_Msk (0x1UL << AAR_PUBLISH_END_EN_Pos)
  #define AAR_PUBLISH_END_EN_Min (0x0UL)
  #define AAR_PUBLISH_END_EN_Max (0x1UL)
  #define AAR_PUBLISH_END_EN_Disabled (0x0UL)
  #define AAR_PUBLISH_END_EN_Enabled (0x1UL)


/* AAR_PUBLISH_RESOLVED: Publish configuration for event RESOLVED */
  #define AAR_PUBLISH_RESOLVED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event RESOLVED will publish to */
  #define AAR_PUBLISH_RESOLVED_CHIDX_Pos (0UL)
  #define AAR_PUBLISH_RESOLVED_CHIDX_Msk (0xFFUL << AAR_PUBLISH_RESOLVED_CHIDX_Pos)
  #define AAR_PUBLISH_RESOLVED_CHIDX_Min (0x00UL)
  #define AAR_PUBLISH_RESOLVED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define AAR_PUBLISH_RESOLVED_EN_Pos (31UL)
  #define AAR_PUBLISH_RESOLVED_EN_Msk (0x1UL << AAR_PUBLISH_RESOLVED_EN_Pos)
  #define AAR_PUBLISH_RESOLVED_EN_Min (0x0UL)
  #define AAR_PUBLISH_RESOLVED_EN_Max (0x1UL)
  #define AAR_PUBLISH_RESOLVED_EN_Disabled (0x0UL)
  #define AAR_PUBLISH_RESOLVED_EN_Enabled (0x1UL)


/* AAR_PUBLISH_NOTRESOLVED: Publish configuration for event NOTRESOLVED */
  #define AAR_PUBLISH_NOTRESOLVED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event NOTRESOLVED will publish to */
  #define AAR_PUBLISH_NOTRESOLVED_CHIDX_Pos (0UL)
  #define AAR_PUBLISH_NOTRESOLVED_CHIDX_Msk (0xFFUL << AAR_PUBLISH_NOTRESOLVED_CHIDX_Pos)
  #define AAR_PUBLISH_NOTRESOLVED_CHIDX_Min (0x00UL)
  #define AAR_PUBLISH_NOTRESOLVED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define AAR_PUBLISH_NOTRESOLVED_EN_Pos (31UL)
  #define AAR_PUBLISH_NOTRESOLVED_EN_Msk (0x1UL << AAR_PUBLISH_NOTRESOLVED_EN_Pos)
  #define AAR_PUBLISH_NOTRESOLVED_EN_Min (0x0UL)
  #define AAR_PUBLISH_NOTRESOLVED_EN_Max (0x1UL)
  #define AAR_PUBLISH_NOTRESOLVED_EN_Disabled (0x0UL)
  #define AAR_PUBLISH_NOTRESOLVED_EN_Enabled (0x1UL)


/* AAR_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define AAR_PUBLISH_ERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define AAR_PUBLISH_ERROR_CHIDX_Pos (0UL)
  #define AAR_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << AAR_PUBLISH_ERROR_CHIDX_Pos)
  #define AAR_PUBLISH_ERROR_CHIDX_Min (0x00UL)
  #define AAR_PUBLISH_ERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define AAR_PUBLISH_ERROR_EN_Pos (31UL)
  #define AAR_PUBLISH_ERROR_EN_Msk (0x1UL << AAR_PUBLISH_ERROR_EN_Pos)
  #define AAR_PUBLISH_ERROR_EN_Min (0x0UL)
  #define AAR_PUBLISH_ERROR_EN_Max (0x1UL)
  #define AAR_PUBLISH_ERROR_EN_Disabled (0x0UL)
  #define AAR_PUBLISH_ERROR_EN_Enabled (0x1UL)


/* AAR_INTENSET: Enable interrupt */
  #define AAR_INTENSET_ResetValue (0x00000000UL)

/* END @Bit 0 : Write '1' to enable interrupt for event END */
  #define AAR_INTENSET_END_Pos (0UL)
  #define AAR_INTENSET_END_Msk (0x1UL << AAR_INTENSET_END_Pos)
  #define AAR_INTENSET_END_Min (0x0UL)
  #define AAR_INTENSET_END_Max (0x1UL)
  #define AAR_INTENSET_END_Set (0x1UL)
  #define AAR_INTENSET_END_Disabled (0x0UL)
  #define AAR_INTENSET_END_Enabled (0x1UL)

/* RESOLVED @Bit 1 : Write '1' to enable interrupt for event RESOLVED */
  #define AAR_INTENSET_RESOLVED_Pos (1UL)
  #define AAR_INTENSET_RESOLVED_Msk (0x1UL << AAR_INTENSET_RESOLVED_Pos)
  #define AAR_INTENSET_RESOLVED_Min (0x0UL)
  #define AAR_INTENSET_RESOLVED_Max (0x1UL)
  #define AAR_INTENSET_RESOLVED_Set (0x1UL)
  #define AAR_INTENSET_RESOLVED_Disabled (0x0UL)
  #define AAR_INTENSET_RESOLVED_Enabled (0x1UL)

/* NOTRESOLVED @Bit 2 : Write '1' to enable interrupt for event NOTRESOLVED */
  #define AAR_INTENSET_NOTRESOLVED_Pos (2UL)
  #define AAR_INTENSET_NOTRESOLVED_Msk (0x1UL << AAR_INTENSET_NOTRESOLVED_Pos)
  #define AAR_INTENSET_NOTRESOLVED_Min (0x0UL)
  #define AAR_INTENSET_NOTRESOLVED_Max (0x1UL)
  #define AAR_INTENSET_NOTRESOLVED_Set (0x1UL)
  #define AAR_INTENSET_NOTRESOLVED_Disabled (0x0UL)
  #define AAR_INTENSET_NOTRESOLVED_Enabled (0x1UL)

/* ERROR @Bit 3 : Write '1' to enable interrupt for event ERROR */
  #define AAR_INTENSET_ERROR_Pos (3UL)
  #define AAR_INTENSET_ERROR_Msk (0x1UL << AAR_INTENSET_ERROR_Pos)
  #define AAR_INTENSET_ERROR_Min (0x0UL)
  #define AAR_INTENSET_ERROR_Max (0x1UL)
  #define AAR_INTENSET_ERROR_Set (0x1UL)
  #define AAR_INTENSET_ERROR_Disabled (0x0UL)
  #define AAR_INTENSET_ERROR_Enabled (0x1UL)


/* AAR_INTENCLR: Disable interrupt */
  #define AAR_INTENCLR_ResetValue (0x00000000UL)

/* END @Bit 0 : Write '1' to disable interrupt for event END */
  #define AAR_INTENCLR_END_Pos (0UL)
  #define AAR_INTENCLR_END_Msk (0x1UL << AAR_INTENCLR_END_Pos)
  #define AAR_INTENCLR_END_Min (0x0UL)
  #define AAR_INTENCLR_END_Max (0x1UL)
  #define AAR_INTENCLR_END_Clear (0x1UL)
  #define AAR_INTENCLR_END_Disabled (0x0UL)
  #define AAR_INTENCLR_END_Enabled (0x1UL)

/* RESOLVED @Bit 1 : Write '1' to disable interrupt for event RESOLVED */
  #define AAR_INTENCLR_RESOLVED_Pos (1UL)
  #define AAR_INTENCLR_RESOLVED_Msk (0x1UL << AAR_INTENCLR_RESOLVED_Pos)
  #define AAR_INTENCLR_RESOLVED_Min (0x0UL)
  #define AAR_INTENCLR_RESOLVED_Max (0x1UL)
  #define AAR_INTENCLR_RESOLVED_Clear (0x1UL)
  #define AAR_INTENCLR_RESOLVED_Disabled (0x0UL)
  #define AAR_INTENCLR_RESOLVED_Enabled (0x1UL)

/* NOTRESOLVED @Bit 2 : Write '1' to disable interrupt for event NOTRESOLVED */
  #define AAR_INTENCLR_NOTRESOLVED_Pos (2UL)
  #define AAR_INTENCLR_NOTRESOLVED_Msk (0x1UL << AAR_INTENCLR_NOTRESOLVED_Pos)
  #define AAR_INTENCLR_NOTRESOLVED_Min (0x0UL)
  #define AAR_INTENCLR_NOTRESOLVED_Max (0x1UL)
  #define AAR_INTENCLR_NOTRESOLVED_Clear (0x1UL)
  #define AAR_INTENCLR_NOTRESOLVED_Disabled (0x0UL)
  #define AAR_INTENCLR_NOTRESOLVED_Enabled (0x1UL)

/* ERROR @Bit 3 : Write '1' to disable interrupt for event ERROR */
  #define AAR_INTENCLR_ERROR_Pos (3UL)
  #define AAR_INTENCLR_ERROR_Msk (0x1UL << AAR_INTENCLR_ERROR_Pos)
  #define AAR_INTENCLR_ERROR_Min (0x0UL)
  #define AAR_INTENCLR_ERROR_Max (0x1UL)
  #define AAR_INTENCLR_ERROR_Clear (0x1UL)
  #define AAR_INTENCLR_ERROR_Disabled (0x0UL)
  #define AAR_INTENCLR_ERROR_Enabled (0x1UL)


/* AAR_ERRORSTATUS: Error status */
  #define AAR_ERRORSTATUS_ResetValue (0x00000000UL)

/* ERRORSTATUS @Bits 0..2 : Error status when the ERROR event is generated */
  #define AAR_ERRORSTATUS_ERRORSTATUS_Pos (0UL)
  #define AAR_ERRORSTATUS_ERRORSTATUS_Msk (0x7UL << AAR_ERRORSTATUS_ERRORSTATUS_Pos)
  #define AAR_ERRORSTATUS_ERRORSTATUS_Min (0x0UL)
  #define AAR_ERRORSTATUS_ERRORSTATUS_Max (0x4UL)
  #define AAR_ERRORSTATUS_ERRORSTATUS_NoError (0x0UL)
  #define AAR_ERRORSTATUS_ERRORSTATUS_PrematureInptrEnd (0x1UL)
  #define AAR_ERRORSTATUS_ERRORSTATUS_PrematureOutptrEnd (0x2UL)
  #define AAR_ERRORSTATUS_ERRORSTATUS_DmaError (0x4UL)


/* AAR_ENABLE: Enable AAR */
  #define AAR_ENABLE_ResetValue (0x00000000UL)

