pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE @Bits 0..1 : Enable or disable AAR */
  #define AAR_ENABLE_ENABLE_Pos (0UL)
  #define AAR_ENABLE_ENABLE_Msk (0x3UL << AAR_ENABLE_ENABLE_Pos)
  #define AAR_ENABLE_ENABLE_Min (0x0UL)
  #define AAR_ENABLE_ENABLE_Max (0x3UL)
  #define AAR_ENABLE_ENABLE_Disabled (0x0UL)
  #define AAR_ENABLE_ENABLE_Enabled (0x3UL)


/* AAR_MAXRESOLVED: Maximum number of IRKs to resolve */
  #define AAR_MAXRESOLVED_ResetValue (0x00000001UL)

/* MAXRESOLVED @Bits 0..11 : The maximum number of IRKs to resolve */
  #define AAR_MAXRESOLVED_MAXRESOLVED_Pos (0UL)
  #define AAR_MAXRESOLVED_MAXRESOLVED_Msk (0xFFFUL << AAR_MAXRESOLVED_MAXRESOLVED_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ABB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct ABB ======================================================== */
/**
  * @brief ABB peripheral
  */
  typedef struct {
    __IM uint32_t RESERVED[256];
    __IM uint32_t STATUS;
    __IM uint32_t RESERVED1[31];
    __IOM uint32_t MODE;
  } NRF_ABB_Type;

/* ABB_STATUS: ABB status */
  #define ABB_STATUS_ResetValue (0x00000000UL)

/* OPPOINT @Bits 0..1 : The current ABB operating point */
  #define ABB_STATUS_OPPOINT_Pos (0UL)
  #define ABB_STATUS_OPPOINT_Msk (0x3UL << ABB_STATUS_OPPOINT_Pos)
  #define ABB_STATUS_OPPOINT_Min (0x0UL)
  #define ABB_STATUS_OPPOINT_Max (0x3UL)
  #define ABB_STATUS_OPPOINT_OpPoint0V4 (0x0UL)
  #define ABB_STATUS_OPPOINT_OpPoint0V5 (0x1UL)
  #define ABB_STATUS_OPPOINT_OpPoint0V6 (0x2UL)
  #define ABB_STATUS_OPPOINT_OpPoint0V8 (0x3UL)

/* EN @Bit 4 : The ABB enable status. */
  #define ABB_STATUS_EN_Pos (4UL)
  #define ABB_STATUS_EN_Msk (0x1UL << ABB_STATUS_EN_Pos)
  #define ABB_STATUS_EN_Min (0x0UL)
  #define ABB_STATUS_EN_Max (0x1UL)
  #define ABB_STATUS_EN_Disabled (0x0UL)
  #define ABB_STATUS_EN_Enabled (0x1UL)

/* LOCKED @Bit 5 : The ABB lock status. */
  #define ABB_STATUS_LOCKED_Pos (5UL)
  #define ABB_STATUS_LOCKED_Msk (0x1UL << ABB_STATUS_LOCKED_Pos)
  #define ABB_STATUS_LOCKED_Min (0x0UL)
  #define ABB_STATUS_LOCKED_Max (0x1UL)
  #define ABB_STATUS_LOCKED_NotLocked (0x0UL)
  #define ABB_STATUS_LOCKED_Locked (0x1UL)


/* ABB_MODE: ABB control */
  #define ABB_MODE_ResetValue (0x00000000UL)

/* OPPOINT @Bits 0..2 : The ABB operating point. */
  #define ABB_MODE_OPPOINT_Pos (0UL)
  #define ABB_MODE_OPPOINT_Msk (0x7UL << ABB_MODE_OPPOINT_Pos)
  #define ABB_MODE_OPPOINT_Min (0x0UL)
  #define ABB_MODE_OPPOINT_Max (0x4UL)
  #define ABB_MODE_OPPOINT_Auto (0x0UL)              /*!< The peripheral controls the operating point automatically based on
                                                          request from the master ABB controller.*/
  #define ABB_MODE_OPPOINT_OpPoint0V4 (0x1UL)
  #define ABB_MODE_OPPOINT_OpPoint0V5 (0x2UL)
  #define ABB_MODE_OPPOINT_OpPoint0V6 (0x3UL)
  #define ABB_MODE_OPPOINT_OpPoint0V8 (0x4UL)

/* ABBEN @Bits 4..5 : Enable ABB. */
  #define ABB_MODE_ABBEN_Pos (4UL)
  #define ABB_MODE_ABBEN_Msk (0x3UL << ABB_MODE_ABBEN_Pos)
  #define ABB_MODE_ABBEN_Min (0x0UL)
  #define ABB_MODE_ABBEN_Max (0x2UL)
  #define ABB_MODE_ABBEN_Auto (0x0UL)                /*!< The peripheral controls the ABB enable automatically based on
                                                          request.*/
  #define ABB_MODE_ABBEN_Enable (0x1UL)
  #define ABB_MODE_ABBEN_Disable (0x2UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         ATBFUNNEL                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct ATBFUNNEL ===================================================== */
/**
  * @brief ATB funnel module
  */
  typedef struct {
    __IOM uint32_t CTRLREG;                          /*!< (@ 0x00000000) The IDFILTER0 register enables the programming of ID
                                                                         filtering for master port 0.*/
    __IOM uint32_t PRIORITYCTRLREG;                  /*!< (@ 0x00000004) The Priority_Ctrl_Reg register defines the order in
                                                                         which inputs are selected. Each 3-bit field is a
                                                                         priority for each particular slave interface.*/
    __IM uint32_t RESERVED[953];
    __IOM uint32_t ITATBDATA0;                       /*!< (@ 0x00000EEC) The ITATBDATA0 register performs different functions
                                                                         depending on whether the access is a read or a write.*/
    __IOM uint32_t ITATBCTR2;                        /*!< (@ 0x00000EF0) The ITATBCTR2 register performs different functions
                                                                         depending on whether the access is a read or a write.*/
    __IOM uint32_t ITATBCTR1;                        /*!< (@ 0x00000EF4) The ITATBCTR1 register performs different functions
                                                                         depending on whether the access is a read or a write.*/
    __IOM uint32_t ITATBCTR0;                        /*!< (@ 0x00000EF8) The ITATBCTR0 register performs different functions
                                                                         depending on whether the access is a read or a write.*/
    __IM uint32_t RESERVED1;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) The ITCTRL register enables the component to switch
                                                                         from a functional mode, which is the default behavior,
                                                                         to integration mode where the inputs and outputs of the
                                                                         component can be directly controlled for the purposes
                                                                         of integration testing and topology detection.*/
    __IM uint32_t RESERVED2[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMSET register sets
                                                                         bits in the claim tag, and determines the number of
                                                                         claim bits implemented.*/
    __IOM uint32_t CLAIMCLR;                         /*!< (@ 0x00000FA4) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMCLR register sets
                                                                         the bits in the claim tag to 0 and determines the
                                                                         current value of the claim tag.*/
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t LAR;                              /*!< (@ 0x00000FB0) This is used to enable write access to device
                                                                         registers.*/
    __IOM uint32_t LSR;                              /*!< (@ 0x00000FB4) This indicates the status of the lock control
                                                                         mechanism. This lock prevents accidental writes by code
                                                                         under debug. Accesses to the extended stimulus port
                                                                         registers are not affected by the lock mechanism. This
                                                                         register must always be present although there might
                                                                         not be any lock access control mechanism. The lock
                                                                         mechanism, where present and locked, must block write
                                                                         accesses to any control register, except the Lock
                                                                         Access Register. For most components this covers all
                                                                         registers except for the Lock Access Register.*/
    __IOM uint32_t AUTHSTATUS;                       /*!< (@ 0x00000FB8) Indicates the current level of tracing permitted by the
                                                                         system*/
    __IM uint32_t RESERVED4[3];
    __IM uint32_t DEVID;
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) The DEVTYPE register provides a debugger with
                                                                         information about the component when the Part Number
                                                                         field is not recognized. The debugger can then report
                                                                         this information.*/
    __IOM uint32_t PIDR4;
    __IM uint32_t RESERVED5[3];
    __IOM uint32_t PIDR0;
    __IOM uint32_t PIDR1;
    __IOM uint32_t PIDR2;
    __IOM uint32_t PIDR3;
    __IOM uint32_t CIDR0;
    __IOM uint32_t CIDR1;
    __IOM uint32_t CIDR2;
    __IOM uint32_t CIDR3;
  } NRF_ATBFUNNEL_Type;

/* ATBFUNNEL_CTRLREG: The IDFILTER0 register enables the programming of ID filtering for master port 0. */
  #define ATBFUNNEL_CTRLREG_ResetValue (0x00000000UL)

/* ENS0 @Bit 0 : Enable slave port 0. */
  #define ATBFUNNEL_CTRLREG_ENS0_Pos (0UL)
  #define ATBFUNNEL_CTRLREG_ENS0_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS0_Pos)
  #define ATBFUNNEL_CTRLREG_ENS0_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_ENS0_Max (0x1UL)
  #define ATBFUNNEL_CTRLREG_ENS0_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS0_Enabled (0x1UL)

/* ENS1 @Bit 1 : Enable slave port 1. */
  #define ATBFUNNEL_CTRLREG_ENS1_Pos (1UL)
  #define ATBFUNNEL_CTRLREG_ENS1_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS1_Pos)
  #define ATBFUNNEL_CTRLREG_ENS1_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_ENS1_Max (0x1UL)
  #define ATBFUNNEL_CTRLREG_ENS1_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS1_Enabled (0x1UL)

