pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENS2 @Bit 2 : Enable slave port 2. */
  #define ATBFUNNEL_CTRLREG_ENS2_Pos (2UL)
  #define ATBFUNNEL_CTRLREG_ENS2_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS2_Pos)
  #define ATBFUNNEL_CTRLREG_ENS2_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_ENS2_Max (0x1UL)
  #define ATBFUNNEL_CTRLREG_ENS2_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS2_Enabled (0x1UL)

/* ENS3 @Bit 3 : Enable slave port 3. */
  #define ATBFUNNEL_CTRLREG_ENS3_Pos (3UL)
  #define ATBFUNNEL_CTRLREG_ENS3_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS3_Pos)
  #define ATBFUNNEL_CTRLREG_ENS3_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_ENS3_Max (0x1UL)
  #define ATBFUNNEL_CTRLREG_ENS3_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS3_Enabled (0x1UL)

/* ENS4 @Bit 4 : Enable slave port 4. */
  #define ATBFUNNEL_CTRLREG_ENS4_Pos (4UL)
  #define ATBFUNNEL_CTRLREG_ENS4_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS4_Pos)
  #define ATBFUNNEL_CTRLREG_ENS4_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_ENS4_Max (0x1UL)
  #define ATBFUNNEL_CTRLREG_ENS4_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS4_Enabled (0x1UL)

/* ENS5 @Bit 5 : Enable slave port 5. */
  #define ATBFUNNEL_CTRLREG_ENS5_Pos (5UL)
  #define ATBFUNNEL_CTRLREG_ENS5_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS5_Pos)
  #define ATBFUNNEL_CTRLREG_ENS5_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_ENS5_Max (0x1UL)
  #define ATBFUNNEL_CTRLREG_ENS5_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS5_Enabled (0x1UL)

/* ENS6 @Bit 6 : Enable slave port 6. */
  #define ATBFUNNEL_CTRLREG_ENS6_Pos (6UL)
  #define ATBFUNNEL_CTRLREG_ENS6_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS6_Pos)
  #define ATBFUNNEL_CTRLREG_ENS6_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_ENS6_Max (0x1UL)
  #define ATBFUNNEL_CTRLREG_ENS6_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS6_Enabled (0x1UL)

/* ENS7 @Bit 7 : Enable slave port 7. */
  #define ATBFUNNEL_CTRLREG_ENS7_Pos (7UL)
  #define ATBFUNNEL_CTRLREG_ENS7_Msk (0x1UL << ATBFUNNEL_CTRLREG_ENS7_Pos)
  #define ATBFUNNEL_CTRLREG_ENS7_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_ENS7_Max (0x1UL)
  #define ATBFUNNEL_CTRLREG_ENS7_Disabled (0x0UL)    /*!< Slave port disabled. This excludes the port from the priority
                                                          selection scheme.*/
  #define ATBFUNNEL_CTRLREG_ENS7_Enabled (0x1UL)

/* HT @Bits 8..11 : Hold Time. The formatting scheme can become inefficient when fast switching occurs, and you can use this
                    setting to minimize switching. When a source has nothing to transmit, then another source is selected
                    irrespective of the minimum number of transactions. The ATB funnel holds for the minimum hold time and one
                    additional transaction. The actual hold time is the register value plus 1. The maximum value that can be
                    entered is 0b1110 and this equates to 15 transactions. 0b1111 is reserved. */

  #define ATBFUNNEL_CTRLREG_HT_Pos (8UL)
  #define ATBFUNNEL_CTRLREG_HT_Msk (0xFUL << ATBFUNNEL_CTRLREG_HT_Pos)
  #define ATBFUNNEL_CTRLREG_HT_Min (0x0UL)
  #define ATBFUNNEL_CTRLREG_HT_Max (0xEUL)


/* ATBFUNNEL_PRIORITYCTRLREG: The Priority_Ctrl_Reg register defines the order in which inputs are selected. Each 3-bit field is
                               a priority for each particular slave interface. */

  #define ATBFUNNEL_PRIORITYCTRLREG_ResetValue (0x00000000UL)

/* PRIPORT0 @Bits 0..2 : Priority value of port number 0. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT0_Pos (0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT0_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT0_Pos) /*!< Bit mask of PRIPORT0
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT0_Min (0x0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT0_Max (0x7UL)

/* PRIPORT1 @Bits 3..5 : Priority value of port number 1. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT1_Pos (3UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT1_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT1_Pos) /*!< Bit mask of PRIPORT1
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT1_Min (0x0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT1_Max (0x7UL)

/* PRIPORT2 @Bits 6..8 : Priority value of port number 2. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT2_Pos (6UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT2_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT2_Pos) /*!< Bit mask of PRIPORT2
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT2_Min (0x0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT2_Max (0x7UL)

/* PRIPORT3 @Bits 9..11 : Priority value of port number 3. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Pos (9UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Pos) /*!< Bit mask of PRIPORT3
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Min (0x0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT3_Max (0x7UL)

/* PRIPORT4 @Bits 12..14 : Priority value of port number 4. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Pos (12UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Pos) /*!< Bit mask of PRIPORT4
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Min (0x0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT4_Max (0x7UL)

