pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PRIPORT5 @Bits 15..17 : Priority value of port number 5. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Pos (15UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Pos) /*!< Bit mask of PRIPORT5
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Min (0x0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT5_Max (0x7UL)

/* PRIPORT6 @Bits 18..20 : Priority value of port number 6. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Pos (18UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Pos) /*!< Bit mask of PRIPORT6
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Min (0x0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT6_Max (0x7UL)

/* PRIPORT7 @Bits 21..23 : Priority value of port number 7. */
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Pos (21UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Msk (0x7UL << ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Pos) /*!< Bit mask of PRIPORT7
                                                                            field.*/
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Min (0x0UL)
  #define ATBFUNNEL_PRIORITYCTRLREG_PRIPORT7_Max (0x7UL)


/* ATBFUNNEL_ITATBDATA0: The ITATBDATA0 register performs different functions depending on whether the access is a read or a
                          write. */

  #define ATBFUNNEL_ITATBDATA0_ResetValue (0x00000000UL)

/* ATDATA0 @Bit 0 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Pos (0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA0_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA0_High (0x1UL)

/* ATDATA1 @Bit 1 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Pos (1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA1_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA1_High (0x1UL)

/* ATDATA2 @Bit 2 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Pos (2UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA2_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA2_High (0x1UL)

/* ATDATA3 @Bit 3 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Pos (3UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA3_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA3_High (0x1UL)

/* ATDATA4 @Bit 4 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Pos (4UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA4_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA4_High (0x1UL)

/* ATDATA5 @Bit 5 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Pos (5UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA5_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA5_High (0x1UL)

/* ATDATA6 @Bit 6 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Pos (6UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA6_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA6_High (0x1UL)

/* ATDATA7 @Bit 7 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Pos (7UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA7_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA7_High (0x1UL)

/* ATDATA8 @Bit 8 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Pos (8UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA8_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA8_High (0x1UL)

/* ATDATA9 @Bit 9 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Pos (9UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA9_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA9_High (0x1UL)

/* ATDATA10 @Bit 10 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Pos (10UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA10_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA10_High (0x1UL)

