pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ATDATA11 @Bit 11 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Pos (11UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA11_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA11_High (0x1UL)

/* ATDATA12 @Bit 12 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Pos (12UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA12_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA12_High (0x1UL)

/* ATDATA13 @Bit 13 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Pos (13UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA13_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA13_High (0x1UL)

/* ATDATA14 @Bit 14 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Pos (14UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA14_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA14_High (0x1UL)

/* ATDATA15 @Bit 15 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Pos (15UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA15_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA15_High (0x1UL)

/* ATDATA16 @Bit 16 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                      corresponding atdatam pin of the enabled port. */

  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Pos (16UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Msk (0x1UL << ATBFUNNEL_ITATBDATA0_ATDATA16_Pos)
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Min (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Max (0x1UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_Low (0x0UL)
  #define ATBFUNNEL_ITATBDATA0_ATDATA16_High (0x1UL)


/* ATBFUNNEL_ITATBCTR2: The ITATBCTR2 register performs different functions depending on whether the access is a read or a
                         write. */

  #define ATBFUNNEL_ITATBCTR2_ResetValue (0x00000000UL)

/* ATREADY @Bit 0 : A read access returns the value of atreadym. A write access outputs the data to afvalids[n], where the value
                    of the CTRLREG at 0x000 defines n. */

  #define ATBFUNNEL_ITATBCTR2_ATREADY_Pos (0UL)
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Msk (0x1UL << ATBFUNNEL_ITATBCTR2_ATREADY_Pos)
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Min (0x0UL)
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Max (0x1UL)
  #define ATBFUNNEL_ITATBCTR2_ATREADY_Low (0x0UL)
  #define ATBFUNNEL_ITATBCTR2_ATREADY_High (0x1UL)

/* AFVALID @Bit 1 : A read access returns the value of afvalidm. A write access outputs the data to atreadys[n], where the value
                    of the CTRLREG at 0x000 defines n. */

  #define ATBFUNNEL_ITATBCTR2_AFVALID_Pos (1UL)
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Msk (0x1UL << ATBFUNNEL_ITATBCTR2_AFVALID_Pos)
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Min (0x0UL)
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Max (0x1UL)
  #define ATBFUNNEL_ITATBCTR2_AFVALID_Low (0x0UL)
  #define ATBFUNNEL_ITATBCTR2_AFVALID_High (0x1UL)


/* ATBFUNNEL_ITATBCTR1: The ITATBCTR1 register performs different functions depending on whether the access is a read or a
                         write. */

  #define ATBFUNNEL_ITATBCTR1_ResetValue (0x00000000UL)

/* ATVALIDM0 @Bits 0..6 : A read returns the value of the atids[n] signals, where the value of the Control Register at 0x000
                          defines n. A write outputs the value to the atidm port. */

  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Pos (0UL)
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Msk (0x7FUL << ATBFUNNEL_ITATBCTR1_ATVALIDM0_Pos)
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Min (0x0UL)
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Max (0x1UL)
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_Low (0x00UL)
  #define ATBFUNNEL_ITATBCTR1_ATVALIDM0_High (0x01UL)


/* ATBFUNNEL_ITATBCTR0: The ITATBCTR0 register performs different functions depending on whether the access is a read or a
                         write. */

  #define ATBFUNNEL_ITATBCTR0_ResetValue (0x00000000UL)

/* ATVALID @Bit 0 : A read returns the value of the atvalids[n] signal, where the value of the CTRLREG at 0x000 defines n. A
                    write outputs the value to atvalidm. */

  #define ATBFUNNEL_ITATBCTR0_ATVALID_Pos (0UL)
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Msk (0x1UL << ATBFUNNEL_ITATBCTR0_ATVALID_Pos)
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Min (0x0UL)
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Max (0x1UL)
  #define ATBFUNNEL_ITATBCTR0_ATVALID_Low (0x0UL)
  #define ATBFUNNEL_ITATBCTR0_ATVALID_High (0x1UL)

/* AFREADY @Bit 2 : A read returns the value of the afreadys[n] signal, where the value of the Ctrl_Reg at 0x000 defines n. A
                    write outputs the value to afreadym. */

  #define ATBFUNNEL_ITATBCTR0_AFREADY_Pos (2UL)
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Msk (0x1UL << ATBFUNNEL_ITATBCTR0_AFREADY_Pos)
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Min (0x0UL)
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Max (0x1UL)
  #define ATBFUNNEL_ITATBCTR0_AFREADY_Low (0x0UL)
  #define ATBFUNNEL_ITATBCTR0_AFREADY_High (0x1UL)

/* ATBYTES @Bits 8..9 : A read returns the value of the atbytess[n] signal, where the value of the Ctrl_Reg at 0x000 defines n.
                        A write outputs the value to atbytesm. */

