pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Pos (8UL)
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Msk (0x3UL << ATBFUNNEL_ITATBCTR0_ATBYTES_Pos)
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Min (0x0UL)
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Max (0x1UL)
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_Low (0x0UL)
  #define ATBFUNNEL_ITATBCTR0_ATBYTES_High (0x1UL)


/* ATBFUNNEL_ITCTRL: The ITCTRL register enables the component to switch from a functional mode, which is the default behavior,
                      to integration mode where the inputs and outputs of the component can be directly controlled for the
                      purposes of integration testing and topology detection. */

  #define ATBFUNNEL_ITCTRL_ResetValue (0x00000000UL)

/* IME @Bit 0 : Integration Mode Enable. */
  #define ATBFUNNEL_ITCTRL_IME_Pos (0UL)
  #define ATBFUNNEL_ITCTRL_IME_Msk (0x1UL << ATBFUNNEL_ITCTRL_IME_Pos)
  #define ATBFUNNEL_ITCTRL_IME_Min (0x0UL)
  #define ATBFUNNEL_ITCTRL_IME_Max (0x1UL)
  #define ATBFUNNEL_ITCTRL_IME_Disabled (0x0UL)
  #define ATBFUNNEL_ITCTRL_IME_Enabled (0x1UL)


/* ATBFUNNEL_CLAIMSET: Software can use the claim tag to coordinate application and debugger access to trace unit functionality.
                        The claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the
                        claim tag, and determines the number of claim bits implemented. */

  #define ATBFUNNEL_CLAIMSET_ResetValue (0x00000000UL)

/* BIT0 @Bit 0 : Set claim bit 0 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT0_Pos (0UL)
  #define ATBFUNNEL_CLAIMSET_BIT0_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT0_Pos)
  #define ATBFUNNEL_CLAIMSET_BIT0_Min (0x0UL)
  #define ATBFUNNEL_CLAIMSET_BIT0_Max (0x1UL)
  #define ATBFUNNEL_CLAIMSET_BIT0_NotImplemented (0x0UL)
  #define ATBFUNNEL_CLAIMSET_BIT0_Implemented (0x1UL)
  #define ATBFUNNEL_CLAIMSET_BIT0_Set (0x1UL)

/* BIT1 @Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT1_Pos (1UL)
  #define ATBFUNNEL_CLAIMSET_BIT1_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT1_Pos)
  #define ATBFUNNEL_CLAIMSET_BIT1_Min (0x0UL)
  #define ATBFUNNEL_CLAIMSET_BIT1_Max (0x1UL)
  #define ATBFUNNEL_CLAIMSET_BIT1_NotImplemented (0x0UL)
  #define ATBFUNNEL_CLAIMSET_BIT1_Implemented (0x1UL)
  #define ATBFUNNEL_CLAIMSET_BIT1_Set (0x1UL)

/* BIT2 @Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT2_Pos (2UL)
  #define ATBFUNNEL_CLAIMSET_BIT2_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT2_Pos)
  #define ATBFUNNEL_CLAIMSET_BIT2_Min (0x0UL)
  #define ATBFUNNEL_CLAIMSET_BIT2_Max (0x1UL)
  #define ATBFUNNEL_CLAIMSET_BIT2_NotImplemented (0x0UL)
  #define ATBFUNNEL_CLAIMSET_BIT2_Implemented (0x1UL)
  #define ATBFUNNEL_CLAIMSET_BIT2_Set (0x1UL)

/* BIT3 @Bit 3 : Set claim bit 3 and check if bit is implemented or not. */
  #define ATBFUNNEL_CLAIMSET_BIT3_Pos (3UL)
  #define ATBFUNNEL_CLAIMSET_BIT3_Msk (0x1UL << ATBFUNNEL_CLAIMSET_BIT3_Pos)
  #define ATBFUNNEL_CLAIMSET_BIT3_Min (0x0UL)
  #define ATBFUNNEL_CLAIMSET_BIT3_Max (0x1UL)
  #define ATBFUNNEL_CLAIMSET_BIT3_NotImplemented (0x0UL)
  #define ATBFUNNEL_CLAIMSET_BIT3_Implemented (0x1UL)
  #define ATBFUNNEL_CLAIMSET_BIT3_Set (0x1UL)


/* ATBFUNNEL_CLAIMCLR: Software can use the claim tag to coordinate application and debugger access to trace unit functionality.
                        The claim tags have no effect on the operation of the component. The CLAIMCLR register sets the bits in
                        the claim tag to 0 and determines the current value of the claim tag. */

  #define ATBFUNNEL_CLAIMCLR_ResetValue (0x00000000UL)

/* BIT0 @Bit 0 : Read or clear claim bit 0. */
  #define ATBFUNNEL_CLAIMCLR_BIT0_Pos (0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT0_Msk (0x1UL << ATBFUNNEL_CLAIMCLR_BIT0_Pos)
  #define ATBFUNNEL_CLAIMCLR_BIT0_Min (0x0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT0_Max (0x1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT0_Cleared (0x0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT0_Set (0x1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT0_Clear (0x1UL)

/* BIT1 @Bit 1 : Read or clear claim bit 1. */
  #define ATBFUNNEL_CLAIMCLR_BIT1_Pos (1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT1_Msk (0x1UL << ATBFUNNEL_CLAIMCLR_BIT1_Pos)
  #define ATBFUNNEL_CLAIMCLR_BIT1_Min (0x0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT1_Max (0x1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT1_Cleared (0x0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT1_Set (0x1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT1_Clear (0x1UL)

/* BIT2 @Bit 2 : Read or clear claim bit 2. */
  #define ATBFUNNEL_CLAIMCLR_BIT2_Pos (2UL)
  #define ATBFUNNEL_CLAIMCLR_BIT2_Msk (0x1UL << ATBFUNNEL_CLAIMCLR_BIT2_Pos)
  #define ATBFUNNEL_CLAIMCLR_BIT2_Min (0x0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT2_Max (0x1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT2_Cleared (0x0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT2_Set (0x1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT2_Clear (0x1UL)

/* BIT3 @Bit 3 : Read or clear claim bit 3. */
  #define ATBFUNNEL_CLAIMCLR_BIT3_Pos (3UL)
  #define ATBFUNNEL_CLAIMCLR_BIT3_Msk (0x1UL << ATBFUNNEL_CLAIMCLR_BIT3_Pos)
  #define ATBFUNNEL_CLAIMCLR_BIT3_Min (0x0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT3_Max (0x1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT3_Cleared (0x0UL)
  #define ATBFUNNEL_CLAIMCLR_BIT3_Set (0x1UL)
  #define ATBFUNNEL_CLAIMCLR_BIT3_Clear (0x1UL)


/* ATBFUNNEL_LAR: This is used to enable write access to device registers. */
  #define ATBFUNNEL_LAR_ResetValue (0x00000000UL)

/* ACCESS @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.
                        */

  #define ATBFUNNEL_LAR_ACCESS_Pos (0UL)
  #define ATBFUNNEL_LAR_ACCESS_Msk (0xFFFFFFFFUL << ATBFUNNEL_LAR_ACCESS_Pos)
  #define ATBFUNNEL_LAR_ACCESS_Min (0xC5ACCE55UL)
  #define ATBFUNNEL_LAR_ACCESS_Max (0xC5ACCE55UL)
  #define ATBFUNNEL_LAR_ACCESS_UnLock (0xC5ACCE55UL)


/* ATBFUNNEL_LSR: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under
                   debug. Accesses to the extended stimulus port registers are not affected by the lock mechanism. This register
                   must always be present although there might not be any lock access control mechanism. The lock mechanism,
                   where present and locked, must block write accesses to any control register, except the Lock Access Register.
                   For most components this covers all registers except for the Lock Access Register. */

  #define ATBFUNNEL_LSR_ResetValue (0x00000000UL)

/* PRESENT @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define ATBFUNNEL_LSR_PRESENT_Pos (0UL)
  #define ATBFUNNEL_LSR_PRESENT_Msk (0x1UL << ATBFUNNEL_LSR_PRESENT_Pos)
  #define ATBFUNNEL_LSR_PRESENT_Min (0x0UL)
  #define ATBFUNNEL_LSR_PRESENT_Max (0x1UL)
  #define ATBFUNNEL_LSR_PRESENT_NotImplemented (0x0UL) /*!< No lock control mechanism exists, writes to the Lock Access Register
                                                            are ignored.*/
  #define ATBFUNNEL_LSR_PRESENT_Implemented (0x1UL)

/* LOCKED @Bit 1 : Returns the current status of the Lock. */
  #define ATBFUNNEL_LSR_LOCKED_Pos (1UL)
  #define ATBFUNNEL_LSR_LOCKED_Msk (0x1UL << ATBFUNNEL_LSR_LOCKED_Pos)
  #define ATBFUNNEL_LSR_LOCKED_Min (0x0UL)
  #define ATBFUNNEL_LSR_LOCKED_Max (0x1UL)
  #define ATBFUNNEL_LSR_LOCKED_UnLocked (0x0UL)
  #define ATBFUNNEL_LSR_LOCKED_Locked (0x1UL)        /*!< Write access to the component is blocked. All writes to control
                                                          registers are ignored. Reads are permitted.*/

/* TYPE @Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
  #define ATBFUNNEL_LSR_TYPE_Pos (2UL)
  #define ATBFUNNEL_LSR_TYPE_Msk (0x1UL << ATBFUNNEL_LSR_TYPE_Pos)
  #define ATBFUNNEL_LSR_TYPE_Min (0x0UL)
  #define ATBFUNNEL_LSR_TYPE_Max (0x1UL)
  #define ATBFUNNEL_LSR_TYPE_Bits32 (0x0UL)
  #define ATBFUNNEL_LSR_TYPE_Bits8 (0x1UL)


/* ATBFUNNEL_AUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define ATBFUNNEL_AUTHSTATUS_ResetValue (0x00000000UL)

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define ATBFUNNEL_AUTHSTATUS_NSID_Pos (0UL)
  #define ATBFUNNEL_AUTHSTATUS_NSID_Msk (0x3UL << ATBFUNNEL_AUTHSTATUS_NSID_Pos)
  #define ATBFUNNEL_AUTHSTATUS_NSID_Min (0x0UL)
  #define ATBFUNNEL_AUTHSTATUS_NSID_Max (0x1UL)
  #define ATBFUNNEL_AUTHSTATUS_NSID_NotImplemented (0x0UL)
  #define ATBFUNNEL_AUTHSTATUS_NSID_Implemented (0x1UL)

