pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ID0_30_3F @Bit 3 : Enable or disable ID filtering for IDs 0x30_0x3F. */
  #define ATBREPLICATOR_IDFILTER0_ID0_30_3F_Pos (3UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_30_3F_Msk (0x1UL << ATBREPLICATOR_IDFILTER0_ID0_30_3F_Pos) /*!< Bit mask of ID0_30_3F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_30_3F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_30_3F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_30_3F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 0.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_30_3F_Selected (0x1UL)

/* ID0_40_4F @Bit 4 : Enable or disable ID filtering for IDs 0x40_0x4F. */
  #define ATBREPLICATOR_IDFILTER0_ID0_40_4F_Pos (4UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_40_4F_Msk (0x1UL << ATBREPLICATOR_IDFILTER0_ID0_40_4F_Pos) /*!< Bit mask of ID0_40_4F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_40_4F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_40_4F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_40_4F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 0.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_40_4F_Selected (0x1UL)

/* ID0_50_5F @Bit 5 : Enable or disable ID filtering for IDs 0x50_0x5F. */
  #define ATBREPLICATOR_IDFILTER0_ID0_50_5F_Pos (5UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_50_5F_Msk (0x1UL << ATBREPLICATOR_IDFILTER0_ID0_50_5F_Pos) /*!< Bit mask of ID0_50_5F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_50_5F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_50_5F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_50_5F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 0.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_50_5F_Selected (0x1UL)

/* ID0_60_6F @Bit 6 : Enable or disable ID filtering for IDs 0x60_0x6F. */
  #define ATBREPLICATOR_IDFILTER0_ID0_60_6F_Pos (6UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_60_6F_Msk (0x1UL << ATBREPLICATOR_IDFILTER0_ID0_60_6F_Pos) /*!< Bit mask of ID0_60_6F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_60_6F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_60_6F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_60_6F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 0.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_60_6F_Selected (0x1UL)

/* ID0_70_7F @Bit 7 : Enable or disable ID filtering for IDs 0x70_0x7F. */
  #define ATBREPLICATOR_IDFILTER0_ID0_70_7F_Pos (7UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_70_7F_Msk (0x1UL << ATBREPLICATOR_IDFILTER0_ID0_70_7F_Pos) /*!< Bit mask of ID0_70_7F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_70_7F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_70_7F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER0_ID0_70_7F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 0.*/
  #define ATBREPLICATOR_IDFILTER0_ID0_70_7F_Selected (0x1UL)


/* ATBREPLICATOR_IDFILTER1: The IDFILTER1 register enables the programming of ID filtering for master port 1. */
  #define ATBREPLICATOR_IDFILTER1_ResetValue (0x00000000UL)

/* ID1_00_0F @Bit 0 : Enable or disable ID filtering for IDs 0x00_0x0F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_00_0F_Pos (0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_00_0F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_00_0F_Pos) /*!< Bit mask of ID1_00_0F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_00_0F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_00_0F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_00_0F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_00_0F_Selected (0x1UL)

/* ID1_10_1F @Bit 1 : Enable or disable ID filtering for IDs 0x10_0x1F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_10_1F_Pos (1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_10_1F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_10_1F_Pos) /*!< Bit mask of ID1_10_1F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_10_1F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_10_1F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_10_1F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_10_1F_Selected (0x1UL)

/* ID1_20_2F @Bit 2 : Enable or disable ID filtering for IDs 0x20_0x2F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_20_2F_Pos (2UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_20_2F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_20_2F_Pos) /*!< Bit mask of ID1_20_2F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_20_2F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_20_2F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_20_2F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_20_2F_Selected (0x1UL)

/* ID1_30_3F @Bit 3 : Enable or disable ID filtering for IDs 0x30_0x3F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Pos (3UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_30_3F_Pos) /*!< Bit mask of ID1_30_3F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_30_3F_Selected (0x1UL)

/* ID1_40_4F @Bit 4 : Enable or disable ID filtering for IDs 0x40_0x4F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Pos (4UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_40_4F_Pos) /*!< Bit mask of ID1_40_4F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_40_4F_Selected (0x1UL)

/* ID1_50_5F @Bit 5 : Enable or disable ID filtering for IDs 0x50_0x5F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Pos (5UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_50_5F_Pos) /*!< Bit mask of ID1_50_5F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_50_5F_Selected (0x1UL)

/* ID1_60_6F @Bit 6 : Enable or disable ID filtering for IDs 0x60_0x6F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Pos (6UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_60_6F_Pos) /*!< Bit mask of ID1_60_6F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_60_6F_Selected (0x1UL)

