pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ID1_70_7F @Bit 7 : Enable or disable ID filtering for IDs 0x70_0x7F. */
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Pos (7UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Msk (0x1UL << ATBREPLICATOR_IDFILTER1_ID1_70_7F_Pos) /*!< Bit mask of ID1_70_7F
                                                                            field.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Min (0x0UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Max (0x1UL)
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_NotFiltered (0x0UL) /*!< Transactions with these IDs are passed on to ATB master
                                                                     port 1.*/
  #define ATBREPLICATOR_IDFILTER1_ID1_70_7F_Selected (0x1UL)


/* ATBREPLICATOR_ITATBCTR1: The ITATBCTR1 register returns the value of the atreadym0, atreadym1, and atvalids inputs in
                             integration mode. */

  #define ATBREPLICATOR_ITATBCTR1_ResetValue (0x00000000UL)

/* ATREADYM0 @Bit 0 : Reads the value of the atreadym0 input. */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Pos (0UL)
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Msk (0x1UL << ATBREPLICATOR_ITATBCTR1_ATREADYM0_Pos) /*!< Bit mask of ATREADYM0
                                                                            field.*/
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Min (0x0UL)
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Max (0x1UL)
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_Low (0x0UL)
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM0_High (0x1UL)

/* ATREADYM1 @Bit 1 : Reads the value of the atreadym1 input. */
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Pos (1UL)
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Msk (0x1UL << ATBREPLICATOR_ITATBCTR1_ATREADYM1_Pos) /*!< Bit mask of ATREADYM1
                                                                            field.*/
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Min (0x0UL)
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Max (0x1UL)
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_Low (0x0UL)
  #define ATBREPLICATOR_ITATBCTR1_ATREADYM1_High (0x1UL)

/* ATVALIDS @Bit 3 : Reads the value of the atvalids input. */
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Pos (3UL)
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Msk (0x1UL << ATBREPLICATOR_ITATBCTR1_ATVALIDS_Pos)
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Min (0x0UL)
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Max (0x1UL)
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_Low (0x0UL)
  #define ATBREPLICATOR_ITATBCTR1_ATVALIDS_High (0x1UL)


/* ATBREPLICATOR_ITATBCTR0: The ITATBCTR0 register controls the value of the atvalidm0, atvalidm1, and atreadys outputs in
                             integration mode. */

  #define ATBREPLICATOR_ITATBCTR0_ResetValue (0x00000000UL)

/* ATVALIDM0 @Bit 0 : Sets the value of the atvalidm0 output. */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Pos (0UL)
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Msk (0x1UL << ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Pos) /*!< Bit mask of ATVALIDM0
                                                                            field.*/
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Min (0x0UL)
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Max (0x1UL)
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_Low (0x0UL)
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM0_High (0x1UL)

/* ATVALIDM1 @Bit 2 : Sets the value of the atvalidm1 output. */
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Pos (2UL)
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Msk (0x1UL << ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Pos) /*!< Bit mask of ATVALIDM1
                                                                            field.*/
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Min (0x0UL)
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Max (0x1UL)
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_Low (0x0UL)
  #define ATBREPLICATOR_ITATBCTR0_ATVALIDM1_High (0x1UL)

/* ATREADYS @Bit 3 : Sets the value of the atreadys output. */
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Pos (3UL)
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Msk (0x1UL << ATBREPLICATOR_ITATBCTR0_ATREADYS_Pos)
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Min (0x0UL)
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Max (0x1UL)
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_Low (0x0UL)
  #define ATBREPLICATOR_ITATBCTR0_ATREADYS_High (0x1UL)


/* ATBREPLICATOR_ITCTRL: The ITCTRL register enables the component to switch from a functional mode, which is the default
                          behavior, to integration mode where the inputs and outputs of the component can be directly controlled
                          for the purposes of integration testing and topology detection. */

  #define ATBREPLICATOR_ITCTRL_ResetValue (0x00000000UL)

/* IME @Bit 0 : Integration Mode Enable. */
  #define ATBREPLICATOR_ITCTRL_IME_Pos (0UL)
  #define ATBREPLICATOR_ITCTRL_IME_Msk (0x1UL << ATBREPLICATOR_ITCTRL_IME_Pos)
  #define ATBREPLICATOR_ITCTRL_IME_Min (0x0UL)
  #define ATBREPLICATOR_ITCTRL_IME_Max (0x1UL)
  #define ATBREPLICATOR_ITCTRL_IME_Disabled (0x0UL)
  #define ATBREPLICATOR_ITCTRL_IME_Enabled (0x1UL)


/* ATBREPLICATOR_CLAIMSET: Software can use the claim tag to coordinate application and debugger access to trace unit
                            functionality. The claim tags have no effect on the operation of the component. The CLAIMSET
                            register sets bits in the claim tag, and determines the number of claim bits implemented. */

  #define ATBREPLICATOR_CLAIMSET_ResetValue (0x00000000UL)

/* BIT0 @Bit 0 : Set claim bit 0 and check if bit is implemented or not. */
  #define ATBREPLICATOR_CLAIMSET_BIT0_Pos (0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT0_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT0_Pos)
  #define ATBREPLICATOR_CLAIMSET_BIT0_Min (0x0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT0_Max (0x1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT0_NotImplemented (0x0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT0_Implemented (0x1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT0_Set (0x1UL)

/* BIT1 @Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
  #define ATBREPLICATOR_CLAIMSET_BIT1_Pos (1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT1_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT1_Pos)
  #define ATBREPLICATOR_CLAIMSET_BIT1_Min (0x0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT1_Max (0x1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT1_NotImplemented (0x0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT1_Implemented (0x1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT1_Set (0x1UL)

/* BIT2 @Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
  #define ATBREPLICATOR_CLAIMSET_BIT2_Pos (2UL)
  #define ATBREPLICATOR_CLAIMSET_BIT2_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT2_Pos)
  #define ATBREPLICATOR_CLAIMSET_BIT2_Min (0x0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT2_Max (0x1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT2_NotImplemented (0x0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT2_Implemented (0x1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT2_Set (0x1UL)

