pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* BIT3 @Bit 3 : Set claim bit 3 and check if bit is implemented or not. */
  #define ATBREPLICATOR_CLAIMSET_BIT3_Pos (3UL)
  #define ATBREPLICATOR_CLAIMSET_BIT3_Msk (0x1UL << ATBREPLICATOR_CLAIMSET_BIT3_Pos)
  #define ATBREPLICATOR_CLAIMSET_BIT3_Min (0x0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT3_Max (0x1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT3_NotImplemented (0x0UL)
  #define ATBREPLICATOR_CLAIMSET_BIT3_Implemented (0x1UL)
  #define ATBREPLICATOR_CLAIMSET_BIT3_Set (0x1UL)


/* ATBREPLICATOR_CLAIMCLR: Software can use the claim tag to coordinate application and debugger access to trace unit
                            functionality. The claim tags have no effect on the operation of the component. The CLAIMCLR
                            register sets the bits in the claim tag to 0 and determines the current value of the claim tag. */

  #define ATBREPLICATOR_CLAIMCLR_ResetValue (0x00000000UL)

/* BIT0 @Bit 0 : Read or clear claim bit 0. */
  #define ATBREPLICATOR_CLAIMCLR_BIT0_Pos (0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT0_Msk (0x1UL << ATBREPLICATOR_CLAIMCLR_BIT0_Pos)
  #define ATBREPLICATOR_CLAIMCLR_BIT0_Min (0x0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT0_Max (0x1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT0_Cleared (0x0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT0_Set (0x1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT0_Clear (0x1UL)

/* BIT1 @Bit 1 : Read or clear claim bit 1. */
  #define ATBREPLICATOR_CLAIMCLR_BIT1_Pos (1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT1_Msk (0x1UL << ATBREPLICATOR_CLAIMCLR_BIT1_Pos)
  #define ATBREPLICATOR_CLAIMCLR_BIT1_Min (0x0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT1_Max (0x1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT1_Cleared (0x0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT1_Set (0x1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT1_Clear (0x1UL)

/* BIT2 @Bit 2 : Read or clear claim bit 2. */
  #define ATBREPLICATOR_CLAIMCLR_BIT2_Pos (2UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT2_Msk (0x1UL << ATBREPLICATOR_CLAIMCLR_BIT2_Pos)
  #define ATBREPLICATOR_CLAIMCLR_BIT2_Min (0x0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT2_Max (0x1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT2_Cleared (0x0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT2_Set (0x1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT2_Clear (0x1UL)

/* BIT3 @Bit 3 : Read or clear claim bit 3. */
  #define ATBREPLICATOR_CLAIMCLR_BIT3_Pos (3UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT3_Msk (0x1UL << ATBREPLICATOR_CLAIMCLR_BIT3_Pos)
  #define ATBREPLICATOR_CLAIMCLR_BIT3_Min (0x0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT3_Max (0x1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT3_Cleared (0x0UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT3_Set (0x1UL)
  #define ATBREPLICATOR_CLAIMCLR_BIT3_Clear (0x1UL)


/* ATBREPLICATOR_LAR: This is used to enable write access to device registers. */
  #define ATBREPLICATOR_LAR_ResetValue (0x00000000UL)

/* ACCESS @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.
                        */

  #define ATBREPLICATOR_LAR_ACCESS_Pos (0UL)
  #define ATBREPLICATOR_LAR_ACCESS_Msk (0xFFFFFFFFUL << ATBREPLICATOR_LAR_ACCESS_Pos)
  #define ATBREPLICATOR_LAR_ACCESS_Min (0xC5ACCE55UL)
  #define ATBREPLICATOR_LAR_ACCESS_Max (0xC5ACCE55UL)
  #define ATBREPLICATOR_LAR_ACCESS_UnLock (0xC5ACCE55UL)


/* ATBREPLICATOR_LSR: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code
                       under debug. Accesses to the extended stimulus port registers are not affected by the lock mechanism.
                       This register must always be present although there might not be any lock access control mechanism. The
                       lock mechanism, where present and locked, must block write accesses to any control register, except the
                       Lock Access Register. For most components this covers all registers except for the Lock Access Register.
                       */

  #define ATBREPLICATOR_LSR_ResetValue (0x00000000UL)

/* PRESENT @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define ATBREPLICATOR_LSR_PRESENT_Pos (0UL)
  #define ATBREPLICATOR_LSR_PRESENT_Msk (0x1UL << ATBREPLICATOR_LSR_PRESENT_Pos)
  #define ATBREPLICATOR_LSR_PRESENT_Min (0x0UL)
  #define ATBREPLICATOR_LSR_PRESENT_Max (0x1UL)
  #define ATBREPLICATOR_LSR_PRESENT_NotImplemented (0x0UL) /*!< No lock control mechanism exists, writes to the Lock Access
                                                                Register are ignored.*/
  #define ATBREPLICATOR_LSR_PRESENT_Implemented (0x1UL)

/* LOCKED @Bit 1 : Returns the current status of the Lock. */
  #define ATBREPLICATOR_LSR_LOCKED_Pos (1UL)
  #define ATBREPLICATOR_LSR_LOCKED_Msk (0x1UL << ATBREPLICATOR_LSR_LOCKED_Pos)
  #define ATBREPLICATOR_LSR_LOCKED_Min (0x0UL)
  #define ATBREPLICATOR_LSR_LOCKED_Max (0x1UL)
  #define ATBREPLICATOR_LSR_LOCKED_UnLocked (0x0UL)
  #define ATBREPLICATOR_LSR_LOCKED_Locked (0x1UL)    /*!< Write access to the component is blocked. All writes to control
                                                          registers are ignored. Reads are permitted.*/

/* TYPE @Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
  #define ATBREPLICATOR_LSR_TYPE_Pos (2UL)
  #define ATBREPLICATOR_LSR_TYPE_Msk (0x1UL << ATBREPLICATOR_LSR_TYPE_Pos)
  #define ATBREPLICATOR_LSR_TYPE_Min (0x0UL)
  #define ATBREPLICATOR_LSR_TYPE_Max (0x1UL)
  #define ATBREPLICATOR_LSR_TYPE_Bits32 (0x0UL)
  #define ATBREPLICATOR_LSR_TYPE_Bits8 (0x1UL)


/* ATBREPLICATOR_AUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define ATBREPLICATOR_AUTHSTATUS_ResetValue (0x00000000UL)

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define ATBREPLICATOR_AUTHSTATUS_NSID_Pos (0UL)
  #define ATBREPLICATOR_AUTHSTATUS_NSID_Msk (0x3UL << ATBREPLICATOR_AUTHSTATUS_NSID_Pos)
  #define ATBREPLICATOR_AUTHSTATUS_NSID_Min (0x0UL)
  #define ATBREPLICATOR_AUTHSTATUS_NSID_Max (0x1UL)
  #define ATBREPLICATOR_AUTHSTATUS_NSID_NotImplemented (0x0UL)
  #define ATBREPLICATOR_AUTHSTATUS_NSID_Implemented (0x1UL)

