pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define ATBREPLICATOR_AUTHSTATUS_NSNID_Pos (2UL)
  #define ATBREPLICATOR_AUTHSTATUS_NSNID_Msk (0x3UL << ATBREPLICATOR_AUTHSTATUS_NSNID_Pos)
  #define ATBREPLICATOR_AUTHSTATUS_NSNID_Min (0x0UL)
  #define ATBREPLICATOR_AUTHSTATUS_NSNID_Max (0x1UL)
  #define ATBREPLICATOR_AUTHSTATUS_NSNID_NotImplemented (0x0UL)
  #define ATBREPLICATOR_AUTHSTATUS_NSNID_Implemented (0x1UL)

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define ATBREPLICATOR_AUTHSTATUS_SID_Pos (4UL)
  #define ATBREPLICATOR_AUTHSTATUS_SID_Msk (0x3UL << ATBREPLICATOR_AUTHSTATUS_SID_Pos)
  #define ATBREPLICATOR_AUTHSTATUS_SID_Min (0x0UL)
  #define ATBREPLICATOR_AUTHSTATUS_SID_Max (0x1UL)
  #define ATBREPLICATOR_AUTHSTATUS_SID_NotImplemented (0x0UL)
  #define ATBREPLICATOR_AUTHSTATUS_SID_Implemented (0x1UL)

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define ATBREPLICATOR_AUTHSTATUS_SNID_Pos (6UL)
  #define ATBREPLICATOR_AUTHSTATUS_SNID_Msk (0x3UL << ATBREPLICATOR_AUTHSTATUS_SNID_Pos)
  #define ATBREPLICATOR_AUTHSTATUS_SNID_Min (0x0UL)
  #define ATBREPLICATOR_AUTHSTATUS_SNID_Max (0x1UL)
  #define ATBREPLICATOR_AUTHSTATUS_SNID_NotImplemented (0x0UL)
  #define ATBREPLICATOR_AUTHSTATUS_SNID_Implemented (0x1UL)


/* ATBREPLICATOR_DEVID: Indicates the capabilities of the component. */
  #define ATBREPLICATOR_DEVID_ResetValue (0x00000000UL)

/* PORTNUM @Bits 0..3 : Indicates the number of master ports implemented. */
  #define ATBREPLICATOR_DEVID_PORTNUM_Pos (0UL)
  #define ATBREPLICATOR_DEVID_PORTNUM_Msk (0xFUL << ATBREPLICATOR_DEVID_PORTNUM_Pos)
  #define ATBREPLICATOR_DEVID_PORTNUM_Min (0x0UL)
  #define ATBREPLICATOR_DEVID_PORTNUM_Max (0xFUL)


/* ATBREPLICATOR_DEVTYPE: The DEVTYPE register provides a debugger with information about the component when the Part Number
                           field is not recognized. The debugger can then report this information. */

  #define ATBREPLICATOR_DEVTYPE_ResetValue (0x00000000UL)

/* MAJOR @Bits 0..3 : The main type of the component */
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Pos (0UL)
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Msk (0xFUL << ATBREPLICATOR_DEVTYPE_MAJOR_Pos)
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Min (0x2UL)
  #define ATBREPLICATOR_DEVTYPE_MAJOR_Max (0x2UL)
  #define ATBREPLICATOR_DEVTYPE_MAJOR_InputOutputDevice (0x2UL)

/* SUB @Bits 4..7 : The sub-type of the component */
  #define ATBREPLICATOR_DEVTYPE_SUB_Pos (4UL)
  #define ATBREPLICATOR_DEVTYPE_SUB_Msk (0xFUL << ATBREPLICATOR_DEVTYPE_SUB_Pos)
  #define ATBREPLICATOR_DEVTYPE_SUB_Min (0x2UL)
  #define ATBREPLICATOR_DEVTYPE_SUB_Max (0x2UL)
  #define ATBREPLICATOR_DEVTYPE_SUB_Replicator (0x2UL) /*!< Indicates that this component replicates trace from a single source
                                                            to multiple targets.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          AUXPLL                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct AUXPLL_CONFIG =================================================== */
/**
  * @brief CONFIG [AUXPLL_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CFGSTATIC;
} NRF_AUXPLL_CONFIG_Type;

/* AUXPLL_CONFIG_CFGSTATIC: AUXPLL configuration */
  #define AUXPLL_CONFIG_CFGSTATIC_ResetValue (0x00000224UL)

/* OUTDRIVE @Bits 0..1 : Output buffer drive strength selection */
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Pos (0UL)
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Msk (0x3UL << AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Pos)
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Min (0x0UL)
  #define AUXPLL_CONFIG_CFGSTATIC_OUTDRIVE_Max (0x3UL)

/* SELCONSTANTI @Bits 2..6 : Constant current tune for ring oscillator */
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Pos (2UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Msk (0x1FUL << AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Pos) /*!< Bit mask of
                                                                            SELCONSTANTI field.*/
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Min (0x00UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Default (0x09UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SELCONSTANTI_Max (0x0FUL)

/* SDMOFF @Bit 7 : Turn off sigma delta modulation */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Pos (7UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Msk (0x1UL << AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Pos)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Min (0x0UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_Max (0x1UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_SDMOn (0x0UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMOFF_SDMOff (0x1UL)

/* SDMDITHEROFF @Bit 8 : Turn off dither in sigma delta modulator */
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Pos (8UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Msk (0x1UL << AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Pos) /*!< Bit mask of
                                                                            SDMDITHEROFF field.*/
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Min (0x0UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_Max (0x1UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_DitherOn (0x0UL)
  #define AUXPLL_CONFIG_CFGSTATIC_SDMDITHEROFF_DitherOff (0x1UL)

/* AUXPLLRANGE @Bits 9..10 : Loop divider base settings */
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Pos (9UL)
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Msk (0x3UL << AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Pos) /*!< Bit mask of
                                                                            AUXPLLRANGE field.*/
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Min (0x0UL)
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Max (0x3UL)
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Low (0x0UL)
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_Mid (0x1UL)
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_High (0x2UL)
  #define AUXPLL_CONFIG_CFGSTATIC_AUXPLLRANGE_StaticHigh (0x3UL)



/* =================================================== Struct AUXPLL_TRIM ==================================================== */
/**
  * @brief TRIM [AUXPLL_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTUNE;
} NRF_AUXPLL_TRIM_Type;

/* AUXPLL_TRIM_CTUNE: Ring oscillator core process corner tuning */
  #define AUXPLL_TRIM_CTUNE_ResetValue (0x0000000DUL)

