pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VAL @Bits 0..4 : Tuning value */
  #define AUXPLL_TRIM_CTUNE_VAL_Pos (0UL)
  #define AUXPLL_TRIM_CTUNE_VAL_Msk (0x1FUL << AUXPLL_TRIM_CTUNE_VAL_Pos)
  #define AUXPLL_TRIM_CTUNE_VAL_Max (0x00UL)
  #define AUXPLL_TRIM_CTUNE_VAL_Default (0x0DUL)
  #define AUXPLL_TRIM_CTUNE_VAL_Min (0x1FUL)



/* ================================================ Struct AUXPLL_AUXPLLCTRL ================================================= */
/**
  * @brief AUXPLLCTRL [AUXPLL_AUXPLLCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FREQUENCY;
  __IOM uint32_t  FREQINC;
  __IOM uint32_t  FREQINCPERIOD;
  __IOM uint32_t  OUTSEL;
  __IOM uint32_t  MODE;
} NRF_AUXPLL_AUXPLLCTRL_Type;

/* AUXPLL_AUXPLLCTRL_FREQUENCY: AUXPLL frequency selection */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_ResetValue (0x00008000UL)

/* FREQUENCY @Bits 0..15 : Set fractional PLL divider ratio */
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Pos (0UL)
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Msk (0xFFFFUL << AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of
                                                                            FREQUENCY field.*/
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Min (0x0UL)
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Max (0xFFFFUL)
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_MinimumDiv (0x0000UL)
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Audio44k1 (0x3BCDUL)
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_USB24M (0x8000UL)
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_Audio48k (0x9BA5UL)
  #define AUXPLL_AUXPLLCTRL_FREQUENCY_FREQUENCY_MaximumDiv (0xFFFFUL)


/* AUXPLL_AUXPLLCTRL_FREQINC: Frequency increment */
  #define AUXPLL_AUXPLLCTRL_FREQINC_ResetValue (0x00000000UL)

/* FREQINC @Bits 0..7 : Signed 8-bit frequency increment, applied to FREQUENCY */
  #define AUXPLL_AUXPLLCTRL_FREQINC_FREQINC_Pos (0UL)
  #define AUXPLL_AUXPLLCTRL_FREQINC_FREQINC_Msk (0xFFUL << AUXPLL_AUXPLLCTRL_FREQINC_FREQINC_Pos) /*!< Bit mask of FREQINC
                                                                            field.*/


/* AUXPLL_AUXPLLCTRL_FREQINCPERIOD: Frequency increment period in 1 us steps */
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_ResetValue (0x00000000UL)

/* FREQINCPERIOD @Bits 0..15 : Frequency increment period */
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Pos (0UL)
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Msk (0xFFFFUL << AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Pos) /*!<
                                                                            Bit mask of FREQINCPERIOD field.*/
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Min (0x0001UL)
  #define AUXPLL_AUXPLLCTRL_FREQINCPERIOD_FREQINCPERIOD_Max (0xFFFFUL)


/* AUXPLL_AUXPLLCTRL_OUTSEL: AUXPLL output prescaler */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_ResetValue (0x00000007UL)

/* OUTSEL @Bits 0..3 : Prescaler ratio */
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Pos (0UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Msk (0xFUL << AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Pos)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Min (0x0UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Max (0x8UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_DivDisabled (0x0UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div1 (0x1UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div2 (0x2UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div3 (0x3UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div4 (0x4UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div6 (0x5UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div8 (0x6UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div12 (0x7UL)
  #define AUXPLL_AUXPLLCTRL_OUTSEL_OUTSEL_Div16 (0x8UL)


/* AUXPLL_AUXPLLCTRL_MODE: Freerunning mode control */
  #define AUXPLL_AUXPLLCTRL_MODE_ResetValue (0x00000000UL)

/* MODECTRL @Bits 0..1 : Freerunning mode control */
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Pos (0UL)
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Msk (0x3UL << AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Pos)
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Min (0x0UL)
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Max (0x2UL)
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Auto (0x0UL)
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Freerun (0x1UL)
  #define AUXPLL_AUXPLLCTRL_MODE_MODECTRL_Locked (0x2UL)


/* ====================================================== Struct AUXPLL ====================================================== */
/**
  * @brief AUXPLL
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_NEWFINEFREQ;
    __OM uint32_t TASKS_NEWBASEFREQ;
    __OM uint32_t TASKS_FREQINCSTART;
    __OM uint32_t TASKS_FREQINCSTOP;
    __IM uint32_t RESERVED[58];
    __IOM uint32_t EVENTS_STARTED;
    __IOM uint32_t EVENTS_STOPPED;
    __IOM uint32_t EVENTS_LOCKED;
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;
    __IM uint32_t RESERVED3[3];
    __IOM NRF_AUXPLL_CONFIG_Type CONFIG;
    __IM uint32_t RESERVED4[11];
    __IOM NRF_AUXPLL_TRIM_Type TRIM;
    __IM uint32_t RESERVED5[7];
    __IOM NRF_AUXPLL_AUXPLLCTRL_Type AUXPLLCTRL;
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t MIRROR;
  } NRF_AUXPLL_Type;

/* AUXPLL_TASKS_START: Start the AUXPLL */
  #define AUXPLL_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start the AUXPLL */
  #define AUXPLL_TASKS_START_TASKS_START_Pos (0UL)
  #define AUXPLL_TASKS_START_TASKS_START_Msk (0x1UL << AUXPLL_TASKS_START_TASKS_START_Pos)
  #define AUXPLL_TASKS_START_TASKS_START_Min (0x1UL)
  #define AUXPLL_TASKS_START_TASKS_START_Max (0x1UL)
  #define AUXPLL_TASKS_START_TASKS_START_Trigger (0x1UL)


/* AUXPLL_TASKS_STOP: Stop the AUXPLL */
  #define AUXPLL_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop the AUXPLL */
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << AUXPLL_TASKS_STOP_TASKS_STOP_Pos)
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define AUXPLL_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* AUXPLL_TASKS_NEWFINEFREQ: Change fine frequency */
  #define AUXPLL_TASKS_NEWFINEFREQ_ResetValue (0x00000000UL)

/* TASKS_NEWFINEFREQ @Bit 0 : Change fine frequency */
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Pos (0UL)
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Msk (0x1UL << AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Pos) /*!< Bit mask
                                                                            of TASKS_NEWFINEFREQ field.*/
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Min (0x1UL)
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Max (0x1UL)
  #define AUXPLL_TASKS_NEWFINEFREQ_TASKS_NEWFINEFREQ_Trigger (0x1UL)


