pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* AUXPLL_TASKS_NEWBASEFREQ: Change base frequency */
  #define AUXPLL_TASKS_NEWBASEFREQ_ResetValue (0x00000000UL)

/* TASKS_NEWBASEFREQ @Bit 0 : Change base frequency */
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Pos (0UL)
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Msk (0x1UL << AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Pos) /*!< Bit mask
                                                                            of TASKS_NEWBASEFREQ field.*/
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Min (0x1UL)
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Max (0x1UL)
  #define AUXPLL_TASKS_NEWBASEFREQ_TASKS_NEWBASEFREQ_Trigger (0x1UL)


/* AUXPLL_TASKS_FREQINCSTART: Start automated frequency increment */
  #define AUXPLL_TASKS_FREQINCSTART_ResetValue (0x00000000UL)

/* TASKS_FREQINCSTART @Bit 0 : Start automated frequency increment */
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Pos (0UL)
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Msk (0x1UL << AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Pos) /*!< Bit
                                                                            mask of TASKS_FREQINCSTART field.*/
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Min (0x1UL)
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Max (0x1UL)
  #define AUXPLL_TASKS_FREQINCSTART_TASKS_FREQINCSTART_Trigger (0x1UL)


/* AUXPLL_TASKS_FREQINCSTOP: Stop automated frequency increment */
  #define AUXPLL_TASKS_FREQINCSTOP_ResetValue (0x00000000UL)

/* TASKS_FREQINCSTOP @Bit 0 : Stop automated frequency increment */
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Pos (0UL)
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Msk (0x1UL << AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Pos) /*!< Bit mask
                                                                            of TASKS_FREQINCSTOP field.*/
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Min (0x1UL)
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Max (0x1UL)
  #define AUXPLL_TASKS_FREQINCSTOP_TASKS_FREQINCSTOP_Trigger (0x1UL)


/* AUXPLL_EVENTS_STARTED: AUXPLL started */
  #define AUXPLL_EVENTS_STARTED_ResetValue (0x00000000UL)

/* EVENTS_STARTED @Bit 0 : AUXPLL started */
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL)
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL)
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL)
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL)
  #define AUXPLL_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL)


/* AUXPLL_EVENTS_STOPPED: AUXPLL stopped */
  #define AUXPLL_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : AUXPLL stopped */
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define AUXPLL_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* AUXPLL_EVENTS_LOCKED: AUXPLL locked */
  #define AUXPLL_EVENTS_LOCKED_ResetValue (0x00000000UL)

/* EVENTS_LOCKED @Bit 0 : AUXPLL locked */
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Pos (0UL)
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Msk (0x1UL << AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Pos) /*!< Bit mask of
                                                                            EVENTS_LOCKED field.*/
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Min (0x0UL)
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Max (0x1UL)
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_NotGenerated (0x0UL)
  #define AUXPLL_EVENTS_LOCKED_EVENTS_LOCKED_Generated (0x1UL)


/* AUXPLL_INTEN: Enable or disable interrupt */
  #define AUXPLL_INTEN_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define AUXPLL_INTEN_STARTED_Pos (0UL)
  #define AUXPLL_INTEN_STARTED_Msk (0x1UL << AUXPLL_INTEN_STARTED_Pos)
  #define AUXPLL_INTEN_STARTED_Min (0x0UL)
  #define AUXPLL_INTEN_STARTED_Max (0x1UL)
  #define AUXPLL_INTEN_STARTED_Disabled (0x0UL)
  #define AUXPLL_INTEN_STARTED_Enabled (0x1UL)

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define AUXPLL_INTEN_STOPPED_Pos (1UL)
  #define AUXPLL_INTEN_STOPPED_Msk (0x1UL << AUXPLL_INTEN_STOPPED_Pos)
  #define AUXPLL_INTEN_STOPPED_Min (0x0UL)
  #define AUXPLL_INTEN_STOPPED_Max (0x1UL)
  #define AUXPLL_INTEN_STOPPED_Disabled (0x0UL)
  #define AUXPLL_INTEN_STOPPED_Enabled (0x1UL)

/* LOCKED @Bit 2 : Enable or disable interrupt for event LOCKED */
  #define AUXPLL_INTEN_LOCKED_Pos (2UL)
  #define AUXPLL_INTEN_LOCKED_Msk (0x1UL << AUXPLL_INTEN_LOCKED_Pos)
  #define AUXPLL_INTEN_LOCKED_Min (0x0UL)
  #define AUXPLL_INTEN_LOCKED_Max (0x1UL)
  #define AUXPLL_INTEN_LOCKED_Disabled (0x0UL)
  #define AUXPLL_INTEN_LOCKED_Enabled (0x1UL)


/* AUXPLL_INTENSET: Enable interrupt */
  #define AUXPLL_INTENSET_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define AUXPLL_INTENSET_STARTED_Pos (0UL)
  #define AUXPLL_INTENSET_STARTED_Msk (0x1UL << AUXPLL_INTENSET_STARTED_Pos)
  #define AUXPLL_INTENSET_STARTED_Min (0x0UL)
  #define AUXPLL_INTENSET_STARTED_Max (0x1UL)
  #define AUXPLL_INTENSET_STARTED_Set (0x1UL)
  #define AUXPLL_INTENSET_STARTED_Disabled (0x0UL)
  #define AUXPLL_INTENSET_STARTED_Enabled (0x1UL)

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define AUXPLL_INTENSET_STOPPED_Pos (1UL)
  #define AUXPLL_INTENSET_STOPPED_Msk (0x1UL << AUXPLL_INTENSET_STOPPED_Pos)
  #define AUXPLL_INTENSET_STOPPED_Min (0x0UL)
  #define AUXPLL_INTENSET_STOPPED_Max (0x1UL)
  #define AUXPLL_INTENSET_STOPPED_Set (0x1UL)
  #define AUXPLL_INTENSET_STOPPED_Disabled (0x0UL)
  #define AUXPLL_INTENSET_STOPPED_Enabled (0x1UL)

/* LOCKED @Bit 2 : Write '1' to enable interrupt for event LOCKED */
  #define AUXPLL_INTENSET_LOCKED_Pos (2UL)
  #define AUXPLL_INTENSET_LOCKED_Msk (0x1UL << AUXPLL_INTENSET_LOCKED_Pos)
  #define AUXPLL_INTENSET_LOCKED_Min (0x0UL)
  #define AUXPLL_INTENSET_LOCKED_Max (0x1UL)
  #define AUXPLL_INTENSET_LOCKED_Set (0x1UL)
  #define AUXPLL_INTENSET_LOCKED_Disabled (0x0UL)
  #define AUXPLL_INTENSET_LOCKED_Enabled (0x1UL)


/* AUXPLL_INTENCLR: Disable interrupt */
  #define AUXPLL_INTENCLR_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define AUXPLL_INTENCLR_STARTED_Pos (0UL)
  #define AUXPLL_INTENCLR_STARTED_Msk (0x1UL << AUXPLL_INTENCLR_STARTED_Pos)
  #define AUXPLL_INTENCLR_STARTED_Min (0x0UL)
  #define AUXPLL_INTENCLR_STARTED_Max (0x1UL)
  #define AUXPLL_INTENCLR_STARTED_Clear (0x1UL)
  #define AUXPLL_INTENCLR_STARTED_Disabled (0x0UL)
  #define AUXPLL_INTENCLR_STARTED_Enabled (0x1UL)

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define AUXPLL_INTENCLR_STOPPED_Pos (1UL)
  #define AUXPLL_INTENCLR_STOPPED_Msk (0x1UL << AUXPLL_INTENCLR_STOPPED_Pos)
  #define AUXPLL_INTENCLR_STOPPED_Min (0x0UL)
  #define AUXPLL_INTENCLR_STOPPED_Max (0x1UL)
  #define AUXPLL_INTENCLR_STOPPED_Clear (0x1UL)
  #define AUXPLL_INTENCLR_STOPPED_Disabled (0x0UL)
  #define AUXPLL_INTENCLR_STOPPED_Enabled (0x1UL)

/* LOCKED @Bit 2 : Write '1' to disable interrupt for event LOCKED */
  #define AUXPLL_INTENCLR_LOCKED_Pos (2UL)
  #define AUXPLL_INTENCLR_LOCKED_Msk (0x1UL << AUXPLL_INTENCLR_LOCKED_Pos)
  #define AUXPLL_INTENCLR_LOCKED_Min (0x0UL)
  #define AUXPLL_INTENCLR_LOCKED_Max (0x1UL)
  #define AUXPLL_INTENCLR_LOCKED_Clear (0x1UL)
  #define AUXPLL_INTENCLR_LOCKED_Disabled (0x0UL)
  #define AUXPLL_INTENCLR_LOCKED_Enabled (0x1UL)


/* AUXPLL_INTPEND: Pending interrupts */
  #define AUXPLL_INTPEND_ResetValue (0x00000000UL)

