pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define AUXPLL_INTPEND_STARTED_Pos (0UL)
  #define AUXPLL_INTPEND_STARTED_Msk (0x1UL << AUXPLL_INTPEND_STARTED_Pos)
  #define AUXPLL_INTPEND_STARTED_Min (0x0UL)
  #define AUXPLL_INTPEND_STARTED_Max (0x1UL)
  #define AUXPLL_INTPEND_STARTED_NotPending (0x0UL)
  #define AUXPLL_INTPEND_STARTED_Pending (0x1UL)

/* STOPPED @Bit 1 : Read pending status of interrupt for event STOPPED */
  #define AUXPLL_INTPEND_STOPPED_Pos (1UL)
  #define AUXPLL_INTPEND_STOPPED_Msk (0x1UL << AUXPLL_INTPEND_STOPPED_Pos)
  #define AUXPLL_INTPEND_STOPPED_Min (0x0UL)
  #define AUXPLL_INTPEND_STOPPED_Max (0x1UL)
  #define AUXPLL_INTPEND_STOPPED_NotPending (0x0UL)
  #define AUXPLL_INTPEND_STOPPED_Pending (0x1UL)

/* LOCKED @Bit 2 : Read pending status of interrupt for event LOCKED */
  #define AUXPLL_INTPEND_LOCKED_Pos (2UL)
  #define AUXPLL_INTPEND_LOCKED_Msk (0x1UL << AUXPLL_INTPEND_LOCKED_Pos)
  #define AUXPLL_INTPEND_LOCKED_Min (0x0UL)
  #define AUXPLL_INTPEND_LOCKED_Max (0x1UL)
  #define AUXPLL_INTPEND_LOCKED_NotPending (0x0UL)
  #define AUXPLL_INTPEND_LOCKED_Pending (0x1UL)


/* AUXPLL_STATUS: Status of AUXPLL */
  #define AUXPLL_STATUS_ResetValue (0x00000000UL)

/* MODE @Bit 0 : AUXPLL mode */
  #define AUXPLL_STATUS_MODE_Pos (0UL)
  #define AUXPLL_STATUS_MODE_Msk (0x1UL << AUXPLL_STATUS_MODE_Pos)
  #define AUXPLL_STATUS_MODE_Min (0x0UL)
  #define AUXPLL_STATUS_MODE_Max (0x1UL)
  #define AUXPLL_STATUS_MODE_Freerunning (0x0UL)
  #define AUXPLL_STATUS_MODE_Locked (0x1UL)

/* PLLRUNNING @Bit 1 : AUXPLL running status */
  #define AUXPLL_STATUS_PLLRUNNING_Pos (1UL)
  #define AUXPLL_STATUS_PLLRUNNING_Msk (0x1UL << AUXPLL_STATUS_PLLRUNNING_Pos)
  #define AUXPLL_STATUS_PLLRUNNING_Min (0x0UL)
  #define AUXPLL_STATUS_PLLRUNNING_Max (0x1UL)
  #define AUXPLL_STATUS_PLLRUNNING_Off (0x0UL)
  #define AUXPLL_STATUS_PLLRUNNING_Running (0x1UL)

/* FREQUENCYACTUAL @Bits 16..31 : Actual fractional PLL divider ratio */
  #define AUXPLL_STATUS_FREQUENCYACTUAL_Pos (16UL)
  #define AUXPLL_STATUS_FREQUENCYACTUAL_Msk (0xFFFFUL << AUXPLL_STATUS_FREQUENCYACTUAL_Pos) /*!< Bit mask of FREQUENCYACTUAL
                                                                            field.*/


/* AUXPLL_MIRROR: Enable LOCK for mirrored registers */
  #define AUXPLL_MIRROR_ResetValue (0x00000000UL)

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define AUXPLL_MIRROR_LOCK_Pos (0UL)
  #define AUXPLL_MIRROR_LOCK_Msk (0x1UL << AUXPLL_MIRROR_LOCK_Pos)
  #define AUXPLL_MIRROR_LOCK_Min (0x0UL)
  #define AUXPLL_MIRROR_LOCK_Max (0x1UL)
  #define AUXPLL_MIRROR_LOCK_Disabled (0x0UL)
  #define AUXPLL_MIRROR_LOCK_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         BELLBOARD                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct BELLBOARD ===================================================== */
/**
  * @brief BELLBOARD APB registers
  */
  typedef struct {
    __OM uint32_t TASKS_TRIGGER[32];
    __IM uint32_t RESERVED[32];
    __IOM uint32_t EVENTS_TRIGGERED[32];
    __IM uint32_t RESERVED1[96];
    __IOM uint32_t INTEN0;
    __IOM uint32_t INTENSET0;
    __IOM uint32_t INTENCLR0;
    __IM uint32_t INTPEND0;
    __IOM uint32_t INTEN1;
    __IOM uint32_t INTENSET1;
    __IOM uint32_t INTENCLR1;
    __IM uint32_t INTPEND1;
    __IOM uint32_t INTEN2;
    __IOM uint32_t INTENSET2;
    __IOM uint32_t INTENCLR2;
    __IM uint32_t INTPEND2;
    __IOM uint32_t INTEN3;
    __IOM uint32_t INTENSET3;
    __IOM uint32_t INTENCLR3;
    __IM uint32_t INTPEND3;
  } NRF_BELLBOARD_Type;

/* BELLBOARD_TASKS_TRIGGER: Task TRIGGER[n] */
  #define BELLBOARD_TASKS_TRIGGER_MaxCount (32UL)
  #define BELLBOARD_TASKS_TRIGGER_MaxIndex (31UL)
  #define BELLBOARD_TASKS_TRIGGER_MinIndex (0UL)
  #define BELLBOARD_TASKS_TRIGGER_ResetValue (0x00000000UL)

/* TASKS_TRIGGER @Bit 0 : Task TRIGGER[n] */
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL)
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGGER field.*/
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL)
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL)
  #define BELLBOARD_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL)


/* BELLBOARD_EVENTS_TRIGGERED: Event TRIGGERED[n] */
  #define BELLBOARD_EVENTS_TRIGGERED_MaxCount (32UL)
  #define BELLBOARD_EVENTS_TRIGGERED_MaxIndex (31UL)
  #define BELLBOARD_EVENTS_TRIGGERED_MinIndex (0UL)
  #define BELLBOARD_EVENTS_TRIGGERED_ResetValue (0x00000000UL)

/* EVENTS_TRIGGERED @Bit 0 : Event TRIGGERED[n] */
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos (0UL)
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Msk (0x1UL << BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos) /*!< Bit
                                                                            mask of EVENTS_TRIGGERED field.*/
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Min (0x0UL)
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Max (0x1UL)
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_NotGenerated (0x0UL)
  #define BELLBOARD_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Generated (0x1UL)


/* BELLBOARD_INTEN0: Enable or disable interrupt */
  #define BELLBOARD_INTEN0_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Enable or disable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTEN0_TRIGGERED0_Pos (0UL)
  #define BELLBOARD_INTEN0_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTEN0_TRIGGERED0_Pos)
  #define BELLBOARD_INTEN0_TRIGGERED0_Min (0x0UL)
  #define BELLBOARD_INTEN0_TRIGGERED0_Max (0x1UL)
  #define BELLBOARD_INTEN0_TRIGGERED0_Disabled (0x0UL)
  #define BELLBOARD_INTEN0_TRIGGERED0_Enabled (0x1UL)

