pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGGERED28 @Bit 28 : Write '1' to disable interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTENCLR0_TRIGGERED28_Pos (28UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTENCLR0_TRIGGERED28_Pos) /*!< Bit mask of TRIGGERED28
                                                                            field.*/
  #define BELLBOARD_INTENCLR0_TRIGGERED28_Min (0x0UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED28_Max (0x1UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED28_Clear (0x1UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED28_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED28_Enabled (0x1UL)

/* TRIGGERED29 @Bit 29 : Write '1' to disable interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTENCLR0_TRIGGERED29_Pos (29UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTENCLR0_TRIGGERED29_Pos) /*!< Bit mask of TRIGGERED29
                                                                            field.*/
  #define BELLBOARD_INTENCLR0_TRIGGERED29_Min (0x0UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED29_Max (0x1UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED29_Clear (0x1UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED29_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED29_Enabled (0x1UL)

/* TRIGGERED30 @Bit 30 : Write '1' to disable interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTENCLR0_TRIGGERED30_Pos (30UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTENCLR0_TRIGGERED30_Pos) /*!< Bit mask of TRIGGERED30
                                                                            field.*/
  #define BELLBOARD_INTENCLR0_TRIGGERED30_Min (0x0UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED30_Max (0x1UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED30_Clear (0x1UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED30_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED30_Enabled (0x1UL)

/* TRIGGERED31 @Bit 31 : Write '1' to disable interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTENCLR0_TRIGGERED31_Pos (31UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTENCLR0_TRIGGERED31_Pos) /*!< Bit mask of TRIGGERED31
                                                                            field.*/
  #define BELLBOARD_INTENCLR0_TRIGGERED31_Min (0x0UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED31_Max (0x1UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED31_Clear (0x1UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED31_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR0_TRIGGERED31_Enabled (0x1UL)


/* BELLBOARD_INTPEND0: Pending interrupts */
  #define BELLBOARD_INTPEND0_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Read pending status of interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTPEND0_TRIGGERED0_Pos (0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED0_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED0_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED0_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED0_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED0_Pending (0x1UL)

/* TRIGGERED1 @Bit 1 : Read pending status of interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTPEND0_TRIGGERED1_Pos (1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED1_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED1_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED1_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED1_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED1_Pending (0x1UL)

/* TRIGGERED2 @Bit 2 : Read pending status of interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTPEND0_TRIGGERED2_Pos (2UL)
  #define BELLBOARD_INTPEND0_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED2_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED2_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED2_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED2_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED2_Pending (0x1UL)

/* TRIGGERED3 @Bit 3 : Read pending status of interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTPEND0_TRIGGERED3_Pos (3UL)
  #define BELLBOARD_INTPEND0_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED3_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED3_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED3_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED3_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED3_Pending (0x1UL)

/* TRIGGERED4 @Bit 4 : Read pending status of interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTPEND0_TRIGGERED4_Pos (4UL)
  #define BELLBOARD_INTPEND0_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED4_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED4_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED4_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED4_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED4_Pending (0x1UL)

/* TRIGGERED5 @Bit 5 : Read pending status of interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTPEND0_TRIGGERED5_Pos (5UL)
  #define BELLBOARD_INTPEND0_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED5_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED5_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED5_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED5_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED5_Pending (0x1UL)

/* TRIGGERED6 @Bit 6 : Read pending status of interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTPEND0_TRIGGERED6_Pos (6UL)
  #define BELLBOARD_INTPEND0_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED6_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED6_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED6_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED6_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED6_Pending (0x1UL)

/* TRIGGERED7 @Bit 7 : Read pending status of interrupt for event TRIGGERED[7] */
  #define BELLBOARD_INTPEND0_TRIGGERED7_Pos (7UL)
  #define BELLBOARD_INTPEND0_TRIGGERED7_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED7_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED7_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED7_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED7_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED7_Pending (0x1UL)

/* TRIGGERED8 @Bit 8 : Read pending status of interrupt for event TRIGGERED[8] */
  #define BELLBOARD_INTPEND0_TRIGGERED8_Pos (8UL)
  #define BELLBOARD_INTPEND0_TRIGGERED8_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED8_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED8_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED8_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED8_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED8_Pending (0x1UL)

/* TRIGGERED9 @Bit 9 : Read pending status of interrupt for event TRIGGERED[9] */
  #define BELLBOARD_INTPEND0_TRIGGERED9_Pos (9UL)
  #define BELLBOARD_INTPEND0_TRIGGERED9_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED9_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED9_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED9_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED9_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED9_Pending (0x1UL)

/* TRIGGERED10 @Bit 10 : Read pending status of interrupt for event TRIGGERED[10] */
  #define BELLBOARD_INTPEND0_TRIGGERED10_Pos (10UL)
  #define BELLBOARD_INTPEND0_TRIGGERED10_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED10_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED10_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED10_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED10_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED10_Pending (0x1UL)

/* TRIGGERED11 @Bit 11 : Read pending status of interrupt for event TRIGGERED[11] */
  #define BELLBOARD_INTPEND0_TRIGGERED11_Pos (11UL)
  #define BELLBOARD_INTPEND0_TRIGGERED11_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED11_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED11_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED11_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED11_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED11_Pending (0x1UL)

/* TRIGGERED12 @Bit 12 : Read pending status of interrupt for event TRIGGERED[12] */
  #define BELLBOARD_INTPEND0_TRIGGERED12_Pos (12UL)
  #define BELLBOARD_INTPEND0_TRIGGERED12_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED12_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED12_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED12_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED12_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED12_Pending (0x1UL)

/* TRIGGERED13 @Bit 13 : Read pending status of interrupt for event TRIGGERED[13] */
  #define BELLBOARD_INTPEND0_TRIGGERED13_Pos (13UL)
  #define BELLBOARD_INTPEND0_TRIGGERED13_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED13_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED13_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED13_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED13_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED13_Pending (0x1UL)

/* TRIGGERED14 @Bit 14 : Read pending status of interrupt for event TRIGGERED[14] */
  #define BELLBOARD_INTPEND0_TRIGGERED14_Pos (14UL)
  #define BELLBOARD_INTPEND0_TRIGGERED14_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED14_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED14_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED14_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED14_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED14_Pending (0x1UL)

/* TRIGGERED15 @Bit 15 : Read pending status of interrupt for event TRIGGERED[15] */
  #define BELLBOARD_INTPEND0_TRIGGERED15_Pos (15UL)
  #define BELLBOARD_INTPEND0_TRIGGERED15_Msk (0x1UL << BELLBOARD_INTPEND0_TRIGGERED15_Pos)
  #define BELLBOARD_INTPEND0_TRIGGERED15_Min (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED15_Max (0x1UL)
  #define BELLBOARD_INTPEND0_TRIGGERED15_NotPending (0x0UL)
  #define BELLBOARD_INTPEND0_TRIGGERED15_Pending (0x1UL)

