pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* BELLBOARD_INTEN2: Enable or disable interrupt */
  #define BELLBOARD_INTEN2_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Enable or disable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTEN2_TRIGGERED0_Pos (0UL)
  #define BELLBOARD_INTEN2_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED0_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED0_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED0_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED0_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED0_Enabled (0x1UL)

/* TRIGGERED1 @Bit 1 : Enable or disable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTEN2_TRIGGERED1_Pos (1UL)
  #define BELLBOARD_INTEN2_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED1_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED1_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED1_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED1_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED1_Enabled (0x1UL)

/* TRIGGERED2 @Bit 2 : Enable or disable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTEN2_TRIGGERED2_Pos (2UL)
  #define BELLBOARD_INTEN2_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED2_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED2_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED2_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED2_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED2_Enabled (0x1UL)

/* TRIGGERED3 @Bit 3 : Enable or disable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTEN2_TRIGGERED3_Pos (3UL)
  #define BELLBOARD_INTEN2_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED3_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED3_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED3_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED3_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED3_Enabled (0x1UL)

/* TRIGGERED4 @Bit 4 : Enable or disable interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTEN2_TRIGGERED4_Pos (4UL)
  #define BELLBOARD_INTEN2_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED4_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED4_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED4_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED4_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED4_Enabled (0x1UL)

/* TRIGGERED5 @Bit 5 : Enable or disable interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTEN2_TRIGGERED5_Pos (5UL)
  #define BELLBOARD_INTEN2_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED5_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED5_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED5_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED5_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED5_Enabled (0x1UL)

/* TRIGGERED6 @Bit 6 : Enable or disable interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTEN2_TRIGGERED6_Pos (6UL)
  #define BELLBOARD_INTEN2_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED6_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED6_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED6_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED6_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED6_Enabled (0x1UL)

/* TRIGGERED7 @Bit 7 : Enable or disable interrupt for event TRIGGERED[7] */
  #define BELLBOARD_INTEN2_TRIGGERED7_Pos (7UL)
  #define BELLBOARD_INTEN2_TRIGGERED7_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED7_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED7_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED7_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED7_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED7_Enabled (0x1UL)

/* TRIGGERED8 @Bit 8 : Enable or disable interrupt for event TRIGGERED[8] */
  #define BELLBOARD_INTEN2_TRIGGERED8_Pos (8UL)
  #define BELLBOARD_INTEN2_TRIGGERED8_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED8_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED8_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED8_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED8_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED8_Enabled (0x1UL)

/* TRIGGERED9 @Bit 9 : Enable or disable interrupt for event TRIGGERED[9] */
  #define BELLBOARD_INTEN2_TRIGGERED9_Pos (9UL)
  #define BELLBOARD_INTEN2_TRIGGERED9_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED9_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED9_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED9_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED9_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED9_Enabled (0x1UL)

/* TRIGGERED10 @Bit 10 : Enable or disable interrupt for event TRIGGERED[10] */
  #define BELLBOARD_INTEN2_TRIGGERED10_Pos (10UL)
  #define BELLBOARD_INTEN2_TRIGGERED10_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED10_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED10_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED10_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED10_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED10_Enabled (0x1UL)

/* TRIGGERED11 @Bit 11 : Enable or disable interrupt for event TRIGGERED[11] */
  #define BELLBOARD_INTEN2_TRIGGERED11_Pos (11UL)
  #define BELLBOARD_INTEN2_TRIGGERED11_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED11_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED11_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED11_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED11_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED11_Enabled (0x1UL)

/* TRIGGERED12 @Bit 12 : Enable or disable interrupt for event TRIGGERED[12] */
  #define BELLBOARD_INTEN2_TRIGGERED12_Pos (12UL)
  #define BELLBOARD_INTEN2_TRIGGERED12_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED12_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED12_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED12_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED12_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED12_Enabled (0x1UL)

/* TRIGGERED13 @Bit 13 : Enable or disable interrupt for event TRIGGERED[13] */
  #define BELLBOARD_INTEN2_TRIGGERED13_Pos (13UL)
  #define BELLBOARD_INTEN2_TRIGGERED13_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED13_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED13_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED13_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED13_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED13_Enabled (0x1UL)

/* TRIGGERED14 @Bit 14 : Enable or disable interrupt for event TRIGGERED[14] */
  #define BELLBOARD_INTEN2_TRIGGERED14_Pos (14UL)
  #define BELLBOARD_INTEN2_TRIGGERED14_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED14_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED14_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED14_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED14_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED14_Enabled (0x1UL)

/* TRIGGERED15 @Bit 15 : Enable or disable interrupt for event TRIGGERED[15] */
  #define BELLBOARD_INTEN2_TRIGGERED15_Pos (15UL)
  #define BELLBOARD_INTEN2_TRIGGERED15_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED15_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED15_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED15_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED15_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED15_Enabled (0x1UL)

/* TRIGGERED16 @Bit 16 : Enable or disable interrupt for event TRIGGERED[16] */
  #define BELLBOARD_INTEN2_TRIGGERED16_Pos (16UL)
  #define BELLBOARD_INTEN2_TRIGGERED16_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED16_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED16_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED16_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED16_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED16_Enabled (0x1UL)

/* TRIGGERED17 @Bit 17 : Enable or disable interrupt for event TRIGGERED[17] */
  #define BELLBOARD_INTEN2_TRIGGERED17_Pos (17UL)
  #define BELLBOARD_INTEN2_TRIGGERED17_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED17_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED17_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED17_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED17_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED17_Enabled (0x1UL)

/* TRIGGERED18 @Bit 18 : Enable or disable interrupt for event TRIGGERED[18] */
  #define BELLBOARD_INTEN2_TRIGGERED18_Pos (18UL)
  #define BELLBOARD_INTEN2_TRIGGERED18_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED18_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED18_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED18_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED18_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED18_Enabled (0x1UL)

/* TRIGGERED19 @Bit 19 : Enable or disable interrupt for event TRIGGERED[19] */
  #define BELLBOARD_INTEN2_TRIGGERED19_Pos (19UL)
  #define BELLBOARD_INTEN2_TRIGGERED19_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED19_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED19_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED19_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED19_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED19_Enabled (0x1UL)

/* TRIGGERED20 @Bit 20 : Enable or disable interrupt for event TRIGGERED[20] */
  #define BELLBOARD_INTEN2_TRIGGERED20_Pos (20UL)
  #define BELLBOARD_INTEN2_TRIGGERED20_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED20_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED20_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED20_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED20_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED20_Enabled (0x1UL)

/* TRIGGERED21 @Bit 21 : Enable or disable interrupt for event TRIGGERED[21] */
  #define BELLBOARD_INTEN2_TRIGGERED21_Pos (21UL)
  #define BELLBOARD_INTEN2_TRIGGERED21_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED21_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED21_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED21_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED21_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED21_Enabled (0x1UL)

/* TRIGGERED22 @Bit 22 : Enable or disable interrupt for event TRIGGERED[22] */
  #define BELLBOARD_INTEN2_TRIGGERED22_Pos (22UL)
  #define BELLBOARD_INTEN2_TRIGGERED22_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED22_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED22_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED22_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED22_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED22_Enabled (0x1UL)

/* TRIGGERED23 @Bit 23 : Enable or disable interrupt for event TRIGGERED[23] */
  #define BELLBOARD_INTEN2_TRIGGERED23_Pos (23UL)
  #define BELLBOARD_INTEN2_TRIGGERED23_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED23_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED23_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED23_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED23_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED23_Enabled (0x1UL)

/* TRIGGERED24 @Bit 24 : Enable or disable interrupt for event TRIGGERED[24] */
  #define BELLBOARD_INTEN2_TRIGGERED24_Pos (24UL)
  #define BELLBOARD_INTEN2_TRIGGERED24_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED24_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED24_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED24_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED24_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED24_Enabled (0x1UL)

/* TRIGGERED25 @Bit 25 : Enable or disable interrupt for event TRIGGERED[25] */
  #define BELLBOARD_INTEN2_TRIGGERED25_Pos (25UL)
  #define BELLBOARD_INTEN2_TRIGGERED25_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED25_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED25_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED25_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED25_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED25_Enabled (0x1UL)

/* TRIGGERED26 @Bit 26 : Enable or disable interrupt for event TRIGGERED[26] */
  #define BELLBOARD_INTEN2_TRIGGERED26_Pos (26UL)
  #define BELLBOARD_INTEN2_TRIGGERED26_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED26_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED26_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED26_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED26_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED26_Enabled (0x1UL)

/* TRIGGERED27 @Bit 27 : Enable or disable interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTEN2_TRIGGERED27_Pos (27UL)
  #define BELLBOARD_INTEN2_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED27_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED27_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED27_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED27_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED27_Enabled (0x1UL)

/* TRIGGERED28 @Bit 28 : Enable or disable interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTEN2_TRIGGERED28_Pos (28UL)
  #define BELLBOARD_INTEN2_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED28_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED28_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED28_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED28_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED28_Enabled (0x1UL)

/* TRIGGERED29 @Bit 29 : Enable or disable interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTEN2_TRIGGERED29_Pos (29UL)
  #define BELLBOARD_INTEN2_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED29_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED29_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED29_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED29_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED29_Enabled (0x1UL)

/* TRIGGERED30 @Bit 30 : Enable or disable interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTEN2_TRIGGERED30_Pos (30UL)
  #define BELLBOARD_INTEN2_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED30_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED30_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED30_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED30_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED30_Enabled (0x1UL)

/* TRIGGERED31 @Bit 31 : Enable or disable interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTEN2_TRIGGERED31_Pos (31UL)
  #define BELLBOARD_INTEN2_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTEN2_TRIGGERED31_Pos)
  #define BELLBOARD_INTEN2_TRIGGERED31_Min (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED31_Max (0x1UL)
  #define BELLBOARD_INTEN2_TRIGGERED31_Disabled (0x0UL)
  #define BELLBOARD_INTEN2_TRIGGERED31_Enabled (0x1UL)


/* BELLBOARD_INTENSET2: Enable interrupt */
  #define BELLBOARD_INTENSET2_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Write '1' to enable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTENSET2_TRIGGERED0_Pos (0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED0_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED0_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED0_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED0_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED0_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED0_Enabled (0x1UL)

/* TRIGGERED1 @Bit 1 : Write '1' to enable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTENSET2_TRIGGERED1_Pos (1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED1_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED1_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED1_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED1_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED1_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED1_Enabled (0x1UL)

/* TRIGGERED2 @Bit 2 : Write '1' to enable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTENSET2_TRIGGERED2_Pos (2UL)
  #define BELLBOARD_INTENSET2_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED2_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED2_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED2_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED2_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED2_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED2_Enabled (0x1UL)

/* TRIGGERED3 @Bit 3 : Write '1' to enable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTENSET2_TRIGGERED3_Pos (3UL)
  #define BELLBOARD_INTENSET2_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED3_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED3_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED3_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED3_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED3_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED3_Enabled (0x1UL)

/* TRIGGERED4 @Bit 4 : Write '1' to enable interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTENSET2_TRIGGERED4_Pos (4UL)
  #define BELLBOARD_INTENSET2_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED4_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED4_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED4_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED4_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED4_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED4_Enabled (0x1UL)

/* TRIGGERED5 @Bit 5 : Write '1' to enable interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTENSET2_TRIGGERED5_Pos (5UL)
  #define BELLBOARD_INTENSET2_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED5_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED5_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED5_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED5_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED5_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED5_Enabled (0x1UL)

/* TRIGGERED6 @Bit 6 : Write '1' to enable interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTENSET2_TRIGGERED6_Pos (6UL)
  #define BELLBOARD_INTENSET2_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED6_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED6_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED6_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED6_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED6_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED6_Enabled (0x1UL)

/* TRIGGERED7 @Bit 7 : Write '1' to enable interrupt for event TRIGGERED[7] */
  #define BELLBOARD_INTENSET2_TRIGGERED7_Pos (7UL)
  #define BELLBOARD_INTENSET2_TRIGGERED7_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED7_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED7_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED7_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED7_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED7_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED7_Enabled (0x1UL)

/* TRIGGERED8 @Bit 8 : Write '1' to enable interrupt for event TRIGGERED[8] */
  #define BELLBOARD_INTENSET2_TRIGGERED8_Pos (8UL)
  #define BELLBOARD_INTENSET2_TRIGGERED8_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED8_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED8_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED8_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED8_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED8_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED8_Enabled (0x1UL)

/* TRIGGERED9 @Bit 9 : Write '1' to enable interrupt for event TRIGGERED[9] */
  #define BELLBOARD_INTENSET2_TRIGGERED9_Pos (9UL)
  #define BELLBOARD_INTENSET2_TRIGGERED9_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED9_Pos)
  #define BELLBOARD_INTENSET2_TRIGGERED9_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED9_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED9_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED9_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED9_Enabled (0x1UL)

/* TRIGGERED10 @Bit 10 : Write '1' to enable interrupt for event TRIGGERED[10] */
  #define BELLBOARD_INTENSET2_TRIGGERED10_Pos (10UL)
  #define BELLBOARD_INTENSET2_TRIGGERED10_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10
                                                                            field.*/
  #define BELLBOARD_INTENSET2_TRIGGERED10_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED10_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED10_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED10_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED10_Enabled (0x1UL)

/* TRIGGERED11 @Bit 11 : Write '1' to enable interrupt for event TRIGGERED[11] */
  #define BELLBOARD_INTENSET2_TRIGGERED11_Pos (11UL)
  #define BELLBOARD_INTENSET2_TRIGGERED11_Msk (0x1UL << BELLBOARD_INTENSET2_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11
                                                                            field.*/
  #define BELLBOARD_INTENSET2_TRIGGERED11_Min (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED11_Max (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED11_Set (0x1UL)
  #define BELLBOARD_INTENSET2_TRIGGERED11_Disabled (0x0UL)
  #define BELLBOARD_INTENSET2_TRIGGERED11_Enabled (0x1UL)

