pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGGERED27 @Bit 27 : Write '1' to enable interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTENSET3_TRIGGERED27_Pos (27UL)
  #define BELLBOARD_INTENSET3_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED27_Min (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED27_Max (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED27_Set (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED27_Disabled (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED27_Enabled (0x1UL)

/* TRIGGERED28 @Bit 28 : Write '1' to enable interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTENSET3_TRIGGERED28_Pos (28UL)
  #define BELLBOARD_INTENSET3_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED28_Pos) /*!< Bit mask of TRIGGERED28
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED28_Min (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED28_Max (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED28_Set (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED28_Disabled (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED28_Enabled (0x1UL)

/* TRIGGERED29 @Bit 29 : Write '1' to enable interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTENSET3_TRIGGERED29_Pos (29UL)
  #define BELLBOARD_INTENSET3_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED29_Pos) /*!< Bit mask of TRIGGERED29
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED29_Min (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED29_Max (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED29_Set (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED29_Disabled (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED29_Enabled (0x1UL)

/* TRIGGERED30 @Bit 30 : Write '1' to enable interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTENSET3_TRIGGERED30_Pos (30UL)
  #define BELLBOARD_INTENSET3_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED30_Pos) /*!< Bit mask of TRIGGERED30
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED30_Min (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED30_Max (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED30_Set (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED30_Disabled (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED30_Enabled (0x1UL)

/* TRIGGERED31 @Bit 31 : Write '1' to enable interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTENSET3_TRIGGERED31_Pos (31UL)
  #define BELLBOARD_INTENSET3_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTENSET3_TRIGGERED31_Pos) /*!< Bit mask of TRIGGERED31
                                                                            field.*/
  #define BELLBOARD_INTENSET3_TRIGGERED31_Min (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED31_Max (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED31_Set (0x1UL)
  #define BELLBOARD_INTENSET3_TRIGGERED31_Disabled (0x0UL)
  #define BELLBOARD_INTENSET3_TRIGGERED31_Enabled (0x1UL)


/* BELLBOARD_INTENCLR3: Disable interrupt */
  #define BELLBOARD_INTENCLR3_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
  #define BELLBOARD_INTENCLR3_TRIGGERED0_Pos (0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED0_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED0_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED0_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED0_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED0_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED0_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED0_Enabled (0x1UL)

/* TRIGGERED1 @Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
  #define BELLBOARD_INTENCLR3_TRIGGERED1_Pos (1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED1_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED1_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED1_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED1_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED1_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED1_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED1_Enabled (0x1UL)

/* TRIGGERED2 @Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
  #define BELLBOARD_INTENCLR3_TRIGGERED2_Pos (2UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED2_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED2_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED2_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED2_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED2_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED2_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED2_Enabled (0x1UL)

/* TRIGGERED3 @Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
  #define BELLBOARD_INTENCLR3_TRIGGERED3_Pos (3UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED3_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED3_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED3_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED3_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED3_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED3_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED3_Enabled (0x1UL)

/* TRIGGERED4 @Bit 4 : Write '1' to disable interrupt for event TRIGGERED[4] */
  #define BELLBOARD_INTENCLR3_TRIGGERED4_Pos (4UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED4_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED4_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED4_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED4_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED4_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED4_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED4_Enabled (0x1UL)

/* TRIGGERED5 @Bit 5 : Write '1' to disable interrupt for event TRIGGERED[5] */
  #define BELLBOARD_INTENCLR3_TRIGGERED5_Pos (5UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED5_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED5_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED5_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED5_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED5_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED5_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED5_Enabled (0x1UL)

/* TRIGGERED6 @Bit 6 : Write '1' to disable interrupt for event TRIGGERED[6] */
  #define BELLBOARD_INTENCLR3_TRIGGERED6_Pos (6UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED6_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED6_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED6_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED6_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED6_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED6_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED6_Enabled (0x1UL)

/* TRIGGERED7 @Bit 7 : Write '1' to disable interrupt for event TRIGGERED[7] */
  #define BELLBOARD_INTENCLR3_TRIGGERED7_Pos (7UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED7_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED7_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED7_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED7_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED7_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED7_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED7_Enabled (0x1UL)

