pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGGERED8 @Bit 8 : Write '1' to disable interrupt for event TRIGGERED[8] */
  #define BELLBOARD_INTENCLR3_TRIGGERED8_Pos (8UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED8_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED8_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED8_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED8_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED8_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED8_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED8_Enabled (0x1UL)

/* TRIGGERED9 @Bit 9 : Write '1' to disable interrupt for event TRIGGERED[9] */
  #define BELLBOARD_INTENCLR3_TRIGGERED9_Pos (9UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED9_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED9_Pos)
  #define BELLBOARD_INTENCLR3_TRIGGERED9_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED9_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED9_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED9_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED9_Enabled (0x1UL)

/* TRIGGERED10 @Bit 10 : Write '1' to disable interrupt for event TRIGGERED[10] */
  #define BELLBOARD_INTENCLR3_TRIGGERED10_Pos (10UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED10_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED10_Pos) /*!< Bit mask of TRIGGERED10
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED10_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED10_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED10_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED10_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED10_Enabled (0x1UL)

/* TRIGGERED11 @Bit 11 : Write '1' to disable interrupt for event TRIGGERED[11] */
  #define BELLBOARD_INTENCLR3_TRIGGERED11_Pos (11UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED11_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED11_Pos) /*!< Bit mask of TRIGGERED11
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED11_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED11_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED11_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED11_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED11_Enabled (0x1UL)

/* TRIGGERED12 @Bit 12 : Write '1' to disable interrupt for event TRIGGERED[12] */
  #define BELLBOARD_INTENCLR3_TRIGGERED12_Pos (12UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED12_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED12_Pos) /*!< Bit mask of TRIGGERED12
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED12_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED12_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED12_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED12_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED12_Enabled (0x1UL)

/* TRIGGERED13 @Bit 13 : Write '1' to disable interrupt for event TRIGGERED[13] */
  #define BELLBOARD_INTENCLR3_TRIGGERED13_Pos (13UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED13_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED13_Pos) /*!< Bit mask of TRIGGERED13
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED13_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED13_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED13_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED13_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED13_Enabled (0x1UL)

/* TRIGGERED14 @Bit 14 : Write '1' to disable interrupt for event TRIGGERED[14] */
  #define BELLBOARD_INTENCLR3_TRIGGERED14_Pos (14UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED14_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED14_Pos) /*!< Bit mask of TRIGGERED14
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED14_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED14_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED14_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED14_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED14_Enabled (0x1UL)

/* TRIGGERED15 @Bit 15 : Write '1' to disable interrupt for event TRIGGERED[15] */
  #define BELLBOARD_INTENCLR3_TRIGGERED15_Pos (15UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED15_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED15_Pos) /*!< Bit mask of TRIGGERED15
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED15_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED15_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED15_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED15_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED15_Enabled (0x1UL)

/* TRIGGERED16 @Bit 16 : Write '1' to disable interrupt for event TRIGGERED[16] */
  #define BELLBOARD_INTENCLR3_TRIGGERED16_Pos (16UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED16_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED16_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED16_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED16_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED16_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED16_Enabled (0x1UL)

/* TRIGGERED17 @Bit 17 : Write '1' to disable interrupt for event TRIGGERED[17] */
  #define BELLBOARD_INTENCLR3_TRIGGERED17_Pos (17UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED17_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED17_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED17_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED17_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED17_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED17_Enabled (0x1UL)

/* TRIGGERED18 @Bit 18 : Write '1' to disable interrupt for event TRIGGERED[18] */
  #define BELLBOARD_INTENCLR3_TRIGGERED18_Pos (18UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED18_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED18_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED18_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED18_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED18_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED18_Enabled (0x1UL)

/* TRIGGERED19 @Bit 19 : Write '1' to disable interrupt for event TRIGGERED[19] */
  #define BELLBOARD_INTENCLR3_TRIGGERED19_Pos (19UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED19_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED19_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED19_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED19_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED19_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED19_Enabled (0x1UL)

/* TRIGGERED20 @Bit 20 : Write '1' to disable interrupt for event TRIGGERED[20] */
  #define BELLBOARD_INTENCLR3_TRIGGERED20_Pos (20UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED20_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED20_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED20_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED20_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED20_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED20_Enabled (0x1UL)

/* TRIGGERED21 @Bit 21 : Write '1' to disable interrupt for event TRIGGERED[21] */
  #define BELLBOARD_INTENCLR3_TRIGGERED21_Pos (21UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED21_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED21_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED21_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED21_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED21_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED21_Enabled (0x1UL)

/* TRIGGERED22 @Bit 22 : Write '1' to disable interrupt for event TRIGGERED[22] */
  #define BELLBOARD_INTENCLR3_TRIGGERED22_Pos (22UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED22_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED22_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED22_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED22_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED22_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED22_Enabled (0x1UL)

/* TRIGGERED23 @Bit 23 : Write '1' to disable interrupt for event TRIGGERED[23] */
  #define BELLBOARD_INTENCLR3_TRIGGERED23_Pos (23UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED23_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED23_Pos) /*!< Bit mask of TRIGGERED23
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED23_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED23_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED23_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED23_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED23_Enabled (0x1UL)

/* TRIGGERED24 @Bit 24 : Write '1' to disable interrupt for event TRIGGERED[24] */
  #define BELLBOARD_INTENCLR3_TRIGGERED24_Pos (24UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED24_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED24_Pos) /*!< Bit mask of TRIGGERED24
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED24_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED24_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED24_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED24_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED24_Enabled (0x1UL)

/* TRIGGERED25 @Bit 25 : Write '1' to disable interrupt for event TRIGGERED[25] */
  #define BELLBOARD_INTENCLR3_TRIGGERED25_Pos (25UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED25_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED25_Pos) /*!< Bit mask of TRIGGERED25
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED25_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED25_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED25_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED25_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED25_Enabled (0x1UL)

/* TRIGGERED26 @Bit 26 : Write '1' to disable interrupt for event TRIGGERED[26] */
  #define BELLBOARD_INTENCLR3_TRIGGERED26_Pos (26UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED26_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED26_Pos) /*!< Bit mask of TRIGGERED26
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED26_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED26_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED26_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED26_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED26_Enabled (0x1UL)

/* TRIGGERED27 @Bit 27 : Write '1' to disable interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTENCLR3_TRIGGERED27_Pos (27UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTENCLR3_TRIGGERED27_Pos) /*!< Bit mask of TRIGGERED27
                                                                            field.*/
  #define BELLBOARD_INTENCLR3_TRIGGERED27_Min (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED27_Max (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED27_Clear (0x1UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED27_Disabled (0x0UL)
  #define BELLBOARD_INTENCLR3_TRIGGERED27_Enabled (0x1UL)

