pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGGERED16 @Bit 16 : Read pending status of interrupt for event TRIGGERED[16] */
  #define BELLBOARD_INTPEND3_TRIGGERED16_Pos (16UL)
  #define BELLBOARD_INTPEND3_TRIGGERED16_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED16_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED16_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED16_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED16_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED16_Pending (0x1UL)

/* TRIGGERED17 @Bit 17 : Read pending status of interrupt for event TRIGGERED[17] */
  #define BELLBOARD_INTPEND3_TRIGGERED17_Pos (17UL)
  #define BELLBOARD_INTPEND3_TRIGGERED17_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED17_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED17_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED17_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED17_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED17_Pending (0x1UL)

/* TRIGGERED18 @Bit 18 : Read pending status of interrupt for event TRIGGERED[18] */
  #define BELLBOARD_INTPEND3_TRIGGERED18_Pos (18UL)
  #define BELLBOARD_INTPEND3_TRIGGERED18_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED18_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED18_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED18_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED18_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED18_Pending (0x1UL)

/* TRIGGERED19 @Bit 19 : Read pending status of interrupt for event TRIGGERED[19] */
  #define BELLBOARD_INTPEND3_TRIGGERED19_Pos (19UL)
  #define BELLBOARD_INTPEND3_TRIGGERED19_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED19_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED19_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED19_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED19_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED19_Pending (0x1UL)

/* TRIGGERED20 @Bit 20 : Read pending status of interrupt for event TRIGGERED[20] */
  #define BELLBOARD_INTPEND3_TRIGGERED20_Pos (20UL)
  #define BELLBOARD_INTPEND3_TRIGGERED20_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED20_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED20_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED20_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED20_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED20_Pending (0x1UL)

/* TRIGGERED21 @Bit 21 : Read pending status of interrupt for event TRIGGERED[21] */
  #define BELLBOARD_INTPEND3_TRIGGERED21_Pos (21UL)
  #define BELLBOARD_INTPEND3_TRIGGERED21_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED21_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED21_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED21_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED21_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED21_Pending (0x1UL)

/* TRIGGERED22 @Bit 22 : Read pending status of interrupt for event TRIGGERED[22] */
  #define BELLBOARD_INTPEND3_TRIGGERED22_Pos (22UL)
  #define BELLBOARD_INTPEND3_TRIGGERED22_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED22_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED22_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED22_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED22_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED22_Pending (0x1UL)

/* TRIGGERED23 @Bit 23 : Read pending status of interrupt for event TRIGGERED[23] */
  #define BELLBOARD_INTPEND3_TRIGGERED23_Pos (23UL)
  #define BELLBOARD_INTPEND3_TRIGGERED23_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED23_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED23_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED23_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED23_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED23_Pending (0x1UL)

/* TRIGGERED24 @Bit 24 : Read pending status of interrupt for event TRIGGERED[24] */
  #define BELLBOARD_INTPEND3_TRIGGERED24_Pos (24UL)
  #define BELLBOARD_INTPEND3_TRIGGERED24_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED24_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED24_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED24_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED24_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED24_Pending (0x1UL)

/* TRIGGERED25 @Bit 25 : Read pending status of interrupt for event TRIGGERED[25] */
  #define BELLBOARD_INTPEND3_TRIGGERED25_Pos (25UL)
  #define BELLBOARD_INTPEND3_TRIGGERED25_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED25_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED25_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED25_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED25_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED25_Pending (0x1UL)

/* TRIGGERED26 @Bit 26 : Read pending status of interrupt for event TRIGGERED[26] */
  #define BELLBOARD_INTPEND3_TRIGGERED26_Pos (26UL)
  #define BELLBOARD_INTPEND3_TRIGGERED26_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED26_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED26_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED26_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED26_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED26_Pending (0x1UL)

/* TRIGGERED27 @Bit 27 : Read pending status of interrupt for event TRIGGERED[27] */
  #define BELLBOARD_INTPEND3_TRIGGERED27_Pos (27UL)
  #define BELLBOARD_INTPEND3_TRIGGERED27_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED27_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED27_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED27_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED27_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED27_Pending (0x1UL)

/* TRIGGERED28 @Bit 28 : Read pending status of interrupt for event TRIGGERED[28] */
  #define BELLBOARD_INTPEND3_TRIGGERED28_Pos (28UL)
  #define BELLBOARD_INTPEND3_TRIGGERED28_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED28_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED28_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED28_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED28_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED28_Pending (0x1UL)

/* TRIGGERED29 @Bit 29 : Read pending status of interrupt for event TRIGGERED[29] */
  #define BELLBOARD_INTPEND3_TRIGGERED29_Pos (29UL)
  #define BELLBOARD_INTPEND3_TRIGGERED29_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED29_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED29_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED29_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED29_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED29_Pending (0x1UL)

/* TRIGGERED30 @Bit 30 : Read pending status of interrupt for event TRIGGERED[30] */
  #define BELLBOARD_INTPEND3_TRIGGERED30_Pos (30UL)
  #define BELLBOARD_INTPEND3_TRIGGERED30_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED30_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED30_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED30_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED30_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED30_Pending (0x1UL)

/* TRIGGERED31 @Bit 31 : Read pending status of interrupt for event TRIGGERED[31] */
  #define BELLBOARD_INTPEND3_TRIGGERED31_Pos (31UL)
  #define BELLBOARD_INTPEND3_TRIGGERED31_Msk (0x1UL << BELLBOARD_INTPEND3_TRIGGERED31_Pos)
  #define BELLBOARD_INTPEND3_TRIGGERED31_Min (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED31_Max (0x1UL)
  #define BELLBOARD_INTPEND3_TRIGGERED31_NotPending (0x0UL)
  #define BELLBOARD_INTPEND3_TRIGGERED31_Pending (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                      BELLBOARDPUBLIC                                      ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ================================================= Struct BELLBOARDPUBLIC ================================================== */
/**
  * @brief BELLBOARD public registers
  */
  typedef struct {
    __OM uint32_t TASKS_TRIGGER[32];
  } NRF_BELLBOARDPUBLIC_Type;

/* BELLBOARDPUBLIC_TASKS_TRIGGER: Task TRIGGER[n] */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_MaxCount (32UL)
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_MaxIndex (31UL)
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_MinIndex (0UL)
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_ResetValue (0x00000000UL)

/* TASKS_TRIGGER @Bit 0 : Task TRIGGER[n] */
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL)
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit
                                                                            mask of TASKS_TRIGGER field.*/
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL)
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL)
  #define BELLBOARDPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           BICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

