pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* =================================================== Struct BICR_IOPORT ==================================================== */
/**
  * @brief IOPORT [BICR_IOPORT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  POWER0;                            /*!< (@ 0x00000000) Power configuration for P0 to P7 IO ports. Note: P0 is
                                                                         not included in the fields of this register because it
                                                                         is always internally supplied and therefore considered
                                                                         'Shorted'.*/
  __IOM uint32_t  POWER1;
  __IOM uint32_t  DRIVECTRL0;
  __IOM uint32_t  DRIVECTRL1;
} NRF_BICR_IOPORT_Type;

/* BICR_IOPORT_POWER0: Power configuration for P0 to P7 IO ports. Note: P0 is not included in the fields of this register
                        because it is always internally supplied and therefore considered 'Shorted'. */

  #define BICR_IOPORT_POWER0_ResetValue (0xFFFFFFFFUL)

/* P1 @Bits 4..7 : P1 power configuration. */
  #define BICR_IOPORT_POWER0_P1_Pos (4UL)
  #define BICR_IOPORT_POWER0_P1_Msk (0xFUL << BICR_IOPORT_POWER0_P1_Pos)
  #define BICR_IOPORT_POWER0_P1_Min (0x0UL)
  #define BICR_IOPORT_POWER0_P1_Max (0xFUL)
  #define BICR_IOPORT_POWER0_P1_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER0_P1_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER0_P1_Shorted (0x1UL)
  #define BICR_IOPORT_POWER0_P1_External1V8 (0x2UL)

/* P2 @Bits 8..11 : P2 power configuration. */
  #define BICR_IOPORT_POWER0_P2_Pos (8UL)
  #define BICR_IOPORT_POWER0_P2_Msk (0xFUL << BICR_IOPORT_POWER0_P2_Pos)
  #define BICR_IOPORT_POWER0_P2_Min (0x0UL)
  #define BICR_IOPORT_POWER0_P2_Max (0xFUL)
  #define BICR_IOPORT_POWER0_P2_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER0_P2_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER0_P2_Shorted (0x1UL)
  #define BICR_IOPORT_POWER0_P2_External1V8 (0x2UL)

/* P6 @Bits 24..27 : P6 power configuration. */
  #define BICR_IOPORT_POWER0_P6_Pos (24UL)
  #define BICR_IOPORT_POWER0_P6_Msk (0xFUL << BICR_IOPORT_POWER0_P6_Pos)
  #define BICR_IOPORT_POWER0_P6_Min (0x0UL)
  #define BICR_IOPORT_POWER0_P6_Max (0xFUL)
  #define BICR_IOPORT_POWER0_P6_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER0_P6_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER0_P6_Shorted (0x1UL)
  #define BICR_IOPORT_POWER0_P6_External1V8 (0x2UL)


/* BICR_IOPORT_POWER1: Power configuration for P8 to P15 IO ports. */
  #define BICR_IOPORT_POWER1_ResetValue (0xFFFFFFFFUL)

/* P8 @Bits 0..3 : P8 power configuration. */
  #define BICR_IOPORT_POWER1_P8_Pos (0UL)
  #define BICR_IOPORT_POWER1_P8_Msk (0xFUL << BICR_IOPORT_POWER1_P8_Pos)
  #define BICR_IOPORT_POWER1_P8_Min (0x0UL)
  #define BICR_IOPORT_POWER1_P8_Max (0xFUL)
  #define BICR_IOPORT_POWER1_P8_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER1_P8_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER1_P8_Shorted (0x1UL)
  #define BICR_IOPORT_POWER1_P8_External1V8 (0x2UL)

/* P9 @Bits 4..7 : P9 power configuration. */
  #define BICR_IOPORT_POWER1_P9_Pos (4UL)
  #define BICR_IOPORT_POWER1_P9_Msk (0xFUL << BICR_IOPORT_POWER1_P9_Pos)
  #define BICR_IOPORT_POWER1_P9_Min (0x0UL)
  #define BICR_IOPORT_POWER1_P9_Max (0xFUL)
  #define BICR_IOPORT_POWER1_P9_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER1_P9_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER1_P9_Shorted (0x1UL)
  #define BICR_IOPORT_POWER1_P9_External1V8 (0x2UL)
  #define BICR_IOPORT_POWER1_P9_External3V (0x3UL)
  #define BICR_IOPORT_POWER1_P9_ExternalFull (0x4UL) /*!< Port supply is provided externally with a full range of values, from 3
                                                          V to 1.8 V.*/

/* P10 @Bits 8..11 : P10 power configuration. */
  #define BICR_IOPORT_POWER1_P10_Pos (8UL)
  #define BICR_IOPORT_POWER1_P10_Msk (0xFUL << BICR_IOPORT_POWER1_P10_Pos)
  #define BICR_IOPORT_POWER1_P10_Min (0x0UL)
  #define BICR_IOPORT_POWER1_P10_Max (0xFUL)
  #define BICR_IOPORT_POWER1_P10_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER1_P10_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER1_P10_Shorted (0x1UL)
  #define BICR_IOPORT_POWER1_P10_External1V8 (0x2UL)

/* P11 @Bits 12..15 : P11 power configuration. */
  #define BICR_IOPORT_POWER1_P11_Pos (12UL)
  #define BICR_IOPORT_POWER1_P11_Msk (0xFUL << BICR_IOPORT_POWER1_P11_Pos)
  #define BICR_IOPORT_POWER1_P11_Min (0x0UL)
  #define BICR_IOPORT_POWER1_P11_Max (0xFUL)
  #define BICR_IOPORT_POWER1_P11_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER1_P11_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER1_P11_Shorted (0x1UL)
  #define BICR_IOPORT_POWER1_P11_External1V8 (0x2UL)

/* P12 @Bits 16..19 : P12 power configuration. */
  #define BICR_IOPORT_POWER1_P12_Pos (16UL)
  #define BICR_IOPORT_POWER1_P12_Msk (0xFUL << BICR_IOPORT_POWER1_P12_Pos)
  #define BICR_IOPORT_POWER1_P12_Min (0x0UL)
  #define BICR_IOPORT_POWER1_P12_Max (0xFUL)
  #define BICR_IOPORT_POWER1_P12_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER1_P12_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER1_P12_Shorted (0x1UL)
  #define BICR_IOPORT_POWER1_P12_External1V8 (0x2UL)

/* P13 @Bits 20..23 : P13 power configuration. */
  #define BICR_IOPORT_POWER1_P13_Pos (20UL)
  #define BICR_IOPORT_POWER1_P13_Msk (0xFUL << BICR_IOPORT_POWER1_P13_Pos)
  #define BICR_IOPORT_POWER1_P13_Min (0x0UL)
  #define BICR_IOPORT_POWER1_P13_Max (0xFUL)
  #define BICR_IOPORT_POWER1_P13_Unconfigured (0xFUL)
  #define BICR_IOPORT_POWER1_P13_Disconnected (0x0UL)
  #define BICR_IOPORT_POWER1_P13_Shorted (0x1UL)
  #define BICR_IOPORT_POWER1_P13_External1V8 (0x2UL)


/* BICR_IOPORT_DRIVECTRL0: Drive control configuration for P0 to P7 IO ports. */
  #define BICR_IOPORT_DRIVECTRL0_ResetValue (0xFFFFFFFFUL)

/* P6 @Bits 24..27 : P6 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL0_P6_Pos (24UL)
  #define BICR_IOPORT_DRIVECTRL0_P6_Msk (0xFUL << BICR_IOPORT_DRIVECTRL0_P6_Pos)
  #define BICR_IOPORT_DRIVECTRL0_P6_Min (0x0UL)
  #define BICR_IOPORT_DRIVECTRL0_P6_Max (0xFUL)
  #define BICR_IOPORT_DRIVECTRL0_P6_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms33 (0x0UL)
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms40 (0x1UL)
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms50 (0x2UL)
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms66 (0x3UL)
  #define BICR_IOPORT_DRIVECTRL0_P6_Ohms100 (0x4UL)


/* BICR_IOPORT_DRIVECTRL1: Drive control configuration for P8 to P15 IO ports. */
  #define BICR_IOPORT_DRIVECTRL1_ResetValue (0xFFFFFFFFUL)

