pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* P8 @Bits 0..3 : P8 drive control configuration. */
  #define BICR_IOPORT_DRIVECTRL1_P8_Pos (0UL)
  #define BICR_IOPORT_DRIVECTRL1_P8_Msk (0xFUL << BICR_IOPORT_DRIVECTRL1_P8_Pos)
  #define BICR_IOPORT_DRIVECTRL1_P8_Min (0x0UL)
  #define BICR_IOPORT_DRIVECTRL1_P8_Max (0xFUL)
  #define BICR_IOPORT_DRIVECTRL1_P8_Unconfigured (0xFUL) /*!< Port supply is unconfigured. PORTCNF.DRIVECTRL will not be
                                                              adjusted.*/
  #define BICR_IOPORT_DRIVECTRL1_P8_Ohms33 (0x0UL)
  #define BICR_IOPORT_DRIVECTRL1_P8_Ohms40 (0x1UL)
  #define BICR_IOPORT_DRIVECTRL1_P8_Ohms50 (0x2UL)
  #define BICR_IOPORT_DRIVECTRL1_P8_Ohms66 (0x3UL)
  #define BICR_IOPORT_DRIVECTRL1_P8_Ohms100 (0x4UL)



/* ==================================================== Struct BICR_LFOSC ==================================================== */
/**
  * @brief LFOSC [BICR_LFOSC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LFXOCONFIG;                        /*!< (@ 0x00000000) LFXO configuration. Note. This configuration might be
                                                                         overridden by FICR configuration.*/
  __IOM uint32_t  LFXOCAL;                           /*!< (@ 0x00000004) LFXO calibration needed. Must be written to 0xFFFFFFFF
                                                                         after any modification of the LFXO board circuit, load
                                                                         capacitance, or crystal swap.*/
  __IOM uint32_t  LFRCAUTOCALCONFIG;
} NRF_BICR_LFOSC_Type;

/* BICR_LFOSC_LFXOCONFIG: LFXO configuration. Note. This configuration might be overridden by FICR configuration. */
  #define BICR_LFOSC_LFXOCONFIG_ResetValue (0xFFFFFFFFUL)

/* ACCURACY @Bits 0..3 : LFXO crystal or external signal accuracy. */
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Pos (0UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Msk (0xFUL << BICR_LFOSC_LFXOCONFIG_ACCURACY_Pos)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Min (0x0UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Max (0xFUL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_Unconfigured (0xFUL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_500ppm (0x0UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_250ppm (0x1UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_150ppm (0x2UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_100ppm (0x3UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_75ppm (0x4UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_50ppm (0x5UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_30ppm (0x6UL)
  #define BICR_LFOSC_LFXOCONFIG_ACCURACY_20ppm (0x7UL)

/* MODE @Bits 4..6 : LFXO mode. LFXO will not start unless MODE is configured. Setting this field to anyting but Unconfigured
                     will be used as the indication that the selected source is available as input to the LFXO. */

  #define BICR_LFOSC_LFXOCONFIG_MODE_Pos (4UL)
  #define BICR_LFOSC_LFXOCONFIG_MODE_Msk (0x7UL << BICR_LFOSC_LFXOCONFIG_MODE_Pos)
  #define BICR_LFOSC_LFXOCONFIG_MODE_Min (0x0UL)
  #define BICR_LFOSC_LFXOCONFIG_MODE_Max (0x7UL)
  #define BICR_LFOSC_LFXOCONFIG_MODE_Unconfigured (0x7UL)
  #define BICR_LFOSC_LFXOCONFIG_MODE_Crystal (0x0UL)
  #define BICR_LFOSC_LFXOCONFIG_MODE_ExtSine (0x2UL)
  #define BICR_LFOSC_LFXOCONFIG_MODE_ExtSquare (0x3UL)
  #define BICR_LFOSC_LFXOCONFIG_MODE_Disabled (0x6UL)

/* LOADCAP @Bits 8..15 : Built-in load capacitors selection in 1 pF steps. Max. value 25 pF. */
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Pos (8UL)
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Msk (0xFFUL << BICR_LFOSC_LFXOCONFIG_LOADCAP_Pos)
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Min (0x0UL)
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Max (0xFFUL)
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_Unconfigured (0xFFUL) /*!< The built-in load capacitors is unconfigured. LFXO will not
                                                                   start unless LOADCAP is configured.*/
  #define BICR_LFOSC_LFXOCONFIG_LOADCAP_External (0x00UL) /*!< Do not use the built-in load capacitors, only external capacitors
                                                               will be used.*/

/* TIME @Bits 16..27 : LFXO startup time in ms. */
  #define BICR_LFOSC_LFXOCONFIG_TIME_Pos (16UL)
  #define BICR_LFOSC_LFXOCONFIG_TIME_Msk (0xFFFUL << BICR_LFOSC_LFXOCONFIG_TIME_Pos)
  #define BICR_LFOSC_LFXOCONFIG_TIME_Min (0xFFFUL)
  #define BICR_LFOSC_LFXOCONFIG_TIME_Max (0xFFFUL)
  #define BICR_LFOSC_LFXOCONFIG_TIME_Unconfigured (0xFFFUL)


/* BICR_LFOSC_LFXOCAL: LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board circuit,
                        load capacitance, or crystal swap. */

  #define BICR_LFOSC_LFXOCAL_ResetValue (0xFFFFFFFFUL)

/* LFXOCAL @Bits 0..31 : LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board
                         circuit, load capacitance, or crystal swap. */

  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Pos (0UL)
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Msk (0xFFFFFFFFUL << BICR_LFOSC_LFXOCAL_LFXOCAL_Pos)
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Min (0xFFFFFFFFUL)
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Max (0xFFFFFFFFUL)
  #define BICR_LFOSC_LFXOCAL_LFXOCAL_Calibrate (0xFFFFFFFFUL)


/* BICR_LFOSC_LFRCAUTOCALCONFIG: LFRC autocalibration configuration. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ResetValue (0xFFFFFFFFUL)

/* TEMPINTERVAL @Bits 0..6 : Temperature measurement interval in 0.25 s steps. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Pos (0UL)
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Msk (0x7FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Pos) /*!< Bit mask
                                                                            of TEMPINTERVAL field.*/

/* TEMPDELTA @Bits 8..13 : Temperature delta that should trigger a calibration in 0.25 degrees steps. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Pos (8UL)
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Msk (0x3FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Pos) /*!< Bit mask of
                                                                            TEMPDELTA field.*/

/* INTERVALMAXNO @Bits 16..20 : Maximum number of TEMPINTERVAL periods in between calibrations, independent of temperature
                                changes. */

  #define BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Pos (16UL)
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Msk (0x1FUL << BICR_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Pos) /*!< Bit
                                                                            mask of INTERVALMAXNO field.*/

