pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE @Bit 31 : LFRC.AUTOCALCONFIG register enable. */
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Pos (31UL)
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Msk (0x1UL << BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Min (0x0UL)
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Max (0x1UL)
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Enabled (0x0UL) /*!< LFRC.AUTOCALCONFIG register has been configured and can be
                                                                   used.*/
  #define BICR_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Disabled (0x1UL) /*!< LFRC.AUTOCALCONFIG register has not been configured and
                                                                    cannot be used.*/



/* =================================================== Struct BICR_HFXO64M =================================================== */
/**
  * @brief HFXO64M [BICR_HFXO64M] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) HFXO64M configuration. Note. This configuration might
                                                                         be overridden by FICR configuration.*/
  __IOM uint32_t  STARTUPTIME;                       /*!< (@ 0x00000004) HFXO64M startup time in us. Note. This configuration
                                                                         might be overridden by FICR configuration.*/
} NRF_BICR_HFXO64M_Type;

/* BICR_HFXO64M_CONFIG: HFXO64M configuration. Note. This configuration might be overridden by FICR configuration. */
  #define BICR_HFXO64M_CONFIG_ResetValue (0xFFFFFFFFUL)

/* MODE @Bits 0..2 : HFXO64M mode. */
  #define BICR_HFXO64M_CONFIG_MODE_Pos (0UL)
  #define BICR_HFXO64M_CONFIG_MODE_Msk (0x7UL << BICR_HFXO64M_CONFIG_MODE_Pos)
  #define BICR_HFXO64M_CONFIG_MODE_Min (0x0UL)
  #define BICR_HFXO64M_CONFIG_MODE_Max (0x7UL)
  #define BICR_HFXO64M_CONFIG_MODE_Unconfigured (0x7UL)
  #define BICR_HFXO64M_CONFIG_MODE_Normal (0x0UL)
  #define BICR_HFXO64M_CONFIG_MODE_TCXO (0x1UL)
  #define BICR_HFXO64M_CONFIG_MODE_Crystal2 (0x2UL)
  #define BICR_HFXO64M_CONFIG_MODE_Crystal3 (0x3UL)
  #define BICR_HFXO64M_CONFIG_MODE_Crystal4 (0x4UL)
  #define BICR_HFXO64M_CONFIG_MODE_Crystal5 (0x5UL)
  #define BICR_HFXO64M_CONFIG_MODE_Crystal6 (0x6UL)


/* BICR_HFXO64M_STARTUPTIME: HFXO64M startup time in us. Note. This configuration might be overridden by FICR configuration. */
  #define BICR_HFXO64M_STARTUPTIME_ResetValue (0xFFFFFFFFUL)

/* TIME @Bits 0..31 : HFXO64M startup time in us. */
  #define BICR_HFXO64M_STARTUPTIME_TIME_Pos (0UL)
  #define BICR_HFXO64M_STARTUPTIME_TIME_Msk (0xFFFFFFFFUL << BICR_HFXO64M_STARTUPTIME_TIME_Pos)
  #define BICR_HFXO64M_STARTUPTIME_TIME_Min (0xFFFFFFFFUL)
  #define BICR_HFXO64M_STARTUPTIME_TIME_Max (0xFFFFFFFFUL)
  #define BICR_HFXO64M_STARTUPTIME_TIME_Unconfigured (0xFFFFFFFFUL)



/* ==================================================== Struct BICR_TAMPC ==================================================== */
/**
  * @brief TAMPC [BICR_TAMPC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TAMPERSWITCH;
  __IOM uint32_t  ACTIVESHIELD;
} NRF_BICR_TAMPC_Type;

/* BICR_TAMPC_TAMPERSWITCH: Configuration for external tamper switch detector. */
  #define BICR_TAMPC_TAMPERSWITCH_ResetValue (0xFFFFFFFFUL)

/* TAMPERSWITCH @Bits 0..3 : Tamper switch enable. */
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Pos (0UL)
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Msk (0xFUL << BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Pos) /*!< Bit mask of
                                                                            TAMPERSWITCH field.*/
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Min (0x0UL)
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Max (0xFUL)
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Disabled (0xFUL)
  #define BICR_TAMPC_TAMPERSWITCH_TAMPERSWITCH_Enabled (0x0UL)


/* BICR_TAMPC_ACTIVESHIELD: Configuration for active shield channels. */
  #define BICR_TAMPC_ACTIVESHIELD_ResetValue (0xFFFFFFFFUL)

/* CHEN0 @Bits 0..3 : Active shield enable for channel 0. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Pos (0UL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN0_Pos)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Min (0x0UL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Max (0xFUL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Disabled (0xFUL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN0_Enabled (0x0UL)

/* CHEN1 @Bits 4..7 : Active shield enable for channel 1. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Pos (4UL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN1_Pos)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Min (0x0UL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Max (0xFUL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Disabled (0xFUL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN1_Enabled (0x0UL)

/* CHEN2 @Bits 8..11 : Active shield enable for channel 2. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Pos (8UL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN2_Pos)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Min (0x0UL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Max (0xFUL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Disabled (0xFUL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN2_Enabled (0x0UL)

/* CHEN3 @Bits 12..15 : Active shield enable for channel 3. */
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Pos (12UL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Msk (0xFUL << BICR_TAMPC_ACTIVESHIELD_CHEN3_Pos)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Min (0x0UL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Max (0xFUL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Disabled (0xFUL)
  #define BICR_TAMPC_ACTIVESHIELD_CHEN3_Enabled (0x0UL)



/* ==================================================== Struct BICR_PMIC ===================================================== */
/**
  * @brief PMIC [BICR_PMIC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LDOIO1V8;
  __IOM uint32_t  LDOIO3V3;
} NRF_BICR_PMIC_Type;

