pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* BICR_PMIC_LDOIO1V8: Configuration for PMIC LDO_IO1V8. */
  #define BICR_PMIC_LDOIO1V8_ResetValue (0xFFFFFFFFUL)

/* LEVEL @Bits 0..4 : PMIC LDO_IO1V8 output voltage in 100mV steps. All values above 0x0F are invalid. */
  #define BICR_PMIC_LDOIO1V8_LEVEL_Pos (0UL)
  #define BICR_PMIC_LDOIO1V8_LEVEL_Msk (0x1FUL << BICR_PMIC_LDOIO1V8_LEVEL_Pos)
  #define BICR_PMIC_LDOIO1V8_LEVEL_Min (0x0UL)
  #define BICR_PMIC_LDOIO1V8_LEVEL_Max (0x1FUL)
  #define BICR_PMIC_LDOIO1V8_LEVEL_1v8 (0x00UL)
  #define BICR_PMIC_LDOIO1V8_LEVEL_2v6 (0x08UL)
  #define BICR_PMIC_LDOIO1V8_LEVEL_3v3 (0x0FUL)
  #define BICR_PMIC_LDOIO1V8_LEVEL_Unconfigured (0x1FUL)

/* ONMODE @Bits 5..6 : PMIC LDO_IO1V8 operation mode during system ON. */
  #define BICR_PMIC_LDOIO1V8_ONMODE_Pos (5UL)
  #define BICR_PMIC_LDOIO1V8_ONMODE_Msk (0x3UL << BICR_PMIC_LDOIO1V8_ONMODE_Pos)
  #define BICR_PMIC_LDOIO1V8_ONMODE_Min (0x0UL)
  #define BICR_PMIC_LDOIO1V8_ONMODE_Max (0x3UL)
  #define BICR_PMIC_LDOIO1V8_ONMODE_Normal (0x0UL)
  #define BICR_PMIC_LDOIO1V8_ONMODE_ULP (0x1UL)
  #define BICR_PMIC_LDOIO1V8_ONMODE_Off (0x2UL)
  #define BICR_PMIC_LDOIO1V8_ONMODE_Unconfigured (0x3UL)

/* IDLEMODE @Bits 7..8 : PMIC LDO_IO1V8 operation mode during system ON IDLE. */
  #define BICR_PMIC_LDOIO1V8_IDLEMODE_Pos (7UL)
  #define BICR_PMIC_LDOIO1V8_IDLEMODE_Msk (0x3UL << BICR_PMIC_LDOIO1V8_IDLEMODE_Pos)
  #define BICR_PMIC_LDOIO1V8_IDLEMODE_Min (0x0UL)
  #define BICR_PMIC_LDOIO1V8_IDLEMODE_Max (0x3UL)
  #define BICR_PMIC_LDOIO1V8_IDLEMODE_Normal (0x0UL) /*!< PMIC LDO_IO1V8 is configured for normal operation during system ON
                                                          IDLE.*/
  #define BICR_PMIC_LDOIO1V8_IDLEMODE_ULP (0x1UL)
  #define BICR_PMIC_LDOIO1V8_IDLEMODE_Off (0x2UL)
  #define BICR_PMIC_LDOIO1V8_IDLEMODE_Unconfigured (0x3UL)

/* OFFMODE @Bits 9..10 : PMIC LDO_IO1V8 operation mode during system OFF. */
  #define BICR_PMIC_LDOIO1V8_OFFMODE_Pos (9UL)
  #define BICR_PMIC_LDOIO1V8_OFFMODE_Msk (0x3UL << BICR_PMIC_LDOIO1V8_OFFMODE_Pos)
  #define BICR_PMIC_LDOIO1V8_OFFMODE_Min (0x0UL)
  #define BICR_PMIC_LDOIO1V8_OFFMODE_Max (0x3UL)
  #define BICR_PMIC_LDOIO1V8_OFFMODE_Normal (0x0UL)
  #define BICR_PMIC_LDOIO1V8_OFFMODE_ULP (0x1UL)
  #define BICR_PMIC_LDOIO1V8_OFFMODE_Off (0x2UL)
  #define BICR_PMIC_LDOIO1V8_OFFMODE_Unconfigured (0x3UL)


/* BICR_PMIC_LDOIO3V3: Configuration for PMIC LDO_IO3V3. */
  #define BICR_PMIC_LDOIO3V3_ResetValue (0xFFFFFFFFUL)

/* LEVEL @Bits 0..4 : PMIC LDO_IO3V3 output voltage in 100mV steps. All values above 0x0F are invalid. */
  #define BICR_PMIC_LDOIO3V3_LEVEL_Pos (0UL)
  #define BICR_PMIC_LDOIO3V3_LEVEL_Msk (0x1FUL << BICR_PMIC_LDOIO3V3_LEVEL_Pos)
  #define BICR_PMIC_LDOIO3V3_LEVEL_Min (0x0UL)
  #define BICR_PMIC_LDOIO3V3_LEVEL_Max (0x1FUL)
  #define BICR_PMIC_LDOIO3V3_LEVEL_1v8 (0x00UL)
  #define BICR_PMIC_LDOIO3V3_LEVEL_2v6 (0x08UL)
  #define BICR_PMIC_LDOIO3V3_LEVEL_3v3 (0x0FUL)
  #define BICR_PMIC_LDOIO3V3_LEVEL_Unconfigured (0x1FUL)

/* ONMODE @Bits 5..6 : PMIC LDO_IO3V3 operation mode during system ON. */
  #define BICR_PMIC_LDOIO3V3_ONMODE_Pos (5UL)
  #define BICR_PMIC_LDOIO3V3_ONMODE_Msk (0x3UL << BICR_PMIC_LDOIO3V3_ONMODE_Pos)
  #define BICR_PMIC_LDOIO3V3_ONMODE_Min (0x0UL)
  #define BICR_PMIC_LDOIO3V3_ONMODE_Max (0x3UL)
  #define BICR_PMIC_LDOIO3V3_ONMODE_Normal (0x0UL)
  #define BICR_PMIC_LDOIO3V3_ONMODE_ULP (0x1UL)
  #define BICR_PMIC_LDOIO3V3_ONMODE_Off (0x2UL)
  #define BICR_PMIC_LDOIO3V3_ONMODE_Unconfigured (0x3UL)

/* IDLEMODE @Bits 7..8 : PMIC LDO_IO3V3 operation mode during system ON IDLE. */
  #define BICR_PMIC_LDOIO3V3_IDLEMODE_Pos (7UL)
  #define BICR_PMIC_LDOIO3V3_IDLEMODE_Msk (0x3UL << BICR_PMIC_LDOIO3V3_IDLEMODE_Pos)
  #define BICR_PMIC_LDOIO3V3_IDLEMODE_Min (0x0UL)
  #define BICR_PMIC_LDOIO3V3_IDLEMODE_Max (0x3UL)
  #define BICR_PMIC_LDOIO3V3_IDLEMODE_Normal (0x0UL) /*!< PMIC LDO_IO3V3 is configured for normal operation during system ON
                                                          IDLE.*/
  #define BICR_PMIC_LDOIO3V3_IDLEMODE_ULP (0x1UL)
  #define BICR_PMIC_LDOIO3V3_IDLEMODE_Off (0x2UL)
  #define BICR_PMIC_LDOIO3V3_IDLEMODE_Unconfigured (0x3UL)

/* OFFMODE @Bits 9..10 : PMIC LDO_IO3V3 operation mode during system OFF. */
  #define BICR_PMIC_LDOIO3V3_OFFMODE_Pos (9UL)
  #define BICR_PMIC_LDOIO3V3_OFFMODE_Msk (0x3UL << BICR_PMIC_LDOIO3V3_OFFMODE_Pos)
  #define BICR_PMIC_LDOIO3V3_OFFMODE_Min (0x0UL)
  #define BICR_PMIC_LDOIO3V3_OFFMODE_Max (0x3UL)
  #define BICR_PMIC_LDOIO3V3_OFFMODE_Normal (0x0UL)
  #define BICR_PMIC_LDOIO3V3_OFFMODE_ULP (0x1UL)
  #define BICR_PMIC_LDOIO3V3_OFFMODE_Off (0x2UL)
  #define BICR_PMIC_LDOIO3V3_OFFMODE_Unconfigured (0x3UL)


/* ======================================================= Struct BICR ======================================================= */
/**
  * @brief Board information configuration registers
  */
  typedef struct {
    __IM uint32_t RESERVED;
    __IOM NRF_BICR_IOPORT_Type IOPORT;
    __IM uint32_t RESERVED1;
    __IOM NRF_BICR_LFOSC_Type LFOSC;
    __IM uint32_t RESERVED2[2];
    __IOM NRF_BICR_HFXO64M_Type HFXO64M;
    __IOM NRF_BICR_TAMPC_Type TAMPC;
    __IM uint32_t RESERVED3[35];
    __IOM NRF_BICR_PMIC_Type PMIC;
  } NRF_BICR_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           CACHE                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct CACHE_PROFILING ================================================== */
/**
  * @brief PROFILING [CACHE_PROFILING] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;
  __OM  uint32_t  CLEAR;
  __IM  uint32_t  HIT;
  __IM  uint32_t  MISS;
  __IM  uint32_t  LMISS;
  __IM  uint32_t  READS;
  __IM  uint32_t  WRITES;
} NRF_CACHE_PROFILING_Type;

/* CACHE_PROFILING_ENABLE: Enable the profiling counters. */
  #define CACHE_PROFILING_ENABLE_ResetValue (0x00000000UL)

