pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE @Bit 0 : Enable the profiling counters */
  #define CACHE_PROFILING_ENABLE_ENABLE_Pos (0UL)
  #define CACHE_PROFILING_ENABLE_ENABLE_Msk (0x1UL << CACHE_PROFILING_ENABLE_ENABLE_Pos)
  #define CACHE_PROFILING_ENABLE_ENABLE_Min (0x0UL)
  #define CACHE_PROFILING_ENABLE_ENABLE_Max (0x1UL)
  #define CACHE_PROFILING_ENABLE_ENABLE_Disable (0x0UL)
  #define CACHE_PROFILING_ENABLE_ENABLE_Enable (0x1UL)


/* CACHE_PROFILING_CLEAR: Clear the profiling counters. */
  #define CACHE_PROFILING_CLEAR_ResetValue (0x00000000UL)

/* CLEAR @Bit 0 : Clearing the profiling counters */
  #define CACHE_PROFILING_CLEAR_CLEAR_Pos (0UL)
  #define CACHE_PROFILING_CLEAR_CLEAR_Msk (0x1UL << CACHE_PROFILING_CLEAR_CLEAR_Pos)
  #define CACHE_PROFILING_CLEAR_CLEAR_Min (0x1UL)
  #define CACHE_PROFILING_CLEAR_CLEAR_Max (0x1UL)
  #define CACHE_PROFILING_CLEAR_CLEAR_Clear (0x1UL)


/* CACHE_PROFILING_HIT: The cache hit counter for cache region. */
  #define CACHE_PROFILING_HIT_ResetValue (0x00000000UL)

/* HITS @Bits 0..31 : Number of cache hits */
  #define CACHE_PROFILING_HIT_HITS_Pos (0UL)
  #define CACHE_PROFILING_HIT_HITS_Msk (0xFFFFFFFFUL << CACHE_PROFILING_HIT_HITS_Pos)


/* CACHE_PROFILING_MISS: The cache miss counter for cache region. */
  #define CACHE_PROFILING_MISS_ResetValue (0x00000000UL)

/* MISSES @Bits 0..31 : Number of cache misses */
  #define CACHE_PROFILING_MISS_MISSES_Pos (0UL)
  #define CACHE_PROFILING_MISS_MISSES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_MISS_MISSES_Pos)


/* CACHE_PROFILING_LMISS: The cache line miss counter for cache region. */
  #define CACHE_PROFILING_LMISS_ResetValue (0x00000000UL)

/* LMISSES @Bits 0..31 : Number of cache line misses */
  #define CACHE_PROFILING_LMISS_LMISSES_Pos (0UL)
  #define CACHE_PROFILING_LMISS_LMISSES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_LMISS_LMISSES_Pos)


/* CACHE_PROFILING_READS: Number of reads for cache region. */
  #define CACHE_PROFILING_READS_ResetValue (0x00000000UL)

/* READS @Bits 0..31 : Number of reads for cache region. */
  #define CACHE_PROFILING_READS_READS_Pos (0UL)
  #define CACHE_PROFILING_READS_READS_Msk (0xFFFFFFFFUL << CACHE_PROFILING_READS_READS_Pos)


/* CACHE_PROFILING_WRITES: Number of writes for cache region. */
  #define CACHE_PROFILING_WRITES_ResetValue (0x00000000UL)

/* WRITES @Bits 0..31 : Number of writes for cache region. */
  #define CACHE_PROFILING_WRITES_WRITES_Pos (0UL)
  #define CACHE_PROFILING_WRITES_WRITES_Msk (0xFFFFFFFFUL << CACHE_PROFILING_WRITES_WRITES_Pos)


/* ====================================================== Struct CACHE ======================================================= */
/**
  * @brief Cache
  */
  typedef struct {
    __OM uint32_t TASKS_SAVE;
    __OM uint32_t TASKS_RESTORE;
    __OM uint32_t TASKS_INVALIDATECACHE;
    __OM uint32_t TASKS_CLEANCACHE;
    __OM uint32_t TASKS_FLUSHCACHE;
    __OM uint32_t TASKS_INVALIDATELINE;
    __OM uint32_t TASKS_CLEANLINE;
    __OM uint32_t TASKS_FLUSHLINE;
    __OM uint32_t TASKS_ERASE;
    __IM uint32_t RESERVED[55];
    __IOM uint32_t EVENTS_DONE;
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED2[60];
    __IM uint32_t STATUS;
    __IOM uint32_t ENABLE;
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t LINEADDR;
    __IOM NRF_CACHE_PROFILING_Type PROFILING;
    __IOM uint32_t DEBUGLOCK;
    __IOM uint32_t WRITELOCK;
  } NRF_CACHE_Type;

/* CACHE_TASKS_SAVE: Save the cache state to a retained memory space. */
  #define CACHE_TASKS_SAVE_ResetValue (0x00000000UL)

/* TASKS_SAVE @Bit 0 : Save the cache state to a retained memory space. */
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Pos (0UL)
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Msk (0x1UL << CACHE_TASKS_SAVE_TASKS_SAVE_Pos)
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Min (0x1UL)
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Max (0x1UL)
  #define CACHE_TASKS_SAVE_TASKS_SAVE_Trigger (0x1UL)


/* CACHE_TASKS_RESTORE: Restore the cache state from a retained memory space. */
  #define CACHE_TASKS_RESTORE_ResetValue (0x00000000UL)

/* TASKS_RESTORE @Bit 0 : Restore the cache state from a retained memory space. */
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Pos (0UL)
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Msk (0x1UL << CACHE_TASKS_RESTORE_TASKS_RESTORE_Pos) /*!< Bit mask of TASKS_RESTORE
                                                                            field.*/
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Min (0x1UL)
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Max (0x1UL)
  #define CACHE_TASKS_RESTORE_TASKS_RESTORE_Trigger (0x1UL)


/* CACHE_TASKS_INVALIDATECACHE: Invalidate the cache. */
  #define CACHE_TASKS_INVALIDATECACHE_ResetValue (0x00000000UL)

/* TASKS_INVALIDATECACHE @Bit 0 : Invalidate the cache. */
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Pos (0UL)
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Msk (0x1UL << CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Pos)
                                                                            /*!< Bit mask of TASKS_INVALIDATECACHE field.*/
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Min (0x1UL) /*!< Min enumerator value of TASKS_INVALIDATECACHE
                                                                            field.*/
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Max (0x1UL) /*!< Max enumerator value of TASKS_INVALIDATECACHE
                                                                            field.*/
  #define CACHE_TASKS_INVALIDATECACHE_TASKS_INVALIDATECACHE_Trigger (0x1UL)


/* CACHE_TASKS_CLEANCACHE: Clean the cache. */
  #define CACHE_TASKS_CLEANCACHE_ResetValue (0x00000000UL)

/* TASKS_CLEANCACHE @Bit 0 : Clean the cache. */
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Pos (0UL)
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Msk (0x1UL << CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Pos) /*!< Bit mask of
                                                                            TASKS_CLEANCACHE field.*/
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Min (0x1UL)
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Max (0x1UL)
  #define CACHE_TASKS_CLEANCACHE_TASKS_CLEANCACHE_Trigger (0x1UL)


