pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CACHE_TASKS_FLUSHCACHE: Flush the cache. */
  #define CACHE_TASKS_FLUSHCACHE_ResetValue (0x00000000UL)

/* TASKS_FLUSHCACHE @Bit 0 : Flush the cache. */
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Pos (0UL)
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Msk (0x1UL << CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Pos) /*!< Bit mask of
                                                                            TASKS_FLUSHCACHE field.*/
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Min (0x1UL)
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Max (0x1UL)
  #define CACHE_TASKS_FLUSHCACHE_TASKS_FLUSHCACHE_Trigger (0x1UL)


/* CACHE_TASKS_INVALIDATELINE: Invalidate the line. */
  #define CACHE_TASKS_INVALIDATELINE_ResetValue (0x00000000UL)

/* TASKS_INVALIDATELINE @Bit 0 : Invalidate the line. */
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Pos (0UL)
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Msk (0x1UL << CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Pos)
                                                                            /*!< Bit mask of TASKS_INVALIDATELINE field.*/
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Min (0x1UL)
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Max (0x1UL)
  #define CACHE_TASKS_INVALIDATELINE_TASKS_INVALIDATELINE_Trigger (0x1UL)


/* CACHE_TASKS_CLEANLINE: Clean the line. */
  #define CACHE_TASKS_CLEANLINE_ResetValue (0x00000000UL)

/* TASKS_CLEANLINE @Bit 0 : Clean the line. */
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Pos (0UL)
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Msk (0x1UL << CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Pos) /*!< Bit mask of
                                                                            TASKS_CLEANLINE field.*/
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Min (0x1UL)
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Max (0x1UL)
  #define CACHE_TASKS_CLEANLINE_TASKS_CLEANLINE_Trigger (0x1UL)


/* CACHE_TASKS_FLUSHLINE: Flush the line. */
  #define CACHE_TASKS_FLUSHLINE_ResetValue (0x00000000UL)

/* TASKS_FLUSHLINE @Bit 0 : Flush the line. */
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Pos (0UL)
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Msk (0x1UL << CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Pos) /*!< Bit mask of
                                                                            TASKS_FLUSHLINE field.*/
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Min (0x1UL)
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Max (0x1UL)
  #define CACHE_TASKS_FLUSHLINE_TASKS_FLUSHLINE_Trigger (0x1UL)


/* CACHE_TASKS_ERASE: Erase the cache. */
  #define CACHE_TASKS_ERASE_ResetValue (0x00000000UL)

/* TASKS_ERASE @Bit 0 : Erase the cache. */
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Pos (0UL)
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Msk (0x1UL << CACHE_TASKS_ERASE_TASKS_ERASE_Pos)
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Min (0x1UL)
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Max (0x1UL)
  #define CACHE_TASKS_ERASE_TASKS_ERASE_Trigger (0x1UL)


/* CACHE_EVENTS_DONE: Save or Restore task is done. */
  #define CACHE_EVENTS_DONE_ResetValue (0x00000000UL)

/* EVENTS_DONE @Bit 0 : Save or Restore task is done. */
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Pos (0UL)
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Msk (0x1UL << CACHE_EVENTS_DONE_EVENTS_DONE_Pos)
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Min (0x0UL)
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Max (0x1UL)
  #define CACHE_EVENTS_DONE_EVENTS_DONE_NotGenerated (0x0UL)
  #define CACHE_EVENTS_DONE_EVENTS_DONE_Generated (0x1UL)


/* CACHE_INTEN: Enable or disable interrupt */
  #define CACHE_INTEN_ResetValue (0x00000000UL)

/* DONE @Bit 0 : Enable or disable interrupt for event DONE */
  #define CACHE_INTEN_DONE_Pos (0UL)
  #define CACHE_INTEN_DONE_Msk (0x1UL << CACHE_INTEN_DONE_Pos)
  #define CACHE_INTEN_DONE_Min (0x0UL)
  #define CACHE_INTEN_DONE_Max (0x1UL)
  #define CACHE_INTEN_DONE_Disabled (0x0UL)
  #define CACHE_INTEN_DONE_Enabled (0x1UL)


/* CACHE_INTENSET: Enable interrupt */
  #define CACHE_INTENSET_ResetValue (0x00000000UL)

/* DONE @Bit 0 : Write '1' to enable interrupt for event DONE */
  #define CACHE_INTENSET_DONE_Pos (0UL)
  #define CACHE_INTENSET_DONE_Msk (0x1UL << CACHE_INTENSET_DONE_Pos)
  #define CACHE_INTENSET_DONE_Min (0x0UL)
  #define CACHE_INTENSET_DONE_Max (0x1UL)
  #define CACHE_INTENSET_DONE_Set (0x1UL)
  #define CACHE_INTENSET_DONE_Disabled (0x0UL)
  #define CACHE_INTENSET_DONE_Enabled (0x1UL)


/* CACHE_INTENCLR: Disable interrupt */
  #define CACHE_INTENCLR_ResetValue (0x00000000UL)

/* DONE @Bit 0 : Write '1' to disable interrupt for event DONE */
  #define CACHE_INTENCLR_DONE_Pos (0UL)
  #define CACHE_INTENCLR_DONE_Msk (0x1UL << CACHE_INTENCLR_DONE_Pos)
  #define CACHE_INTENCLR_DONE_Min (0x0UL)
  #define CACHE_INTENCLR_DONE_Max (0x1UL)
  #define CACHE_INTENCLR_DONE_Clear (0x1UL)
  #define CACHE_INTENCLR_DONE_Disabled (0x0UL)
  #define CACHE_INTENCLR_DONE_Enabled (0x1UL)


/* CACHE_INTPEND: Pending interrupts */
  #define CACHE_INTPEND_ResetValue (0x00000000UL)

/* DONE @Bit 0 : Read pending status of interrupt for event DONE */
  #define CACHE_INTPEND_DONE_Pos (0UL)
  #define CACHE_INTPEND_DONE_Msk (0x1UL << CACHE_INTPEND_DONE_Pos)
  #define CACHE_INTPEND_DONE_Min (0x0UL)
  #define CACHE_INTPEND_DONE_Max (0x1UL)
  #define CACHE_INTPEND_DONE_NotPending (0x0UL)
  #define CACHE_INTPEND_DONE_Pending (0x1UL)


/* CACHE_STATUS: Status of the cache activities. */
  #define CACHE_STATUS_ResetValue (0x00000000UL)

/* BUSY @Bit 0 : Busy status. */
  #define CACHE_STATUS_BUSY_Pos (0UL)
  #define CACHE_STATUS_BUSY_Msk (0x1UL << CACHE_STATUS_BUSY_Pos)
  #define CACHE_STATUS_BUSY_Min (0x0UL)
  #define CACHE_STATUS_BUSY_Max (0x1UL)
  #define CACHE_STATUS_BUSY_Ready (0x0UL)
  #define CACHE_STATUS_BUSY_Busy (0x1UL)


/* CACHE_ENABLE: Enable cache. */
  #define CACHE_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable cache */
  #define CACHE_ENABLE_ENABLE_Pos (0UL)
  #define CACHE_ENABLE_ENABLE_Msk (0x1UL << CACHE_ENABLE_ENABLE_Pos)
  #define CACHE_ENABLE_ENABLE_Min (0x0UL)
  #define CACHE_ENABLE_ENABLE_Max (0x1UL)
  #define CACHE_ENABLE_ENABLE_Disabled (0x0UL)
  #define CACHE_ENABLE_ENABLE_Enabled (0x1UL)


/* CACHE_LINEADDR: Memory address covered by the line to be maintained. */
  #define CACHE_LINEADDR_ResetValue (0x00000000UL)

/* ADDR @Bits 0..31 : Address. */
  #define CACHE_LINEADDR_ADDR_Pos (0UL)
  #define CACHE_LINEADDR_ADDR_Msk (0xFFFFFFFFUL << CACHE_LINEADDR_ADDR_Pos)


