pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CACHE_DEBUGLOCK: Lock debug mode. */
  #define CACHE_DEBUGLOCK_ResetValue (0x00000000UL)

/* DEBUGLOCK @Bit 0 : Lock debug mode */
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Pos (0UL)
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Msk (0x1UL << CACHE_DEBUGLOCK_DEBUGLOCK_Pos)
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Min (0x0UL)
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Max (0x1UL)
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Unlocked (0x0UL)
  #define CACHE_DEBUGLOCK_DEBUGLOCK_Locked (0x1UL)


/* CACHE_WRITELOCK: Lock cache updates. */
  #define CACHE_WRITELOCK_ResetValue (0x00000000UL)

/* WRITELOCK @Bit 0 : Lock cache updates */
  #define CACHE_WRITELOCK_WRITELOCK_Pos (0UL)
  #define CACHE_WRITELOCK_WRITELOCK_Msk (0x1UL << CACHE_WRITELOCK_WRITELOCK_Pos)
  #define CACHE_WRITELOCK_WRITELOCK_Min (0x0UL)
  #define CACHE_WRITELOCK_WRITELOCK_Max (0x1UL)
  #define CACHE_WRITELOCK_WRITELOCK_Unlocked (0x0UL)
  #define CACHE_WRITELOCK_WRITELOCK_Locked (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CAN                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CAN ======================================================== */
/**
  * @brief Controller Area Network
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOPREQ;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED[61];
    __IOM uint32_t EVENTS_CORE[2];                   /*!< (@ 0x00000100) Event indicating that interrupt n triggered at CAN
                                                                         core*/
    __IOM uint32_t EVENTS_DMU;
    __IOM uint32_t EVENTS_DMA;
    __IOM uint32_t EVENTS_READYFORSTOP;
    __IM uint32_t RESERVED1[59];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
  } NRF_CAN_Type;

/* CAN_TASKS_START: Start the CAN peripheral. */
  #define CAN_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start the CAN peripheral. */
  #define CAN_TASKS_START_TASKS_START_Pos (0UL)
  #define CAN_TASKS_START_TASKS_START_Msk (0x1UL << CAN_TASKS_START_TASKS_START_Pos)
  #define CAN_TASKS_START_TASKS_START_Min (0x1UL)
  #define CAN_TASKS_START_TASKS_START_Max (0x1UL)
  #define CAN_TASKS_START_TASKS_START_Trigger (0x1UL)


/* CAN_TASKS_STOPREQ: Request to stop the CAN peripheral */
  #define CAN_TASKS_STOPREQ_ResetValue (0x00000000UL)

/* TASKS_STOPREQ @Bit 0 : Request to stop the CAN peripheral */
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Pos (0UL)
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Msk (0x1UL << CAN_TASKS_STOPREQ_TASKS_STOPREQ_Pos) /*!< Bit mask of TASKS_STOPREQ
                                                                            field.*/
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Min (0x1UL)
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Max (0x1UL)
  #define CAN_TASKS_STOPREQ_TASKS_STOPREQ_Trigger (0x1UL)


/* CAN_TASKS_STOP: Stop the CAN peripheral */
  #define CAN_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop the CAN peripheral */
  #define CAN_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define CAN_TASKS_STOP_TASKS_STOP_Msk (0x1UL << CAN_TASKS_STOP_TASKS_STOP_Pos)
  #define CAN_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define CAN_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define CAN_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* CAN_EVENTS_CORE: Event indicating that interrupt n triggered at CAN core */
  #define CAN_EVENTS_CORE_MaxCount (2UL)
  #define CAN_EVENTS_CORE_MaxIndex (1UL)
  #define CAN_EVENTS_CORE_MinIndex (0UL)
  #define CAN_EVENTS_CORE_ResetValue (0x00000000UL)

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt n triggered at CAN core */
  #define CAN_EVENTS_CORE_EVENTS_CORE_Pos (0UL)
  #define CAN_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << CAN_EVENTS_CORE_EVENTS_CORE_Pos)
  #define CAN_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)
  #define CAN_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)
  #define CAN_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL)
  #define CAN_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL)


/* CAN_EVENTS_DMU: Event indicating that interrupt triggered at CAN DMU */
  #define CAN_EVENTS_DMU_ResetValue (0x00000000UL)

/* EVENTS_DMU @Bit 0 : Event indicating that interrupt triggered at CAN DMU */
  #define CAN_EVENTS_DMU_EVENTS_DMU_Pos (0UL)
  #define CAN_EVENTS_DMU_EVENTS_DMU_Msk (0x1UL << CAN_EVENTS_DMU_EVENTS_DMU_Pos)
  #define CAN_EVENTS_DMU_EVENTS_DMU_Min (0x0UL)
  #define CAN_EVENTS_DMU_EVENTS_DMU_Max (0x1UL)
  #define CAN_EVENTS_DMU_EVENTS_DMU_NotGenerated (0x0UL)
  #define CAN_EVENTS_DMU_EVENTS_DMU_Generated (0x1UL)


/* CAN_EVENTS_DMA: Event indicating that interrupt triggered at CAN DMA */
  #define CAN_EVENTS_DMA_ResetValue (0x00000000UL)

/* EVENTS_DMA @Bit 0 : Event indicating that interrupt triggered at CAN DMA */
  #define CAN_EVENTS_DMA_EVENTS_DMA_Pos (0UL)
  #define CAN_EVENTS_DMA_EVENTS_DMA_Msk (0x1UL << CAN_EVENTS_DMA_EVENTS_DMA_Pos)
  #define CAN_EVENTS_DMA_EVENTS_DMA_Min (0x0UL)
  #define CAN_EVENTS_DMA_EVENTS_DMA_Max (0x1UL)
  #define CAN_EVENTS_DMA_EVENTS_DMA_NotGenerated (0x0UL)
  #define CAN_EVENTS_DMA_EVENTS_DMA_Generated (0x1UL)


/* CAN_EVENTS_READYFORSTOP: Event indicating that the CAN is ready to be stopped */
  #define CAN_EVENTS_READYFORSTOP_ResetValue (0x00000000UL)

/* EVENTS_READYFORSTOP @Bit 0 : Event indicating that the CAN is ready to be stopped */
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Pos (0UL)
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Msk (0x1UL << CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Pos) /*!< Bit
                                                                            mask of EVENTS_READYFORSTOP field.*/
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Min (0x0UL)
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Max (0x1UL)
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_NotGenerated (0x0UL)
  #define CAN_EVENTS_READYFORSTOP_EVENTS_READYFORSTOP_Generated (0x1UL)


