pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CAN_SHORTS: Shortcuts between local events and tasks */
  #define CAN_SHORTS_ResetValue (0x00000000UL)

/* READYFORSTOP_STOP @Bit 0 : Shortcut between event READYFORSTOP and task STOP */
  #define CAN_SHORTS_READYFORSTOP_STOP_Pos (0UL)
  #define CAN_SHORTS_READYFORSTOP_STOP_Msk (0x1UL << CAN_SHORTS_READYFORSTOP_STOP_Pos) /*!< Bit mask of READYFORSTOP_STOP
                                                                            field.*/
  #define CAN_SHORTS_READYFORSTOP_STOP_Min (0x0UL)
  #define CAN_SHORTS_READYFORSTOP_STOP_Max (0x1UL)
  #define CAN_SHORTS_READYFORSTOP_STOP_Disabled (0x0UL)
  #define CAN_SHORTS_READYFORSTOP_STOP_Enabled (0x1UL)


/* CAN_INTEN: Enable or disable interrupt */
  #define CAN_INTEN_ResetValue (0x00000000UL)

/* CORE0 @Bit 0 : Enable or disable interrupt for event CORE[0] */
  #define CAN_INTEN_CORE0_Pos (0UL)
  #define CAN_INTEN_CORE0_Msk (0x1UL << CAN_INTEN_CORE0_Pos)
  #define CAN_INTEN_CORE0_Min (0x0UL)
  #define CAN_INTEN_CORE0_Max (0x1UL)
  #define CAN_INTEN_CORE0_Disabled (0x0UL)
  #define CAN_INTEN_CORE0_Enabled (0x1UL)

/* CORE1 @Bit 1 : Enable or disable interrupt for event CORE[1] */
  #define CAN_INTEN_CORE1_Pos (1UL)
  #define CAN_INTEN_CORE1_Msk (0x1UL << CAN_INTEN_CORE1_Pos)
  #define CAN_INTEN_CORE1_Min (0x0UL)
  #define CAN_INTEN_CORE1_Max (0x1UL)
  #define CAN_INTEN_CORE1_Disabled (0x0UL)
  #define CAN_INTEN_CORE1_Enabled (0x1UL)

/* DMU @Bit 2 : Enable or disable interrupt for event DMU */
  #define CAN_INTEN_DMU_Pos (2UL)
  #define CAN_INTEN_DMU_Msk (0x1UL << CAN_INTEN_DMU_Pos)
  #define CAN_INTEN_DMU_Min (0x0UL)
  #define CAN_INTEN_DMU_Max (0x1UL)
  #define CAN_INTEN_DMU_Disabled (0x0UL)
  #define CAN_INTEN_DMU_Enabled (0x1UL)

/* DMA @Bit 3 : Enable or disable interrupt for event DMA */
  #define CAN_INTEN_DMA_Pos (3UL)
  #define CAN_INTEN_DMA_Msk (0x1UL << CAN_INTEN_DMA_Pos)
  #define CAN_INTEN_DMA_Min (0x0UL)
  #define CAN_INTEN_DMA_Max (0x1UL)
  #define CAN_INTEN_DMA_Disabled (0x0UL)
  #define CAN_INTEN_DMA_Enabled (0x1UL)

/* READYFORSTOP @Bit 4 : Enable or disable interrupt for event READYFORSTOP */
  #define CAN_INTEN_READYFORSTOP_Pos (4UL)
  #define CAN_INTEN_READYFORSTOP_Msk (0x1UL << CAN_INTEN_READYFORSTOP_Pos)
  #define CAN_INTEN_READYFORSTOP_Min (0x0UL)
  #define CAN_INTEN_READYFORSTOP_Max (0x1UL)
  #define CAN_INTEN_READYFORSTOP_Disabled (0x0UL)
  #define CAN_INTEN_READYFORSTOP_Enabled (0x1UL)


/* CAN_INTENSET: Enable interrupt */
  #define CAN_INTENSET_ResetValue (0x00000000UL)

/* CORE0 @Bit 0 : Write '1' to enable interrupt for event CORE[0] */
  #define CAN_INTENSET_CORE0_Pos (0UL)
  #define CAN_INTENSET_CORE0_Msk (0x1UL << CAN_INTENSET_CORE0_Pos)
  #define CAN_INTENSET_CORE0_Min (0x0UL)
  #define CAN_INTENSET_CORE0_Max (0x1UL)
  #define CAN_INTENSET_CORE0_Set (0x1UL)
  #define CAN_INTENSET_CORE0_Disabled (0x0UL)
  #define CAN_INTENSET_CORE0_Enabled (0x1UL)

/* CORE1 @Bit 1 : Write '1' to enable interrupt for event CORE[1] */
  #define CAN_INTENSET_CORE1_Pos (1UL)
  #define CAN_INTENSET_CORE1_Msk (0x1UL << CAN_INTENSET_CORE1_Pos)
  #define CAN_INTENSET_CORE1_Min (0x0UL)
  #define CAN_INTENSET_CORE1_Max (0x1UL)
  #define CAN_INTENSET_CORE1_Set (0x1UL)
  #define CAN_INTENSET_CORE1_Disabled (0x0UL)
  #define CAN_INTENSET_CORE1_Enabled (0x1UL)

/* DMU @Bit 2 : Write '1' to enable interrupt for event DMU */
  #define CAN_INTENSET_DMU_Pos (2UL)
  #define CAN_INTENSET_DMU_Msk (0x1UL << CAN_INTENSET_DMU_Pos)
  #define CAN_INTENSET_DMU_Min (0x0UL)
  #define CAN_INTENSET_DMU_Max (0x1UL)
  #define CAN_INTENSET_DMU_Set (0x1UL)
  #define CAN_INTENSET_DMU_Disabled (0x0UL)
  #define CAN_INTENSET_DMU_Enabled (0x1UL)

/* DMA @Bit 3 : Write '1' to enable interrupt for event DMA */
  #define CAN_INTENSET_DMA_Pos (3UL)
  #define CAN_INTENSET_DMA_Msk (0x1UL << CAN_INTENSET_DMA_Pos)
  #define CAN_INTENSET_DMA_Min (0x0UL)
  #define CAN_INTENSET_DMA_Max (0x1UL)
  #define CAN_INTENSET_DMA_Set (0x1UL)
  #define CAN_INTENSET_DMA_Disabled (0x0UL)
  #define CAN_INTENSET_DMA_Enabled (0x1UL)

/* READYFORSTOP @Bit 4 : Write '1' to enable interrupt for event READYFORSTOP */
  #define CAN_INTENSET_READYFORSTOP_Pos (4UL)
  #define CAN_INTENSET_READYFORSTOP_Msk (0x1UL << CAN_INTENSET_READYFORSTOP_Pos)
  #define CAN_INTENSET_READYFORSTOP_Min (0x0UL)
  #define CAN_INTENSET_READYFORSTOP_Max (0x1UL)
  #define CAN_INTENSET_READYFORSTOP_Set (0x1UL)
  #define CAN_INTENSET_READYFORSTOP_Disabled (0x0UL)
  #define CAN_INTENSET_READYFORSTOP_Enabled (0x1UL)


/* CAN_INTENCLR: Disable interrupt */
  #define CAN_INTENCLR_ResetValue (0x00000000UL)

/* CORE0 @Bit 0 : Write '1' to disable interrupt for event CORE[0] */
  #define CAN_INTENCLR_CORE0_Pos (0UL)
  #define CAN_INTENCLR_CORE0_Msk (0x1UL << CAN_INTENCLR_CORE0_Pos)
  #define CAN_INTENCLR_CORE0_Min (0x0UL)
  #define CAN_INTENCLR_CORE0_Max (0x1UL)
  #define CAN_INTENCLR_CORE0_Clear (0x1UL)
  #define CAN_INTENCLR_CORE0_Disabled (0x0UL)
  #define CAN_INTENCLR_CORE0_Enabled (0x1UL)

/* CORE1 @Bit 1 : Write '1' to disable interrupt for event CORE[1] */
  #define CAN_INTENCLR_CORE1_Pos (1UL)
  #define CAN_INTENCLR_CORE1_Msk (0x1UL << CAN_INTENCLR_CORE1_Pos)
  #define CAN_INTENCLR_CORE1_Min (0x0UL)
  #define CAN_INTENCLR_CORE1_Max (0x1UL)
  #define CAN_INTENCLR_CORE1_Clear (0x1UL)
  #define CAN_INTENCLR_CORE1_Disabled (0x0UL)
  #define CAN_INTENCLR_CORE1_Enabled (0x1UL)

/* DMU @Bit 2 : Write '1' to disable interrupt for event DMU */
  #define CAN_INTENCLR_DMU_Pos (2UL)
  #define CAN_INTENCLR_DMU_Msk (0x1UL << CAN_INTENCLR_DMU_Pos)
  #define CAN_INTENCLR_DMU_Min (0x0UL)
  #define CAN_INTENCLR_DMU_Max (0x1UL)
  #define CAN_INTENCLR_DMU_Clear (0x1UL)
  #define CAN_INTENCLR_DMU_Disabled (0x0UL)
  #define CAN_INTENCLR_DMU_Enabled (0x1UL)

/* DMA @Bit 3 : Write '1' to disable interrupt for event DMA */
  #define CAN_INTENCLR_DMA_Pos (3UL)
  #define CAN_INTENCLR_DMA_Msk (0x1UL << CAN_INTENCLR_DMA_Pos)
  #define CAN_INTENCLR_DMA_Min (0x0UL)
  #define CAN_INTENCLR_DMA_Max (0x1UL)
  #define CAN_INTENCLR_DMA_Clear (0x1UL)
  #define CAN_INTENCLR_DMA_Disabled (0x0UL)
  #define CAN_INTENCLR_DMA_Enabled (0x1UL)

