pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* READYFORSTOP @Bit 4 : Write '1' to disable interrupt for event READYFORSTOP */
  #define CAN_INTENCLR_READYFORSTOP_Pos (4UL)
  #define CAN_INTENCLR_READYFORSTOP_Msk (0x1UL << CAN_INTENCLR_READYFORSTOP_Pos)
  #define CAN_INTENCLR_READYFORSTOP_Min (0x0UL)
  #define CAN_INTENCLR_READYFORSTOP_Max (0x1UL)
  #define CAN_INTENCLR_READYFORSTOP_Clear (0x1UL)
  #define CAN_INTENCLR_READYFORSTOP_Disabled (0x0UL)
  #define CAN_INTENCLR_READYFORSTOP_Enabled (0x1UL)


/* CAN_INTPEND: Pending interrupts */
  #define CAN_INTPEND_ResetValue (0x00000000UL)

/* CORE0 @Bit 0 : Read pending status of interrupt for event CORE[0] */
  #define CAN_INTPEND_CORE0_Pos (0UL)
  #define CAN_INTPEND_CORE0_Msk (0x1UL << CAN_INTPEND_CORE0_Pos)
  #define CAN_INTPEND_CORE0_Min (0x0UL)
  #define CAN_INTPEND_CORE0_Max (0x1UL)
  #define CAN_INTPEND_CORE0_NotPending (0x0UL)
  #define CAN_INTPEND_CORE0_Pending (0x1UL)

/* CORE1 @Bit 1 : Read pending status of interrupt for event CORE[1] */
  #define CAN_INTPEND_CORE1_Pos (1UL)
  #define CAN_INTPEND_CORE1_Msk (0x1UL << CAN_INTPEND_CORE1_Pos)
  #define CAN_INTPEND_CORE1_Min (0x0UL)
  #define CAN_INTPEND_CORE1_Max (0x1UL)
  #define CAN_INTPEND_CORE1_NotPending (0x0UL)
  #define CAN_INTPEND_CORE1_Pending (0x1UL)

/* DMU @Bit 2 : Read pending status of interrupt for event DMU */
  #define CAN_INTPEND_DMU_Pos (2UL)
  #define CAN_INTPEND_DMU_Msk (0x1UL << CAN_INTPEND_DMU_Pos)
  #define CAN_INTPEND_DMU_Min (0x0UL)
  #define CAN_INTPEND_DMU_Max (0x1UL)
  #define CAN_INTPEND_DMU_NotPending (0x0UL)
  #define CAN_INTPEND_DMU_Pending (0x1UL)

/* DMA @Bit 3 : Read pending status of interrupt for event DMA */
  #define CAN_INTPEND_DMA_Pos (3UL)
  #define CAN_INTPEND_DMA_Msk (0x1UL << CAN_INTPEND_DMA_Pos)
  #define CAN_INTPEND_DMA_Min (0x0UL)
  #define CAN_INTPEND_DMA_Max (0x1UL)
  #define CAN_INTPEND_DMA_NotPending (0x0UL)
  #define CAN_INTPEND_DMA_Pending (0x1UL)

/* READYFORSTOP @Bit 4 : Read pending status of interrupt for event READYFORSTOP */
  #define CAN_INTPEND_READYFORSTOP_Pos (4UL)
  #define CAN_INTPEND_READYFORSTOP_Msk (0x1UL << CAN_INTPEND_READYFORSTOP_Pos)
  #define CAN_INTPEND_READYFORSTOP_Min (0x0UL)
  #define CAN_INTPEND_READYFORSTOP_Max (0x1UL)
  #define CAN_INTPEND_READYFORSTOP_NotPending (0x0UL)
  #define CAN_INTPEND_READYFORSTOP_Pending (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CCM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct CCM_KEY ====================================================== */
/**
  * @brief KEY [CCM_KEY] (unspecified)
  */
typedef struct {
  __OM  uint32_t  VALUE[4];
} NRF_CCM_KEY_Type;

/* CCM_KEY_VALUE: 128-bit AES key */
  #define CCM_KEY_VALUE_MaxCount (4UL)
  #define CCM_KEY_VALUE_MaxIndex (3UL)
  #define CCM_KEY_VALUE_MinIndex (0UL)
  #define CCM_KEY_VALUE_ResetValue (0x00000000UL)

/* VALUE @Bits 0..31 : AES 128-bit key value, bits (32*(i+1))-1 : (32*i) */
  #define CCM_KEY_VALUE_VALUE_Pos (0UL)
  #define CCM_KEY_VALUE_VALUE_Msk (0xFFFFFFFFUL << CCM_KEY_VALUE_VALUE_Pos)



/* ==================================================== Struct CCM_NONCE ===================================================== */
/**
  * @brief NONCE [CCM_NONCE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VALUE[4];
} NRF_CCM_NONCE_Type;

/* CCM_NONCE_VALUE: 13-byte NONCE vector Only the lower 13 bytes are used */
  #define CCM_NONCE_VALUE_MaxCount (4UL)
  #define CCM_NONCE_VALUE_MaxIndex (3UL)
  #define CCM_NONCE_VALUE_MinIndex (0UL)
  #define CCM_NONCE_VALUE_ResetValue (0x00000000UL)

/* VALUE @Bits 0..31 : NONCE value, bits (32*(n+1))-1 : (32*n) */
  #define CCM_NONCE_VALUE_VALUE_Pos (0UL)
  #define CCM_NONCE_VALUE_VALUE_Msk (0xFFFFFFFFUL << CCM_NONCE_VALUE_VALUE_Pos)



/* ====================================================== Struct CCM_IN ====================================================== */
/**
  * @brief IN [CCM_IN] IN EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Input pointer Points to a job list containing
                                                                         unencrypted CCM data structure in Encryption mode
                                                                         Points to a job list containing encrypted CCM data
                                                                         structure in Decryption mode*/
} NRF_CCM_IN_Type;

/* CCM_IN_PTR: Input pointer Points to a job list containing unencrypted CCM data structure in Encryption mode Points to a job
                list containing encrypted CCM data structure in Decryption mode */

  #define CCM_IN_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : Input pointer */
  #define CCM_IN_PTR_PTR_Pos (0UL)
  #define CCM_IN_PTR_PTR_Msk (0xFFFFFFFFUL << CCM_IN_PTR_PTR_Pos)



/* ===================================================== Struct CCM_OUT ====================================================== */
/**
  * @brief OUT [CCM_OUT] OUT EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Output pointer Points to a job list containing
                                                                         encrypted CCM data structure in Encryption mode Points
                                                                         to a job list containing decrypted CCM data structure
                                                                         in Decryption mode*/
} NRF_CCM_OUT_Type;

/* CCM_OUT_PTR: Output pointer Points to a job list containing encrypted CCM data structure in Encryption mode Points to a job
                 list containing decrypted CCM data structure in Decryption mode */

