pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define CCM_OUT_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : Output pointer */
  #define CCM_OUT_PTR_PTR_Pos (0UL)
  #define CCM_OUT_PTR_PTR_Msk (0xFFFFFFFFUL << CCM_OUT_PTR_PTR_Pos)


/* ======================================================= Struct CCM ======================================================== */
/**
  * @brief AES CCM Mode Encryption
  */
  typedef struct {
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start encryption/decryption. This operation will stop
                                                                         by itself when completed.*/
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_RATEOVERRIDE;                /*!< (@ 0x00000008) Override DATARATE setting in MODE register with the
                                                                         contents of the RATEOVERRIDE register for any ongoing
                                                                         encryption/decryption*/
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_RATEOVERRIDE;
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_END;
    __IOM uint32_t EVENTS_ERROR;
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_END;
    __IOM uint32_t PUBLISH_ERROR;
    __IM uint32_t RESERVED3[94];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED4[61];
    __IM uint32_t MACSTATUS;
    __IM uint32_t ERRORSTATUS;
    __IM uint32_t RESERVED5[62];
    __IOM uint32_t ENABLE;
    __IOM uint32_t MODE;
    __IM uint32_t RESERVED6[2];
    __IOM NRF_CCM_KEY_Type KEY;
    __IOM NRF_CCM_NONCE_Type NONCE;
    __IOM NRF_CCM_IN_Type IN;
    __IM uint32_t RESERVED7;
    __IOM NRF_CCM_OUT_Type OUT;
    __IM uint32_t RESERVED8[2];
    __IOM uint32_t RATEOVERRIDE;
    __IOM uint32_t ADATAMASK;
  } NRF_CCM_Type;

/* CCM_TASKS_START: Start encryption/decryption. This operation will stop by itself when completed. */
  #define CCM_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start encryption/decryption. This operation will stop by itself when completed. */
  #define CCM_TASKS_START_TASKS_START_Pos (0UL)
  #define CCM_TASKS_START_TASKS_START_Msk (0x1UL << CCM_TASKS_START_TASKS_START_Pos)
  #define CCM_TASKS_START_TASKS_START_Min (0x1UL)
  #define CCM_TASKS_START_TASKS_START_Max (0x1UL)
  #define CCM_TASKS_START_TASKS_START_Trigger (0x1UL)


/* CCM_TASKS_STOP: Stop encryption/decryption */
  #define CCM_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop encryption/decryption */
  #define CCM_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define CCM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << CCM_TASKS_STOP_TASKS_STOP_Pos)
  #define CCM_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define CCM_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define CCM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* CCM_TASKS_RATEOVERRIDE: Override DATARATE setting in MODE register with the contents of the RATEOVERRIDE register for any
                            ongoing encryption/decryption */

  #define CCM_TASKS_RATEOVERRIDE_ResetValue (0x00000000UL)

/* TASKS_RATEOVERRIDE @Bit 0 : Override DATARATE setting in MODE register with the contents of the RATEOVERRIDE register for any
                               ongoing encryption/decryption */

  #define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Pos (0UL)
  #define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Msk (0x1UL << CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Pos) /*!< Bit mask
                                                                            of TASKS_RATEOVERRIDE field.*/
  #define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Min (0x1UL)
  #define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Max (0x1UL)
  #define CCM_TASKS_RATEOVERRIDE_TASKS_RATEOVERRIDE_Trigger (0x1UL)


/* CCM_SUBSCRIBE_START: Subscribe configuration for task START */
  #define CCM_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define CCM_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define CCM_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_START_CHIDX_Pos)
  #define CCM_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define CCM_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define CCM_SUBSCRIBE_START_EN_Pos (31UL)
  #define CCM_SUBSCRIBE_START_EN_Msk (0x1UL << CCM_SUBSCRIBE_START_EN_Pos)
  #define CCM_SUBSCRIBE_START_EN_Min (0x0UL)
  #define CCM_SUBSCRIBE_START_EN_Max (0x1UL)
  #define CCM_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define CCM_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* CCM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define CCM_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define CCM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define CCM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_STOP_CHIDX_Pos)
  #define CCM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define CCM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define CCM_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define CCM_SUBSCRIBE_STOP_EN_Msk (0x1UL << CCM_SUBSCRIBE_STOP_EN_Pos)
  #define CCM_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define CCM_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define CCM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define CCM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* CCM_SUBSCRIBE_RATEOVERRIDE: Subscribe configuration for task RATEOVERRIDE */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RATEOVERRIDE will subscribe to */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Pos (0UL)
  #define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Msk (0xFFUL << CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Pos)
  #define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Min (0x00UL)
  #define CCM_SUBSCRIBE_RATEOVERRIDE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Pos (31UL)
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Msk (0x1UL << CCM_SUBSCRIBE_RATEOVERRIDE_EN_Pos)
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Min (0x0UL)
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Max (0x1UL)
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Disabled (0x0UL)
  #define CCM_SUBSCRIBE_RATEOVERRIDE_EN_Enabled (0x1UL)


/* CCM_EVENTS_END: Encrypt/decrypt complete or ended because of an error */
  #define CCM_EVENTS_END_ResetValue (0x00000000UL)

/* EVENTS_END @Bit 0 : Encrypt/decrypt complete or ended because of an error */
  #define CCM_EVENTS_END_EVENTS_END_Pos (0UL)
  #define CCM_EVENTS_END_EVENTS_END_Msk (0x1UL << CCM_EVENTS_END_EVENTS_END_Pos)
  #define CCM_EVENTS_END_EVENTS_END_Min (0x0UL)
  #define CCM_EVENTS_END_EVENTS_END_Max (0x1UL)
  #define CCM_EVENTS_END_EVENTS_END_NotGenerated (0x0UL)
  #define CCM_EVENTS_END_EVENTS_END_Generated (0x1UL)


