pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CCM_EVENTS_ERROR: CCM error event */
  #define CCM_EVENTS_ERROR_ResetValue (0x00000000UL)

/* EVENTS_ERROR @Bit 0 : CCM error event */
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << CCM_EVENTS_ERROR_EVENTS_ERROR_Pos)
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL)
  #define CCM_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL)


/* CCM_PUBLISH_END: Publish configuration for event END */
  #define CCM_PUBLISH_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define CCM_PUBLISH_END_CHIDX_Pos (0UL)
  #define CCM_PUBLISH_END_CHIDX_Msk (0xFFUL << CCM_PUBLISH_END_CHIDX_Pos)
  #define CCM_PUBLISH_END_CHIDX_Min (0x00UL)
  #define CCM_PUBLISH_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define CCM_PUBLISH_END_EN_Pos (31UL)
  #define CCM_PUBLISH_END_EN_Msk (0x1UL << CCM_PUBLISH_END_EN_Pos)
  #define CCM_PUBLISH_END_EN_Min (0x0UL)
  #define CCM_PUBLISH_END_EN_Max (0x1UL)
  #define CCM_PUBLISH_END_EN_Disabled (0x0UL)
  #define CCM_PUBLISH_END_EN_Enabled (0x1UL)


/* CCM_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define CCM_PUBLISH_ERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define CCM_PUBLISH_ERROR_CHIDX_Pos (0UL)
  #define CCM_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << CCM_PUBLISH_ERROR_CHIDX_Pos)
  #define CCM_PUBLISH_ERROR_CHIDX_Min (0x00UL)
  #define CCM_PUBLISH_ERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define CCM_PUBLISH_ERROR_EN_Pos (31UL)
  #define CCM_PUBLISH_ERROR_EN_Msk (0x1UL << CCM_PUBLISH_ERROR_EN_Pos)
  #define CCM_PUBLISH_ERROR_EN_Min (0x0UL)
  #define CCM_PUBLISH_ERROR_EN_Max (0x1UL)
  #define CCM_PUBLISH_ERROR_EN_Disabled (0x0UL)
  #define CCM_PUBLISH_ERROR_EN_Enabled (0x1UL)


/* CCM_INTENSET: Enable interrupt */
  #define CCM_INTENSET_ResetValue (0x00000000UL)

/* END @Bit 1 : Write '1' to enable interrupt for event END */
  #define CCM_INTENSET_END_Pos (1UL)
  #define CCM_INTENSET_END_Msk (0x1UL << CCM_INTENSET_END_Pos)
  #define CCM_INTENSET_END_Min (0x0UL)
  #define CCM_INTENSET_END_Max (0x1UL)
  #define CCM_INTENSET_END_Set (0x1UL)
  #define CCM_INTENSET_END_Disabled (0x0UL)
  #define CCM_INTENSET_END_Enabled (0x1UL)

/* ERROR @Bit 2 : Write '1' to enable interrupt for event ERROR */
  #define CCM_INTENSET_ERROR_Pos (2UL)
  #define CCM_INTENSET_ERROR_Msk (0x1UL << CCM_INTENSET_ERROR_Pos)
  #define CCM_INTENSET_ERROR_Min (0x0UL)
  #define CCM_INTENSET_ERROR_Max (0x1UL)
  #define CCM_INTENSET_ERROR_Set (0x1UL)
  #define CCM_INTENSET_ERROR_Disabled (0x0UL)
  #define CCM_INTENSET_ERROR_Enabled (0x1UL)


/* CCM_INTENCLR: Disable interrupt */
  #define CCM_INTENCLR_ResetValue (0x00000000UL)

/* END @Bit 1 : Write '1' to disable interrupt for event END */
  #define CCM_INTENCLR_END_Pos (1UL)
  #define CCM_INTENCLR_END_Msk (0x1UL << CCM_INTENCLR_END_Pos)
  #define CCM_INTENCLR_END_Min (0x0UL)
  #define CCM_INTENCLR_END_Max (0x1UL)
  #define CCM_INTENCLR_END_Clear (0x1UL)
  #define CCM_INTENCLR_END_Disabled (0x0UL)
  #define CCM_INTENCLR_END_Enabled (0x1UL)

/* ERROR @Bit 2 : Write '1' to disable interrupt for event ERROR */
  #define CCM_INTENCLR_ERROR_Pos (2UL)
  #define CCM_INTENCLR_ERROR_Msk (0x1UL << CCM_INTENCLR_ERROR_Pos)
  #define CCM_INTENCLR_ERROR_Min (0x0UL)
  #define CCM_INTENCLR_ERROR_Max (0x1UL)
  #define CCM_INTENCLR_ERROR_Clear (0x1UL)
  #define CCM_INTENCLR_ERROR_Disabled (0x0UL)
  #define CCM_INTENCLR_ERROR_Enabled (0x1UL)


/* CCM_MACSTATUS: MAC check result */
  #define CCM_MACSTATUS_ResetValue (0x00000000UL)

/* MACSTATUS @Bit 0 : The result of the MAC check performed during the previous decryption operation */
  #define CCM_MACSTATUS_MACSTATUS_Pos (0UL)
  #define CCM_MACSTATUS_MACSTATUS_Msk (0x1UL << CCM_MACSTATUS_MACSTATUS_Pos)
  #define CCM_MACSTATUS_MACSTATUS_Min (0x0UL)
  #define CCM_MACSTATUS_MACSTATUS_Max (0x1UL)
  #define CCM_MACSTATUS_MACSTATUS_CheckFailed (0x0UL)
  #define CCM_MACSTATUS_MACSTATUS_CheckPassed (0x1UL)


/* CCM_ERRORSTATUS: Error status */
  #define CCM_ERRORSTATUS_ResetValue (0x00000000UL)

/* ERRORSTATUS @Bits 0..2 : Error status when the ERROR event is generated */
  #define CCM_ERRORSTATUS_ERRORSTATUS_Pos (0UL)
  #define CCM_ERRORSTATUS_ERRORSTATUS_Msk (0x7UL << CCM_ERRORSTATUS_ERRORSTATUS_Pos)
  #define CCM_ERRORSTATUS_ERRORSTATUS_Min (0x0UL)
  #define CCM_ERRORSTATUS_ERRORSTATUS_Max (0x3UL)
  #define CCM_ERRORSTATUS_ERRORSTATUS_NoError (0x0UL)
  #define CCM_ERRORSTATUS_ERRORSTATUS_PrematureInptrEnd (0x1UL)
  #define CCM_ERRORSTATUS_ERRORSTATUS_PrematureOutptrEnd (0x2UL) /*!< End of OUTPTR job list before CCM data structure was
                                                                      read.*/
  #define CCM_ERRORSTATUS_ERRORSTATUS_EncryptionTooSlow (0x3UL) /*!< Encryption of the unencrypted CCM data structure did not
                                                                     complete in time.*/


/* CCM_ENABLE: Enable */
  #define CCM_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bits 0..1 : Enable or disable CCM */
  #define CCM_ENABLE_ENABLE_Pos (0UL)
  #define CCM_ENABLE_ENABLE_Msk (0x3UL << CCM_ENABLE_ENABLE_Pos)
  #define CCM_ENABLE_ENABLE_Min (0x0UL)
  #define CCM_ENABLE_ENABLE_Max (0x2UL)
  #define CCM_ENABLE_ENABLE_Disabled (0x0UL)
  #define CCM_ENABLE_ENABLE_Enabled (0x2UL)


/* CCM_MODE: Operation mode */
  #define CCM_MODE_ResetValue (0x00000001UL)

/* MODE @Bits 0..1 : The mode of operation to be used. The settings in this register apply when the CRYPT task is triggered. */
  #define CCM_MODE_MODE_Pos (0UL)
  #define CCM_MODE_MODE_Msk (0x3UL << CCM_MODE_MODE_Pos)
  #define CCM_MODE_MODE_Min (0x0UL)
  #define CCM_MODE_MODE_Max (0x2UL)
  #define CCM_MODE_MODE_Encryption (0x0UL)
  #define CCM_MODE_MODE_Decryption (0x1UL)
  #define CCM_MODE_MODE_FastDecryption (0x2UL)       /*!< AES fast decrypt mode. This mode will run CCM decryption as fast as
                                                          possible, i.e. not locked to a radio data rate. This can be used when
                                                          a packet has been completely received.*/

/* PROTOCOL @Bits 8..9 : Protocol and packet format selection */
  #define CCM_MODE_PROTOCOL_Pos (8UL)
  #define CCM_MODE_PROTOCOL_Msk (0x3UL << CCM_MODE_PROTOCOL_Pos)
  #define CCM_MODE_PROTOCOL_Min (0x0UL)
  #define CCM_MODE_PROTOCOL_Max (0x1UL)
  #define CCM_MODE_PROTOCOL_Ble (0x0UL)
  #define CCM_MODE_PROTOCOL_Ieee802154 (0x1UL)

/* DATARATE @Bits 16..18 : Radio data rate that the CCM shall run synchronous with */
  #define CCM_MODE_DATARATE_Pos (16UL)
  #define CCM_MODE_DATARATE_Msk (0x7UL << CCM_MODE_DATARATE_Pos)
  #define CCM_MODE_DATARATE_Min (0x0UL)
  #define CCM_MODE_DATARATE_Max (0x5UL)
  #define CCM_MODE_DATARATE_125Kbit (0x0UL)
  #define CCM_MODE_DATARATE_250Kbit (0x1UL)
  #define CCM_MODE_DATARATE_500Kbit (0x2UL)
  #define CCM_MODE_DATARATE_1Mbit (0x3UL)
  #define CCM_MODE_DATARATE_2Mbit (0x4UL)
  #define CCM_MODE_DATARATE_4Mbit (0x5UL)

/* MACLEN @Bits 24..26 : CCM MAC length (bytes) */
  #define CCM_MODE_MACLEN_Pos (24UL)
  #define CCM_MODE_MACLEN_Msk (0x7UL << CCM_MODE_MACLEN_Pos)
  #define CCM_MODE_MACLEN_Min (0x0UL)
  #define CCM_MODE_MACLEN_Max (0x7UL)
  #define CCM_MODE_MACLEN_M0 (0x0UL)                 /*!< M = 0 This is a special case for CCM* where encryption is required but
                                                          not authentication*/
  #define CCM_MODE_MACLEN_M4 (0x1UL)
  #define CCM_MODE_MACLEN_M6 (0x2UL)
  #define CCM_MODE_MACLEN_M8 (0x3UL)
  #define CCM_MODE_MACLEN_M10 (0x4UL)
  #define CCM_MODE_MACLEN_M12 (0x5UL)
  #define CCM_MODE_MACLEN_M14 (0x6UL)
  #define CCM_MODE_MACLEN_M16 (0x7UL)


/* CCM_RATEOVERRIDE: Data rate override setting. */
  #define CCM_RATEOVERRIDE_ResetValue (0x00000002UL)

/* RATEOVERRIDE @Bits 0..2 : Data rate override setting. */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_Pos (0UL)
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_Msk (0x7UL << CCM_RATEOVERRIDE_RATEOVERRIDE_Pos)
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_Min (0x0UL)
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_Max (0x2UL)
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_125Kbit (0x0UL)
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_500Kbit (0x2UL)


/* CCM_ADATAMASK: CCM adata mask. */
  #define CCM_ADATAMASK_ResetValue (0x000000E3UL)

/* ADATAMASK @Bits 0..7 : CCM adata mask. */
  #define CCM_ADATAMASK_ADATAMASK_Pos (0UL)
  #define CCM_ADATAMASK_ADATAMASK_Msk (0xFFUL << CCM_ADATAMASK_ADATAMASK_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           CLIC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct CLIC_CLIC ===================================================== */
/**
  * @brief CLIC [CLIC_CLIC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CLICCFG;
  __IM  uint32_t  CLICINFO;
  __IM  uint32_t  RESERVED[1022];
  __IOM uint32_t  CLICINT[480];
} NRF_CLIC_CLIC_Type;

/* CLIC_CLIC_CLICCFG: CLIC configuration. */
  #define CLIC_CLIC_CLICCFG_ResetValue (0x00000011UL)

/* NVBITS @Bit 0 : Selective interrupt hardware vectoring. */
  #define CLIC_CLIC_CLICCFG_NVBITS_Pos (0UL)
  #define CLIC_CLIC_CLICCFG_NVBITS_Msk (0x1UL << CLIC_CLIC_CLICCFG_NVBITS_Pos)
  #define CLIC_CLIC_CLICCFG_NVBITS_Min (0x1UL)
  #define CLIC_CLIC_CLICCFG_NVBITS_Max (0x1UL)
  #define CLIC_CLIC_CLICCFG_NVBITS_Implemented (0x1UL)

/* NLBITS @Bits 1..4 : Interrupt level encoding. */
  #define CLIC_CLIC_CLICCFG_NLBITS_Pos (1UL)
  #define CLIC_CLIC_CLICCFG_NLBITS_Msk (0xFUL << CLIC_CLIC_CLICCFG_NLBITS_Pos)
  #define CLIC_CLIC_CLICCFG_NLBITS_Min (0x8UL)
  #define CLIC_CLIC_CLICCFG_NLBITS_Max (0x8UL)
  #define CLIC_CLIC_CLICCFG_NLBITS_Eight (0x8UL)

