pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* NMBITS @Bits 5..6 : Interrupt privilege mode. */
  #define CLIC_CLIC_CLICCFG_NMBITS_Pos (5UL)
  #define CLIC_CLIC_CLICCFG_NMBITS_Msk (0x3UL << CLIC_CLIC_CLICCFG_NMBITS_Pos)
  #define CLIC_CLIC_CLICCFG_NMBITS_Min (0x0UL)
  #define CLIC_CLIC_CLICCFG_NMBITS_Max (0x0UL)
  #define CLIC_CLIC_CLICCFG_NMBITS_ModeM (0x0UL)


/* CLIC_CLIC_CLICINFO: CLIC information. */
  #define CLIC_CLIC_CLICINFO_ResetValue (0x00401FFFUL)

/* NUMINTERRUPTS @Bits 0..12 : Maximum number of interrupts supported. */
  #define CLIC_CLIC_CLICINFO_NUMINTERRUPTS_Pos (0UL)
  #define CLIC_CLIC_CLICINFO_NUMINTERRUPTS_Msk (0x1FFFUL << CLIC_CLIC_CLICINFO_NUMINTERRUPTS_Pos) /*!< Bit mask of NUMINTERRUPTS
                                                                            field.*/

/* VERSION @Bits 13..20 : Version */
  #define CLIC_CLIC_CLICINFO_VERSION_Pos (13UL)
  #define CLIC_CLIC_CLICINFO_VERSION_Msk (0xFFUL << CLIC_CLIC_CLICINFO_VERSION_Pos)

/* NUMTRIGGER @Bits 25..30 : Number of maximum interrupt triggers supported */
  #define CLIC_CLIC_CLICINFO_NUMTRIGGER_Pos (25UL)
  #define CLIC_CLIC_CLICINFO_NUMTRIGGER_Msk (0x3FUL << CLIC_CLIC_CLICINFO_NUMTRIGGER_Pos)


/* CLIC_CLIC_CLICINT: Interrupt control register for IRQ number [n]. */
  #define CLIC_CLIC_CLICINT_MaxCount (480UL)
  #define CLIC_CLIC_CLICINT_MaxIndex (479UL)
  #define CLIC_CLIC_CLICINT_MinIndex (0UL)
  #define CLIC_CLIC_CLICINT_ResetValue (0x3FC30000UL)

/* IP @Bit 0 : Interrupt Pending bit. */
  #define CLIC_CLIC_CLICINT_IP_Pos (0UL)
  #define CLIC_CLIC_CLICINT_IP_Msk (0x1UL << CLIC_CLIC_CLICINT_IP_Pos)
  #define CLIC_CLIC_CLICINT_IP_Min (0x0UL)
  #define CLIC_CLIC_CLICINT_IP_Max (0x1UL)
  #define CLIC_CLIC_CLICINT_IP_NotPending (0x0UL)
  #define CLIC_CLIC_CLICINT_IP_Pending (0x1UL)

/* READ1 @Bits 1..7 : Read as 0, write ignored. */
  #define CLIC_CLIC_CLICINT_READ1_Pos (1UL)
  #define CLIC_CLIC_CLICINT_READ1_Msk (0x7FUL << CLIC_CLIC_CLICINT_READ1_Pos)

/* IE @Bit 8 : Interrupt enable bit. */
  #define CLIC_CLIC_CLICINT_IE_Pos (8UL)
  #define CLIC_CLIC_CLICINT_IE_Msk (0x1UL << CLIC_CLIC_CLICINT_IE_Pos)
  #define CLIC_CLIC_CLICINT_IE_Min (0x0UL)
  #define CLIC_CLIC_CLICINT_IE_Max (0x1UL)
  #define CLIC_CLIC_CLICINT_IE_Disabled (0x0UL)
  #define CLIC_CLIC_CLICINT_IE_Enabled (0x1UL)

/* READ2 @Bits 9..15 : Read as 0, write ignored. */
  #define CLIC_CLIC_CLICINT_READ2_Pos (9UL)
  #define CLIC_CLIC_CLICINT_READ2_Msk (0x7FUL << CLIC_CLIC_CLICINT_READ2_Pos)

/* SHV @Bit 16 : Selective Hardware Vectoring. */
  #define CLIC_CLIC_CLICINT_SHV_Pos (16UL)
  #define CLIC_CLIC_CLICINT_SHV_Msk (0x1UL << CLIC_CLIC_CLICINT_SHV_Pos)
  #define CLIC_CLIC_CLICINT_SHV_Min (0x1UL)
  #define CLIC_CLIC_CLICINT_SHV_Max (0x1UL)
  #define CLIC_CLIC_CLICINT_SHV_Vectored (0x1UL)

/* TRIG @Bits 17..18 : Trigger type and polarity for each interrupt input. */
  #define CLIC_CLIC_CLICINT_TRIG_Pos (17UL)
  #define CLIC_CLIC_CLICINT_TRIG_Msk (0x3UL << CLIC_CLIC_CLICINT_TRIG_Pos)
  #define CLIC_CLIC_CLICINT_TRIG_Min (0x1UL)
  #define CLIC_CLIC_CLICINT_TRIG_Max (0x1UL)
  #define CLIC_CLIC_CLICINT_TRIG_EdgeTriggered (0x1UL)

/* MODE @Bits 22..23 : Privilege mode. */
  #define CLIC_CLIC_CLICINT_MODE_Pos (22UL)
  #define CLIC_CLIC_CLICINT_MODE_Msk (0x3UL << CLIC_CLIC_CLICINT_MODE_Pos)
  #define CLIC_CLIC_CLICINT_MODE_Min (0x3UL)
  #define CLIC_CLIC_CLICINT_MODE_Max (0x3UL)
  #define CLIC_CLIC_CLICINT_MODE_MachineMode (0x3UL)

/* PRIORITY @Bits 24..31 : Interrupt priority level */
  #define CLIC_CLIC_CLICINT_PRIORITY_Pos (24UL)
  #define CLIC_CLIC_CLICINT_PRIORITY_Msk (0xFFUL << CLIC_CLIC_CLICINT_PRIORITY_Pos)
  #define CLIC_CLIC_CLICINT_PRIORITY_Min (0x3FUL)
  #define CLIC_CLIC_CLICINT_PRIORITY_Max (0xFFUL)
  #define CLIC_CLIC_CLICINT_PRIORITY_PRIOLEVEL0 (0x3FUL)
  #define CLIC_CLIC_CLICINT_PRIORITY_PRIOLEVEL1 (0x7FUL)
  #define CLIC_CLIC_CLICINT_PRIORITY_PRIOLEVEL2 (0xBFUL)
  #define CLIC_CLIC_CLICINT_PRIORITY_PRIOLEVEL3 (0xFFUL)


/* ======================================================= Struct CLIC ======================================================= */
/**
  * @brief VPR CLIC registers
  */
  typedef struct {
    __IOM NRF_CLIC_CLIC_Type CLIC;
  } NRF_CLIC_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          CM33SS                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct CM33SS ====================================================== */
/**
  * @brief CM33 SubSystem
  */
  typedef struct {
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_FPUIOC;                    /*!< (@ 0x00000100) An invalid operation exception has occurred in the
                                                                         FPU.*/
    __IOM uint32_t EVENTS_FPUDZC;                    /*!< (@ 0x00000104) A floating-point divide-by-zero exception has occurred
                                                                         in the FPU.*/
    __IOM uint32_t EVENTS_FPUOFC;                    /*!< (@ 0x00000108) A floating-point overflow exception has occurred in the
                                                                         FPU.*/
    __IOM uint32_t EVENTS_FPUUFC;                    /*!< (@ 0x0000010C) A floating-point underflow exception has occurred in
                                                                         the FPU.*/
    __IOM uint32_t EVENTS_FPUIXC;                    /*!< (@ 0x00000110) A floating-point inexact exception has occurred in the
                                                                         FPU.*/
    __IOM uint32_t EVENTS_FPUIDC;                    /*!< (@ 0x00000114) A floating-point input denormal exception has occurred
                                                                         in the FPU.*/
    __IM uint32_t RESERVED1[250];
    __IOM uint32_t LOCK;                             /*!< (@ 0x00000500) Register to lock the certain parts of the CPU from
                                                                         being modified.*/
    __IM uint32_t CPUID;
  } NRF_CM33SS_Type;

/* CM33SS_EVENTS_FPUIOC: An invalid operation exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIOC_ResetValue (0x00000000UL)

/* EVENTS_FPUIOC @Bit 0 : An invalid operation exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Pos (0UL)
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Msk (0x1UL << CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUIOC field.*/
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Min (0x0UL)
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Max (0x1UL)
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_NotGenerated (0x0UL)
  #define CM33SS_EVENTS_FPUIOC_EVENTS_FPUIOC_Generated (0x1UL)


