pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CM33SS_EVENTS_FPUDZC: A floating-point divide-by-zero exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUDZC_ResetValue (0x00000000UL)

/* EVENTS_FPUDZC @Bit 0 : A floating-point divide-by-zero exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Pos (0UL)
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Msk (0x1UL << CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUDZC field.*/
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Min (0x0UL)
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Max (0x1UL)
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_NotGenerated (0x0UL)
  #define CM33SS_EVENTS_FPUDZC_EVENTS_FPUDZC_Generated (0x1UL)


/* CM33SS_EVENTS_FPUOFC: A floating-point overflow exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUOFC_ResetValue (0x00000000UL)

/* EVENTS_FPUOFC @Bit 0 : A floating-point overflow exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Pos (0UL)
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Msk (0x1UL << CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUOFC field.*/
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Min (0x0UL)
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Max (0x1UL)
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_NotGenerated (0x0UL)
  #define CM33SS_EVENTS_FPUOFC_EVENTS_FPUOFC_Generated (0x1UL)


/* CM33SS_EVENTS_FPUUFC: A floating-point underflow exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUUFC_ResetValue (0x00000000UL)

/* EVENTS_FPUUFC @Bit 0 : A floating-point underflow exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Pos (0UL)
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Msk (0x1UL << CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUUFC field.*/
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Min (0x0UL)
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Max (0x1UL)
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_NotGenerated (0x0UL)
  #define CM33SS_EVENTS_FPUUFC_EVENTS_FPUUFC_Generated (0x1UL)


/* CM33SS_EVENTS_FPUIXC: A floating-point inexact exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIXC_ResetValue (0x00000000UL)

/* EVENTS_FPUIXC @Bit 0 : A floating-point inexact exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Pos (0UL)
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Msk (0x1UL << CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUIXC field.*/
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Min (0x0UL)
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Max (0x1UL)
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_NotGenerated (0x0UL)
  #define CM33SS_EVENTS_FPUIXC_EVENTS_FPUIXC_Generated (0x1UL)


/* CM33SS_EVENTS_FPUIDC: A floating-point input denormal exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIDC_ResetValue (0x00000000UL)

/* EVENTS_FPUIDC @Bit 0 : A floating-point input denormal exception has occurred in the FPU. */
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Pos (0UL)
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Msk (0x1UL << CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Pos) /*!< Bit mask of
                                                                            EVENTS_FPUIDC field.*/
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Min (0x0UL)
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Max (0x1UL)
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_NotGenerated (0x0UL)
  #define CM33SS_EVENTS_FPUIDC_EVENTS_FPUIDC_Generated (0x1UL)


/* CM33SS_LOCK: Register to lock the certain parts of the CPU from being modified. */
  #define CM33SS_LOCK_ResetValue (0x00000000UL)

/* LOCKVTORAIRCRS @Bit 0 : Locks both the Vector table Offset Register (VTOR) and Application Interrupt and Reset Control
                           Register (AIRCR) for secure mode. */

  #define CM33SS_LOCK_LOCKVTORAIRCRS_Pos (0UL)
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Msk (0x1UL << CM33SS_LOCK_LOCKVTORAIRCRS_Pos)
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Min (0x0UL)
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Max (0x1UL)
  #define CM33SS_LOCK_LOCKVTORAIRCRS_NotLocked (0x0UL)
  #define CM33SS_LOCK_LOCKVTORAIRCRS_Locked (0x1UL)

/* LOCKVTORNS @Bit 1 : Locks the Vector table Offset Register (VTOR) for non-secure mode. */
  #define CM33SS_LOCK_LOCKVTORNS_Pos (1UL)
  #define CM33SS_LOCK_LOCKVTORNS_Msk (0x1UL << CM33SS_LOCK_LOCKVTORNS_Pos)
  #define CM33SS_LOCK_LOCKVTORNS_Min (0x0UL)
  #define CM33SS_LOCK_LOCKVTORNS_Max (0x1UL)
  #define CM33SS_LOCK_LOCKVTORNS_NotLocked (0x0UL)
  #define CM33SS_LOCK_LOCKVTORNS_Locked (0x1UL)

/* LOCKMPUS @Bit 2 : Locks the Memory Protection Unit (MPU) for secure mode. */
  #define CM33SS_LOCK_LOCKMPUS_Pos (2UL)
  #define CM33SS_LOCK_LOCKMPUS_Msk (0x1UL << CM33SS_LOCK_LOCKMPUS_Pos)
  #define CM33SS_LOCK_LOCKMPUS_Min (0x0UL)
  #define CM33SS_LOCK_LOCKMPUS_Max (0x1UL)
  #define CM33SS_LOCK_LOCKMPUS_NotLocked (0x0UL)
  #define CM33SS_LOCK_LOCKMPUS_Locked (0x1UL)

/* LOCKMPUNS @Bit 3 : Locks the Memory Protection Unit (MPU) for non secure mode. */
  #define CM33SS_LOCK_LOCKMPUNS_Pos (3UL)
  #define CM33SS_LOCK_LOCKMPUNS_Msk (0x1UL << CM33SS_LOCK_LOCKMPUNS_Pos)
  #define CM33SS_LOCK_LOCKMPUNS_Min (0x0UL)
  #define CM33SS_LOCK_LOCKMPUNS_Max (0x1UL)
  #define CM33SS_LOCK_LOCKMPUNS_NotLocked (0x0UL)
  #define CM33SS_LOCK_LOCKMPUNS_Locked (0x1UL)

/* LOCKSAU @Bit 4 : Locks the Security Attribution Unit (SAU) */
  #define CM33SS_LOCK_LOCKSAU_Pos (4UL)
  #define CM33SS_LOCK_LOCKSAU_Msk (0x1UL << CM33SS_LOCK_LOCKSAU_Pos)
  #define CM33SS_LOCK_LOCKSAU_Min (0x0UL)
  #define CM33SS_LOCK_LOCKSAU_Max (0x1UL)
  #define CM33SS_LOCK_LOCKSAU_NotLocked (0x0UL)
  #define CM33SS_LOCK_LOCKSAU_Locked (0x1UL)


/* CM33SS_CPUID: The identifier for the CPU in this subsystem. */
  #define CM33SS_CPUID_ResetValue (0x00000000UL)

/* CPUID @Bits 0..31 : The CPU identifier. */
  #define CM33SS_CPUID_CPUID_Pos (0UL)
  #define CM33SS_CPUID_CPUID_Msk (0xFFFFFFFFUL << CM33SS_CPUID_CPUID_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           COMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct COMP ======================================================= */
/**
  * @brief Comparator
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_SAMPLE;
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_SAMPLE;
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;
    __IOM uint32_t EVENTS_DOWN;
    __IOM uint32_t EVENTS_UP;
    __IOM uint32_t EVENTS_CROSS;
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;
    __IOM uint32_t PUBLISH_DOWN;
    __IOM uint32_t PUBLISH_UP;
    __IOM uint32_t PUBLISH_CROSS;
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED5[60];
    __IM uint32_t RESULT;
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t ENABLE;
    __IOM uint32_t PSEL;
    __IOM uint32_t REFSEL;
    __IOM uint32_t EXTREFSEL;
    __IM uint32_t RESERVED7[8];
    __IOM uint32_t TH;
    __IOM uint32_t MODE;
    __IOM uint32_t HYST;
    __IOM uint32_t ISOURCE;
  } NRF_COMP_Type;

/* COMP_TASKS_START: Start comparator */
  #define COMP_TASKS_START_ResetValue (0x00000000UL)

