pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS_START @Bit 0 : Start comparator */
  #define COMP_TASKS_START_TASKS_START_Pos (0UL)
  #define COMP_TASKS_START_TASKS_START_Msk (0x1UL << COMP_TASKS_START_TASKS_START_Pos)
  #define COMP_TASKS_START_TASKS_START_Min (0x1UL)
  #define COMP_TASKS_START_TASKS_START_Max (0x1UL)
  #define COMP_TASKS_START_TASKS_START_Trigger (0x1UL)


/* COMP_TASKS_STOP: Stop comparator */
  #define COMP_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop comparator */
  #define COMP_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define COMP_TASKS_STOP_TASKS_STOP_Msk (0x1UL << COMP_TASKS_STOP_TASKS_STOP_Pos)
  #define COMP_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define COMP_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define COMP_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* COMP_TASKS_SAMPLE: Sample comparator value */
  #define COMP_TASKS_SAMPLE_ResetValue (0x00000000UL)

/* TASKS_SAMPLE @Bit 0 : Sample comparator value */
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos (0UL)
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Msk (0x1UL << COMP_TASKS_SAMPLE_TASKS_SAMPLE_Pos)
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Min (0x1UL)
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Max (0x1UL)
  #define COMP_TASKS_SAMPLE_TASKS_SAMPLE_Trigger (0x1UL)


/* COMP_SUBSCRIBE_START: Subscribe configuration for task START */
  #define COMP_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define COMP_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define COMP_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << COMP_SUBSCRIBE_START_CHIDX_Pos)
  #define COMP_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define COMP_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define COMP_SUBSCRIBE_START_EN_Pos (31UL)
  #define COMP_SUBSCRIBE_START_EN_Msk (0x1UL << COMP_SUBSCRIBE_START_EN_Pos)
  #define COMP_SUBSCRIBE_START_EN_Min (0x0UL)
  #define COMP_SUBSCRIBE_START_EN_Max (0x1UL)
  #define COMP_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define COMP_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* COMP_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define COMP_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define COMP_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define COMP_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << COMP_SUBSCRIBE_STOP_CHIDX_Pos)
  #define COMP_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define COMP_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define COMP_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define COMP_SUBSCRIBE_STOP_EN_Msk (0x1UL << COMP_SUBSCRIBE_STOP_EN_Pos)
  #define COMP_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define COMP_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define COMP_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define COMP_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* COMP_SUBSCRIBE_SAMPLE: Subscribe configuration for task SAMPLE */
  #define COMP_SUBSCRIBE_SAMPLE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SAMPLE will subscribe to */
  #define COMP_SUBSCRIBE_SAMPLE_CHIDX_Pos (0UL)
  #define COMP_SUBSCRIBE_SAMPLE_CHIDX_Msk (0xFFUL << COMP_SUBSCRIBE_SAMPLE_CHIDX_Pos)
  #define COMP_SUBSCRIBE_SAMPLE_CHIDX_Min (0x00UL)
  #define COMP_SUBSCRIBE_SAMPLE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define COMP_SUBSCRIBE_SAMPLE_EN_Pos (31UL)
  #define COMP_SUBSCRIBE_SAMPLE_EN_Msk (0x1UL << COMP_SUBSCRIBE_SAMPLE_EN_Pos)
  #define COMP_SUBSCRIBE_SAMPLE_EN_Min (0x0UL)
  #define COMP_SUBSCRIBE_SAMPLE_EN_Max (0x1UL)
  #define COMP_SUBSCRIBE_SAMPLE_EN_Disabled (0x0UL)
  #define COMP_SUBSCRIBE_SAMPLE_EN_Enabled (0x1UL)


/* COMP_EVENTS_READY: COMP is ready and output is valid */
  #define COMP_EVENTS_READY_ResetValue (0x00000000UL)

/* EVENTS_READY @Bit 0 : COMP is ready and output is valid */
  #define COMP_EVENTS_READY_EVENTS_READY_Pos (0UL)
  #define COMP_EVENTS_READY_EVENTS_READY_Msk (0x1UL << COMP_EVENTS_READY_EVENTS_READY_Pos)
  #define COMP_EVENTS_READY_EVENTS_READY_Min (0x0UL)
  #define COMP_EVENTS_READY_EVENTS_READY_Max (0x1UL)
  #define COMP_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL)
  #define COMP_EVENTS_READY_EVENTS_READY_Generated (0x1UL)


/* COMP_EVENTS_DOWN: Downward crossing */
  #define COMP_EVENTS_DOWN_ResetValue (0x00000000UL)

/* EVENTS_DOWN @Bit 0 : Downward crossing */
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Pos (0UL)
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Msk (0x1UL << COMP_EVENTS_DOWN_EVENTS_DOWN_Pos)
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Min (0x0UL)
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Max (0x1UL)
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_NotGenerated (0x0UL)
  #define COMP_EVENTS_DOWN_EVENTS_DOWN_Generated (0x1UL)


/* COMP_EVENTS_UP: Upward crossing */
  #define COMP_EVENTS_UP_ResetValue (0x00000000UL)

/* EVENTS_UP @Bit 0 : Upward crossing */
  #define COMP_EVENTS_UP_EVENTS_UP_Pos (0UL)
  #define COMP_EVENTS_UP_EVENTS_UP_Msk (0x1UL << COMP_EVENTS_UP_EVENTS_UP_Pos)
  #define COMP_EVENTS_UP_EVENTS_UP_Min (0x0UL)
  #define COMP_EVENTS_UP_EVENTS_UP_Max (0x1UL)
  #define COMP_EVENTS_UP_EVENTS_UP_NotGenerated (0x0UL)
  #define COMP_EVENTS_UP_EVENTS_UP_Generated (0x1UL)


/* COMP_EVENTS_CROSS: Downward or upward crossing */
  #define COMP_EVENTS_CROSS_ResetValue (0x00000000UL)

/* EVENTS_CROSS @Bit 0 : Downward or upward crossing */
  #define COMP_EVENTS_CROSS_EVENTS_CROSS_Pos (0UL)
  #define COMP_EVENTS_CROSS_EVENTS_CROSS_Msk (0x1UL << COMP_EVENTS_CROSS_EVENTS_CROSS_Pos)
  #define COMP_EVENTS_CROSS_EVENTS_CROSS_Min (0x0UL)
  #define COMP_EVENTS_CROSS_EVENTS_CROSS_Max (0x1UL)
  #define COMP_EVENTS_CROSS_EVENTS_CROSS_NotGenerated (0x0UL)
  #define COMP_EVENTS_CROSS_EVENTS_CROSS_Generated (0x1UL)


/* COMP_PUBLISH_READY: Publish configuration for event READY */
  #define COMP_PUBLISH_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define COMP_PUBLISH_READY_CHIDX_Pos (0UL)
  #define COMP_PUBLISH_READY_CHIDX_Msk (0xFFUL << COMP_PUBLISH_READY_CHIDX_Pos)
  #define COMP_PUBLISH_READY_CHIDX_Min (0x00UL)
  #define COMP_PUBLISH_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define COMP_PUBLISH_READY_EN_Pos (31UL)
  #define COMP_PUBLISH_READY_EN_Msk (0x1UL << COMP_PUBLISH_READY_EN_Pos)
  #define COMP_PUBLISH_READY_EN_Min (0x0UL)
  #define COMP_PUBLISH_READY_EN_Max (0x1UL)
  #define COMP_PUBLISH_READY_EN_Disabled (0x0UL)
  #define COMP_PUBLISH_READY_EN_Enabled (0x1UL)


