pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMP_PUBLISH_DOWN: Publish configuration for event DOWN */
  #define COMP_PUBLISH_DOWN_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event DOWN will publish to */
  #define COMP_PUBLISH_DOWN_CHIDX_Pos (0UL)
  #define COMP_PUBLISH_DOWN_CHIDX_Msk (0xFFUL << COMP_PUBLISH_DOWN_CHIDX_Pos)
  #define COMP_PUBLISH_DOWN_CHIDX_Min (0x00UL)
  #define COMP_PUBLISH_DOWN_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define COMP_PUBLISH_DOWN_EN_Pos (31UL)
  #define COMP_PUBLISH_DOWN_EN_Msk (0x1UL << COMP_PUBLISH_DOWN_EN_Pos)
  #define COMP_PUBLISH_DOWN_EN_Min (0x0UL)
  #define COMP_PUBLISH_DOWN_EN_Max (0x1UL)
  #define COMP_PUBLISH_DOWN_EN_Disabled (0x0UL)
  #define COMP_PUBLISH_DOWN_EN_Enabled (0x1UL)


/* COMP_PUBLISH_UP: Publish configuration for event UP */
  #define COMP_PUBLISH_UP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event UP will publish to */
  #define COMP_PUBLISH_UP_CHIDX_Pos (0UL)
  #define COMP_PUBLISH_UP_CHIDX_Msk (0xFFUL << COMP_PUBLISH_UP_CHIDX_Pos)
  #define COMP_PUBLISH_UP_CHIDX_Min (0x00UL)
  #define COMP_PUBLISH_UP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define COMP_PUBLISH_UP_EN_Pos (31UL)
  #define COMP_PUBLISH_UP_EN_Msk (0x1UL << COMP_PUBLISH_UP_EN_Pos)
  #define COMP_PUBLISH_UP_EN_Min (0x0UL)
  #define COMP_PUBLISH_UP_EN_Max (0x1UL)
  #define COMP_PUBLISH_UP_EN_Disabled (0x0UL)
  #define COMP_PUBLISH_UP_EN_Enabled (0x1UL)


/* COMP_PUBLISH_CROSS: Publish configuration for event CROSS */
  #define COMP_PUBLISH_CROSS_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CROSS will publish to */
  #define COMP_PUBLISH_CROSS_CHIDX_Pos (0UL)
  #define COMP_PUBLISH_CROSS_CHIDX_Msk (0xFFUL << COMP_PUBLISH_CROSS_CHIDX_Pos)
  #define COMP_PUBLISH_CROSS_CHIDX_Min (0x00UL)
  #define COMP_PUBLISH_CROSS_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define COMP_PUBLISH_CROSS_EN_Pos (31UL)
  #define COMP_PUBLISH_CROSS_EN_Msk (0x1UL << COMP_PUBLISH_CROSS_EN_Pos)
  #define COMP_PUBLISH_CROSS_EN_Min (0x0UL)
  #define COMP_PUBLISH_CROSS_EN_Max (0x1UL)
  #define COMP_PUBLISH_CROSS_EN_Disabled (0x0UL)
  #define COMP_PUBLISH_CROSS_EN_Enabled (0x1UL)


/* COMP_SHORTS: Shortcuts between local events and tasks */
  #define COMP_SHORTS_ResetValue (0x00000000UL)

/* READY_SAMPLE @Bit 0 : Shortcut between event READY and task SAMPLE */
  #define COMP_SHORTS_READY_SAMPLE_Pos (0UL)
  #define COMP_SHORTS_READY_SAMPLE_Msk (0x1UL << COMP_SHORTS_READY_SAMPLE_Pos)
  #define COMP_SHORTS_READY_SAMPLE_Min (0x0UL)
  #define COMP_SHORTS_READY_SAMPLE_Max (0x1UL)
  #define COMP_SHORTS_READY_SAMPLE_Disabled (0x0UL)
  #define COMP_SHORTS_READY_SAMPLE_Enabled (0x1UL)

/* READY_STOP @Bit 1 : Shortcut between event READY and task STOP */
  #define COMP_SHORTS_READY_STOP_Pos (1UL)
  #define COMP_SHORTS_READY_STOP_Msk (0x1UL << COMP_SHORTS_READY_STOP_Pos)
  #define COMP_SHORTS_READY_STOP_Min (0x0UL)
  #define COMP_SHORTS_READY_STOP_Max (0x1UL)
  #define COMP_SHORTS_READY_STOP_Disabled (0x0UL)
  #define COMP_SHORTS_READY_STOP_Enabled (0x1UL)

/* DOWN_STOP @Bit 2 : Shortcut between event DOWN and task STOP */
  #define COMP_SHORTS_DOWN_STOP_Pos (2UL)
  #define COMP_SHORTS_DOWN_STOP_Msk (0x1UL << COMP_SHORTS_DOWN_STOP_Pos)
  #define COMP_SHORTS_DOWN_STOP_Min (0x0UL)
  #define COMP_SHORTS_DOWN_STOP_Max (0x1UL)
  #define COMP_SHORTS_DOWN_STOP_Disabled (0x0UL)
  #define COMP_SHORTS_DOWN_STOP_Enabled (0x1UL)

/* UP_STOP @Bit 3 : Shortcut between event UP and task STOP */
  #define COMP_SHORTS_UP_STOP_Pos (3UL)
  #define COMP_SHORTS_UP_STOP_Msk (0x1UL << COMP_SHORTS_UP_STOP_Pos)
  #define COMP_SHORTS_UP_STOP_Min (0x0UL)
  #define COMP_SHORTS_UP_STOP_Max (0x1UL)
  #define COMP_SHORTS_UP_STOP_Disabled (0x0UL)
  #define COMP_SHORTS_UP_STOP_Enabled (0x1UL)

/* CROSS_STOP @Bit 4 : Shortcut between event CROSS and task STOP */
  #define COMP_SHORTS_CROSS_STOP_Pos (4UL)
  #define COMP_SHORTS_CROSS_STOP_Msk (0x1UL << COMP_SHORTS_CROSS_STOP_Pos)
  #define COMP_SHORTS_CROSS_STOP_Min (0x0UL)
  #define COMP_SHORTS_CROSS_STOP_Max (0x1UL)
  #define COMP_SHORTS_CROSS_STOP_Disabled (0x0UL)
  #define COMP_SHORTS_CROSS_STOP_Enabled (0x1UL)


/* COMP_INTEN: Enable or disable interrupt */
  #define COMP_INTEN_ResetValue (0x00000000UL)

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define COMP_INTEN_READY_Pos (0UL)
  #define COMP_INTEN_READY_Msk (0x1UL << COMP_INTEN_READY_Pos)
  #define COMP_INTEN_READY_Min (0x0UL)
  #define COMP_INTEN_READY_Max (0x1UL)
  #define COMP_INTEN_READY_Disabled (0x0UL)
  #define COMP_INTEN_READY_Enabled (0x1UL)

/* DOWN @Bit 1 : Enable or disable interrupt for event DOWN */
  #define COMP_INTEN_DOWN_Pos (1UL)
  #define COMP_INTEN_DOWN_Msk (0x1UL << COMP_INTEN_DOWN_Pos)
  #define COMP_INTEN_DOWN_Min (0x0UL)
  #define COMP_INTEN_DOWN_Max (0x1UL)
  #define COMP_INTEN_DOWN_Disabled (0x0UL)
  #define COMP_INTEN_DOWN_Enabled (0x1UL)

/* UP @Bit 2 : Enable or disable interrupt for event UP */
  #define COMP_INTEN_UP_Pos (2UL)
  #define COMP_INTEN_UP_Msk (0x1UL << COMP_INTEN_UP_Pos)
  #define COMP_INTEN_UP_Min (0x0UL)
  #define COMP_INTEN_UP_Max (0x1UL)
  #define COMP_INTEN_UP_Disabled (0x0UL)
  #define COMP_INTEN_UP_Enabled (0x1UL)

/* CROSS @Bit 3 : Enable or disable interrupt for event CROSS */
  #define COMP_INTEN_CROSS_Pos (3UL)
  #define COMP_INTEN_CROSS_Msk (0x1UL << COMP_INTEN_CROSS_Pos)
  #define COMP_INTEN_CROSS_Min (0x0UL)
  #define COMP_INTEN_CROSS_Max (0x1UL)
  #define COMP_INTEN_CROSS_Disabled (0x0UL)
  #define COMP_INTEN_CROSS_Enabled (0x1UL)


/* COMP_INTENSET: Enable interrupt */
  #define COMP_INTENSET_ResetValue (0x00000000UL)

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define COMP_INTENSET_READY_Pos (0UL)
  #define COMP_INTENSET_READY_Msk (0x1UL << COMP_INTENSET_READY_Pos)
  #define COMP_INTENSET_READY_Min (0x0UL)
  #define COMP_INTENSET_READY_Max (0x1UL)
  #define COMP_INTENSET_READY_Set (0x1UL)
  #define COMP_INTENSET_READY_Disabled (0x0UL)
  #define COMP_INTENSET_READY_Enabled (0x1UL)

/* DOWN @Bit 1 : Write '1' to enable interrupt for event DOWN */
  #define COMP_INTENSET_DOWN_Pos (1UL)
  #define COMP_INTENSET_DOWN_Msk (0x1UL << COMP_INTENSET_DOWN_Pos)
  #define COMP_INTENSET_DOWN_Min (0x0UL)
  #define COMP_INTENSET_DOWN_Max (0x1UL)
  #define COMP_INTENSET_DOWN_Set (0x1UL)
  #define COMP_INTENSET_DOWN_Disabled (0x0UL)
  #define COMP_INTENSET_DOWN_Enabled (0x1UL)

/* UP @Bit 2 : Write '1' to enable interrupt for event UP */
  #define COMP_INTENSET_UP_Pos (2UL)
  #define COMP_INTENSET_UP_Msk (0x1UL << COMP_INTENSET_UP_Pos)
  #define COMP_INTENSET_UP_Min (0x0UL)
  #define COMP_INTENSET_UP_Max (0x1UL)
  #define COMP_INTENSET_UP_Set (0x1UL)
  #define COMP_INTENSET_UP_Disabled (0x0UL)
  #define COMP_INTENSET_UP_Enabled (0x1UL)

/* CROSS @Bit 3 : Write '1' to enable interrupt for event CROSS */
  #define COMP_INTENSET_CROSS_Pos (3UL)
  #define COMP_INTENSET_CROSS_Msk (0x1UL << COMP_INTENSET_CROSS_Pos)
  #define COMP_INTENSET_CROSS_Min (0x0UL)
  #define COMP_INTENSET_CROSS_Max (0x1UL)
  #define COMP_INTENSET_CROSS_Set (0x1UL)
  #define COMP_INTENSET_CROSS_Disabled (0x0UL)
  #define COMP_INTENSET_CROSS_Enabled (0x1UL)


