pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMP_INTENCLR: Disable interrupt */
  #define COMP_INTENCLR_ResetValue (0x00000000UL)

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define COMP_INTENCLR_READY_Pos (0UL)
  #define COMP_INTENCLR_READY_Msk (0x1UL << COMP_INTENCLR_READY_Pos)
  #define COMP_INTENCLR_READY_Min (0x0UL)
  #define COMP_INTENCLR_READY_Max (0x1UL)
  #define COMP_INTENCLR_READY_Clear (0x1UL)
  #define COMP_INTENCLR_READY_Disabled (0x0UL)
  #define COMP_INTENCLR_READY_Enabled (0x1UL)

/* DOWN @Bit 1 : Write '1' to disable interrupt for event DOWN */
  #define COMP_INTENCLR_DOWN_Pos (1UL)
  #define COMP_INTENCLR_DOWN_Msk (0x1UL << COMP_INTENCLR_DOWN_Pos)
  #define COMP_INTENCLR_DOWN_Min (0x0UL)
  #define COMP_INTENCLR_DOWN_Max (0x1UL)
  #define COMP_INTENCLR_DOWN_Clear (0x1UL)
  #define COMP_INTENCLR_DOWN_Disabled (0x0UL)
  #define COMP_INTENCLR_DOWN_Enabled (0x1UL)

/* UP @Bit 2 : Write '1' to disable interrupt for event UP */
  #define COMP_INTENCLR_UP_Pos (2UL)
  #define COMP_INTENCLR_UP_Msk (0x1UL << COMP_INTENCLR_UP_Pos)
  #define COMP_INTENCLR_UP_Min (0x0UL)
  #define COMP_INTENCLR_UP_Max (0x1UL)
  #define COMP_INTENCLR_UP_Clear (0x1UL)
  #define COMP_INTENCLR_UP_Disabled (0x0UL)
  #define COMP_INTENCLR_UP_Enabled (0x1UL)

/* CROSS @Bit 3 : Write '1' to disable interrupt for event CROSS */
  #define COMP_INTENCLR_CROSS_Pos (3UL)
  #define COMP_INTENCLR_CROSS_Msk (0x1UL << COMP_INTENCLR_CROSS_Pos)
  #define COMP_INTENCLR_CROSS_Min (0x0UL)
  #define COMP_INTENCLR_CROSS_Max (0x1UL)
  #define COMP_INTENCLR_CROSS_Clear (0x1UL)
  #define COMP_INTENCLR_CROSS_Disabled (0x0UL)
  #define COMP_INTENCLR_CROSS_Enabled (0x1UL)


/* COMP_INTPEND: Pending interrupts */
  #define COMP_INTPEND_ResetValue (0x00000000UL)

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define COMP_INTPEND_READY_Pos (0UL)
  #define COMP_INTPEND_READY_Msk (0x1UL << COMP_INTPEND_READY_Pos)
  #define COMP_INTPEND_READY_Min (0x0UL)
  #define COMP_INTPEND_READY_Max (0x1UL)
  #define COMP_INTPEND_READY_NotPending (0x0UL)
  #define COMP_INTPEND_READY_Pending (0x1UL)

/* DOWN @Bit 1 : Read pending status of interrupt for event DOWN */
  #define COMP_INTPEND_DOWN_Pos (1UL)
  #define COMP_INTPEND_DOWN_Msk (0x1UL << COMP_INTPEND_DOWN_Pos)
  #define COMP_INTPEND_DOWN_Min (0x0UL)
  #define COMP_INTPEND_DOWN_Max (0x1UL)
  #define COMP_INTPEND_DOWN_NotPending (0x0UL)
  #define COMP_INTPEND_DOWN_Pending (0x1UL)

/* UP @Bit 2 : Read pending status of interrupt for event UP */
  #define COMP_INTPEND_UP_Pos (2UL)
  #define COMP_INTPEND_UP_Msk (0x1UL << COMP_INTPEND_UP_Pos)
  #define COMP_INTPEND_UP_Min (0x0UL)
  #define COMP_INTPEND_UP_Max (0x1UL)
  #define COMP_INTPEND_UP_NotPending (0x0UL)
  #define COMP_INTPEND_UP_Pending (0x1UL)

/* CROSS @Bit 3 : Read pending status of interrupt for event CROSS */
  #define COMP_INTPEND_CROSS_Pos (3UL)
  #define COMP_INTPEND_CROSS_Msk (0x1UL << COMP_INTPEND_CROSS_Pos)
  #define COMP_INTPEND_CROSS_Min (0x0UL)
  #define COMP_INTPEND_CROSS_Max (0x1UL)
  #define COMP_INTPEND_CROSS_NotPending (0x0UL)
  #define COMP_INTPEND_CROSS_Pending (0x1UL)


/* COMP_RESULT: Compare result */
  #define COMP_RESULT_ResetValue (0x00000000UL)

/* RESULT @Bit 0 : Result of last compare. Decision point SAMPLE task. */
  #define COMP_RESULT_RESULT_Pos (0UL)
  #define COMP_RESULT_RESULT_Msk (0x1UL << COMP_RESULT_RESULT_Pos)
  #define COMP_RESULT_RESULT_Min (0x0UL)
  #define COMP_RESULT_RESULT_Max (0x1UL)
  #define COMP_RESULT_RESULT_Below (0x0UL)
  #define COMP_RESULT_RESULT_Above (0x1UL)


/* COMP_ENABLE: COMP enable */
  #define COMP_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bits 0..1 : Enable or disable COMP */
  #define COMP_ENABLE_ENABLE_Pos (0UL)
  #define COMP_ENABLE_ENABLE_Msk (0x3UL << COMP_ENABLE_ENABLE_Pos)
  #define COMP_ENABLE_ENABLE_Min (0x0UL)
  #define COMP_ENABLE_ENABLE_Max (0x2UL)
  #define COMP_ENABLE_ENABLE_Disabled (0x0UL)
  #define COMP_ENABLE_ENABLE_Enabled (0x2UL)


/* COMP_PSEL: Pin select */
  #define COMP_PSEL_ResetValue (0x00000000UL)

/* PIN @Bits 0..4 : Analog pin select */
  #define COMP_PSEL_PIN_Pos (0UL)
  #define COMP_PSEL_PIN_Msk (0x1FUL << COMP_PSEL_PIN_Pos)

/* PORT @Bits 8..11 : GPIO Port selection */
  #define COMP_PSEL_PORT_Pos (8UL)
  #define COMP_PSEL_PORT_Msk (0xFUL << COMP_PSEL_PORT_Pos)


/* COMP_REFSEL: Reference source select for single-ended mode */
  #define COMP_REFSEL_ResetValue (0x00000004UL)

/* REFSEL @Bits 0..2 : Reference select */
  #define COMP_REFSEL_REFSEL_Pos (0UL)
  #define COMP_REFSEL_REFSEL_Msk (0x7UL << COMP_REFSEL_REFSEL_Pos)
  #define COMP_REFSEL_REFSEL_Min (0x0UL)
  #define COMP_REFSEL_REFSEL_Max (0x5UL)
  #define COMP_REFSEL_REFSEL_Int1V2 (0x0UL)
  #define COMP_REFSEL_REFSEL_AVDDAO1V8 (0x4UL)
  #define COMP_REFSEL_REFSEL_ARef (0x5UL)


/* COMP_EXTREFSEL: External reference select */
  #define COMP_EXTREFSEL_ResetValue (0x00000000UL)

/* PIN @Bits 0..4 : External analog reference pin select */
  #define COMP_EXTREFSEL_PIN_Pos (0UL)
  #define COMP_EXTREFSEL_PIN_Msk (0x1FUL << COMP_EXTREFSEL_PIN_Pos)

/* PORT @Bits 8..11 : GPIO Port selection */
  #define COMP_EXTREFSEL_PORT_Pos (8UL)
  #define COMP_EXTREFSEL_PORT_Msk (0xFUL << COMP_EXTREFSEL_PORT_Pos)


/* COMP_TH: Threshold configuration for hysteresis unit */
  #define COMP_TH_ResetValue (0x00002020UL)

/* THDOWN @Bits 0..5 : VDOWN = (THDOWN+1)/64*VREF */
  #define COMP_TH_THDOWN_Pos (0UL)
  #define COMP_TH_THDOWN_Msk (0x3FUL << COMP_TH_THDOWN_Pos)
  #define COMP_TH_THDOWN_Min (0x00UL)
  #define COMP_TH_THDOWN_Max (0x3FUL)

/* THUP @Bits 8..13 : VUP = (THUP+1)/64*VREF */
  #define COMP_TH_THUP_Pos (8UL)
  #define COMP_TH_THUP_Msk (0x3FUL << COMP_TH_THUP_Pos)
  #define COMP_TH_THUP_Min (0x00UL)
  #define COMP_TH_THUP_Max (0x3FUL)


/* COMP_MODE: Mode configuration */
  #define COMP_MODE_ResetValue (0x00000000UL)

/* SP @Bit 0 : Speed and power modes */
  #define COMP_MODE_SP_Pos (0UL)
  #define COMP_MODE_SP_Msk (0x1UL << COMP_MODE_SP_Pos)
  #define COMP_MODE_SP_Min (0x0UL)
  #define COMP_MODE_SP_Max (0x1UL)
  #define COMP_MODE_SP_Low (0x0UL)
  #define COMP_MODE_SP_High (0x1UL)

/* MAIN @Bit 8 : Main operation modes */
  #define COMP_MODE_MAIN_Pos (8UL)
  #define COMP_MODE_MAIN_Msk (0x1UL << COMP_MODE_MAIN_Pos)
  #define COMP_MODE_MAIN_Min (0x0UL)
  #define COMP_MODE_MAIN_Max (0x1UL)
  #define COMP_MODE_MAIN_SE (0x0UL)
  #define COMP_MODE_MAIN_Diff (0x1UL)


