pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMP_HYST: Comparator hysteresis enable */
  #define COMP_HYST_ResetValue (0x00000000UL)

/* HYST @Bit 0 : Comparator hysteresis */
  #define COMP_HYST_HYST_Pos (0UL)
  #define COMP_HYST_HYST_Msk (0x1UL << COMP_HYST_HYST_Pos)
  #define COMP_HYST_HYST_Min (0x0UL)
  #define COMP_HYST_HYST_Max (0x1UL)
  #define COMP_HYST_HYST_NoHyst (0x0UL)
  #define COMP_HYST_HYST_Hyst40mV (0x1UL)


/* COMP_ISOURCE: Current source select on analog input */
  #define COMP_ISOURCE_ResetValue (0x00000000UL)

/* ISOURCE @Bits 0..1 : Current source select on analog input */
  #define COMP_ISOURCE_ISOURCE_Pos (0UL)
  #define COMP_ISOURCE_ISOURCE_Msk (0x3UL << COMP_ISOURCE_ISOURCE_Pos)
  #define COMP_ISOURCE_ISOURCE_Min (0x0UL)
  #define COMP_ISOURCE_ISOURCE_Max (0x3UL)
  #define COMP_ISOURCE_ISOURCE_Off (0x0UL)
  #define COMP_ISOURCE_ISOURCE_Ien2uA5 (0x1UL)
  #define COMP_ISOURCE_ISOURCE_Ien5uA (0x2UL)
  #define COMP_ISOURCE_ISOURCE_Ien10uA (0x3UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            CTI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CTI ======================================================== */
/**
  * @brief Cross-Trigger Interface control
  */
  typedef struct {
    __IOM uint32_t CTICONTROL;
    __IM uint32_t RESERVED[3];
    __OM uint32_t CTIINTACK;
    __IOM uint32_t CTIAPPSET;
    __OM uint32_t CTIAPPCLEAR;
    __OM uint32_t CTIAPPPULSE;
    __IOM uint32_t CTIINEN[8];
    __IM uint32_t RESERVED1[24];
    __IOM uint32_t CTIOUTEN[8];
    __IM uint32_t RESERVED2[28];
    __IM uint32_t CTITRIGINSTATUS;
    __IM uint32_t CTITRIGOUTSTATUS;
    __IM uint32_t CTICHINSTATUS;
    __IM uint32_t RESERVED3;
    __IOM uint32_t CTIGATE;
    __IM uint32_t RESERVED4[926];
    __IM uint32_t DEVARCH;
    __IM uint32_t RESERVED5[2];
    __IM uint32_t DEVID;
    __IM uint32_t DEVTYPE;
    __IM uint32_t PIDR4;
    __IM uint32_t PIDR5;
    __IM uint32_t PIDR6;
    __IM uint32_t PIDR7;
    __IM uint32_t PIDR0;
    __IM uint32_t PIDR1;
    __IM uint32_t PIDR2;
    __IM uint32_t PIDR3;
    __IM uint32_t CIDR0;
    __IM uint32_t CIDR1;
    __IM uint32_t CIDR2;
    __IM uint32_t CIDR3;
  } NRF_CTI_Type;

/* CTI_CTICONTROL: CTI Control register */
  #define CTI_CTICONTROL_ResetValue (0x00000000UL)

/* GLBEN @Bit 0 : Enables or disables the CTI. */
  #define CTI_CTICONTROL_GLBEN_Pos (0UL)
  #define CTI_CTICONTROL_GLBEN_Msk (0x1UL << CTI_CTICONTROL_GLBEN_Pos)
  #define CTI_CTICONTROL_GLBEN_Min (0x0UL)
  #define CTI_CTICONTROL_GLBEN_Max (0x1UL)
  #define CTI_CTICONTROL_GLBEN_Disabled (0x0UL)
  #define CTI_CTICONTROL_GLBEN_Enabled (0x1UL)


/* CTI_CTIINTACK: CTI Interrupt Acknowledge register */
  #define CTI_CTIINTACK_ResetValue (0x00000000UL)

/* INTACK0 @Bit 0 : Acknowledges the ctitrigout 0 output. */
  #define CTI_CTIINTACK_INTACK0_Pos (0UL)
  #define CTI_CTIINTACK_INTACK0_Msk (0x1UL << CTI_CTIINTACK_INTACK0_Pos)
  #define CTI_CTIINTACK_INTACK0_Min (0x1UL)
  #define CTI_CTIINTACK_INTACK0_Max (0x1UL)
  #define CTI_CTIINTACK_INTACK0_Acknowledge (0x1UL)

/* INTACK1 @Bit 1 : Acknowledges the ctitrigout 1 output. */
  #define CTI_CTIINTACK_INTACK1_Pos (1UL)
  #define CTI_CTIINTACK_INTACK1_Msk (0x1UL << CTI_CTIINTACK_INTACK1_Pos)
  #define CTI_CTIINTACK_INTACK1_Min (0x1UL)
  #define CTI_CTIINTACK_INTACK1_Max (0x1UL)
  #define CTI_CTIINTACK_INTACK1_Acknowledge (0x1UL)

/* INTACK2 @Bit 2 : Acknowledges the ctitrigout 2 output. */
  #define CTI_CTIINTACK_INTACK2_Pos (2UL)
  #define CTI_CTIINTACK_INTACK2_Msk (0x1UL << CTI_CTIINTACK_INTACK2_Pos)
  #define CTI_CTIINTACK_INTACK2_Min (0x1UL)
  #define CTI_CTIINTACK_INTACK2_Max (0x1UL)
  #define CTI_CTIINTACK_INTACK2_Acknowledge (0x1UL)

/* INTACK3 @Bit 3 : Acknowledges the ctitrigout 3 output. */
  #define CTI_CTIINTACK_INTACK3_Pos (3UL)
  #define CTI_CTIINTACK_INTACK3_Msk (0x1UL << CTI_CTIINTACK_INTACK3_Pos)
  #define CTI_CTIINTACK_INTACK3_Min (0x1UL)
  #define CTI_CTIINTACK_INTACK3_Max (0x1UL)
  #define CTI_CTIINTACK_INTACK3_Acknowledge (0x1UL)

/* INTACK4 @Bit 4 : Acknowledges the ctitrigout 4 output. */
  #define CTI_CTIINTACK_INTACK4_Pos (4UL)
  #define CTI_CTIINTACK_INTACK4_Msk (0x1UL << CTI_CTIINTACK_INTACK4_Pos)
  #define CTI_CTIINTACK_INTACK4_Min (0x1UL)
  #define CTI_CTIINTACK_INTACK4_Max (0x1UL)
  #define CTI_CTIINTACK_INTACK4_Acknowledge (0x1UL)

/* INTACK5 @Bit 5 : Acknowledges the ctitrigout 5 output. */
  #define CTI_CTIINTACK_INTACK5_Pos (5UL)
  #define CTI_CTIINTACK_INTACK5_Msk (0x1UL << CTI_CTIINTACK_INTACK5_Pos)
  #define CTI_CTIINTACK_INTACK5_Min (0x1UL)
  #define CTI_CTIINTACK_INTACK5_Max (0x1UL)
  #define CTI_CTIINTACK_INTACK5_Acknowledge (0x1UL)

/* INTACK6 @Bit 6 : Acknowledges the ctitrigout 6 output. */
  #define CTI_CTIINTACK_INTACK6_Pos (6UL)
  #define CTI_CTIINTACK_INTACK6_Msk (0x1UL << CTI_CTIINTACK_INTACK6_Pos)
  #define CTI_CTIINTACK_INTACK6_Min (0x1UL)
  #define CTI_CTIINTACK_INTACK6_Max (0x1UL)
  #define CTI_CTIINTACK_INTACK6_Acknowledge (0x1UL)

/* INTACK7 @Bit 7 : Acknowledges the ctitrigout 7 output. */
  #define CTI_CTIINTACK_INTACK7_Pos (7UL)
  #define CTI_CTIINTACK_INTACK7_Msk (0x1UL << CTI_CTIINTACK_INTACK7_Pos)
  #define CTI_CTIINTACK_INTACK7_Min (0x1UL)
  #define CTI_CTIINTACK_INTACK7_Max (0x1UL)
  #define CTI_CTIINTACK_INTACK7_Acknowledge (0x1UL)


/* CTI_CTIAPPSET: CTI Application Trigger Set register */
  #define CTI_CTIAPPSET_ResetValue (0x00000000UL)

/* APPSET0 @Bit 0 : Application trigger event for channel 0. */
  #define CTI_CTIAPPSET_APPSET0_Pos (0UL)
  #define CTI_CTIAPPSET_APPSET0_Msk (0x1UL << CTI_CTIAPPSET_APPSET0_Pos)
  #define CTI_CTIAPPSET_APPSET0_Min (0x0UL)
  #define CTI_CTIAPPSET_APPSET0_Max (0x1UL)
  #define CTI_CTIAPPSET_APPSET0_Inactive (0x0UL)
  #define CTI_CTIAPPSET_APPSET0_Active (0x1UL)
  #define CTI_CTIAPPSET_APPSET0_Activate (0x1UL)

/* APPSET1 @Bit 1 : Application trigger event for channel 1. */
  #define CTI_CTIAPPSET_APPSET1_Pos (1UL)
  #define CTI_CTIAPPSET_APPSET1_Msk (0x1UL << CTI_CTIAPPSET_APPSET1_Pos)
  #define CTI_CTIAPPSET_APPSET1_Min (0x0UL)
  #define CTI_CTIAPPSET_APPSET1_Max (0x1UL)
  #define CTI_CTIAPPSET_APPSET1_Inactive (0x0UL)
  #define CTI_CTIAPPSET_APPSET1_Active (0x1UL)
  #define CTI_CTIAPPSET_APPSET1_Activate (0x1UL)

/* APPSET2 @Bit 2 : Application trigger event for channel 2. */
  #define CTI_CTIAPPSET_APPSET2_Pos (2UL)
  #define CTI_CTIAPPSET_APPSET2_Msk (0x1UL << CTI_CTIAPPSET_APPSET2_Pos)
  #define CTI_CTIAPPSET_APPSET2_Min (0x0UL)
  #define CTI_CTIAPPSET_APPSET2_Max (0x1UL)
  #define CTI_CTIAPPSET_APPSET2_Inactive (0x0UL)
  #define CTI_CTIAPPSET_APPSET2_Active (0x1UL)
  #define CTI_CTIAPPSET_APPSET2_Activate (0x1UL)

/* APPSET3 @Bit 3 : Application trigger event for channel 3. */
  #define CTI_CTIAPPSET_APPSET3_Pos (3UL)
  #define CTI_CTIAPPSET_APPSET3_Msk (0x1UL << CTI_CTIAPPSET_APPSET3_Pos)
  #define CTI_CTIAPPSET_APPSET3_Min (0x0UL)
  #define CTI_CTIAPPSET_APPSET3_Max (0x1UL)
  #define CTI_CTIAPPSET_APPSET3_Inactive (0x0UL)
  #define CTI_CTIAPPSET_APPSET3_Active (0x1UL)
  #define CTI_CTIAPPSET_APPSET3_Activate (0x1UL)


/* CTI_CTIAPPCLEAR: CTI Application Trigger Clear register */
  #define CTI_CTIAPPCLEAR_ResetValue (0x00000000UL)

