pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* APPCLEAR0 @Bit 0 : Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel. */
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Pos (0UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Msk (0x1UL << CTI_CTIAPPCLEAR_APPCLEAR0_Pos)
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Min (0x1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Max (0x1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR0_Clear (0x1UL)

/* APPCLEAR1 @Bit 1 : Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel. */
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Pos (1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Msk (0x1UL << CTI_CTIAPPCLEAR_APPCLEAR1_Pos)
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Min (0x1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Max (0x1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR1_Clear (0x1UL)

/* APPCLEAR2 @Bit 2 : Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel. */
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Pos (2UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Msk (0x1UL << CTI_CTIAPPCLEAR_APPCLEAR2_Pos)
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Min (0x1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Max (0x1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR2_Clear (0x1UL)

/* APPCLEAR3 @Bit 3 : Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel. */
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Pos (3UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Msk (0x1UL << CTI_CTIAPPCLEAR_APPCLEAR3_Pos)
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Min (0x1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Max (0x1UL)
  #define CTI_CTIAPPCLEAR_APPCLEAR3_Clear (0x1UL)


/* CTI_CTIAPPPULSE: CTI Application Pulse register */
  #define CTI_CTIAPPPULSE_ResetValue (0x00000000UL)

/* APPULSE0 @Bit 0 : Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the
                     register for each channel. */

  #define CTI_CTIAPPPULSE_APPULSE0_Pos (0UL)
  #define CTI_CTIAPPPULSE_APPULSE0_Msk (0x1UL << CTI_CTIAPPPULSE_APPULSE0_Pos)
  #define CTI_CTIAPPPULSE_APPULSE0_Min (0x1UL)
  #define CTI_CTIAPPPULSE_APPULSE0_Max (0x1UL)
  #define CTI_CTIAPPPULSE_APPULSE0_Generate (0x1UL)

/* APPULSE1 @Bit 1 : Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the
                     register for each channel. */

  #define CTI_CTIAPPPULSE_APPULSE1_Pos (1UL)
  #define CTI_CTIAPPPULSE_APPULSE1_Msk (0x1UL << CTI_CTIAPPPULSE_APPULSE1_Pos)
  #define CTI_CTIAPPPULSE_APPULSE1_Min (0x1UL)
  #define CTI_CTIAPPPULSE_APPULSE1_Max (0x1UL)
  #define CTI_CTIAPPPULSE_APPULSE1_Generate (0x1UL)

/* APPULSE2 @Bit 2 : Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the
                     register for each channel. */

  #define CTI_CTIAPPPULSE_APPULSE2_Pos (2UL)
  #define CTI_CTIAPPPULSE_APPULSE2_Msk (0x1UL << CTI_CTIAPPPULSE_APPULSE2_Pos)
  #define CTI_CTIAPPPULSE_APPULSE2_Min (0x1UL)
  #define CTI_CTIAPPPULSE_APPULSE2_Max (0x1UL)
  #define CTI_CTIAPPPULSE_APPULSE2_Generate (0x1UL)

/* APPULSE3 @Bit 3 : Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the
                     register for each channel. */

  #define CTI_CTIAPPPULSE_APPULSE3_Pos (3UL)
  #define CTI_CTIAPPPULSE_APPULSE3_Msk (0x1UL << CTI_CTIAPPPULSE_APPULSE3_Pos)
  #define CTI_CTIAPPPULSE_APPULSE3_Min (0x1UL)
  #define CTI_CTIAPPPULSE_APPULSE3_Max (0x1UL)
  #define CTI_CTIAPPPULSE_APPULSE3_Generate (0x1UL)


/* CTI_CTIINEN: CTI Trigger to Channel Enable register */
  #define CTI_CTIINEN_MaxCount (8UL)
  #define CTI_CTIINEN_MaxIndex (7UL)
  #define CTI_CTIINEN_MinIndex (0UL)
  #define CTI_CTIINEN_ResetValue (0x00000000UL)

/* TRIGINEN0 @Bit 0 : Enables a cross trigger event to channel 0 when a ctitrigin input is activated. */
  #define CTI_CTIINEN_TRIGINEN0_Pos (0UL)
  #define CTI_CTIINEN_TRIGINEN0_Msk (0x1UL << CTI_CTIINEN_TRIGINEN0_Pos)
  #define CTI_CTIINEN_TRIGINEN0_Min (0x0UL)
  #define CTI_CTIINEN_TRIGINEN0_Max (0x1UL)
  #define CTI_CTIINEN_TRIGINEN0_Disabled (0x0UL)
  #define CTI_CTIINEN_TRIGINEN0_Enabled (0x1UL)      /*!< When an event is received on input trigger n (ctitrigin[n]), generate
                                                          an event on channel 0.*/

/* TRIGINEN1 @Bit 1 : Enables a cross trigger event to channel 1 when a ctitrigin input is activated. */
  #define CTI_CTIINEN_TRIGINEN1_Pos (1UL)
  #define CTI_CTIINEN_TRIGINEN1_Msk (0x1UL << CTI_CTIINEN_TRIGINEN1_Pos)
  #define CTI_CTIINEN_TRIGINEN1_Min (0x0UL)
  #define CTI_CTIINEN_TRIGINEN1_Max (0x1UL)
  #define CTI_CTIINEN_TRIGINEN1_Disabled (0x0UL)
  #define CTI_CTIINEN_TRIGINEN1_Enabled (0x1UL)      /*!< When an event is received on input trigger n (ctitrigin[n]), generate
                                                          an event on channel 1.*/

/* TRIGINEN2 @Bit 2 : Enables a cross trigger event to channel 2 when a ctitrigin input is activated. */
  #define CTI_CTIINEN_TRIGINEN2_Pos (2UL)
  #define CTI_CTIINEN_TRIGINEN2_Msk (0x1UL << CTI_CTIINEN_TRIGINEN2_Pos)
  #define CTI_CTIINEN_TRIGINEN2_Min (0x0UL)
  #define CTI_CTIINEN_TRIGINEN2_Max (0x1UL)
  #define CTI_CTIINEN_TRIGINEN2_Disabled (0x0UL)
  #define CTI_CTIINEN_TRIGINEN2_Enabled (0x1UL)      /*!< When an event is received on input trigger n (ctitrigin[n]), generate
                                                          an event on channel 2.*/

/* TRIGINEN3 @Bit 3 : Enables a cross trigger event to channel 3 when a ctitrigin input is activated. */
  #define CTI_CTIINEN_TRIGINEN3_Pos (3UL)
  #define CTI_CTIINEN_TRIGINEN3_Msk (0x1UL << CTI_CTIINEN_TRIGINEN3_Pos)
  #define CTI_CTIINEN_TRIGINEN3_Min (0x0UL)
  #define CTI_CTIINEN_TRIGINEN3_Max (0x1UL)
  #define CTI_CTIINEN_TRIGINEN3_Disabled (0x0UL)
  #define CTI_CTIINEN_TRIGINEN3_Enabled (0x1UL)      /*!< When an event is received on input trigger n (ctitrigin[n]), generate
                                                          an event on channel 3.*/


/* CTI_CTIOUTEN: CTI Channel to Trigger Enable register */
  #define CTI_CTIOUTEN_MaxCount (8UL)
  #define CTI_CTIOUTEN_MaxIndex (7UL)
  #define CTI_CTIOUTEN_MinIndex (0UL)
  #define CTI_CTIOUTEN_ResetValue (0x00000000UL)

/* TRIGOUTEN0 @Bit 0 : Enables a cross trigger event to ctitrigout when channel 0 is activated. */
  #define CTI_CTIOUTEN_TRIGOUTEN0_Pos (0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN0_Msk (0x1UL << CTI_CTIOUTEN_TRIGOUTEN0_Pos)
  #define CTI_CTIOUTEN_TRIGOUTEN0_Min (0x0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN0_Max (0x1UL)
  #define CTI_CTIOUTEN_TRIGOUTEN0_Disabled (0x0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN0_Enabled (0x1UL)    /*!< When an event occurs on channel 0, generate an event on output event n
                                                          (ctitrigout[n]).*/

/* TRIGOUTEN1 @Bit 1 : Enables a cross trigger event to ctitrigout when channel 1 is activated. */
  #define CTI_CTIOUTEN_TRIGOUTEN1_Pos (1UL)
  #define CTI_CTIOUTEN_TRIGOUTEN1_Msk (0x1UL << CTI_CTIOUTEN_TRIGOUTEN1_Pos)
  #define CTI_CTIOUTEN_TRIGOUTEN1_Min (0x0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN1_Max (0x1UL)
  #define CTI_CTIOUTEN_TRIGOUTEN1_Disabled (0x0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN1_Enabled (0x1UL)    /*!< When an event occurs on channel 1, generate an event on output event n
                                                          (ctitrigout[n]).*/

/* TRIGOUTEN2 @Bit 2 : Enables a cross trigger event to ctitrigout when channel 2 is activated. */
  #define CTI_CTIOUTEN_TRIGOUTEN2_Pos (2UL)
  #define CTI_CTIOUTEN_TRIGOUTEN2_Msk (0x1UL << CTI_CTIOUTEN_TRIGOUTEN2_Pos)
  #define CTI_CTIOUTEN_TRIGOUTEN2_Min (0x0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN2_Max (0x1UL)
  #define CTI_CTIOUTEN_TRIGOUTEN2_Disabled (0x0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN2_Enabled (0x1UL)    /*!< When an event occurs on channel 2, generate an event on output event n
                                                          (ctitrigout[n]).*/

/* TRIGOUTEN3 @Bit 3 : Enables a cross trigger event to ctitrigout when channel 3 is activated. */
  #define CTI_CTIOUTEN_TRIGOUTEN3_Pos (3UL)
  #define CTI_CTIOUTEN_TRIGOUTEN3_Msk (0x1UL << CTI_CTIOUTEN_TRIGOUTEN3_Pos)
  #define CTI_CTIOUTEN_TRIGOUTEN3_Min (0x0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN3_Max (0x1UL)
  #define CTI_CTIOUTEN_TRIGOUTEN3_Disabled (0x0UL)
  #define CTI_CTIOUTEN_TRIGOUTEN3_Enabled (0x1UL)    /*!< When an event occurs on channel 3, generate an event on output event n
                                                          (ctitrigout[n]).*/


/* CTI_CTITRIGINSTATUS: CTI Trigger In Status register */
  #define CTI_CTITRIGINSTATUS_ResetValue (0x00000000UL)

