pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGINSTATUS0 @Bit 0 : Shows the status of ctitrigin0 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Pos (0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Pos) /*!< Bit mask of TRIGINSTATUS0
                                                                            field.*/
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Min (0x0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Max (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Active (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS0_Inactive (0x0UL)

/* TRIGINSTATUS1 @Bit 1 : Shows the status of ctitrigin1 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Pos (1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Pos) /*!< Bit mask of TRIGINSTATUS1
                                                                            field.*/
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Min (0x0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Max (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Active (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS1_Inactive (0x0UL)

/* TRIGINSTATUS2 @Bit 2 : Shows the status of ctitrigin2 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Pos (2UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Pos) /*!< Bit mask of TRIGINSTATUS2
                                                                            field.*/
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Min (0x0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Max (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Active (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS2_Inactive (0x0UL)

/* TRIGINSTATUS3 @Bit 3 : Shows the status of ctitrigin3 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Pos (3UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Pos) /*!< Bit mask of TRIGINSTATUS3
                                                                            field.*/
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Min (0x0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Max (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Active (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS3_Inactive (0x0UL)

/* TRIGINSTATUS4 @Bit 4 : Shows the status of ctitrigin4 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Pos (4UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Pos) /*!< Bit mask of TRIGINSTATUS4
                                                                            field.*/
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Min (0x0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Max (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Active (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS4_Inactive (0x0UL)

/* TRIGINSTATUS5 @Bit 5 : Shows the status of ctitrigin5 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Pos (5UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Pos) /*!< Bit mask of TRIGINSTATUS5
                                                                            field.*/
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Min (0x0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Max (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Active (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS5_Inactive (0x0UL)

/* TRIGINSTATUS6 @Bit 6 : Shows the status of ctitrigin6 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Pos (6UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Pos) /*!< Bit mask of TRIGINSTATUS6
                                                                            field.*/
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Min (0x0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Max (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Active (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS6_Inactive (0x0UL)

/* TRIGINSTATUS7 @Bit 7 : Shows the status of ctitrigin7 input. */
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Pos (7UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Msk (0x1UL << CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Pos) /*!< Bit mask of TRIGINSTATUS7
                                                                            field.*/
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Min (0x0UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Max (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Active (0x1UL)
  #define CTI_CTITRIGINSTATUS_TRIGINSTATUS7_Inactive (0x0UL)


/* CTI_CTITRIGOUTSTATUS: CTI Trigger Out Status register */
  #define CTI_CTITRIGOUTSTATUS_ResetValue (0x00000000UL)

/* TRIGOUTSTATUS0 @Bit 0 : Shows the status of ctitrigout0 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Pos (0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS0 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Min (0x0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Max (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Active (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS0_Inactive (0x0UL)

/* TRIGOUTSTATUS1 @Bit 1 : Shows the status of ctitrigout1 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Pos (1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS1 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Min (0x0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Max (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Active (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS1_Inactive (0x0UL)

/* TRIGOUTSTATUS2 @Bit 2 : Shows the status of ctitrigout2 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Pos (2UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS2 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Min (0x0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Max (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Active (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS2_Inactive (0x0UL)

/* TRIGOUTSTATUS3 @Bit 3 : Shows the status of ctitrigout3 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Pos (3UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS3 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Min (0x0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Max (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Active (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS3_Inactive (0x0UL)

/* TRIGOUTSTATUS4 @Bit 4 : Shows the status of ctitrigout4 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Pos (4UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS4 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Min (0x0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Max (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Active (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS4_Inactive (0x0UL)

/* TRIGOUTSTATUS5 @Bit 5 : Shows the status of ctitrigout5 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Pos (5UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS5 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Min (0x0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Max (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Active (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS5_Inactive (0x0UL)

