pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGOUTSTATUS6 @Bit 6 : Shows the status of ctitrigout6 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Pos (6UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS6 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Min (0x0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Max (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Active (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS6_Inactive (0x0UL)

/* TRIGOUTSTATUS7 @Bit 7 : Shows the status of ctitrigout7 output. */
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Pos (7UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Msk (0x1UL << CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Pos) /*!< Bit mask of
                                                                            TRIGOUTSTATUS7 field.*/
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Min (0x0UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Max (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Active (0x1UL)
  #define CTI_CTITRIGOUTSTATUS_TRIGOUTSTATUS7_Inactive (0x0UL)


/* CTI_CTICHINSTATUS: CTI Channel In Status register */
  #define CTI_CTICHINSTATUS_ResetValue (0x00000000UL)

/* CTICHINSTATUS0 @Bit 0 : Shows the status of the ctitrigin 0 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Pos (0UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS0_Pos) /*!< Bit mask of CTICHINSTATUS0
                                                                            field.*/
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Min (0x0UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Max (0x1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Active (0x1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS0_Inactive (0x0UL)

/* CTICHINSTATUS1 @Bit 1 : Shows the status of the ctitrigin 1 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Pos (1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS1_Pos) /*!< Bit mask of CTICHINSTATUS1
                                                                            field.*/
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Min (0x0UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Max (0x1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Active (0x1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS1_Inactive (0x0UL)

/* CTICHINSTATUS2 @Bit 2 : Shows the status of the ctitrigin 2 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Pos (2UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS2_Pos) /*!< Bit mask of CTICHINSTATUS2
                                                                            field.*/
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Min (0x0UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Max (0x1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Active (0x1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS2_Inactive (0x0UL)

/* CTICHINSTATUS3 @Bit 3 : Shows the status of the ctitrigin 3 input. */
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Pos (3UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Msk (0x1UL << CTI_CTICHINSTATUS_CTICHINSTATUS3_Pos) /*!< Bit mask of CTICHINSTATUS3
                                                                            field.*/
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Min (0x0UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Max (0x1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Active (0x1UL)
  #define CTI_CTICHINSTATUS_CTICHINSTATUS3_Inactive (0x0UL)


/* CTI_CTIGATE: Enable CTI Channel Gate register */
  #define CTI_CTIGATE_ResetValue (0x0000000FUL)

/* CTIGATEEN0 @Bit 0 : Enable ctichout0. */
  #define CTI_CTIGATE_CTIGATEEN0_Pos (0UL)
  #define CTI_CTIGATE_CTIGATEEN0_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN0_Pos)
  #define CTI_CTIGATE_CTIGATEEN0_Min (0x0UL)
  #define CTI_CTIGATE_CTIGATEEN0_Max (0x1UL)
  #define CTI_CTIGATE_CTIGATEEN0_Enabled (0x1UL)
  #define CTI_CTIGATE_CTIGATEEN0_Disabled (0x0UL)

/* CTIGATEEN1 @Bit 1 : Enable ctichout1. */
  #define CTI_CTIGATE_CTIGATEEN1_Pos (1UL)
  #define CTI_CTIGATE_CTIGATEEN1_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN1_Pos)
  #define CTI_CTIGATE_CTIGATEEN1_Min (0x0UL)
  #define CTI_CTIGATE_CTIGATEEN1_Max (0x1UL)
  #define CTI_CTIGATE_CTIGATEEN1_Enabled (0x1UL)
  #define CTI_CTIGATE_CTIGATEEN1_Disabled (0x0UL)

/* CTIGATEEN2 @Bit 2 : Enable ctichout2. */
  #define CTI_CTIGATE_CTIGATEEN2_Pos (2UL)
  #define CTI_CTIGATE_CTIGATEEN2_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN2_Pos)
  #define CTI_CTIGATE_CTIGATEEN2_Min (0x0UL)
  #define CTI_CTIGATE_CTIGATEEN2_Max (0x1UL)
  #define CTI_CTIGATE_CTIGATEEN2_Enabled (0x1UL)
  #define CTI_CTIGATE_CTIGATEEN2_Disabled (0x0UL)

/* CTIGATEEN3 @Bit 3 : Enable ctichout3. */
  #define CTI_CTIGATE_CTIGATEEN3_Pos (3UL)
  #define CTI_CTIGATE_CTIGATEEN3_Msk (0x1UL << CTI_CTIGATE_CTIGATEEN3_Pos)
  #define CTI_CTIGATE_CTIGATEEN3_Min (0x0UL)
  #define CTI_CTIGATE_CTIGATEEN3_Max (0x1UL)
  #define CTI_CTIGATE_CTIGATEEN3_Enabled (0x1UL)
  #define CTI_CTIGATE_CTIGATEEN3_Disabled (0x0UL)


/* CTI_DEVARCH: Device Architecture register */
  #define CTI_DEVARCH_ResetValue (0x47701A14UL)

/* Architecture @Bit 0 : Contains the CTI device architecture. */
  #define CTI_DEVARCH_Architecture_Pos (0UL)
  #define CTI_DEVARCH_Architecture_Msk (0x1UL << CTI_DEVARCH_Architecture_Pos)


/* CTI_DEVID: Device Configuration register */
  #define CTI_DEVID_ResetValue (0x00040800UL)

/* EXTMUXNUM @Bits 0..4 : Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using
                          asicctl. The default value of 0b00000 indicates that no multiplexing is present. */

  #define CTI_DEVID_EXTMUXNUM_Pos (0UL)
  #define CTI_DEVID_EXTMUXNUM_Msk (0x1FUL << CTI_DEVID_EXTMUXNUM_Pos)

/* NUMTRIG @Bits 8..15 : Number of ECT triggers available. */
  #define CTI_DEVID_NUMTRIG_Pos (8UL)
  #define CTI_DEVID_NUMTRIG_Msk (0xFFUL << CTI_DEVID_NUMTRIG_Pos)

/* NUMCH @Bits 16..19 : Number of ECT channels available. */
  #define CTI_DEVID_NUMCH_Pos (16UL)
  #define CTI_DEVID_NUMCH_Msk (0xFUL << CTI_DEVID_NUMCH_Pos)


/* CTI_DEVTYPE: Device Type Identifier register */
  #define CTI_DEVTYPE_ResetValue (0x00000014UL)

