pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MAJOR @Bits 0..3 : Major classification of the type of the debug component as specified in the Arm Architecture Specification
                      for this debug and trace component. */

  #define CTI_DEVTYPE_MAJOR_Pos (0UL)
  #define CTI_DEVTYPE_MAJOR_Msk (0xFUL << CTI_DEVTYPE_MAJOR_Pos)
  #define CTI_DEVTYPE_MAJOR_Min (0x4UL)
  #define CTI_DEVTYPE_MAJOR_Max (0x4UL)
  #define CTI_DEVTYPE_MAJOR_Controller (0x4UL)       /*!< Indicates that this component allows a debugger to control other
                                                          components in an Arm CoreSight SoC-400 system.*/

/* SUB @Bits 4..7 : Sub-classification of the type of the debug component as specified in the Arm Architecture Specification
                    within the major classification as specified in the MAJOR field. */

  #define CTI_DEVTYPE_SUB_Pos (4UL)
  #define CTI_DEVTYPE_SUB_Msk (0xFUL << CTI_DEVTYPE_SUB_Pos)
  #define CTI_DEVTYPE_SUB_Min (0x1UL)
  #define CTI_DEVTYPE_SUB_Max (0x1UL)
  #define CTI_DEVTYPE_SUB_Crosstrigger (0x1UL)


/* CTI_PIDR4: Peripheral ID4 Register */
  #define CTI_PIDR4_ResetValue (0x00000004UL)

/* DES_2 @Bits 0..3 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
  #define CTI_PIDR4_DES_2_Pos (0UL)
  #define CTI_PIDR4_DES_2_Msk (0xFUL << CTI_PIDR4_DES_2_Pos)
  #define CTI_PIDR4_DES_2_Min (0x4UL)
  #define CTI_PIDR4_DES_2_Max (0x4UL)
  #define CTI_PIDR4_DES_2_Code (0x4UL)

/* SIZE @Bits 4..7 : Always 0b0000. Indicates that the device only occupies 4KB of memory. */
  #define CTI_PIDR4_SIZE_Pos (4UL)
  #define CTI_PIDR4_SIZE_Msk (0xFUL << CTI_PIDR4_SIZE_Pos)


/* CTI_PIDR0: Peripheral ID0 Register */
  #define CTI_PIDR0_ResetValue (0x00000021UL)

/* PART_0 @Bits 0..7 : Bits[7:0] of the 12-bit part number of the component. The designer of the component assigns this part
                       number. */

  #define CTI_PIDR0_PART_0_Pos (0UL)
  #define CTI_PIDR0_PART_0_Msk (0xFFUL << CTI_PIDR0_PART_0_Pos)
  #define CTI_PIDR0_PART_0_Min (0x21UL)
  #define CTI_PIDR0_PART_0_Max (0x21UL)
  #define CTI_PIDR0_PART_0_PartnumberL (0x21UL)


/* CTI_PIDR1: Peripheral ID1 Register */
  #define CTI_PIDR1_ResetValue (0x000000BDUL)

/* PART_1 @Bits 0..3 : Bits[11:8] of the 12-bit part number of the component. The designer of the component assigns this part
                       number. */

  #define CTI_PIDR1_PART_1_Pos (0UL)
  #define CTI_PIDR1_PART_1_Msk (0xFUL << CTI_PIDR1_PART_1_Pos)
  #define CTI_PIDR1_PART_1_Min (0xDUL)
  #define CTI_PIDR1_PART_1_Max (0xDUL)
  #define CTI_PIDR1_PART_1_PartnumberH (0xDUL)

/* DES_0 @Bits 4..7 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
  #define CTI_PIDR1_DES_0_Pos (4UL)
  #define CTI_PIDR1_DES_0_Msk (0xFUL << CTI_PIDR1_DES_0_Pos)
  #define CTI_PIDR1_DES_0_Min (0xBUL)
  #define CTI_PIDR1_DES_0_Max (0xBUL)
  #define CTI_PIDR1_DES_0_Arm (0xBUL)


/* CTI_PIDR2: Peripheral ID2 Register */
  #define CTI_PIDR2_ResetValue (0x0000000BUL)

/* DES_1 @Bits 0..2 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
  #define CTI_PIDR2_DES_1_Pos (0UL)
  #define CTI_PIDR2_DES_1_Msk (0x7UL << CTI_PIDR2_DES_1_Pos)
  #define CTI_PIDR2_DES_1_Min (0x3UL)
  #define CTI_PIDR2_DES_1_Max (0x3UL)
  #define CTI_PIDR2_DES_1_Arm (0x3UL)

/* JEDEC @Bit 3 : Always 1. Indicates that the JEDEC-assigned designer ID is used. */
  #define CTI_PIDR2_JEDEC_Pos (3UL)
  #define CTI_PIDR2_JEDEC_Msk (0x1UL << CTI_PIDR2_JEDEC_Pos)

/* REVISION @Bits 4..7 : Peripheral revision */
  #define CTI_PIDR2_REVISION_Pos (4UL)
  #define CTI_PIDR2_REVISION_Msk (0xFUL << CTI_PIDR2_REVISION_Pos)
  #define CTI_PIDR2_REVISION_Min (0x0UL)
  #define CTI_PIDR2_REVISION_Max (0x0UL)
  #define CTI_PIDR2_REVISION_Rev0p0 (0x0UL)


/* CTI_PIDR3: Peripheral ID3 Register */
  #define CTI_PIDR3_ResetValue (0x00000000UL)

/* CMOD @Bits 0..3 : Customer Modified. Indicates whether the customer has modified the behavior of the component. In most
                     cases, this field is 0b0000. Customers change this value when they make authorized modifications to this
                     component. */

  #define CTI_PIDR3_CMOD_Pos (0UL)
  #define CTI_PIDR3_CMOD_Msk (0xFUL << CTI_PIDR3_CMOD_Pos)
  #define CTI_PIDR3_CMOD_Min (0x0UL)
  #define CTI_PIDR3_CMOD_Max (0x0UL)
  #define CTI_PIDR3_CMOD_Unmodified (0x0UL)

/* REVAND @Bits 4..7 : Indicates minor errata fixes specific to the revision of the component being used, for example metal
                       fixes after implementation. In most cases, this field is 0b0000. Arm recommends that the component
                       designers ensure that a metal fix can change this field if required, for example, by driving it from
                       registers that reset to 0b0000. */

  #define CTI_PIDR3_REVAND_Pos (4UL)
  #define CTI_PIDR3_REVAND_Msk (0xFUL << CTI_PIDR3_REVAND_Pos)
  #define CTI_PIDR3_REVAND_Min (0x0UL)
  #define CTI_PIDR3_REVAND_Max (0x0UL)
  #define CTI_PIDR3_REVAND_NoErrata (0x0UL)


/* CTI_CIDR0: Component ID0 Register */
  #define CTI_CIDR0_ResetValue (0x0000000DUL)

/* PRMBL_0 @Bits 0..7 : Preamble[0]. Contains bits[7:0] of the component identification code. */
  #define CTI_CIDR0_PRMBL_0_Pos (0UL)
  #define CTI_CIDR0_PRMBL_0_Msk (0xFFUL << CTI_CIDR0_PRMBL_0_Pos)
  #define CTI_CIDR0_PRMBL_0_Min (0xDUL)
  #define CTI_CIDR0_PRMBL_0_Max (0xDUL)
  #define CTI_CIDR0_PRMBL_0_Value (0x0DUL)


/* CTI_CIDR1: Component ID1 Register */
  #define CTI_CIDR1_ResetValue (0x00000090UL)

/* PRMBL_1 @Bits 0..3 : Preamble[1]. Contains bits[11:8] of the component identification code. */
  #define CTI_CIDR1_PRMBL_1_Pos (0UL)
  #define CTI_CIDR1_PRMBL_1_Msk (0xFUL << CTI_CIDR1_PRMBL_1_Pos)
  #define CTI_CIDR1_PRMBL_1_Min (0x0UL)
  #define CTI_CIDR1_PRMBL_1_Max (0x0UL)
  #define CTI_CIDR1_PRMBL_1_Value (0x0UL)

/* CLASS @Bits 4..7 : Class of the component, for example, whether the component is a ROM table or a generic CoreSight
                      component. Contains bits[15:12] of the component identification code */

