pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define CTI_CIDR1_CLASS_Pos (4UL)
  #define CTI_CIDR1_CLASS_Msk (0xFUL << CTI_CIDR1_CLASS_Pos)
  #define CTI_CIDR1_CLASS_Min (0x9UL)
  #define CTI_CIDR1_CLASS_Max (0x9UL)
  #define CTI_CIDR1_CLASS_Coresight (0x9UL)


/* CTI_CIDR2: Component ID2 Register */
  #define CTI_CIDR2_ResetValue (0x00000005UL)

/* PRMBL_2 @Bits 0..7 : Preamble[2]. Contains bits[23:16] of the component identification code. */
  #define CTI_CIDR2_PRMBL_2_Pos (0UL)
  #define CTI_CIDR2_PRMBL_2_Msk (0xFFUL << CTI_CIDR2_PRMBL_2_Pos)
  #define CTI_CIDR2_PRMBL_2_Min (0x5UL)
  #define CTI_CIDR2_PRMBL_2_Max (0x5UL)
  #define CTI_CIDR2_PRMBL_2_Value (0x05UL)


/* CTI_CIDR3: Component ID3 Register */
  #define CTI_CIDR3_ResetValue (0x000000B1UL)

/* PRMBL_3 @Bits 0..7 : Preamble[3]. Contains bits[31:24] of the component identification code. */
  #define CTI_CIDR3_PRMBL_3_Pos (0UL)
  #define CTI_CIDR3_PRMBL_3_Msk (0xFFUL << CTI_CIDR3_PRMBL_3_Pos)
  #define CTI_CIDR3_PRMBL_3_Min (0xB1UL)
  #define CTI_CIDR3_PRMBL_3_Max (0xB1UL)
  #define CTI_CIDR3_PRMBL_3_Value (0xB1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        CTRLAPPERI                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct CTRLAPPERI_MAILBOX ================================================ */
/**
  * @brief MAILBOX [CTRLAPPERI_MAILBOX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RXDATA;
  __IM  uint32_t  RXSTATUS;                          /*!< (@ 0x00000004) Status to indicate if data sent from the debugger to
                                                                         the CPU has been read*/
  __IM  uint32_t  RESERVED[30];
  __IOM uint32_t  TXDATA;
  __IM  uint32_t  TXSTATUS;                          /*!< (@ 0x00000084) Status to indicate if data sent from the CPU to the
                                                                         debugger has been read*/
  __IM  uint32_t  BOOTMODE;
} NRF_CTRLAPPERI_MAILBOX_Type;

/* CTRLAPPERI_MAILBOX_RXDATA: Data sent from the debugger to the CPU */
  #define CTRLAPPERI_MAILBOX_RXDATA_ResetValue (0x00000000UL)

/* RXDATA @Bits 0..31 : Data received from debugger */
  #define CTRLAPPERI_MAILBOX_RXDATA_RXDATA_Pos (0UL)
  #define CTRLAPPERI_MAILBOX_RXDATA_RXDATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_MAILBOX_RXDATA_RXDATA_Pos) /*!< Bit mask of RXDATA
                                                                            field.*/


/* CTRLAPPERI_MAILBOX_RXSTATUS: Status to indicate if data sent from the debugger to the CPU has been read */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_ResetValue (0x00000000UL)

/* RXSTATUS @Bit 0 : Status of data in register RXDATA */
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Pos (0UL)
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Msk (0x1UL << CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Pos) /*!< Bit mask of RXSTATUS
                                                                            field.*/
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Min (0x0UL)
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_Max (0x1UL)
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_NoDataPending (0x0UL)
  #define CTRLAPPERI_MAILBOX_RXSTATUS_RXSTATUS_DataPending (0x1UL)


/* CTRLAPPERI_MAILBOX_TXDATA: Data sent from the CPU to the debugger */
  #define CTRLAPPERI_MAILBOX_TXDATA_ResetValue (0x00000000UL)

/* TXDATA @Bits 0..31 : Data sent to debugger */
  #define CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Pos (0UL)
  #define CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Msk (0xFFFFFFFFUL << CTRLAPPERI_MAILBOX_TXDATA_TXDATA_Pos) /*!< Bit mask of TXDATA
                                                                            field.*/


/* CTRLAPPERI_MAILBOX_TXSTATUS: Status to indicate if data sent from the CPU to the debugger has been read */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_ResetValue (0x00000000UL)

/* TXSTATUS @Bit 0 : Status of data in register TXDATA */
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Pos (0UL)
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Msk (0x1UL << CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Pos) /*!< Bit mask of TXSTATUS
                                                                            field.*/
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Min (0x0UL)
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_Max (0x1UL)
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_NoDataPending (0x0UL)
  #define CTRLAPPERI_MAILBOX_TXSTATUS_TXSTATUS_DataPending (0x1UL)


/* CTRLAPPERI_MAILBOX_BOOTMODE: Secure domain boot mode. */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_ResetValue (0x00000000UL)

/* MODE @Bit 0 : Mode */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Pos (0UL)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Msk (0x1UL << CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Pos)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Min (0x0UL)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Max (0x1UL)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_Normal (0x0UL)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_MODE_ROMOperation (0x1UL)

/* SAFEMODE @Bit 4 : Secure domain safe boot mode */
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Pos (4UL)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Msk (0x1UL << CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Pos) /*!< Bit mask of SAFEMODE
                                                                            field.*/
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Min (0x0UL)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Max (0x1UL)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_Normal (0x0UL)
  #define CTRLAPPERI_MAILBOX_BOOTMODE_SAFEMODE_SafeOperation (0x1UL)



/* ================================================= Struct CTRLAPPERI_INFO ================================================== */
/**
  * @brief INFO [CTRLAPPERI_INFO] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  READY;
} NRF_CTRLAPPERI_INFO_Type;

/* CTRLAPPERI_INFO_READY: Ready status. */
  #define CTRLAPPERI_INFO_READY_ResetValue (0x00000001UL)

