pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* READY @Bit 0 : Ready status. */
  #define CTRLAPPERI_INFO_READY_READY_Pos (0UL)
  #define CTRLAPPERI_INFO_READY_READY_Msk (0x1UL << CTRLAPPERI_INFO_READY_READY_Pos)
  #define CTRLAPPERI_INFO_READY_READY_Min (0x0UL)
  #define CTRLAPPERI_INFO_READY_READY_Max (0x1UL)
  #define CTRLAPPERI_INFO_READY_READY_Ready (0x0UL)
  #define CTRLAPPERI_INFO_READY_READY_NotReady (0x1UL)


/* ==================================================== Struct CTRLAPPERI ==================================================== */
/**
  * @brief Control access port
  */
  typedef struct {
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_RXREADY;
    __IOM uint32_t EVENTS_TXDONE;
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED2[60];
    __IOM NRF_CTRLAPPERI_MAILBOX_Type MAILBOX;
    __IM uint32_t RESERVED3[29];
    __IOM NRF_CTRLAPPERI_INFO_Type INFO;
    __IOM uint32_t BOOTSTATUS;
  } NRF_CTRLAPPERI_Type;

/* CTRLAPPERI_EVENTS_RXREADY: The RXSTATUS is changed to DataPending */
  #define CTRLAPPERI_EVENTS_RXREADY_ResetValue (0x00000000UL)

/* EVENTS_RXREADY @Bit 0 : The RXSTATUS is changed to DataPending */
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Pos (0UL)
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Msk (0x1UL << CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Pos) /*!< Bit mask of
                                                                            EVENTS_RXREADY field.*/
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Min (0x0UL)
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Max (0x1UL)
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_NotGenerated (0x0UL)
  #define CTRLAPPERI_EVENTS_RXREADY_EVENTS_RXREADY_Generated (0x1UL)


/* CTRLAPPERI_EVENTS_TXDONE: The TXSTATUS is changed to NoDataPending */
  #define CTRLAPPERI_EVENTS_TXDONE_ResetValue (0x00000000UL)

/* EVENTS_TXDONE @Bit 0 : The TXSTATUS is changed to NoDataPending */
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Pos (0UL)
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Msk (0x1UL << CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_TXDONE field.*/
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Min (0x0UL)
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Max (0x1UL)
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_NotGenerated (0x0UL)
  #define CTRLAPPERI_EVENTS_TXDONE_EVENTS_TXDONE_Generated (0x1UL)


/* CTRLAPPERI_INTEN: Enable or disable interrupt */
  #define CTRLAPPERI_INTEN_ResetValue (0x00000000UL)

/* RXREADY @Bit 0 : Enable or disable interrupt for event RXREADY */
  #define CTRLAPPERI_INTEN_RXREADY_Pos (0UL)
  #define CTRLAPPERI_INTEN_RXREADY_Msk (0x1UL << CTRLAPPERI_INTEN_RXREADY_Pos)
  #define CTRLAPPERI_INTEN_RXREADY_Min (0x0UL)
  #define CTRLAPPERI_INTEN_RXREADY_Max (0x1UL)
  #define CTRLAPPERI_INTEN_RXREADY_Disabled (0x0UL)
  #define CTRLAPPERI_INTEN_RXREADY_Enabled (0x1UL)

/* TXDONE @Bit 1 : Enable or disable interrupt for event TXDONE */
  #define CTRLAPPERI_INTEN_TXDONE_Pos (1UL)
  #define CTRLAPPERI_INTEN_TXDONE_Msk (0x1UL << CTRLAPPERI_INTEN_TXDONE_Pos)
  #define CTRLAPPERI_INTEN_TXDONE_Min (0x0UL)
  #define CTRLAPPERI_INTEN_TXDONE_Max (0x1UL)
  #define CTRLAPPERI_INTEN_TXDONE_Disabled (0x0UL)
  #define CTRLAPPERI_INTEN_TXDONE_Enabled (0x1UL)


/* CTRLAPPERI_INTENSET: Enable interrupt */
  #define CTRLAPPERI_INTENSET_ResetValue (0x00000000UL)

/* RXREADY @Bit 0 : Write '1' to enable interrupt for event RXREADY */
  #define CTRLAPPERI_INTENSET_RXREADY_Pos (0UL)
  #define CTRLAPPERI_INTENSET_RXREADY_Msk (0x1UL << CTRLAPPERI_INTENSET_RXREADY_Pos)
  #define CTRLAPPERI_INTENSET_RXREADY_Min (0x0UL)
  #define CTRLAPPERI_INTENSET_RXREADY_Max (0x1UL)
  #define CTRLAPPERI_INTENSET_RXREADY_Set (0x1UL)
  #define CTRLAPPERI_INTENSET_RXREADY_Disabled (0x0UL)
  #define CTRLAPPERI_INTENSET_RXREADY_Enabled (0x1UL)

/* TXDONE @Bit 1 : Write '1' to enable interrupt for event TXDONE */
  #define CTRLAPPERI_INTENSET_TXDONE_Pos (1UL)
  #define CTRLAPPERI_INTENSET_TXDONE_Msk (0x1UL << CTRLAPPERI_INTENSET_TXDONE_Pos)
  #define CTRLAPPERI_INTENSET_TXDONE_Min (0x0UL)
  #define CTRLAPPERI_INTENSET_TXDONE_Max (0x1UL)
  #define CTRLAPPERI_INTENSET_TXDONE_Set (0x1UL)
  #define CTRLAPPERI_INTENSET_TXDONE_Disabled (0x0UL)
  #define CTRLAPPERI_INTENSET_TXDONE_Enabled (0x1UL)


/* CTRLAPPERI_INTENCLR: Disable interrupt */
  #define CTRLAPPERI_INTENCLR_ResetValue (0x00000000UL)

/* RXREADY @Bit 0 : Write '1' to disable interrupt for event RXREADY */
  #define CTRLAPPERI_INTENCLR_RXREADY_Pos (0UL)
  #define CTRLAPPERI_INTENCLR_RXREADY_Msk (0x1UL << CTRLAPPERI_INTENCLR_RXREADY_Pos)
  #define CTRLAPPERI_INTENCLR_RXREADY_Min (0x0UL)
  #define CTRLAPPERI_INTENCLR_RXREADY_Max (0x1UL)
  #define CTRLAPPERI_INTENCLR_RXREADY_Clear (0x1UL)
  #define CTRLAPPERI_INTENCLR_RXREADY_Disabled (0x0UL)
  #define CTRLAPPERI_INTENCLR_RXREADY_Enabled (0x1UL)

/* TXDONE @Bit 1 : Write '1' to disable interrupt for event TXDONE */
  #define CTRLAPPERI_INTENCLR_TXDONE_Pos (1UL)
  #define CTRLAPPERI_INTENCLR_TXDONE_Msk (0x1UL << CTRLAPPERI_INTENCLR_TXDONE_Pos)
  #define CTRLAPPERI_INTENCLR_TXDONE_Min (0x0UL)
  #define CTRLAPPERI_INTENCLR_TXDONE_Max (0x1UL)
  #define CTRLAPPERI_INTENCLR_TXDONE_Clear (0x1UL)
  #define CTRLAPPERI_INTENCLR_TXDONE_Disabled (0x0UL)
  #define CTRLAPPERI_INTENCLR_TXDONE_Enabled (0x1UL)


/* CTRLAPPERI_INTPEND: Pending interrupts */
  #define CTRLAPPERI_INTPEND_ResetValue (0x00000000UL)

/* RXREADY @Bit 0 : Read pending status of interrupt for event RXREADY */
  #define CTRLAPPERI_INTPEND_RXREADY_Pos (0UL)
  #define CTRLAPPERI_INTPEND_RXREADY_Msk (0x1UL << CTRLAPPERI_INTPEND_RXREADY_Pos)
  #define CTRLAPPERI_INTPEND_RXREADY_Min (0x0UL)
  #define CTRLAPPERI_INTPEND_RXREADY_Max (0x1UL)
  #define CTRLAPPERI_INTPEND_RXREADY_NotPending (0x0UL)
  #define CTRLAPPERI_INTPEND_RXREADY_Pending (0x1UL)

/* TXDONE @Bit 1 : Read pending status of interrupt for event TXDONE */
  #define CTRLAPPERI_INTPEND_TXDONE_Pos (1UL)
  #define CTRLAPPERI_INTPEND_TXDONE_Msk (0x1UL << CTRLAPPERI_INTPEND_TXDONE_Pos)
  #define CTRLAPPERI_INTPEND_TXDONE_Min (0x0UL)
  #define CTRLAPPERI_INTPEND_TXDONE_Max (0x1UL)
  #define CTRLAPPERI_INTPEND_TXDONE_NotPending (0x0UL)
  #define CTRLAPPERI_INTPEND_TXDONE_Pending (0x1UL)


/* CTRLAPPERI_BOOTSTATUS: Boot status */
  #define CTRLAPPERI_BOOTSTATUS_ResetValue (0x00000000UL)

