pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VAL @Bits 0..31 : Value */
  #define CTRLAPPERI_BOOTSTATUS_VAL_Pos (0UL)
  #define CTRLAPPERI_BOOTSTATUS_VAL_Msk (0xFFFFFFFFUL << CTRLAPPERI_BOOTSTATUS_VAL_Pos)
  #define CTRLAPPERI_BOOTSTATUS_VAL_Min (0x00000000UL)
  #define CTRLAPPERI_BOOTSTATUS_VAL_Max (0xFFFFFFFFUL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        DCACHEDATA                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct DCACHEDATA_SET_WAY_DU =============================================== */
/**
  * @brief DU [DCACHEDATA_SET_WAY_DU] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[1];                           /*!< (@ 0x00000000) Cache data bits for DATA[q] in DU[p] (DataUnit) of
                                                                         SET[n], WAY[o].*/
} NRF_DCACHEDATA_SET_WAY_DU_Type;
  #define DCACHEDATA_SET_WAY_DU_MaxCount (8UL)
  #define DCACHEDATA_SET_WAY_DU_MaxIndex (7UL)
  #define DCACHEDATA_SET_WAY_DU_MinIndex (0UL)

/* DCACHEDATA_SET_WAY_DU_DATA: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o]. */
  #define DCACHEDATA_SET_WAY_DU_DATA_MaxCount (1UL)
  #define DCACHEDATA_SET_WAY_DU_DATA_MaxIndex (0UL)
  #define DCACHEDATA_SET_WAY_DU_DATA_MinIndex (0UL)
  #define DCACHEDATA_SET_WAY_DU_DATA_ResetValue (0x00000000UL)

/* Data @Bits 0..31 : Data */
  #define DCACHEDATA_SET_WAY_DU_DATA_Data_Pos (0UL)
  #define DCACHEDATA_SET_WAY_DU_DATA_Data_Msk (0xFFFFFFFFUL << DCACHEDATA_SET_WAY_DU_DATA_Data_Pos) /*!< Bit mask of Data
                                                                            field.*/



/* ================================================ Struct DCACHEDATA_SET_WAY ================================================ */
/**
  * @brief WAY [DCACHEDATA_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM NRF_DCACHEDATA_SET_WAY_DU_Type DU[8];
} NRF_DCACHEDATA_SET_WAY_Type;
  #define DCACHEDATA_SET_WAY_MaxCount (2UL)
  #define DCACHEDATA_SET_WAY_MaxIndex (1UL)
  #define DCACHEDATA_SET_WAY_MinIndex (0UL)


/* ================================================== Struct DCACHEDATA_SET ================================================== */
/**
  * @brief SET [DCACHEDATA_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_DCACHEDATA_SET_WAY_Type WAY[2];
} NRF_DCACHEDATA_SET_Type;
  #define DCACHEDATA_SET_MaxCount (256UL)
  #define DCACHEDATA_SET_MaxIndex (255UL)
  #define DCACHEDATA_SET_MinIndex (0UL)

/* ==================================================== Struct DCACHEDATA ==================================================== */
/**
  * @brief CACHEDATA
  */
  typedef struct {
    __IOM NRF_DCACHEDATA_SET_Type SET[256];
  } NRF_DCACHEDATA_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        DCACHEINFO                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct DCACHEINFO_SET_WAY ================================================ */
/**
  * @brief WAY [DCACHEINFO_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INFO;
  __IOM uint32_t  INFOEXT;
} NRF_DCACHEINFO_SET_WAY_Type;
  #define DCACHEINFO_SET_WAY_MaxCount (2UL)
  #define DCACHEINFO_SET_WAY_MaxIndex (1UL)
  #define DCACHEINFO_SET_WAY_MinIndex (0UL)

/* DCACHEINFO_SET_WAY_INFO: Cache information for SET[n], WAY[o]. */
  #define DCACHEINFO_SET_WAY_INFO_ResetValue (0x00000000UL)

/* TAG @Bits 0..19 : Cache tag. */
  #define DCACHEINFO_SET_WAY_INFO_TAG_Pos (0UL)
  #define DCACHEINFO_SET_WAY_INFO_TAG_Msk (0xFFFFFUL << DCACHEINFO_SET_WAY_INFO_TAG_Pos)

/* DUV0 @Bit 24 : Data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Pos (24UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_DUV0_Pos)
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV0_Valid (0x1UL)

/* DUV1 @Bit 25 : Data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Pos (25UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_DUV1_Pos)
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV1_Valid (0x1UL)

/* DUV2 @Bit 26 : Data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Pos (26UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_DUV2_Pos)
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV2_Valid (0x1UL)

/* DUV3 @Bit 27 : Data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Pos (27UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_DUV3_Pos)
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_DUV3_Valid (0x1UL)

/* D0 @Bit 28 : Dirty status of combined data unit 0 and 1. */
  #define DCACHEINFO_SET_WAY_INFO_D0_Pos (28UL)
  #define DCACHEINFO_SET_WAY_INFO_D0_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_D0_Pos)
  #define DCACHEINFO_SET_WAY_INFO_D0_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_D0_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFO_D0_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_D0_Dirty (0x1UL)

