pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* D1 @Bit 29 : Dirty status of combined data unit 2 and 3. */
  #define DCACHEINFO_SET_WAY_INFO_D1_Pos (29UL)
  #define DCACHEINFO_SET_WAY_INFO_D1_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_D1_Pos)
  #define DCACHEINFO_SET_WAY_INFO_D1_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_D1_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFO_D1_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_D1_Dirty (0x1UL)

/* V @Bit 30 : Line valid bit. */
  #define DCACHEINFO_SET_WAY_INFO_V_Pos (30UL)
  #define DCACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_V_Pos)
  #define DCACHEINFO_SET_WAY_INFO_V_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_V_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)

/* MRU @Bit 31 : Most recently used way. */
  #define DCACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)
  #define DCACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << DCACHEINFO_SET_WAY_INFO_MRU_Pos)
  #define DCACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)
  #define DCACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)


/* DCACHEINFO_SET_WAY_INFOEXT: Extended cache information for SET[n], WAY[o]. */
  #define DCACHEINFO_SET_WAY_INFOEXT_ResetValue (0x00000000UL)

/* D0 @Bit 16 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Pos (16UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D0_Pos)
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D0_Dirty (0x1UL)

/* D1 @Bit 17 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Pos (17UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D1_Pos)
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D1_Dirty (0x1UL)

/* D2 @Bit 18 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Pos (18UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D2_Pos)
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D2_Dirty (0x1UL)

/* D3 @Bit 19 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Pos (19UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D3_Pos)
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D3_Dirty (0x1UL)

/* D4 @Bit 20 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Pos (20UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D4_Pos)
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D4_Dirty (0x1UL)

/* D5 @Bit 21 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Pos (21UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D5_Pos)
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D5_Dirty (0x1UL)

/* D6 @Bit 22 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Pos (22UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D6_Pos)
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D6_Dirty (0x1UL)

/* D7 @Bit 23 : Dirty status. */
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Pos (23UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_D7_Pos)
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Clean (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_D7_Dirty (0x1UL)

/* DUVEXT0 @Bit 24 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Pos (24UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Pos) /*!< Bit mask of DUVEXT0
                                                                            field.*/
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT0_Valid (0x1UL)

/* DUVEXT1 @Bit 25 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Pos (25UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Pos) /*!< Bit mask of DUVEXT1
                                                                            field.*/
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT1_Valid (0x1UL)

/* DUVEXT2 @Bit 26 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Pos (26UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Pos) /*!< Bit mask of DUVEXT2
                                                                            field.*/
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT2_Valid (0x1UL)

/* DUVEXT3 @Bit 27 : Extended data unit valid info. */
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Pos (27UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Msk (0x1UL << DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Pos) /*!< Bit mask of DUVEXT3
                                                                            field.*/
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Min (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Max (0x1UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Invalid (0x0UL)
  #define DCACHEINFO_SET_WAY_INFOEXT_DUVEXT3_Valid (0x1UL)



/* ================================================== Struct DCACHEINFO_SET ================================================== */
/**
  * @brief SET [DCACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_DCACHEINFO_SET_WAY_Type WAY[2];
} NRF_DCACHEINFO_SET_Type;
  #define DCACHEINFO_SET_MaxCount (256UL)
  #define DCACHEINFO_SET_MaxIndex (255UL)
  #define DCACHEINFO_SET_MinIndex (0UL)

/* ==================================================== Struct DCACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {
    __IOM NRF_DCACHEINFO_SET_Type SET[256];
  } NRF_DCACHEINFO_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            DMU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct DMU ======================================================== */
/**
  * @brief DMU
  */
  typedef struct {
    __IM uint32_t RESERVED[240];
    __IM uint32_t DMUCR;
    __IOM uint32_t DMUI;
    __IOM uint32_t DMUQC;
    __IOM uint32_t DMUIR;
    __IOM uint32_t DMUIE;
    __IOM uint32_t DMUC;
  } NRF_DMU_Type;

/* DMU_DMUCR: DMU Core Release */
  #define DMU_DMUCR_ResetValue (0x00000000UL)

/* REL @Bit 1 : Core Release */
  #define DMU_DMUCR_REL_Pos (1UL)
  #define DMU_DMUCR_REL_Msk (0x1UL << DMU_DMUCR_REL_Pos)

