pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* STEP @Bit 2 : Step of Core Release */
  #define DMU_DMUCR_STEP_Pos (2UL)
  #define DMU_DMUCR_STEP_Msk (0x1UL << DMU_DMUCR_STEP_Pos)

/* SUBSTEP @Bit 3 : Sub-step of Core Release */
  #define DMU_DMUCR_SUBSTEP_Pos (3UL)
  #define DMU_DMUCR_SUBSTEP_Msk (0x1UL << DMU_DMUCR_SUBSTEP_Pos)

/* YEAR @Bit 4 : Time Stamp Year */
  #define DMU_DMUCR_YEAR_Pos (4UL)
  #define DMU_DMUCR_YEAR_Msk (0x1UL << DMU_DMUCR_YEAR_Pos)

/* MON @Bit 6 : Time Stamp Month */
  #define DMU_DMUCR_MON_Pos (6UL)
  #define DMU_DMUCR_MON_Msk (0x1UL << DMU_DMUCR_MON_Pos)

/* DAY @Bit 8 : Time Stamp Day */
  #define DMU_DMUCR_DAY_Pos (8UL)
  #define DMU_DMUCR_DAY_Msk (0x1UL << DMU_DMUCR_DAY_Pos)


/* DMU_DMUI: DMU Internals */
  #define DMU_DMUI_ResetValue (0x00070000UL)

/* TXR @Bit 0 : TX Service Request line of DMU */
  #define DMU_DMUI_TXR_Pos (0UL)
  #define DMU_DMUI_TXR_Msk (0x1UL << DMU_DMUI_TXR_Pos)
  #define DMU_DMUI_TXR_Min (0x0UL)
  #define DMU_DMUI_TXR_Max (0x1UL)
  #define DMU_DMUI_TXR_NotRequested (0x0UL)
  #define DMU_DMUI_TXR_Requested (0x1UL)

/* RX0R @Bit 1 : RX0 Service Request line of DMU */
  #define DMU_DMUI_RX0R_Pos (1UL)
  #define DMU_DMUI_RX0R_Msk (0x1UL << DMU_DMUI_RX0R_Pos)
  #define DMU_DMUI_RX0R_Min (0x0UL)
  #define DMU_DMUI_RX0R_Max (0x1UL)
  #define DMU_DMUI_RX0R_NotRequested (0x0UL)
  #define DMU_DMUI_RX0R_Requested (0x1UL)

/* RX1R @Bit 2 : RX1 Service Request line of DMU */
  #define DMU_DMUI_RX1R_Pos (2UL)
  #define DMU_DMUI_RX1R_Msk (0x1UL << DMU_DMUI_RX1R_Pos)
  #define DMU_DMUI_RX1R_Min (0x0UL)
  #define DMU_DMUI_RX1R_Max (0x1UL)
  #define DMU_DMUI_RX1R_NotRequested (0x0UL)
  #define DMU_DMUI_RX1R_Requested (0x1UL)

/* TXER @Bit 3 : TX Event Service Request line of DMU */
  #define DMU_DMUI_TXER_Pos (3UL)
  #define DMU_DMUI_TXER_Msk (0x1UL << DMU_DMUI_TXER_Pos)
  #define DMU_DMUI_TXER_Min (0x0UL)
  #define DMU_DMUI_TXER_Max (0x1UL)
  #define DMU_DMUI_TXER_NotRequested (0x0UL)
  #define DMU_DMUI_TXER_Requested (0x1UL)

/* TFQPIP @Bits 8..12 : TX FIFO/Queue Put Index Previous */
  #define DMU_DMUI_TFQPIP_Pos (8UL)
  #define DMU_DMUI_TFQPIP_Msk (0x1FUL << DMU_DMUI_TFQPIP_Pos)

/* ENA @Bit 15 : DMU is enabled */
  #define DMU_DMUI_ENA_Pos (15UL)
  #define DMU_DMUI_ENA_Msk (0x1UL << DMU_DMUI_ENA_Pos)
  #define DMU_DMUI_ENA_Min (0x0UL)
  #define DMU_DMUI_ENA_Max (0x1UL)
  #define DMU_DMUI_ENA_Disabled (0x0UL)
  #define DMU_DMUI_ENA_Enabled (0x1UL)

/* DEHS @Bits 16..18 : Detect Element Handler State */
  #define DMU_DMUI_DEHS_Pos (16UL)
  #define DMU_DMUI_DEHS_Msk (0x7UL << DMU_DMUI_DEHS_Pos)

/* DTX @Bit 20 : Detect DMU Element Service */
  #define DMU_DMUI_DTX_Pos (20UL)
  #define DMU_DMUI_DTX_Msk (0x1UL << DMU_DMUI_DTX_Pos)
  #define DMU_DMUI_DTX_Min (0x0UL)
  #define DMU_DMUI_DTX_Max (0x1UL)
  #define DMU_DMUI_DTX_Disabled (0x0UL)
  #define DMU_DMUI_DTX_Enabled (0x1UL)               /*!< Queueing of DMU Element will activate interrupt flag when DMUI.EHS =
                                                          DMUI.DEHS*/

/* DRX0 @Bit 21 : Detect DMU Element Service */
  #define DMU_DMUI_DRX0_Pos (21UL)
  #define DMU_DMUI_DRX0_Msk (0x1UL << DMU_DMUI_DRX0_Pos)
  #define DMU_DMUI_DRX0_Min (0x0UL)
  #define DMU_DMUI_DRX0_Max (0x1UL)
  #define DMU_DMUI_DRX0_Disabled (0x0UL)
  #define DMU_DMUI_DRX0_Enabled (0x1UL)              /*!< Queueing of DMU Element will activate interrupt flag when DMUI.EHS =
                                                          DMUI.DEHS*/

/* DRX1 @Bit 22 : Detect DMU Element Service */
  #define DMU_DMUI_DRX1_Pos (22UL)
  #define DMU_DMUI_DRX1_Msk (0x1UL << DMU_DMUI_DRX1_Pos)
  #define DMU_DMUI_DRX1_Min (0x0UL)
  #define DMU_DMUI_DRX1_Max (0x1UL)
  #define DMU_DMUI_DRX1_Disabled (0x0UL)
  #define DMU_DMUI_DRX1_Enabled (0x1UL)              /*!< Queueing of DMU Element will activate interrupt flag when DMUI.EHS =
                                                          DMUI.DEHS*/

/* DTXE @Bit 23 : Detect DMU Element Service */
  #define DMU_DMUI_DTXE_Pos (23UL)
  #define DMU_DMUI_DTXE_Msk (0x1UL << DMU_DMUI_DTXE_Pos)
  #define DMU_DMUI_DTXE_Min (0x0UL)
  #define DMU_DMUI_DTXE_Max (0x1UL)
  #define DMU_DMUI_DTXE_Disabled (0x0UL)
  #define DMU_DMUI_DTXE_Enabled (0x1UL)              /*!< Queueing of DMU Element will activate interrupt flag when DMUI.EHS =
                                                          DMUI.DEHS*/

/* EHS @Bits 24..26 : Element Handler State */
  #define DMU_DMUI_EHS_Pos (24UL)
  #define DMU_DMUI_EHS_Msk (0x7UL << DMU_DMUI_EHS_Pos)
  #define DMU_DMUI_EHS_Min (0x0UL)
  #define DMU_DMUI_EHS_Max (0x5UL)
  #define DMU_DMUI_EHS_wait4cce (0x0UL)
  #define DMU_DMUI_EHS_wait4sa (0x1UL)
  #define DMU_DMUI_EHS_wait4ta (0x2UL)
  #define DMU_DMUI_EHS_transfer (0x3UL)
  #define DMU_DMUI_EHS_ack2mcan (0x4UL)
  #define DMU_DMUI_EHS_recovery (0x5UL)

/* TX @Bit 28 : Actual DMU Element Service */
  #define DMU_DMUI_TX_Pos (28UL)
  #define DMU_DMUI_TX_Msk (0x1UL << DMU_DMUI_TX_Pos)
  #define DMU_DMUI_TX_Min (0x0UL)
  #define DMU_DMUI_TX_Max (0x1UL)
  #define DMU_DMUI_TX_NotServed (0x0UL)
  #define DMU_DMUI_TX_Served (0x1UL)

/* RX0 @Bit 29 : Actual DMU Element Service */
  #define DMU_DMUI_RX0_Pos (29UL)
  #define DMU_DMUI_RX0_Msk (0x1UL << DMU_DMUI_RX0_Pos)
  #define DMU_DMUI_RX0_Min (0x0UL)
  #define DMU_DMUI_RX0_Max (0x1UL)
  #define DMU_DMUI_RX0_NotServed (0x0UL)
  #define DMU_DMUI_RX0_Served (0x1UL)

/* RX1 @Bit 30 : Actual DMU Element Service */
  #define DMU_DMUI_RX1_Pos (30UL)
  #define DMU_DMUI_RX1_Msk (0x1UL << DMU_DMUI_RX1_Pos)
  #define DMU_DMUI_RX1_Min (0x0UL)
  #define DMU_DMUI_RX1_Max (0x1UL)
  #define DMU_DMUI_RX1_NotServed (0x0UL)
  #define DMU_DMUI_RX1_Served (0x1UL)

/* TXE @Bit 31 : Actual DMU Element Service */
  #define DMU_DMUI_TXE_Pos (31UL)
  #define DMU_DMUI_TXE_Msk (0x1UL << DMU_DMUI_TXE_Pos)
  #define DMU_DMUI_TXE_Min (0x0UL)
  #define DMU_DMUI_TXE_Max (0x1UL)
  #define DMU_DMUI_TXE_NotServed (0x0UL)
  #define DMU_DMUI_TXE_Served (0x1UL)


/* DMU_DMUQC: DMU Queueing Counter */
  #define DMU_DMUQC_ResetValue (0x00000000UL)

/* TXEEC @Bits 0..7 : TX Element Enqueueing Counter */
  #define DMU_DMUQC_TXEEC_Pos (0UL)
  #define DMU_DMUQC_TXEEC_Msk (0xFFUL << DMU_DMUQC_TXEEC_Pos)

/* RX0EDC @Bits 8..15 : RX0 Element Dequeueing Counter */
  #define DMU_DMUQC_RX0EDC_Pos (8UL)
  #define DMU_DMUQC_RX0EDC_Msk (0xFFUL << DMU_DMUQC_RX0EDC_Pos)

/* RX1EDC @Bits 16..23 : RX1 Element Dequeueing Counter */
  #define DMU_DMUQC_RX1EDC_Pos (16UL)
  #define DMU_DMUQC_RX1EDC_Msk (0xFFUL << DMU_DMUQC_RX1EDC_Pos)

/* TXEEDC @Bits 24..31 : TX Event Element Dequeueing Counter */
  #define DMU_DMUQC_TXEEDC_Pos (24UL)
  #define DMU_DMUQC_TXEEDC_Msk (0xFFUL << DMU_DMUQC_TXEEDC_Pos)


/* DMU_DMUIR: DMU Interrupt Register */
  #define DMU_DMUIR_ResetValue (0x00000000UL)

/* TXENSA @Bit 0 : TX Element Not Start Address */
  #define DMU_DMUIR_TXENSA_Pos (0UL)
  #define DMU_DMUIR_TXENSA_Msk (0x1UL << DMU_DMUIR_TXENSA_Pos)
  #define DMU_DMUIR_TXENSA_Min (0x0UL)
  #define DMU_DMUIR_TXENSA_Max (0x1UL)
  #define DMU_DMUIR_TXENSA_Clear (0x1UL)
  #define DMU_DMUIR_TXENSA_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXENSA_Generated (0x1UL)         /*!< Write to TX Element begins without using start address, exception
                                                          recovery started.*/

/* TXEIE @Bit 1 : TX Element Illegal Enqueueing */
  #define DMU_DMUIR_TXEIE_Pos (1UL)
  #define DMU_DMUIR_TXEIE_Msk (0x1UL << DMU_DMUIR_TXEIE_Pos)
  #define DMU_DMUIR_TXEIE_Min (0x0UL)
  #define DMU_DMUIR_TXEIE_Max (0x1UL)
  #define DMU_DMUIR_TXEIE_Clear (0x1UL)
  #define DMU_DMUIR_TXEIE_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEIE_Generated (0x1UL)          /*!< Start of enqueueing without request detected, exception recovery
                                                          started.*/

