pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TXEIAS @Bit 2 : TX Element Illegal Access Sequence */
  #define DMU_DMUIR_TXEIAS_Pos (2UL)
  #define DMU_DMUIR_TXEIAS_Msk (0x1UL << DMU_DMUIR_TXEIAS_Pos)
  #define DMU_DMUIR_TXEIAS_Min (0x0UL)
  #define DMU_DMUIR_TXEIAS_Max (0x1UL)
  #define DMU_DMUIR_TXEIAS_Clear (0x1UL)
  #define DMU_DMUIR_TXEIAS_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEIAS_Generated (0x1UL)         /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* TXEIDLC @Bit 3 : TX Element Illegal DLC */
  #define DMU_DMUIR_TXEIDLC_Pos (3UL)
  #define DMU_DMUIR_TXEIDLC_Msk (0x1UL << DMU_DMUIR_TXEIDLC_Pos)
  #define DMU_DMUIR_TXEIDLC_Min (0x0UL)
  #define DMU_DMUIR_TXEIDLC_Max (0x1UL)
  #define DMU_DMUIR_TXEIDLC_Clear (0x1UL)
  #define DMU_DMUIR_TXEIDLC_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEIDLC_Generated (0x1UL)        /*!< DLC exceeds Tx Buffer element size of MCAN, exception recovery
                                                          started.*/

/* TXEWATA @Bit 4 : TX Element Write After Trigger Address */
  #define DMU_DMUIR_TXEWATA_Pos (4UL)
  #define DMU_DMUIR_TXEWATA_Msk (0x1UL << DMU_DMUIR_TXEWATA_Pos)
  #define DMU_DMUIR_TXEWATA_Min (0x0UL)
  #define DMU_DMUIR_TXEWATA_Max (0x1UL)
  #define DMU_DMUIR_TXEWATA_Clear (0x1UL)
  #define DMU_DMUIR_TXEWATA_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEWATA_Generated (0x1UL)

/* TXEIR @Bit 5 : TX Element Illegal Read */
  #define DMU_DMUIR_TXEIR_Pos (5UL)
  #define DMU_DMUIR_TXEIR_Msk (0x1UL << DMU_DMUIR_TXEIR_Pos)
  #define DMU_DMUIR_TXEIR_Min (0x0UL)
  #define DMU_DMUIR_TXEIR_Max (0x1UL)
  #define DMU_DMUIR_TXEIR_Clear (0x1UL)
  #define DMU_DMUIR_TXEIR_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEIR_Generated (0x1UL)          /*!< Illegal read access to DMU TX Element section detected, exception
                                                          recovery started.*/

/* TXEE @Bit 6 : A successful enqueueing of a Tx message with the DMU TX Element section sets this flag. */
  #define DMU_DMUIR_TXEE_Pos (6UL)
  #define DMU_DMUIR_TXEE_Msk (0x1UL << DMU_DMUIR_TXEE_Pos)
  #define DMU_DMUIR_TXEE_Min (0x0UL)
  #define DMU_DMUIR_TXEE_Max (0x1UL)
  #define DMU_DMUIR_TXEE_Clear (0x1UL)
  #define DMU_DMUIR_TXEE_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEE_Generated (0x1UL)

/* RX0ENSA @Bit 7 : RX0 Element Not Start Address */
  #define DMU_DMUIR_RX0ENSA_Pos (7UL)
  #define DMU_DMUIR_RX0ENSA_Msk (0x1UL << DMU_DMUIR_RX0ENSA_Pos)
  #define DMU_DMUIR_RX0ENSA_Min (0x0UL)
  #define DMU_DMUIR_RX0ENSA_Max (0x1UL)
  #define DMU_DMUIR_RX0ENSA_Clear (0x1UL)
  #define DMU_DMUIR_RX0ENSA_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX0ENSA_Generated (0x1UL)        /*!< Read from RX0 Element begins without using start address, exception
                                                          recovery started.*/

/* RX0EID @Bit 8 : RX0 Element Illegal Dequeueing */
  #define DMU_DMUIR_RX0EID_Pos (8UL)
  #define DMU_DMUIR_RX0EID_Msk (0x1UL << DMU_DMUIR_RX0EID_Pos)
  #define DMU_DMUIR_RX0EID_Min (0x0UL)
  #define DMU_DMUIR_RX0EID_Max (0x1UL)
  #define DMU_DMUIR_RX0EID_Clear (0x1UL)
  #define DMU_DMUIR_RX0EID_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX0EID_Generated (0x1UL)         /*!< Start of dequeueing without request detected, exception recovery
                                                          started,*/

/* RX0EIAS @Bit 9 : RX0 Element Illegal Access Sequence */
  #define DMU_DMUIR_RX0EIAS_Pos (9UL)
  #define DMU_DMUIR_RX0EIAS_Msk (0x1UL << DMU_DMUIR_RX0EIAS_Pos)
  #define DMU_DMUIR_RX0EIAS_Min (0x0UL)
  #define DMU_DMUIR_RX0EIAS_Max (0x1UL)
  #define DMU_DMUIR_RX0EIAS_Clear (0x1UL)
  #define DMU_DMUIR_RX0EIAS_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX0EIAS_Generated (0x1UL)        /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* RX0EIW @Bit 10 : RX0 Element Illegal Write */
  #define DMU_DMUIR_RX0EIW_Pos (10UL)
  #define DMU_DMUIR_RX0EIW_Msk (0x1UL << DMU_DMUIR_RX0EIW_Pos)
  #define DMU_DMUIR_RX0EIW_Min (0x0UL)
  #define DMU_DMUIR_RX0EIW_Max (0x1UL)
  #define DMU_DMUIR_RX0EIW_Clear (0x1UL)
  #define DMU_DMUIR_RX0EIW_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX0EIW_Generated (0x1UL)         /*!< Illegal write access to DMU RX0 Element detected, exception recovery
                                                          started.*/

/* RX0ED @Bit 11 : RX0 Element Dequeued */
  #define DMU_DMUIR_RX0ED_Pos (11UL)
  #define DMU_DMUIR_RX0ED_Msk (0x1UL << DMU_DMUIR_RX0ED_Pos)
  #define DMU_DMUIR_RX0ED_Min (0x0UL)
  #define DMU_DMUIR_RX0ED_Max (0x1UL)
  #define DMU_DMUIR_RX0ED_Clear (0x1UL)
  #define DMU_DMUIR_RX0ED_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX0ED_Generated (0x1UL)

/* RX0EIO @Bit 12 : RX0 Element Illegal Overwrite by timestamp */
  #define DMU_DMUIR_RX0EIO_Pos (12UL)
  #define DMU_DMUIR_RX0EIO_Msk (0x1UL << DMU_DMUIR_RX0EIO_Pos)
  #define DMU_DMUIR_RX0EIO_Min (0x0UL)
  #define DMU_DMUIR_RX0EIO_Max (0x1UL)
  #define DMU_DMUIR_RX0EIO_Clear (0x1UL)
  #define DMU_DMUIR_RX0EIO_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX0EIO_Generated (0x1UL)         /*!< DMU has internally overwritten the last element word of a SYNC
                                                          message*/

/* BEU @Bit 15 : Bus Error Uncorrected */
  #define DMU_DMUIR_BEU_Pos (15UL)
  #define DMU_DMUIR_BEU_Msk (0x1UL << DMU_DMUIR_BEU_Pos)
  #define DMU_DMUIR_BEU_Min (0x0UL)
  #define DMU_DMUIR_BEU_Max (0x1UL)
  #define DMU_DMUIR_BEU_Clear (0x1UL)
  #define DMU_DMUIR_BEU_NotGenerated (0x0UL)
  #define DMU_DMUIR_BEU_Generated (0x1UL)

/* RX1ENSA @Bit 16 : RX1 Element Not Start Address */
  #define DMU_DMUIR_RX1ENSA_Pos (16UL)
  #define DMU_DMUIR_RX1ENSA_Msk (0x1UL << DMU_DMUIR_RX1ENSA_Pos)
  #define DMU_DMUIR_RX1ENSA_Min (0x0UL)
  #define DMU_DMUIR_RX1ENSA_Max (0x1UL)
  #define DMU_DMUIR_RX1ENSA_Clear (0x1UL)
  #define DMU_DMUIR_RX1ENSA_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX1ENSA_Generated (0x1UL)        /*!< Read from RX1 Element begins without using start address, exception
                                                          recovery started.*/

/* RX1EID @Bit 17 : RX1 Element Illegal Dequeueing */
  #define DMU_DMUIR_RX1EID_Pos (17UL)
  #define DMU_DMUIR_RX1EID_Msk (0x1UL << DMU_DMUIR_RX1EID_Pos)
  #define DMU_DMUIR_RX1EID_Min (0x0UL)
  #define DMU_DMUIR_RX1EID_Max (0x1UL)
  #define DMU_DMUIR_RX1EID_Clear (0x1UL)
  #define DMU_DMUIR_RX1EID_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX1EID_Generated (0x1UL)         /*!< Start of dequeueing without request detected, exception recovery
                                                          started,*/

/* RX1EIAS @Bit 18 : RX0 Element Illegal Access Sequence */
  #define DMU_DMUIR_RX1EIAS_Pos (18UL)
  #define DMU_DMUIR_RX1EIAS_Msk (0x1UL << DMU_DMUIR_RX1EIAS_Pos)
  #define DMU_DMUIR_RX1EIAS_Min (0x0UL)
  #define DMU_DMUIR_RX1EIAS_Max (0x1UL)
  #define DMU_DMUIR_RX1EIAS_Clear (0x1UL)
  #define DMU_DMUIR_RX1EIAS_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX1EIAS_Generated (0x1UL)        /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* RX1EIW @Bit 19 : RX1 Element Illegal Write */
  #define DMU_DMUIR_RX1EIW_Pos (19UL)
  #define DMU_DMUIR_RX1EIW_Msk (0x1UL << DMU_DMUIR_RX1EIW_Pos)
  #define DMU_DMUIR_RX1EIW_Min (0x0UL)
  #define DMU_DMUIR_RX1EIW_Max (0x1UL)
  #define DMU_DMUIR_RX1EIW_Clear (0x1UL)
  #define DMU_DMUIR_RX1EIW_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX1EIW_Generated (0x1UL)         /*!< Illegal write access to DMU RX1 Element detected, exception recovery
                                                          started.*/

