pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RX1ED @Bit 20 : RX0 Element Dequeued */
  #define DMU_DMUIR_RX1ED_Pos (20UL)
  #define DMU_DMUIR_RX1ED_Msk (0x1UL << DMU_DMUIR_RX1ED_Pos)
  #define DMU_DMUIR_RX1ED_Min (0x0UL)
  #define DMU_DMUIR_RX1ED_Max (0x1UL)
  #define DMU_DMUIR_RX1ED_Clear (0x1UL)
  #define DMU_DMUIR_RX1ED_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX1ED_Generated (0x1UL)

/* RX1EIO @Bit 21 : RX1 Element Illegal Overwrite by timestamp */
  #define DMU_DMUIR_RX1EIO_Pos (21UL)
  #define DMU_DMUIR_RX1EIO_Msk (0x1UL << DMU_DMUIR_RX1EIO_Pos)
  #define DMU_DMUIR_RX1EIO_Min (0x0UL)
  #define DMU_DMUIR_RX1EIO_Max (0x1UL)
  #define DMU_DMUIR_RX1EIO_Clear (0x1UL)
  #define DMU_DMUIR_RX1EIO_NotGenerated (0x0UL)
  #define DMU_DMUIR_RX1EIO_Generated (0x1UL)         /*!< DMU has internally overwritten the last element word of a SYNC
                                                          message*/

/* TXEENSA @Bit 24 : TX Event Element Not Start Address */
  #define DMU_DMUIR_TXEENSA_Pos (24UL)
  #define DMU_DMUIR_TXEENSA_Msk (0x1UL << DMU_DMUIR_TXEENSA_Pos)
  #define DMU_DMUIR_TXEENSA_Min (0x0UL)
  #define DMU_DMUIR_TXEENSA_Max (0x1UL)
  #define DMU_DMUIR_TXEENSA_Clear (0x1UL)
  #define DMU_DMUIR_TXEENSA_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEENSA_Generated (0x1UL)        /*!< Read from TX Event Element begins without using start address,
                                                          exception recovery started.*/

/* TXEEID @Bit 25 : TX Event Element Illegal Dequeueing */
  #define DMU_DMUIR_TXEEID_Pos (25UL)
  #define DMU_DMUIR_TXEEID_Msk (0x1UL << DMU_DMUIR_TXEEID_Pos)
  #define DMU_DMUIR_TXEEID_Min (0x0UL)
  #define DMU_DMUIR_TXEEID_Max (0x1UL)
  #define DMU_DMUIR_TXEEID_Clear (0x1UL)
  #define DMU_DMUIR_TXEEID_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEEID_Generated (0x1UL)         /*!< Start of dequeueing without request detected, exception recovery
                                                          started.*/

/* TXEEIAS @Bit 26 : TX Event Element Illegal Access Sequence */
  #define DMU_DMUIR_TXEEIAS_Pos (26UL)
  #define DMU_DMUIR_TXEEIAS_Msk (0x1UL << DMU_DMUIR_TXEEIAS_Pos)
  #define DMU_DMUIR_TXEEIAS_Min (0x0UL)
  #define DMU_DMUIR_TXEEIAS_Max (0x1UL)
  #define DMU_DMUIR_TXEEIAS_Clear (0x1UL)
  #define DMU_DMUIR_TXEEIAS_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEEIAS_Generated (0x1UL)        /*!< Accesses are not strictly linear to ascending and consecutive
                                                          addresses, exception recovery started.*/

/* TXEEIW @Bit 27 : TX Event Element Illegal Write */
  #define DMU_DMUIR_TXEEIW_Pos (27UL)
  #define DMU_DMUIR_TXEEIW_Msk (0x1UL << DMU_DMUIR_TXEEIW_Pos)
  #define DMU_DMUIR_TXEEIW_Min (0x0UL)
  #define DMU_DMUIR_TXEEIW_Max (0x1UL)
  #define DMU_DMUIR_TXEEIW_Clear (0x1UL)
  #define DMU_DMUIR_TXEEIW_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEEIW_Generated (0x1UL)         /*!< Illegal write access to DMU TX Event Element detected, exception
                                                          recovery started.*/

/* TXEED @Bit 28 : TX Event Element Dequeued */
  #define DMU_DMUIR_TXEED_Pos (28UL)
  #define DMU_DMUIR_TXEED_Msk (0x1UL << DMU_DMUIR_TXEED_Pos)
  #define DMU_DMUIR_TXEED_Min (0x0UL)
  #define DMU_DMUIR_TXEED_Max (0x1UL)
  #define DMU_DMUIR_TXEED_Clear (0x1UL)
  #define DMU_DMUIR_TXEED_NotGenerated (0x0UL)
  #define DMU_DMUIR_TXEED_Generated (0x1UL)

/* DT @Bit 29 : Debug Trigger */
  #define DMU_DMUIR_DT_Pos (29UL)
  #define DMU_DMUIR_DT_Msk (0x1UL << DMU_DMUIR_DT_Pos)
  #define DMU_DMUIR_DT_Min (0x0UL)
  #define DMU_DMUIR_DT_Max (0x1UL)
  #define DMU_DMUIR_DT_Clear (0x1UL)
  #define DMU_DMUIR_DT_NotGenerated (0x0UL)
  #define DMU_DMUIR_DT_Generated (0x1UL)

/* IAC @Bit 30 : Illegal Access while in Configuration mode */
  #define DMU_DMUIR_IAC_Pos (30UL)
  #define DMU_DMUIR_IAC_Msk (0x1UL << DMU_DMUIR_IAC_Pos)
  #define DMU_DMUIR_IAC_Min (0x0UL)
  #define DMU_DMUIR_IAC_Max (0x1UL)
  #define DMU_DMUIR_IAC_Clear (0x1UL)
  #define DMU_DMUIR_IAC_NotGenerated (0x0UL)
  #define DMU_DMUIR_IAC_Generated (0x1UL)


/* DMU_DMUIE: DMU Interrupt Enable */
  #define DMU_DMUIE_ResetValue (0x00000000UL)

/* TXENSAE @Bit 0 : TX Element Not Start Address Enable */
  #define DMU_DMUIE_TXENSAE_Pos (0UL)
  #define DMU_DMUIE_TXENSAE_Msk (0x1UL << DMU_DMUIE_TXENSAE_Pos)
  #define DMU_DMUIE_TXENSAE_Min (0x0UL)
  #define DMU_DMUIE_TXENSAE_Max (0x1UL)
  #define DMU_DMUIE_TXENSAE_Disabled (0x0UL)
  #define DMU_DMUIE_TXENSAE_Enabled (0x1UL)


/* DMU_DMUC: DMU Configuration */
  #define DMU_DMUC_ResetValue (0x00000000UL)

/* TTS @Bit 0 : Transfer Timestamp */
  #define DMU_DMUC_TTS_Pos (0UL)
  #define DMU_DMUC_TTS_Msk (0x1UL << DMU_DMUC_TTS_Pos)
  #define DMU_DMUC_TTS_Min (0x0UL)
  #define DMU_DMUC_TTS_Max (0x1UL)
  #define DMU_DMUC_TTS_Disabled (0x0UL)
  #define DMU_DMUC_TTS_Enabled (0x1UL)               /*!< Timestamp of message will be transferred from TSU via DMU Virtual
                                                          Buffer*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           DPPIC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct DPPIC_TASKS_CHG ================================================== */
/**
  * @brief TASKS_CHG [DPPIC_TASKS_CHG] Channel group tasks
  */
typedef struct {
  __OM  uint32_t  EN;
  __OM  uint32_t  DIS;
} NRF_DPPIC_TASKS_CHG_Type;
  #define DPPIC_TASKS_CHG_MaxCount (4UL)
  #define DPPIC_TASKS_CHG_MaxIndex (3UL)
  #define DPPIC_TASKS_CHG_MinIndex (0UL)

/* DPPIC_TASKS_CHG_EN: Enable channel group n */
  #define DPPIC_TASKS_CHG_EN_ResetValue (0x00000000UL)

