pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EN @Bit 0 : Enable channel group n */
  #define DPPIC_TASKS_CHG_EN_EN_Pos (0UL)
  #define DPPIC_TASKS_CHG_EN_EN_Msk (0x1UL << DPPIC_TASKS_CHG_EN_EN_Pos)
  #define DPPIC_TASKS_CHG_EN_EN_Min (0x1UL)
  #define DPPIC_TASKS_CHG_EN_EN_Max (0x1UL)
  #define DPPIC_TASKS_CHG_EN_EN_Trigger (0x1UL)


/* DPPIC_TASKS_CHG_DIS: Disable channel group n */
  #define DPPIC_TASKS_CHG_DIS_ResetValue (0x00000000UL)

/* DIS @Bit 0 : Disable channel group n */
  #define DPPIC_TASKS_CHG_DIS_DIS_Pos (0UL)
  #define DPPIC_TASKS_CHG_DIS_DIS_Msk (0x1UL << DPPIC_TASKS_CHG_DIS_DIS_Pos)
  #define DPPIC_TASKS_CHG_DIS_DIS_Min (0x1UL)
  #define DPPIC_TASKS_CHG_DIS_DIS_Max (0x1UL)
  #define DPPIC_TASKS_CHG_DIS_DIS_Trigger (0x1UL)



/* =============================================== Struct DPPIC_SUBSCRIBE_CHG ================================================ */
/**
  * @brief SUBSCRIBE_CHG [DPPIC_SUBSCRIBE_CHG] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  EN;
  __IOM uint32_t  DIS;
} NRF_DPPIC_SUBSCRIBE_CHG_Type;
  #define DPPIC_SUBSCRIBE_CHG_MaxCount (4UL)
  #define DPPIC_SUBSCRIBE_CHG_MaxIndex (3UL)
  #define DPPIC_SUBSCRIBE_CHG_MinIndex (0UL)

/* DPPIC_SUBSCRIBE_CHG_EN: Subscribe configuration for task CHG[n].EN */
  #define DPPIC_SUBSCRIBE_CHG_EN_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CHG[n].EN will subscribe to */
  #define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos (0UL)
  #define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Msk (0xFFUL << DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos)
  #define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Min (0x00UL)
  #define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Pos (31UL)
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Msk (0x1UL << DPPIC_SUBSCRIBE_CHG_EN_EN_Pos)
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Min (0x0UL)
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Max (0x1UL)
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Disabled (0x0UL)
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Enabled (0x1UL)


/* DPPIC_SUBSCRIBE_CHG_DIS: Subscribe configuration for task CHG[n].DIS */
  #define DPPIC_SUBSCRIBE_CHG_DIS_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CHG[n].DIS will subscribe to */
  #define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos (0UL)
  #define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Msk (0xFFUL << DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos)
  #define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Min (0x00UL)
  #define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos (31UL)
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Msk (0x1UL << DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos)
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Min (0x0UL)
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Max (0x1UL)
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Disabled (0x0UL)
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Enabled (0x1UL)


/* ====================================================== Struct DPPIC ======================================================= */
/**
  * @brief Distributed programmable peripheral interconnect controller
  */
  typedef struct {
    __OM NRF_DPPIC_TASKS_CHG_Type TASKS_CHG[4];
    __IM uint32_t RESERVED[24];
    __IOM NRF_DPPIC_SUBSCRIBE_CHG_Type SUBSCRIBE_CHG[4];
    __IM uint32_t RESERVED1[280];
    __IOM uint32_t CHEN;
    __IOM uint32_t CHENSET;
    __IOM uint32_t CHENCLR;
    __IM uint32_t RESERVED2[189];
    __IOM uint32_t CHG[4];                           /*!< (@ 0x00000800) Channel group n Note: Writes to this register are
                                                                         ignored if either SUBSCRIBE_CHG[n].EN or
                                                                         SUBSCRIBE_CHG[n].DIS is enabled*/
  } NRF_DPPIC_Type;

/* DPPIC_CHEN: Channel enable register */
  #define DPPIC_CHEN_ResetValue (0x00000000UL)

/* CH0 @Bit 0 : Enable or disable channel 0 */
  #define DPPIC_CHEN_CH0_Pos (0UL)
  #define DPPIC_CHEN_CH0_Msk (0x1UL << DPPIC_CHEN_CH0_Pos)
  #define DPPIC_CHEN_CH0_Min (0x0UL)
  #define DPPIC_CHEN_CH0_Max (0x1UL)
  #define DPPIC_CHEN_CH0_Disabled (0x0UL)
  #define DPPIC_CHEN_CH0_Enabled (0x1UL)

/* CH1 @Bit 1 : Enable or disable channel 1 */
  #define DPPIC_CHEN_CH1_Pos (1UL)
  #define DPPIC_CHEN_CH1_Msk (0x1UL << DPPIC_CHEN_CH1_Pos)
  #define DPPIC_CHEN_CH1_Min (0x0UL)
  #define DPPIC_CHEN_CH1_Max (0x1UL)
  #define DPPIC_CHEN_CH1_Disabled (0x0UL)
  #define DPPIC_CHEN_CH1_Enabled (0x1UL)

/* CH2 @Bit 2 : Enable or disable channel 2 */
  #define DPPIC_CHEN_CH2_Pos (2UL)
  #define DPPIC_CHEN_CH2_Msk (0x1UL << DPPIC_CHEN_CH2_Pos)
  #define DPPIC_CHEN_CH2_Min (0x0UL)
  #define DPPIC_CHEN_CH2_Max (0x1UL)
  #define DPPIC_CHEN_CH2_Disabled (0x0UL)
  #define DPPIC_CHEN_CH2_Enabled (0x1UL)

/* CH3 @Bit 3 : Enable or disable channel 3 */
  #define DPPIC_CHEN_CH3_Pos (3UL)
  #define DPPIC_CHEN_CH3_Msk (0x1UL << DPPIC_CHEN_CH3_Pos)
  #define DPPIC_CHEN_CH3_Min (0x0UL)
  #define DPPIC_CHEN_CH3_Max (0x1UL)
  #define DPPIC_CHEN_CH3_Disabled (0x0UL)
  #define DPPIC_CHEN_CH3_Enabled (0x1UL)

/* CH4 @Bit 4 : Enable or disable channel 4 */
  #define DPPIC_CHEN_CH4_Pos (4UL)
  #define DPPIC_CHEN_CH4_Msk (0x1UL << DPPIC_CHEN_CH4_Pos)
  #define DPPIC_CHEN_CH4_Min (0x0UL)
  #define DPPIC_CHEN_CH4_Max (0x1UL)
  #define DPPIC_CHEN_CH4_Disabled (0x0UL)
  #define DPPIC_CHEN_CH4_Enabled (0x1UL)

/* CH5 @Bit 5 : Enable or disable channel 5 */
  #define DPPIC_CHEN_CH5_Pos (5UL)
  #define DPPIC_CHEN_CH5_Msk (0x1UL << DPPIC_CHEN_CH5_Pos)
  #define DPPIC_CHEN_CH5_Min (0x0UL)
  #define DPPIC_CHEN_CH5_Max (0x1UL)
  #define DPPIC_CHEN_CH5_Disabled (0x0UL)
  #define DPPIC_CHEN_CH5_Enabled (0x1UL)

/* CH6 @Bit 6 : Enable or disable channel 6 */
  #define DPPIC_CHEN_CH6_Pos (6UL)
  #define DPPIC_CHEN_CH6_Msk (0x1UL << DPPIC_CHEN_CH6_Pos)
  #define DPPIC_CHEN_CH6_Min (0x0UL)
  #define DPPIC_CHEN_CH6_Max (0x1UL)
  #define DPPIC_CHEN_CH6_Disabled (0x0UL)
  #define DPPIC_CHEN_CH6_Enabled (0x1UL)

/* CH7 @Bit 7 : Enable or disable channel 7 */
  #define DPPIC_CHEN_CH7_Pos (7UL)
  #define DPPIC_CHEN_CH7_Msk (0x1UL << DPPIC_CHEN_CH7_Pos)
  #define DPPIC_CHEN_CH7_Min (0x0UL)
  #define DPPIC_CHEN_CH7_Max (0x1UL)
  #define DPPIC_CHEN_CH7_Disabled (0x0UL)
  #define DPPIC_CHEN_CH7_Enabled (0x1UL)

