pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH8 @Bit 8 : Enable or disable channel 8 */
  #define DPPIC_CHEN_CH8_Pos (8UL)
  #define DPPIC_CHEN_CH8_Msk (0x1UL << DPPIC_CHEN_CH8_Pos)
  #define DPPIC_CHEN_CH8_Min (0x0UL)
  #define DPPIC_CHEN_CH8_Max (0x1UL)
  #define DPPIC_CHEN_CH8_Disabled (0x0UL)
  #define DPPIC_CHEN_CH8_Enabled (0x1UL)

/* CH9 @Bit 9 : Enable or disable channel 9 */
  #define DPPIC_CHEN_CH9_Pos (9UL)
  #define DPPIC_CHEN_CH9_Msk (0x1UL << DPPIC_CHEN_CH9_Pos)
  #define DPPIC_CHEN_CH9_Min (0x0UL)
  #define DPPIC_CHEN_CH9_Max (0x1UL)
  #define DPPIC_CHEN_CH9_Disabled (0x0UL)
  #define DPPIC_CHEN_CH9_Enabled (0x1UL)

/* CH10 @Bit 10 : Enable or disable channel 10 */
  #define DPPIC_CHEN_CH10_Pos (10UL)
  #define DPPIC_CHEN_CH10_Msk (0x1UL << DPPIC_CHEN_CH10_Pos)
  #define DPPIC_CHEN_CH10_Min (0x0UL)
  #define DPPIC_CHEN_CH10_Max (0x1UL)
  #define DPPIC_CHEN_CH10_Disabled (0x0UL)
  #define DPPIC_CHEN_CH10_Enabled (0x1UL)

/* CH11 @Bit 11 : Enable or disable channel 11 */
  #define DPPIC_CHEN_CH11_Pos (11UL)
  #define DPPIC_CHEN_CH11_Msk (0x1UL << DPPIC_CHEN_CH11_Pos)
  #define DPPIC_CHEN_CH11_Min (0x0UL)
  #define DPPIC_CHEN_CH11_Max (0x1UL)
  #define DPPIC_CHEN_CH11_Disabled (0x0UL)
  #define DPPIC_CHEN_CH11_Enabled (0x1UL)

/* CH12 @Bit 12 : Enable or disable channel 12 */
  #define DPPIC_CHEN_CH12_Pos (12UL)
  #define DPPIC_CHEN_CH12_Msk (0x1UL << DPPIC_CHEN_CH12_Pos)
  #define DPPIC_CHEN_CH12_Min (0x0UL)
  #define DPPIC_CHEN_CH12_Max (0x1UL)
  #define DPPIC_CHEN_CH12_Disabled (0x0UL)
  #define DPPIC_CHEN_CH12_Enabled (0x1UL)

/* CH13 @Bit 13 : Enable or disable channel 13 */
  #define DPPIC_CHEN_CH13_Pos (13UL)
  #define DPPIC_CHEN_CH13_Msk (0x1UL << DPPIC_CHEN_CH13_Pos)
  #define DPPIC_CHEN_CH13_Min (0x0UL)
  #define DPPIC_CHEN_CH13_Max (0x1UL)
  #define DPPIC_CHEN_CH13_Disabled (0x0UL)
  #define DPPIC_CHEN_CH13_Enabled (0x1UL)

/* CH14 @Bit 14 : Enable or disable channel 14 */
  #define DPPIC_CHEN_CH14_Pos (14UL)
  #define DPPIC_CHEN_CH14_Msk (0x1UL << DPPIC_CHEN_CH14_Pos)
  #define DPPIC_CHEN_CH14_Min (0x0UL)
  #define DPPIC_CHEN_CH14_Max (0x1UL)
  #define DPPIC_CHEN_CH14_Disabled (0x0UL)
  #define DPPIC_CHEN_CH14_Enabled (0x1UL)

/* CH15 @Bit 15 : Enable or disable channel 15 */
  #define DPPIC_CHEN_CH15_Pos (15UL)
  #define DPPIC_CHEN_CH15_Msk (0x1UL << DPPIC_CHEN_CH15_Pos)
  #define DPPIC_CHEN_CH15_Min (0x0UL)
  #define DPPIC_CHEN_CH15_Max (0x1UL)
  #define DPPIC_CHEN_CH15_Disabled (0x0UL)
  #define DPPIC_CHEN_CH15_Enabled (0x1UL)

/* CH16 @Bit 16 : Enable or disable channel 16 */
  #define DPPIC_CHEN_CH16_Pos (16UL)
  #define DPPIC_CHEN_CH16_Msk (0x1UL << DPPIC_CHEN_CH16_Pos)
  #define DPPIC_CHEN_CH16_Min (0x0UL)
  #define DPPIC_CHEN_CH16_Max (0x1UL)
  #define DPPIC_CHEN_CH16_Disabled (0x0UL)
  #define DPPIC_CHEN_CH16_Enabled (0x1UL)

/* CH17 @Bit 17 : Enable or disable channel 17 */
  #define DPPIC_CHEN_CH17_Pos (17UL)
  #define DPPIC_CHEN_CH17_Msk (0x1UL << DPPIC_CHEN_CH17_Pos)
  #define DPPIC_CHEN_CH17_Min (0x0UL)
  #define DPPIC_CHEN_CH17_Max (0x1UL)
  #define DPPIC_CHEN_CH17_Disabled (0x0UL)
  #define DPPIC_CHEN_CH17_Enabled (0x1UL)

/* CH18 @Bit 18 : Enable or disable channel 18 */
  #define DPPIC_CHEN_CH18_Pos (18UL)
  #define DPPIC_CHEN_CH18_Msk (0x1UL << DPPIC_CHEN_CH18_Pos)
  #define DPPIC_CHEN_CH18_Min (0x0UL)
  #define DPPIC_CHEN_CH18_Max (0x1UL)
  #define DPPIC_CHEN_CH18_Disabled (0x0UL)
  #define DPPIC_CHEN_CH18_Enabled (0x1UL)

/* CH19 @Bit 19 : Enable or disable channel 19 */
  #define DPPIC_CHEN_CH19_Pos (19UL)
  #define DPPIC_CHEN_CH19_Msk (0x1UL << DPPIC_CHEN_CH19_Pos)
  #define DPPIC_CHEN_CH19_Min (0x0UL)
  #define DPPIC_CHEN_CH19_Max (0x1UL)
  #define DPPIC_CHEN_CH19_Disabled (0x0UL)
  #define DPPIC_CHEN_CH19_Enabled (0x1UL)

/* CH20 @Bit 20 : Enable or disable channel 20 */
  #define DPPIC_CHEN_CH20_Pos (20UL)
  #define DPPIC_CHEN_CH20_Msk (0x1UL << DPPIC_CHEN_CH20_Pos)
  #define DPPIC_CHEN_CH20_Min (0x0UL)
  #define DPPIC_CHEN_CH20_Max (0x1UL)
  #define DPPIC_CHEN_CH20_Disabled (0x0UL)
  #define DPPIC_CHEN_CH20_Enabled (0x1UL)

/* CH21 @Bit 21 : Enable or disable channel 21 */
  #define DPPIC_CHEN_CH21_Pos (21UL)
  #define DPPIC_CHEN_CH21_Msk (0x1UL << DPPIC_CHEN_CH21_Pos)
  #define DPPIC_CHEN_CH21_Min (0x0UL)
  #define DPPIC_CHEN_CH21_Max (0x1UL)
  #define DPPIC_CHEN_CH21_Disabled (0x0UL)
  #define DPPIC_CHEN_CH21_Enabled (0x1UL)

/* CH22 @Bit 22 : Enable or disable channel 22 */
  #define DPPIC_CHEN_CH22_Pos (22UL)
  #define DPPIC_CHEN_CH22_Msk (0x1UL << DPPIC_CHEN_CH22_Pos)
  #define DPPIC_CHEN_CH22_Min (0x0UL)
  #define DPPIC_CHEN_CH22_Max (0x1UL)
  #define DPPIC_CHEN_CH22_Disabled (0x0UL)
  #define DPPIC_CHEN_CH22_Enabled (0x1UL)

/* CH23 @Bit 23 : Enable or disable channel 23 */
  #define DPPIC_CHEN_CH23_Pos (23UL)
  #define DPPIC_CHEN_CH23_Msk (0x1UL << DPPIC_CHEN_CH23_Pos)
  #define DPPIC_CHEN_CH23_Min (0x0UL)
  #define DPPIC_CHEN_CH23_Max (0x1UL)
  #define DPPIC_CHEN_CH23_Disabled (0x0UL)
  #define DPPIC_CHEN_CH23_Enabled (0x1UL)


/* DPPIC_CHENSET: Channel enable set register */
  #define DPPIC_CHENSET_ResetValue (0x00000000UL)

/* CH0 @Bit 0 : Channel 0 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH0_Pos (0UL)
  #define DPPIC_CHENSET_CH0_Msk (0x1UL << DPPIC_CHENSET_CH0_Pos)
  #define DPPIC_CHENSET_CH0_Min (0x0UL)
  #define DPPIC_CHENSET_CH0_Max (0x1UL)
  #define DPPIC_CHENSET_CH0_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH0_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH0_Set (0x1UL)

/* CH1 @Bit 1 : Channel 1 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH1_Pos (1UL)
  #define DPPIC_CHENSET_CH1_Msk (0x1UL << DPPIC_CHENSET_CH1_Pos)
  #define DPPIC_CHENSET_CH1_Min (0x0UL)
  #define DPPIC_CHENSET_CH1_Max (0x1UL)
  #define DPPIC_CHENSET_CH1_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH1_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH1_Set (0x1UL)

/* CH2 @Bit 2 : Channel 2 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH2_Pos (2UL)
  #define DPPIC_CHENSET_CH2_Msk (0x1UL << DPPIC_CHENSET_CH2_Pos)
  #define DPPIC_CHENSET_CH2_Min (0x0UL)
  #define DPPIC_CHENSET_CH2_Max (0x1UL)
  #define DPPIC_CHENSET_CH2_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH2_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH2_Set (0x1UL)

/* CH3 @Bit 3 : Channel 3 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH3_Pos (3UL)
  #define DPPIC_CHENSET_CH3_Msk (0x1UL << DPPIC_CHENSET_CH3_Pos)
  #define DPPIC_CHENSET_CH3_Min (0x0UL)
  #define DPPIC_CHENSET_CH3_Max (0x1UL)
  #define DPPIC_CHENSET_CH3_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH3_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH3_Set (0x1UL)

/* CH4 @Bit 4 : Channel 4 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH4_Pos (4UL)
  #define DPPIC_CHENSET_CH4_Msk (0x1UL << DPPIC_CHENSET_CH4_Pos)
  #define DPPIC_CHENSET_CH4_Min (0x0UL)
  #define DPPIC_CHENSET_CH4_Max (0x1UL)
  #define DPPIC_CHENSET_CH4_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH4_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH4_Set (0x1UL)

/* CH5 @Bit 5 : Channel 5 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH5_Pos (5UL)
  #define DPPIC_CHENSET_CH5_Msk (0x1UL << DPPIC_CHENSET_CH5_Pos)
  #define DPPIC_CHENSET_CH5_Min (0x0UL)
  #define DPPIC_CHENSET_CH5_Max (0x1UL)
  #define DPPIC_CHENSET_CH5_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH5_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH5_Set (0x1UL)

