pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH6 @Bit 6 : Channel 6 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH6_Pos (6UL)
  #define DPPIC_CHENSET_CH6_Msk (0x1UL << DPPIC_CHENSET_CH6_Pos)
  #define DPPIC_CHENSET_CH6_Min (0x0UL)
  #define DPPIC_CHENSET_CH6_Max (0x1UL)
  #define DPPIC_CHENSET_CH6_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH6_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH6_Set (0x1UL)

/* CH7 @Bit 7 : Channel 7 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH7_Pos (7UL)
  #define DPPIC_CHENSET_CH7_Msk (0x1UL << DPPIC_CHENSET_CH7_Pos)
  #define DPPIC_CHENSET_CH7_Min (0x0UL)
  #define DPPIC_CHENSET_CH7_Max (0x1UL)
  #define DPPIC_CHENSET_CH7_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH7_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH7_Set (0x1UL)

/* CH8 @Bit 8 : Channel 8 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH8_Pos (8UL)
  #define DPPIC_CHENSET_CH8_Msk (0x1UL << DPPIC_CHENSET_CH8_Pos)
  #define DPPIC_CHENSET_CH8_Min (0x0UL)
  #define DPPIC_CHENSET_CH8_Max (0x1UL)
  #define DPPIC_CHENSET_CH8_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH8_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH8_Set (0x1UL)

/* CH9 @Bit 9 : Channel 9 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH9_Pos (9UL)
  #define DPPIC_CHENSET_CH9_Msk (0x1UL << DPPIC_CHENSET_CH9_Pos)
  #define DPPIC_CHENSET_CH9_Min (0x0UL)
  #define DPPIC_CHENSET_CH9_Max (0x1UL)
  #define DPPIC_CHENSET_CH9_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH9_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH9_Set (0x1UL)

/* CH10 @Bit 10 : Channel 10 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH10_Pos (10UL)
  #define DPPIC_CHENSET_CH10_Msk (0x1UL << DPPIC_CHENSET_CH10_Pos)
  #define DPPIC_CHENSET_CH10_Min (0x0UL)
  #define DPPIC_CHENSET_CH10_Max (0x1UL)
  #define DPPIC_CHENSET_CH10_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH10_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH10_Set (0x1UL)

/* CH11 @Bit 11 : Channel 11 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH11_Pos (11UL)
  #define DPPIC_CHENSET_CH11_Msk (0x1UL << DPPIC_CHENSET_CH11_Pos)
  #define DPPIC_CHENSET_CH11_Min (0x0UL)
  #define DPPIC_CHENSET_CH11_Max (0x1UL)
  #define DPPIC_CHENSET_CH11_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH11_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH11_Set (0x1UL)

/* CH12 @Bit 12 : Channel 12 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH12_Pos (12UL)
  #define DPPIC_CHENSET_CH12_Msk (0x1UL << DPPIC_CHENSET_CH12_Pos)
  #define DPPIC_CHENSET_CH12_Min (0x0UL)
  #define DPPIC_CHENSET_CH12_Max (0x1UL)
  #define DPPIC_CHENSET_CH12_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH12_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH12_Set (0x1UL)

/* CH13 @Bit 13 : Channel 13 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH13_Pos (13UL)
  #define DPPIC_CHENSET_CH13_Msk (0x1UL << DPPIC_CHENSET_CH13_Pos)
  #define DPPIC_CHENSET_CH13_Min (0x0UL)
  #define DPPIC_CHENSET_CH13_Max (0x1UL)
  #define DPPIC_CHENSET_CH13_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH13_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH13_Set (0x1UL)

/* CH14 @Bit 14 : Channel 14 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH14_Pos (14UL)
  #define DPPIC_CHENSET_CH14_Msk (0x1UL << DPPIC_CHENSET_CH14_Pos)
  #define DPPIC_CHENSET_CH14_Min (0x0UL)
  #define DPPIC_CHENSET_CH14_Max (0x1UL)
  #define DPPIC_CHENSET_CH14_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH14_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH14_Set (0x1UL)

/* CH15 @Bit 15 : Channel 15 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH15_Pos (15UL)
  #define DPPIC_CHENSET_CH15_Msk (0x1UL << DPPIC_CHENSET_CH15_Pos)
  #define DPPIC_CHENSET_CH15_Min (0x0UL)
  #define DPPIC_CHENSET_CH15_Max (0x1UL)
  #define DPPIC_CHENSET_CH15_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH15_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH15_Set (0x1UL)

/* CH16 @Bit 16 : Channel 16 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH16_Pos (16UL)
  #define DPPIC_CHENSET_CH16_Msk (0x1UL << DPPIC_CHENSET_CH16_Pos)
  #define DPPIC_CHENSET_CH16_Min (0x0UL)
  #define DPPIC_CHENSET_CH16_Max (0x1UL)
  #define DPPIC_CHENSET_CH16_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH16_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH16_Set (0x1UL)

/* CH17 @Bit 17 : Channel 17 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH17_Pos (17UL)
  #define DPPIC_CHENSET_CH17_Msk (0x1UL << DPPIC_CHENSET_CH17_Pos)
  #define DPPIC_CHENSET_CH17_Min (0x0UL)
  #define DPPIC_CHENSET_CH17_Max (0x1UL)
  #define DPPIC_CHENSET_CH17_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH17_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH17_Set (0x1UL)

/* CH18 @Bit 18 : Channel 18 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH18_Pos (18UL)
  #define DPPIC_CHENSET_CH18_Msk (0x1UL << DPPIC_CHENSET_CH18_Pos)
  #define DPPIC_CHENSET_CH18_Min (0x0UL)
  #define DPPIC_CHENSET_CH18_Max (0x1UL)
  #define DPPIC_CHENSET_CH18_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH18_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH18_Set (0x1UL)

/* CH19 @Bit 19 : Channel 19 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH19_Pos (19UL)
  #define DPPIC_CHENSET_CH19_Msk (0x1UL << DPPIC_CHENSET_CH19_Pos)
  #define DPPIC_CHENSET_CH19_Min (0x0UL)
  #define DPPIC_CHENSET_CH19_Max (0x1UL)
  #define DPPIC_CHENSET_CH19_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH19_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH19_Set (0x1UL)

/* CH20 @Bit 20 : Channel 20 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH20_Pos (20UL)
  #define DPPIC_CHENSET_CH20_Msk (0x1UL << DPPIC_CHENSET_CH20_Pos)
  #define DPPIC_CHENSET_CH20_Min (0x0UL)
  #define DPPIC_CHENSET_CH20_Max (0x1UL)
  #define DPPIC_CHENSET_CH20_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH20_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH20_Set (0x1UL)

/* CH21 @Bit 21 : Channel 21 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH21_Pos (21UL)
  #define DPPIC_CHENSET_CH21_Msk (0x1UL << DPPIC_CHENSET_CH21_Pos)
  #define DPPIC_CHENSET_CH21_Min (0x0UL)
  #define DPPIC_CHENSET_CH21_Max (0x1UL)
  #define DPPIC_CHENSET_CH21_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH21_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH21_Set (0x1UL)

/* CH22 @Bit 22 : Channel 22 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH22_Pos (22UL)
  #define DPPIC_CHENSET_CH22_Msk (0x1UL << DPPIC_CHENSET_CH22_Pos)
  #define DPPIC_CHENSET_CH22_Min (0x0UL)
  #define DPPIC_CHENSET_CH22_Max (0x1UL)
  #define DPPIC_CHENSET_CH22_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH22_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH22_Set (0x1UL)

/* CH23 @Bit 23 : Channel 23 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH23_Pos (23UL)
  #define DPPIC_CHENSET_CH23_Msk (0x1UL << DPPIC_CHENSET_CH23_Pos)
  #define DPPIC_CHENSET_CH23_Min (0x0UL)
  #define DPPIC_CHENSET_CH23_Max (0x1UL)
  #define DPPIC_CHENSET_CH23_Disabled (0x0UL)
  #define DPPIC_CHENSET_CH23_Enabled (0x1UL)
  #define DPPIC_CHENSET_CH23_Set (0x1UL)


/* DPPIC_CHENCLR: Channel enable clear register */
  #define DPPIC_CHENCLR_ResetValue (0x00000000UL)

/* CH0 @Bit 0 : Channel 0 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH0_Pos (0UL)
  #define DPPIC_CHENCLR_CH0_Msk (0x1UL << DPPIC_CHENCLR_CH0_Pos)
  #define DPPIC_CHENCLR_CH0_Min (0x0UL)
  #define DPPIC_CHENCLR_CH0_Max (0x1UL)
  #define DPPIC_CHENCLR_CH0_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH0_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH0_Clear (0x1UL)

/* CH1 @Bit 1 : Channel 1 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH1_Pos (1UL)
  #define DPPIC_CHENCLR_CH1_Msk (0x1UL << DPPIC_CHENCLR_CH1_Pos)
  #define DPPIC_CHENCLR_CH1_Min (0x0UL)
  #define DPPIC_CHENCLR_CH1_Max (0x1UL)
  #define DPPIC_CHENCLR_CH1_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH1_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH1_Clear (0x1UL)

/* CH2 @Bit 2 : Channel 2 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH2_Pos (2UL)
  #define DPPIC_CHENCLR_CH2_Msk (0x1UL << DPPIC_CHENCLR_CH2_Pos)
  #define DPPIC_CHENCLR_CH2_Min (0x0UL)
  #define DPPIC_CHENCLR_CH2_Max (0x1UL)
  #define DPPIC_CHENCLR_CH2_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH2_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH2_Clear (0x1UL)

/* CH3 @Bit 3 : Channel 3 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH3_Pos (3UL)
  #define DPPIC_CHENCLR_CH3_Msk (0x1UL << DPPIC_CHENCLR_CH3_Pos)
  #define DPPIC_CHENCLR_CH3_Min (0x0UL)
  #define DPPIC_CHENCLR_CH3_Max (0x1UL)
  #define DPPIC_CHENCLR_CH3_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH3_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH3_Clear (0x1UL)

/* CH4 @Bit 4 : Channel 4 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH4_Pos (4UL)
  #define DPPIC_CHENCLR_CH4_Msk (0x1UL << DPPIC_CHENCLR_CH4_Pos)
  #define DPPIC_CHENCLR_CH4_Min (0x0UL)
  #define DPPIC_CHENCLR_CH4_Max (0x1UL)
  #define DPPIC_CHENCLR_CH4_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH4_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH4_Clear (0x1UL)

/* CH5 @Bit 5 : Channel 5 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH5_Pos (5UL)
  #define DPPIC_CHENCLR_CH5_Msk (0x1UL << DPPIC_CHENCLR_CH5_Pos)
  #define DPPIC_CHENCLR_CH5_Min (0x0UL)
  #define DPPIC_CHENCLR_CH5_Max (0x1UL)
  #define DPPIC_CHENCLR_CH5_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH5_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH5_Clear (0x1UL)

/* CH6 @Bit 6 : Channel 6 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH6_Pos (6UL)
  #define DPPIC_CHENCLR_CH6_Msk (0x1UL << DPPIC_CHENCLR_CH6_Pos)
  #define DPPIC_CHENCLR_CH6_Min (0x0UL)
  #define DPPIC_CHENCLR_CH6_Max (0x1UL)
  #define DPPIC_CHENCLR_CH6_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH6_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH6_Clear (0x1UL)

/* CH7 @Bit 7 : Channel 7 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH7_Pos (7UL)
  #define DPPIC_CHENCLR_CH7_Msk (0x1UL << DPPIC_CHENCLR_CH7_Pos)
  #define DPPIC_CHENCLR_CH7_Min (0x0UL)
  #define DPPIC_CHENCLR_CH7_Max (0x1UL)
  #define DPPIC_CHENCLR_CH7_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH7_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH7_Clear (0x1UL)

/* CH8 @Bit 8 : Channel 8 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH8_Pos (8UL)
  #define DPPIC_CHENCLR_CH8_Msk (0x1UL << DPPIC_CHENCLR_CH8_Pos)
  #define DPPIC_CHENCLR_CH8_Min (0x0UL)
  #define DPPIC_CHENCLR_CH8_Max (0x1UL)
  #define DPPIC_CHENCLR_CH8_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH8_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH8_Clear (0x1UL)

/* CH9 @Bit 9 : Channel 9 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH9_Pos (9UL)
  #define DPPIC_CHENCLR_CH9_Msk (0x1UL << DPPIC_CHENCLR_CH9_Pos)
  #define DPPIC_CHENCLR_CH9_Min (0x0UL)
  #define DPPIC_CHENCLR_CH9_Max (0x1UL)
  #define DPPIC_CHENCLR_CH9_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH9_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH9_Clear (0x1UL)

