pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH10 @Bit 10 : Channel 10 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH10_Pos (10UL)
  #define DPPIC_CHENCLR_CH10_Msk (0x1UL << DPPIC_CHENCLR_CH10_Pos)
  #define DPPIC_CHENCLR_CH10_Min (0x0UL)
  #define DPPIC_CHENCLR_CH10_Max (0x1UL)
  #define DPPIC_CHENCLR_CH10_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH10_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH10_Clear (0x1UL)

/* CH11 @Bit 11 : Channel 11 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH11_Pos (11UL)
  #define DPPIC_CHENCLR_CH11_Msk (0x1UL << DPPIC_CHENCLR_CH11_Pos)
  #define DPPIC_CHENCLR_CH11_Min (0x0UL)
  #define DPPIC_CHENCLR_CH11_Max (0x1UL)
  #define DPPIC_CHENCLR_CH11_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH11_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH11_Clear (0x1UL)

/* CH12 @Bit 12 : Channel 12 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH12_Pos (12UL)
  #define DPPIC_CHENCLR_CH12_Msk (0x1UL << DPPIC_CHENCLR_CH12_Pos)
  #define DPPIC_CHENCLR_CH12_Min (0x0UL)
  #define DPPIC_CHENCLR_CH12_Max (0x1UL)
  #define DPPIC_CHENCLR_CH12_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH12_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH12_Clear (0x1UL)

/* CH13 @Bit 13 : Channel 13 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH13_Pos (13UL)
  #define DPPIC_CHENCLR_CH13_Msk (0x1UL << DPPIC_CHENCLR_CH13_Pos)
  #define DPPIC_CHENCLR_CH13_Min (0x0UL)
  #define DPPIC_CHENCLR_CH13_Max (0x1UL)
  #define DPPIC_CHENCLR_CH13_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH13_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH13_Clear (0x1UL)

/* CH14 @Bit 14 : Channel 14 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH14_Pos (14UL)
  #define DPPIC_CHENCLR_CH14_Msk (0x1UL << DPPIC_CHENCLR_CH14_Pos)
  #define DPPIC_CHENCLR_CH14_Min (0x0UL)
  #define DPPIC_CHENCLR_CH14_Max (0x1UL)
  #define DPPIC_CHENCLR_CH14_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH14_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH14_Clear (0x1UL)

/* CH15 @Bit 15 : Channel 15 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH15_Pos (15UL)
  #define DPPIC_CHENCLR_CH15_Msk (0x1UL << DPPIC_CHENCLR_CH15_Pos)
  #define DPPIC_CHENCLR_CH15_Min (0x0UL)
  #define DPPIC_CHENCLR_CH15_Max (0x1UL)
  #define DPPIC_CHENCLR_CH15_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH15_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH15_Clear (0x1UL)

/* CH16 @Bit 16 : Channel 16 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH16_Pos (16UL)
  #define DPPIC_CHENCLR_CH16_Msk (0x1UL << DPPIC_CHENCLR_CH16_Pos)
  #define DPPIC_CHENCLR_CH16_Min (0x0UL)
  #define DPPIC_CHENCLR_CH16_Max (0x1UL)
  #define DPPIC_CHENCLR_CH16_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH16_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH16_Clear (0x1UL)

/* CH17 @Bit 17 : Channel 17 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH17_Pos (17UL)
  #define DPPIC_CHENCLR_CH17_Msk (0x1UL << DPPIC_CHENCLR_CH17_Pos)
  #define DPPIC_CHENCLR_CH17_Min (0x0UL)
  #define DPPIC_CHENCLR_CH17_Max (0x1UL)
  #define DPPIC_CHENCLR_CH17_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH17_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH17_Clear (0x1UL)

/* CH18 @Bit 18 : Channel 18 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH18_Pos (18UL)
  #define DPPIC_CHENCLR_CH18_Msk (0x1UL << DPPIC_CHENCLR_CH18_Pos)
  #define DPPIC_CHENCLR_CH18_Min (0x0UL)
  #define DPPIC_CHENCLR_CH18_Max (0x1UL)
  #define DPPIC_CHENCLR_CH18_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH18_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH18_Clear (0x1UL)

/* CH19 @Bit 19 : Channel 19 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH19_Pos (19UL)
  #define DPPIC_CHENCLR_CH19_Msk (0x1UL << DPPIC_CHENCLR_CH19_Pos)
  #define DPPIC_CHENCLR_CH19_Min (0x0UL)
  #define DPPIC_CHENCLR_CH19_Max (0x1UL)
  #define DPPIC_CHENCLR_CH19_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH19_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH19_Clear (0x1UL)

/* CH20 @Bit 20 : Channel 20 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH20_Pos (20UL)
  #define DPPIC_CHENCLR_CH20_Msk (0x1UL << DPPIC_CHENCLR_CH20_Pos)
  #define DPPIC_CHENCLR_CH20_Min (0x0UL)
  #define DPPIC_CHENCLR_CH20_Max (0x1UL)
  #define DPPIC_CHENCLR_CH20_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH20_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH20_Clear (0x1UL)

/* CH21 @Bit 21 : Channel 21 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH21_Pos (21UL)
  #define DPPIC_CHENCLR_CH21_Msk (0x1UL << DPPIC_CHENCLR_CH21_Pos)
  #define DPPIC_CHENCLR_CH21_Min (0x0UL)
  #define DPPIC_CHENCLR_CH21_Max (0x1UL)
  #define DPPIC_CHENCLR_CH21_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH21_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH21_Clear (0x1UL)

/* CH22 @Bit 22 : Channel 22 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH22_Pos (22UL)
  #define DPPIC_CHENCLR_CH22_Msk (0x1UL << DPPIC_CHENCLR_CH22_Pos)
  #define DPPIC_CHENCLR_CH22_Min (0x0UL)
  #define DPPIC_CHENCLR_CH22_Max (0x1UL)
  #define DPPIC_CHENCLR_CH22_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH22_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH22_Clear (0x1UL)

/* CH23 @Bit 23 : Channel 23 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH23_Pos (23UL)
  #define DPPIC_CHENCLR_CH23_Msk (0x1UL << DPPIC_CHENCLR_CH23_Pos)
  #define DPPIC_CHENCLR_CH23_Min (0x0UL)
  #define DPPIC_CHENCLR_CH23_Max (0x1UL)
  #define DPPIC_CHENCLR_CH23_Disabled (0x0UL)
  #define DPPIC_CHENCLR_CH23_Enabled (0x1UL)
  #define DPPIC_CHENCLR_CH23_Clear (0x1UL)


/* DPPIC_CHG: Channel group n Note: Writes to this register are ignored if either SUBSCRIBE_CHG[n].EN or SUBSCRIBE_CHG[n].DIS is
               enabled */

  #define DPPIC_CHG_MaxCount (4UL)
  #define DPPIC_CHG_MaxIndex (3UL)
  #define DPPIC_CHG_MinIndex (0UL)
  #define DPPIC_CHG_ResetValue (0x00000000UL)

/* CH0 @Bit 0 : Include or exclude channel 0 */
  #define DPPIC_CHG_CH0_Pos (0UL)
  #define DPPIC_CHG_CH0_Msk (0x1UL << DPPIC_CHG_CH0_Pos)
  #define DPPIC_CHG_CH0_Min (0x0UL)
  #define DPPIC_CHG_CH0_Max (0x1UL)
  #define DPPIC_CHG_CH0_Excluded (0x0UL)
  #define DPPIC_CHG_CH0_Included (0x1UL)

/* CH1 @Bit 1 : Include or exclude channel 1 */
  #define DPPIC_CHG_CH1_Pos (1UL)
  #define DPPIC_CHG_CH1_Msk (0x1UL << DPPIC_CHG_CH1_Pos)
  #define DPPIC_CHG_CH1_Min (0x0UL)
  #define DPPIC_CHG_CH1_Max (0x1UL)
  #define DPPIC_CHG_CH1_Excluded (0x0UL)
  #define DPPIC_CHG_CH1_Included (0x1UL)

/* CH2 @Bit 2 : Include or exclude channel 2 */
  #define DPPIC_CHG_CH2_Pos (2UL)
  #define DPPIC_CHG_CH2_Msk (0x1UL << DPPIC_CHG_CH2_Pos)
  #define DPPIC_CHG_CH2_Min (0x0UL)
  #define DPPIC_CHG_CH2_Max (0x1UL)
  #define DPPIC_CHG_CH2_Excluded (0x0UL)
  #define DPPIC_CHG_CH2_Included (0x1UL)

/* CH3 @Bit 3 : Include or exclude channel 3 */
  #define DPPIC_CHG_CH3_Pos (3UL)
  #define DPPIC_CHG_CH3_Msk (0x1UL << DPPIC_CHG_CH3_Pos)
  #define DPPIC_CHG_CH3_Min (0x0UL)
  #define DPPIC_CHG_CH3_Max (0x1UL)
  #define DPPIC_CHG_CH3_Excluded (0x0UL)
  #define DPPIC_CHG_CH3_Included (0x1UL)

