pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH4 @Bit 4 : Include or exclude channel 4 */
  #define DPPIC_CHG_CH4_Pos (4UL)
  #define DPPIC_CHG_CH4_Msk (0x1UL << DPPIC_CHG_CH4_Pos)
  #define DPPIC_CHG_CH4_Min (0x0UL)
  #define DPPIC_CHG_CH4_Max (0x1UL)
  #define DPPIC_CHG_CH4_Excluded (0x0UL)
  #define DPPIC_CHG_CH4_Included (0x1UL)

/* CH5 @Bit 5 : Include or exclude channel 5 */
  #define DPPIC_CHG_CH5_Pos (5UL)
  #define DPPIC_CHG_CH5_Msk (0x1UL << DPPIC_CHG_CH5_Pos)
  #define DPPIC_CHG_CH5_Min (0x0UL)
  #define DPPIC_CHG_CH5_Max (0x1UL)
  #define DPPIC_CHG_CH5_Excluded (0x0UL)
  #define DPPIC_CHG_CH5_Included (0x1UL)

/* CH6 @Bit 6 : Include or exclude channel 6 */
  #define DPPIC_CHG_CH6_Pos (6UL)
  #define DPPIC_CHG_CH6_Msk (0x1UL << DPPIC_CHG_CH6_Pos)
  #define DPPIC_CHG_CH6_Min (0x0UL)
  #define DPPIC_CHG_CH6_Max (0x1UL)
  #define DPPIC_CHG_CH6_Excluded (0x0UL)
  #define DPPIC_CHG_CH6_Included (0x1UL)

/* CH7 @Bit 7 : Include or exclude channel 7 */
  #define DPPIC_CHG_CH7_Pos (7UL)
  #define DPPIC_CHG_CH7_Msk (0x1UL << DPPIC_CHG_CH7_Pos)
  #define DPPIC_CHG_CH7_Min (0x0UL)
  #define DPPIC_CHG_CH7_Max (0x1UL)
  #define DPPIC_CHG_CH7_Excluded (0x0UL)
  #define DPPIC_CHG_CH7_Included (0x1UL)

/* CH8 @Bit 8 : Include or exclude channel 8 */
  #define DPPIC_CHG_CH8_Pos (8UL)
  #define DPPIC_CHG_CH8_Msk (0x1UL << DPPIC_CHG_CH8_Pos)
  #define DPPIC_CHG_CH8_Min (0x0UL)
  #define DPPIC_CHG_CH8_Max (0x1UL)
  #define DPPIC_CHG_CH8_Excluded (0x0UL)
  #define DPPIC_CHG_CH8_Included (0x1UL)

/* CH9 @Bit 9 : Include or exclude channel 9 */
  #define DPPIC_CHG_CH9_Pos (9UL)
  #define DPPIC_CHG_CH9_Msk (0x1UL << DPPIC_CHG_CH9_Pos)
  #define DPPIC_CHG_CH9_Min (0x0UL)
  #define DPPIC_CHG_CH9_Max (0x1UL)
  #define DPPIC_CHG_CH9_Excluded (0x0UL)
  #define DPPIC_CHG_CH9_Included (0x1UL)

/* CH10 @Bit 10 : Include or exclude channel 10 */
  #define DPPIC_CHG_CH10_Pos (10UL)
  #define DPPIC_CHG_CH10_Msk (0x1UL << DPPIC_CHG_CH10_Pos)
  #define DPPIC_CHG_CH10_Min (0x0UL)
  #define DPPIC_CHG_CH10_Max (0x1UL)
  #define DPPIC_CHG_CH10_Excluded (0x0UL)
  #define DPPIC_CHG_CH10_Included (0x1UL)

/* CH11 @Bit 11 : Include or exclude channel 11 */
  #define DPPIC_CHG_CH11_Pos (11UL)
  #define DPPIC_CHG_CH11_Msk (0x1UL << DPPIC_CHG_CH11_Pos)
  #define DPPIC_CHG_CH11_Min (0x0UL)
  #define DPPIC_CHG_CH11_Max (0x1UL)
  #define DPPIC_CHG_CH11_Excluded (0x0UL)
  #define DPPIC_CHG_CH11_Included (0x1UL)

/* CH12 @Bit 12 : Include or exclude channel 12 */
  #define DPPIC_CHG_CH12_Pos (12UL)
  #define DPPIC_CHG_CH12_Msk (0x1UL << DPPIC_CHG_CH12_Pos)
  #define DPPIC_CHG_CH12_Min (0x0UL)
  #define DPPIC_CHG_CH12_Max (0x1UL)
  #define DPPIC_CHG_CH12_Excluded (0x0UL)
  #define DPPIC_CHG_CH12_Included (0x1UL)

/* CH13 @Bit 13 : Include or exclude channel 13 */
  #define DPPIC_CHG_CH13_Pos (13UL)
  #define DPPIC_CHG_CH13_Msk (0x1UL << DPPIC_CHG_CH13_Pos)
  #define DPPIC_CHG_CH13_Min (0x0UL)
  #define DPPIC_CHG_CH13_Max (0x1UL)
  #define DPPIC_CHG_CH13_Excluded (0x0UL)
  #define DPPIC_CHG_CH13_Included (0x1UL)

/* CH14 @Bit 14 : Include or exclude channel 14 */
  #define DPPIC_CHG_CH14_Pos (14UL)
  #define DPPIC_CHG_CH14_Msk (0x1UL << DPPIC_CHG_CH14_Pos)
  #define DPPIC_CHG_CH14_Min (0x0UL)
  #define DPPIC_CHG_CH14_Max (0x1UL)
  #define DPPIC_CHG_CH14_Excluded (0x0UL)
  #define DPPIC_CHG_CH14_Included (0x1UL)

/* CH15 @Bit 15 : Include or exclude channel 15 */
  #define DPPIC_CHG_CH15_Pos (15UL)
  #define DPPIC_CHG_CH15_Msk (0x1UL << DPPIC_CHG_CH15_Pos)
  #define DPPIC_CHG_CH15_Min (0x0UL)
  #define DPPIC_CHG_CH15_Max (0x1UL)
  #define DPPIC_CHG_CH15_Excluded (0x0UL)
  #define DPPIC_CHG_CH15_Included (0x1UL)

/* CH16 @Bit 16 : Include or exclude channel 16 */
  #define DPPIC_CHG_CH16_Pos (16UL)
  #define DPPIC_CHG_CH16_Msk (0x1UL << DPPIC_CHG_CH16_Pos)
  #define DPPIC_CHG_CH16_Min (0x0UL)
  #define DPPIC_CHG_CH16_Max (0x1UL)
  #define DPPIC_CHG_CH16_Excluded (0x0UL)
  #define DPPIC_CHG_CH16_Included (0x1UL)

/* CH17 @Bit 17 : Include or exclude channel 17 */
  #define DPPIC_CHG_CH17_Pos (17UL)
  #define DPPIC_CHG_CH17_Msk (0x1UL << DPPIC_CHG_CH17_Pos)
  #define DPPIC_CHG_CH17_Min (0x0UL)
  #define DPPIC_CHG_CH17_Max (0x1UL)
  #define DPPIC_CHG_CH17_Excluded (0x0UL)
  #define DPPIC_CHG_CH17_Included (0x1UL)

/* CH18 @Bit 18 : Include or exclude channel 18 */
  #define DPPIC_CHG_CH18_Pos (18UL)
  #define DPPIC_CHG_CH18_Msk (0x1UL << DPPIC_CHG_CH18_Pos)
  #define DPPIC_CHG_CH18_Min (0x0UL)
  #define DPPIC_CHG_CH18_Max (0x1UL)
  #define DPPIC_CHG_CH18_Excluded (0x0UL)
  #define DPPIC_CHG_CH18_Included (0x1UL)

/* CH19 @Bit 19 : Include or exclude channel 19 */
  #define DPPIC_CHG_CH19_Pos (19UL)
  #define DPPIC_CHG_CH19_Msk (0x1UL << DPPIC_CHG_CH19_Pos)
  #define DPPIC_CHG_CH19_Min (0x0UL)
  #define DPPIC_CHG_CH19_Max (0x1UL)
  #define DPPIC_CHG_CH19_Excluded (0x0UL)
  #define DPPIC_CHG_CH19_Included (0x1UL)

/* CH20 @Bit 20 : Include or exclude channel 20 */
  #define DPPIC_CHG_CH20_Pos (20UL)
  #define DPPIC_CHG_CH20_Msk (0x1UL << DPPIC_CHG_CH20_Pos)
  #define DPPIC_CHG_CH20_Min (0x0UL)
  #define DPPIC_CHG_CH20_Max (0x1UL)
  #define DPPIC_CHG_CH20_Excluded (0x0UL)
  #define DPPIC_CHG_CH20_Included (0x1UL)

/* CH21 @Bit 21 : Include or exclude channel 21 */
  #define DPPIC_CHG_CH21_Pos (21UL)
  #define DPPIC_CHG_CH21_Msk (0x1UL << DPPIC_CHG_CH21_Pos)
  #define DPPIC_CHG_CH21_Min (0x0UL)
  #define DPPIC_CHG_CH21_Max (0x1UL)
  #define DPPIC_CHG_CH21_Excluded (0x0UL)
  #define DPPIC_CHG_CH21_Included (0x1UL)

/* CH22 @Bit 22 : Include or exclude channel 22 */
  #define DPPIC_CHG_CH22_Pos (22UL)
  #define DPPIC_CHG_CH22_Msk (0x1UL << DPPIC_CHG_CH22_Pos)
  #define DPPIC_CHG_CH22_Min (0x0UL)
  #define DPPIC_CHG_CH22_Max (0x1UL)
  #define DPPIC_CHG_CH22_Excluded (0x0UL)
  #define DPPIC_CHG_CH22_Included (0x1UL)

/* CH23 @Bit 23 : Include or exclude channel 23 */
  #define DPPIC_CHG_CH23_Pos (23UL)
  #define DPPIC_CHG_CH23_Msk (0x1UL << DPPIC_CHG_CH23_Pos)
  #define DPPIC_CHG_CH23_Min (0x0UL)
  #define DPPIC_CHG_CH23_Max (0x1UL)
  #define DPPIC_CHG_CH23_Excluded (0x0UL)
  #define DPPIC_CHG_CH23_Included (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ECB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

