pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ===================================================== Struct ECB_KEY ====================================================== */
/**
  * @brief KEY [ECB_KEY] (unspecified)
  */
typedef struct {
  __OM  uint32_t  VALUE[4];
} NRF_ECB_KEY_Type;

/* ECB_KEY_VALUE: 128-bit AES key */
  #define ECB_KEY_VALUE_MaxCount (4UL)
  #define ECB_KEY_VALUE_MaxIndex (3UL)
  #define ECB_KEY_VALUE_MinIndex (0UL)
  #define ECB_KEY_VALUE_ResetValue (0x00000000UL)

/* VALUE @Bits 0..31 : AES 128-bit key value, bits (32*(n+1))-1 : (32*n) */
  #define ECB_KEY_VALUE_VALUE_Pos (0UL)
  #define ECB_KEY_VALUE_VALUE_Msk (0xFFFFFFFFUL << ECB_KEY_VALUE_VALUE_Pos)



/* ====================================================== Struct ECB_IN ====================================================== */
/**
  * @brief IN [ECB_IN] IN EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;
} NRF_ECB_IN_Type;

/* ECB_IN_PTR: Input pointer */
  #define ECB_IN_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : Points to a job list containing unencrypted ECB data structure */
  #define ECB_IN_PTR_PTR_Pos (0UL)
  #define ECB_IN_PTR_PTR_Msk (0xFFFFFFFFUL << ECB_IN_PTR_PTR_Pos)



/* ===================================================== Struct ECB_OUT ====================================================== */
/**
  * @brief OUT [ECB_OUT] OUT EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Output pointer Points to a job list containing
                                                                         encrypted ECB data structure*/
} NRF_ECB_OUT_Type;

/* ECB_OUT_PTR: Output pointer Points to a job list containing encrypted ECB data structure */
  #define ECB_OUT_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : Output pointer */
  #define ECB_OUT_PTR_PTR_Pos (0UL)
  #define ECB_OUT_PTR_PTR_Msk (0xFFFFFFFFUL << ECB_OUT_PTR_PTR_Pos)


/* ======================================================= Struct ECB ======================================================== */
/**
  * @brief AES ECB Mode Encryption
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_END;
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x00000104) ECB block encrypt aborted because of a STOP task or due
                                                                         to an error*/
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_END;
    __IOM uint32_t PUBLISH_ERROR;
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED4[61];
    __IM uint32_t ERRORSTATUS;
    __IM uint32_t RESERVED5[67];
    __IOM NRF_ECB_KEY_Type KEY;
    __IM uint32_t RESERVED6[4];
    __IOM NRF_ECB_IN_Type IN;
    __IM uint32_t RESERVED7;
    __IOM NRF_ECB_OUT_Type OUT;
  } NRF_ECB_Type;

/* ECB_TASKS_START: Start ECB block encrypt */
  #define ECB_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start ECB block encrypt */
  #define ECB_TASKS_START_TASKS_START_Pos (0UL)
  #define ECB_TASKS_START_TASKS_START_Msk (0x1UL << ECB_TASKS_START_TASKS_START_Pos)
  #define ECB_TASKS_START_TASKS_START_Min (0x1UL)
  #define ECB_TASKS_START_TASKS_START_Max (0x1UL)
  #define ECB_TASKS_START_TASKS_START_Trigger (0x1UL)


/* ECB_TASKS_STOP: Abort a possible executing ECB operation */
  #define ECB_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Abort a possible executing ECB operation */
  #define ECB_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define ECB_TASKS_STOP_TASKS_STOP_Msk (0x1UL << ECB_TASKS_STOP_TASKS_STOP_Pos)
  #define ECB_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define ECB_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define ECB_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* ECB_SUBSCRIBE_START: Subscribe configuration for task START */
  #define ECB_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define ECB_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define ECB_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << ECB_SUBSCRIBE_START_CHIDX_Pos)
  #define ECB_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define ECB_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define ECB_SUBSCRIBE_START_EN_Pos (31UL)
  #define ECB_SUBSCRIBE_START_EN_Msk (0x1UL << ECB_SUBSCRIBE_START_EN_Pos)
  #define ECB_SUBSCRIBE_START_EN_Min (0x0UL)
  #define ECB_SUBSCRIBE_START_EN_Max (0x1UL)
  #define ECB_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define ECB_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* ECB_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define ECB_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define ECB_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define ECB_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << ECB_SUBSCRIBE_STOP_CHIDX_Pos)
  #define ECB_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define ECB_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define ECB_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define ECB_SUBSCRIBE_STOP_EN_Msk (0x1UL << ECB_SUBSCRIBE_STOP_EN_Pos)
  #define ECB_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define ECB_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define ECB_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define ECB_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* ECB_EVENTS_END: ECB block encrypt complete */
  #define ECB_EVENTS_END_ResetValue (0x00000000UL)

/* EVENTS_END @Bit 0 : ECB block encrypt complete */
  #define ECB_EVENTS_END_EVENTS_END_Pos (0UL)
  #define ECB_EVENTS_END_EVENTS_END_Msk (0x1UL << ECB_EVENTS_END_EVENTS_END_Pos)
  #define ECB_EVENTS_END_EVENTS_END_Min (0x0UL)
  #define ECB_EVENTS_END_EVENTS_END_Max (0x1UL)
  #define ECB_EVENTS_END_EVENTS_END_NotGenerated (0x0UL)
  #define ECB_EVENTS_END_EVENTS_END_Generated (0x1UL)


/* ECB_EVENTS_ERROR: ECB block encrypt aborted because of a STOP task or due to an error */
  #define ECB_EVENTS_ERROR_ResetValue (0x00000000UL)

/* EVENTS_ERROR @Bit 0 : ECB block encrypt aborted because of a STOP task or due to an error */
  #define ECB_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)
  #define ECB_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << ECB_EVENTS_ERROR_EVENTS_ERROR_Pos)
  #define ECB_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)
  #define ECB_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)
  #define ECB_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL)
  #define ECB_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL)


/* ECB_PUBLISH_END: Publish configuration for event END */
  #define ECB_PUBLISH_END_ResetValue (0x00000000UL)

