pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define ECB_PUBLISH_END_CHIDX_Pos (0UL)
  #define ECB_PUBLISH_END_CHIDX_Msk (0xFFUL << ECB_PUBLISH_END_CHIDX_Pos)
  #define ECB_PUBLISH_END_CHIDX_Min (0x00UL)
  #define ECB_PUBLISH_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define ECB_PUBLISH_END_EN_Pos (31UL)
  #define ECB_PUBLISH_END_EN_Msk (0x1UL << ECB_PUBLISH_END_EN_Pos)
  #define ECB_PUBLISH_END_EN_Min (0x0UL)
  #define ECB_PUBLISH_END_EN_Max (0x1UL)
  #define ECB_PUBLISH_END_EN_Disabled (0x0UL)
  #define ECB_PUBLISH_END_EN_Enabled (0x1UL)


/* ECB_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define ECB_PUBLISH_ERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define ECB_PUBLISH_ERROR_CHIDX_Pos (0UL)
  #define ECB_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << ECB_PUBLISH_ERROR_CHIDX_Pos)
  #define ECB_PUBLISH_ERROR_CHIDX_Min (0x00UL)
  #define ECB_PUBLISH_ERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define ECB_PUBLISH_ERROR_EN_Pos (31UL)
  #define ECB_PUBLISH_ERROR_EN_Msk (0x1UL << ECB_PUBLISH_ERROR_EN_Pos)
  #define ECB_PUBLISH_ERROR_EN_Min (0x0UL)
  #define ECB_PUBLISH_ERROR_EN_Max (0x1UL)
  #define ECB_PUBLISH_ERROR_EN_Disabled (0x0UL)
  #define ECB_PUBLISH_ERROR_EN_Enabled (0x1UL)


/* ECB_INTENSET: Enable interrupt */
  #define ECB_INTENSET_ResetValue (0x00000000UL)

/* END @Bit 0 : Write '1' to enable interrupt for event END */
  #define ECB_INTENSET_END_Pos (0UL)
  #define ECB_INTENSET_END_Msk (0x1UL << ECB_INTENSET_END_Pos)
  #define ECB_INTENSET_END_Min (0x0UL)
  #define ECB_INTENSET_END_Max (0x1UL)
  #define ECB_INTENSET_END_Set (0x1UL)
  #define ECB_INTENSET_END_Disabled (0x0UL)
  #define ECB_INTENSET_END_Enabled (0x1UL)

/* ERROR @Bit 1 : Write '1' to enable interrupt for event ERROR */
  #define ECB_INTENSET_ERROR_Pos (1UL)
  #define ECB_INTENSET_ERROR_Msk (0x1UL << ECB_INTENSET_ERROR_Pos)
  #define ECB_INTENSET_ERROR_Min (0x0UL)
  #define ECB_INTENSET_ERROR_Max (0x1UL)
  #define ECB_INTENSET_ERROR_Set (0x1UL)
  #define ECB_INTENSET_ERROR_Disabled (0x0UL)
  #define ECB_INTENSET_ERROR_Enabled (0x1UL)


/* ECB_INTENCLR: Disable interrupt */
  #define ECB_INTENCLR_ResetValue (0x00000000UL)

/* END @Bit 0 : Write '1' to disable interrupt for event END */
  #define ECB_INTENCLR_END_Pos (0UL)
  #define ECB_INTENCLR_END_Msk (0x1UL << ECB_INTENCLR_END_Pos)
  #define ECB_INTENCLR_END_Min (0x0UL)
  #define ECB_INTENCLR_END_Max (0x1UL)
  #define ECB_INTENCLR_END_Clear (0x1UL)
  #define ECB_INTENCLR_END_Disabled (0x0UL)
  #define ECB_INTENCLR_END_Enabled (0x1UL)

/* ERROR @Bit 1 : Write '1' to disable interrupt for event ERROR */
  #define ECB_INTENCLR_ERROR_Pos (1UL)
  #define ECB_INTENCLR_ERROR_Msk (0x1UL << ECB_INTENCLR_ERROR_Pos)
  #define ECB_INTENCLR_ERROR_Min (0x0UL)
  #define ECB_INTENCLR_ERROR_Max (0x1UL)
  #define ECB_INTENCLR_ERROR_Clear (0x1UL)
  #define ECB_INTENCLR_ERROR_Disabled (0x0UL)
  #define ECB_INTENCLR_ERROR_Enabled (0x1UL)


/* ECB_ERRORSTATUS: Error status */
  #define ECB_ERRORSTATUS_ResetValue (0x00000000UL)

/* ERRORSTATUS @Bits 0..2 : Error status when the ERROR event is generated */
  #define ECB_ERRORSTATUS_ERRORSTATUS_Pos (0UL)
  #define ECB_ERRORSTATUS_ERRORSTATUS_Msk (0x7UL << ECB_ERRORSTATUS_ERRORSTATUS_Pos)
  #define ECB_ERRORSTATUS_ERRORSTATUS_Min (0x0UL)
  #define ECB_ERRORSTATUS_ERRORSTATUS_Max (0x4UL)
  #define ECB_ERRORSTATUS_ERRORSTATUS_NoError (0x0UL)
  #define ECB_ERRORSTATUS_ERRORSTATUS_PrematureInptrEnd (0x1UL)
  #define ECB_ERRORSTATUS_ERRORSTATUS_PrematureOutptrEnd (0x2UL)
  #define ECB_ERRORSTATUS_ERRORSTATUS_Aborted (0x3UL) /*!< Encryption aborted due to higher priority peripheral requesting or
                                                           using the AES module.*/
  #define ECB_ERRORSTATUS_ERRORSTATUS_DmaError (0x4UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            EGU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct EGU ======================================================== */
/**
  * @brief Event generator unit
  */
  typedef struct {
    __OM uint32_t TASKS_TRIGGER[16];                 /*!< (@ 0x00000000) Trigger n for triggering the corresponding TRIGGERED[n]
                                                                         event*/
    __IM uint32_t RESERVED[16];
    __IOM uint32_t SUBSCRIBE_TRIGGER[16];
    __IM uint32_t RESERVED1[16];
    __IOM uint32_t EVENTS_TRIGGERED[16];             /*!< (@ 0x00000100) Event number n generated by triggering the
                                                                         corresponding TRIGGER[n] task*/
    __IM uint32_t RESERVED2[16];
    __IOM uint32_t PUBLISH_TRIGGERED[16];
    __IM uint32_t RESERVED3[80];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
  } NRF_EGU_Type;

/* EGU_TASKS_TRIGGER: Trigger n for triggering the corresponding TRIGGERED[n] event */
  #define EGU_TASKS_TRIGGER_MaxCount (16UL)
  #define EGU_TASKS_TRIGGER_MaxIndex (15UL)
  #define EGU_TASKS_TRIGGER_MinIndex (0UL)
  #define EGU_TASKS_TRIGGER_ResetValue (0x00000000UL)

/* TASKS_TRIGGER @Bit 0 : Trigger n for triggering the corresponding TRIGGERED[n] event */
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL)
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << EGU_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of TASKS_TRIGGER
                                                                            field.*/
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL)
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL)
  #define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL)


/* EGU_SUBSCRIBE_TRIGGER: Subscribe configuration for task TRIGGER[n] */
  #define EGU_SUBSCRIBE_TRIGGER_MaxCount (16UL)
  #define EGU_SUBSCRIBE_TRIGGER_MaxIndex (15UL)
  #define EGU_SUBSCRIBE_TRIGGER_MinIndex (0UL)
  #define EGU_SUBSCRIBE_TRIGGER_ResetValue (0x00000000UL)

