pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task TRIGGER[n] will subscribe to */
  #define EGU_SUBSCRIBE_TRIGGER_CHIDX_Pos (0UL)
  #define EGU_SUBSCRIBE_TRIGGER_CHIDX_Msk (0xFFUL << EGU_SUBSCRIBE_TRIGGER_CHIDX_Pos)
  #define EGU_SUBSCRIBE_TRIGGER_CHIDX_Min (0x00UL)
  #define EGU_SUBSCRIBE_TRIGGER_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define EGU_SUBSCRIBE_TRIGGER_EN_Pos (31UL)
  #define EGU_SUBSCRIBE_TRIGGER_EN_Msk (0x1UL << EGU_SUBSCRIBE_TRIGGER_EN_Pos)
  #define EGU_SUBSCRIBE_TRIGGER_EN_Min (0x0UL)
  #define EGU_SUBSCRIBE_TRIGGER_EN_Max (0x1UL)
  #define EGU_SUBSCRIBE_TRIGGER_EN_Disabled (0x0UL)
  #define EGU_SUBSCRIBE_TRIGGER_EN_Enabled (0x1UL)


/* EGU_EVENTS_TRIGGERED: Event number n generated by triggering the corresponding TRIGGER[n] task */
  #define EGU_EVENTS_TRIGGERED_MaxCount (16UL)
  #define EGU_EVENTS_TRIGGERED_MaxIndex (15UL)
  #define EGU_EVENTS_TRIGGERED_MinIndex (0UL)
  #define EGU_EVENTS_TRIGGERED_ResetValue (0x00000000UL)

/* EVENTS_TRIGGERED @Bit 0 : Event number n generated by triggering the corresponding TRIGGER[n] task */
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos (0UL)
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Msk (0x1UL << EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos) /*!< Bit mask of
                                                                            EVENTS_TRIGGERED field.*/
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Min (0x0UL)
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Max (0x1UL)
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_NotGenerated (0x0UL)
  #define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Generated (0x1UL)


/* EGU_PUBLISH_TRIGGERED: Publish configuration for event TRIGGERED[n] */
  #define EGU_PUBLISH_TRIGGERED_MaxCount (16UL)
  #define EGU_PUBLISH_TRIGGERED_MaxIndex (15UL)
  #define EGU_PUBLISH_TRIGGERED_MinIndex (0UL)
  #define EGU_PUBLISH_TRIGGERED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event TRIGGERED[n] will publish to */
  #define EGU_PUBLISH_TRIGGERED_CHIDX_Pos (0UL)
  #define EGU_PUBLISH_TRIGGERED_CHIDX_Msk (0xFFUL << EGU_PUBLISH_TRIGGERED_CHIDX_Pos)
  #define EGU_PUBLISH_TRIGGERED_CHIDX_Min (0x00UL)
  #define EGU_PUBLISH_TRIGGERED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define EGU_PUBLISH_TRIGGERED_EN_Pos (31UL)
  #define EGU_PUBLISH_TRIGGERED_EN_Msk (0x1UL << EGU_PUBLISH_TRIGGERED_EN_Pos)
  #define EGU_PUBLISH_TRIGGERED_EN_Min (0x0UL)
  #define EGU_PUBLISH_TRIGGERED_EN_Max (0x1UL)
  #define EGU_PUBLISH_TRIGGERED_EN_Disabled (0x0UL)
  #define EGU_PUBLISH_TRIGGERED_EN_Enabled (0x1UL)


/* EGU_INTEN: Enable or disable interrupt */
  #define EGU_INTEN_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Enable or disable interrupt for event TRIGGERED[0] */
  #define EGU_INTEN_TRIGGERED0_Pos (0UL)
  #define EGU_INTEN_TRIGGERED0_Msk (0x1UL << EGU_INTEN_TRIGGERED0_Pos)
  #define EGU_INTEN_TRIGGERED0_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED0_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED0_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED0_Enabled (0x1UL)

/* TRIGGERED1 @Bit 1 : Enable or disable interrupt for event TRIGGERED[1] */
  #define EGU_INTEN_TRIGGERED1_Pos (1UL)
  #define EGU_INTEN_TRIGGERED1_Msk (0x1UL << EGU_INTEN_TRIGGERED1_Pos)
  #define EGU_INTEN_TRIGGERED1_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED1_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED1_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED1_Enabled (0x1UL)

/* TRIGGERED2 @Bit 2 : Enable or disable interrupt for event TRIGGERED[2] */
  #define EGU_INTEN_TRIGGERED2_Pos (2UL)
  #define EGU_INTEN_TRIGGERED2_Msk (0x1UL << EGU_INTEN_TRIGGERED2_Pos)
  #define EGU_INTEN_TRIGGERED2_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED2_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED2_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED2_Enabled (0x1UL)

/* TRIGGERED3 @Bit 3 : Enable or disable interrupt for event TRIGGERED[3] */
  #define EGU_INTEN_TRIGGERED3_Pos (3UL)
  #define EGU_INTEN_TRIGGERED3_Msk (0x1UL << EGU_INTEN_TRIGGERED3_Pos)
  #define EGU_INTEN_TRIGGERED3_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED3_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED3_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED3_Enabled (0x1UL)

/* TRIGGERED4 @Bit 4 : Enable or disable interrupt for event TRIGGERED[4] */
  #define EGU_INTEN_TRIGGERED4_Pos (4UL)
  #define EGU_INTEN_TRIGGERED4_Msk (0x1UL << EGU_INTEN_TRIGGERED4_Pos)
  #define EGU_INTEN_TRIGGERED4_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED4_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED4_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED4_Enabled (0x1UL)

/* TRIGGERED5 @Bit 5 : Enable or disable interrupt for event TRIGGERED[5] */
  #define EGU_INTEN_TRIGGERED5_Pos (5UL)
  #define EGU_INTEN_TRIGGERED5_Msk (0x1UL << EGU_INTEN_TRIGGERED5_Pos)
  #define EGU_INTEN_TRIGGERED5_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED5_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED5_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED5_Enabled (0x1UL)

/* TRIGGERED6 @Bit 6 : Enable or disable interrupt for event TRIGGERED[6] */
  #define EGU_INTEN_TRIGGERED6_Pos (6UL)
  #define EGU_INTEN_TRIGGERED6_Msk (0x1UL << EGU_INTEN_TRIGGERED6_Pos)
  #define EGU_INTEN_TRIGGERED6_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED6_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED6_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED6_Enabled (0x1UL)

/* TRIGGERED7 @Bit 7 : Enable or disable interrupt for event TRIGGERED[7] */
  #define EGU_INTEN_TRIGGERED7_Pos (7UL)
  #define EGU_INTEN_TRIGGERED7_Msk (0x1UL << EGU_INTEN_TRIGGERED7_Pos)
  #define EGU_INTEN_TRIGGERED7_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED7_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED7_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED7_Enabled (0x1UL)

/* TRIGGERED8 @Bit 8 : Enable or disable interrupt for event TRIGGERED[8] */
  #define EGU_INTEN_TRIGGERED8_Pos (8UL)
  #define EGU_INTEN_TRIGGERED8_Msk (0x1UL << EGU_INTEN_TRIGGERED8_Pos)
  #define EGU_INTEN_TRIGGERED8_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED8_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED8_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED8_Enabled (0x1UL)

/* TRIGGERED9 @Bit 9 : Enable or disable interrupt for event TRIGGERED[9] */
  #define EGU_INTEN_TRIGGERED9_Pos (9UL)
  #define EGU_INTEN_TRIGGERED9_Msk (0x1UL << EGU_INTEN_TRIGGERED9_Pos)
  #define EGU_INTEN_TRIGGERED9_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED9_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED9_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED9_Enabled (0x1UL)

/* TRIGGERED10 @Bit 10 : Enable or disable interrupt for event TRIGGERED[10] */
  #define EGU_INTEN_TRIGGERED10_Pos (10UL)
  #define EGU_INTEN_TRIGGERED10_Msk (0x1UL << EGU_INTEN_TRIGGERED10_Pos)
  #define EGU_INTEN_TRIGGERED10_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED10_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED10_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED10_Enabled (0x1UL)

/* TRIGGERED11 @Bit 11 : Enable or disable interrupt for event TRIGGERED[11] */
  #define EGU_INTEN_TRIGGERED11_Pos (11UL)
  #define EGU_INTEN_TRIGGERED11_Msk (0x1UL << EGU_INTEN_TRIGGERED11_Pos)
  #define EGU_INTEN_TRIGGERED11_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED11_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED11_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED11_Enabled (0x1UL)

/* TRIGGERED12 @Bit 12 : Enable or disable interrupt for event TRIGGERED[12] */
  #define EGU_INTEN_TRIGGERED12_Pos (12UL)
  #define EGU_INTEN_TRIGGERED12_Msk (0x1UL << EGU_INTEN_TRIGGERED12_Pos)
  #define EGU_INTEN_TRIGGERED12_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED12_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED12_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED12_Enabled (0x1UL)

/* TRIGGERED13 @Bit 13 : Enable or disable interrupt for event TRIGGERED[13] */
  #define EGU_INTEN_TRIGGERED13_Pos (13UL)
  #define EGU_INTEN_TRIGGERED13_Msk (0x1UL << EGU_INTEN_TRIGGERED13_Pos)
  #define EGU_INTEN_TRIGGERED13_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED13_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED13_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED13_Enabled (0x1UL)

/* TRIGGERED14 @Bit 14 : Enable or disable interrupt for event TRIGGERED[14] */
  #define EGU_INTEN_TRIGGERED14_Pos (14UL)
  #define EGU_INTEN_TRIGGERED14_Msk (0x1UL << EGU_INTEN_TRIGGERED14_Pos)
  #define EGU_INTEN_TRIGGERED14_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED14_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED14_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED14_Enabled (0x1UL)

/* TRIGGERED15 @Bit 15 : Enable or disable interrupt for event TRIGGERED[15] */
  #define EGU_INTEN_TRIGGERED15_Pos (15UL)
  #define EGU_INTEN_TRIGGERED15_Msk (0x1UL << EGU_INTEN_TRIGGERED15_Pos)
  #define EGU_INTEN_TRIGGERED15_Min (0x0UL)
  #define EGU_INTEN_TRIGGERED15_Max (0x1UL)
  #define EGU_INTEN_TRIGGERED15_Disabled (0x0UL)
  #define EGU_INTEN_TRIGGERED15_Enabled (0x1UL)


/* EGU_INTENSET: Enable interrupt */
  #define EGU_INTENSET_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Write '1' to enable interrupt for event TRIGGERED[0] */
  #define EGU_INTENSET_TRIGGERED0_Pos (0UL)
  #define EGU_INTENSET_TRIGGERED0_Msk (0x1UL << EGU_INTENSET_TRIGGERED0_Pos)
  #define EGU_INTENSET_TRIGGERED0_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED0_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED0_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED0_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED0_Enabled (0x1UL)

/* TRIGGERED1 @Bit 1 : Write '1' to enable interrupt for event TRIGGERED[1] */
  #define EGU_INTENSET_TRIGGERED1_Pos (1UL)
  #define EGU_INTENSET_TRIGGERED1_Msk (0x1UL << EGU_INTENSET_TRIGGERED1_Pos)
  #define EGU_INTENSET_TRIGGERED1_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED1_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED1_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED1_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED1_Enabled (0x1UL)

/* TRIGGERED2 @Bit 2 : Write '1' to enable interrupt for event TRIGGERED[2] */
  #define EGU_INTENSET_TRIGGERED2_Pos (2UL)
  #define EGU_INTENSET_TRIGGERED2_Msk (0x1UL << EGU_INTENSET_TRIGGERED2_Pos)
  #define EGU_INTENSET_TRIGGERED2_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED2_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED2_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED2_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED2_Enabled (0x1UL)

/* TRIGGERED3 @Bit 3 : Write '1' to enable interrupt for event TRIGGERED[3] */
  #define EGU_INTENSET_TRIGGERED3_Pos (3UL)
  #define EGU_INTENSET_TRIGGERED3_Msk (0x1UL << EGU_INTENSET_TRIGGERED3_Pos)
  #define EGU_INTENSET_TRIGGERED3_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED3_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED3_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED3_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED3_Enabled (0x1UL)

/* TRIGGERED4 @Bit 4 : Write '1' to enable interrupt for event TRIGGERED[4] */
  #define EGU_INTENSET_TRIGGERED4_Pos (4UL)
  #define EGU_INTENSET_TRIGGERED4_Msk (0x1UL << EGU_INTENSET_TRIGGERED4_Pos)
  #define EGU_INTENSET_TRIGGERED4_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED4_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED4_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED4_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED4_Enabled (0x1UL)

/* TRIGGERED5 @Bit 5 : Write '1' to enable interrupt for event TRIGGERED[5] */
  #define EGU_INTENSET_TRIGGERED5_Pos (5UL)
  #define EGU_INTENSET_TRIGGERED5_Msk (0x1UL << EGU_INTENSET_TRIGGERED5_Pos)
  #define EGU_INTENSET_TRIGGERED5_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED5_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED5_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED5_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED5_Enabled (0x1UL)

/* TRIGGERED6 @Bit 6 : Write '1' to enable interrupt for event TRIGGERED[6] */
  #define EGU_INTENSET_TRIGGERED6_Pos (6UL)
  #define EGU_INTENSET_TRIGGERED6_Msk (0x1UL << EGU_INTENSET_TRIGGERED6_Pos)
  #define EGU_INTENSET_TRIGGERED6_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED6_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED6_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED6_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED6_Enabled (0x1UL)

/* TRIGGERED7 @Bit 7 : Write '1' to enable interrupt for event TRIGGERED[7] */
  #define EGU_INTENSET_TRIGGERED7_Pos (7UL)
  #define EGU_INTENSET_TRIGGERED7_Msk (0x1UL << EGU_INTENSET_TRIGGERED7_Pos)
  #define EGU_INTENSET_TRIGGERED7_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED7_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED7_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED7_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED7_Enabled (0x1UL)

/* TRIGGERED8 @Bit 8 : Write '1' to enable interrupt for event TRIGGERED[8] */
  #define EGU_INTENSET_TRIGGERED8_Pos (8UL)
  #define EGU_INTENSET_TRIGGERED8_Msk (0x1UL << EGU_INTENSET_TRIGGERED8_Pos)
  #define EGU_INTENSET_TRIGGERED8_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED8_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED8_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED8_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED8_Enabled (0x1UL)

/* TRIGGERED9 @Bit 9 : Write '1' to enable interrupt for event TRIGGERED[9] */
  #define EGU_INTENSET_TRIGGERED9_Pos (9UL)
  #define EGU_INTENSET_TRIGGERED9_Msk (0x1UL << EGU_INTENSET_TRIGGERED9_Pos)
  #define EGU_INTENSET_TRIGGERED9_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED9_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED9_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED9_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED9_Enabled (0x1UL)

/* TRIGGERED10 @Bit 10 : Write '1' to enable interrupt for event TRIGGERED[10] */
  #define EGU_INTENSET_TRIGGERED10_Pos (10UL)
  #define EGU_INTENSET_TRIGGERED10_Msk (0x1UL << EGU_INTENSET_TRIGGERED10_Pos)
  #define EGU_INTENSET_TRIGGERED10_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED10_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED10_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED10_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED10_Enabled (0x1UL)

/* TRIGGERED11 @Bit 11 : Write '1' to enable interrupt for event TRIGGERED[11] */
  #define EGU_INTENSET_TRIGGERED11_Pos (11UL)
  #define EGU_INTENSET_TRIGGERED11_Msk (0x1UL << EGU_INTENSET_TRIGGERED11_Pos)
  #define EGU_INTENSET_TRIGGERED11_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED11_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED11_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED11_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED11_Enabled (0x1UL)

