pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGGERED12 @Bit 12 : Write '1' to enable interrupt for event TRIGGERED[12] */
  #define EGU_INTENSET_TRIGGERED12_Pos (12UL)
  #define EGU_INTENSET_TRIGGERED12_Msk (0x1UL << EGU_INTENSET_TRIGGERED12_Pos)
  #define EGU_INTENSET_TRIGGERED12_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED12_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED12_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED12_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED12_Enabled (0x1UL)

/* TRIGGERED13 @Bit 13 : Write '1' to enable interrupt for event TRIGGERED[13] */
  #define EGU_INTENSET_TRIGGERED13_Pos (13UL)
  #define EGU_INTENSET_TRIGGERED13_Msk (0x1UL << EGU_INTENSET_TRIGGERED13_Pos)
  #define EGU_INTENSET_TRIGGERED13_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED13_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED13_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED13_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED13_Enabled (0x1UL)

/* TRIGGERED14 @Bit 14 : Write '1' to enable interrupt for event TRIGGERED[14] */
  #define EGU_INTENSET_TRIGGERED14_Pos (14UL)
  #define EGU_INTENSET_TRIGGERED14_Msk (0x1UL << EGU_INTENSET_TRIGGERED14_Pos)
  #define EGU_INTENSET_TRIGGERED14_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED14_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED14_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED14_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED14_Enabled (0x1UL)

/* TRIGGERED15 @Bit 15 : Write '1' to enable interrupt for event TRIGGERED[15] */
  #define EGU_INTENSET_TRIGGERED15_Pos (15UL)
  #define EGU_INTENSET_TRIGGERED15_Msk (0x1UL << EGU_INTENSET_TRIGGERED15_Pos)
  #define EGU_INTENSET_TRIGGERED15_Min (0x0UL)
  #define EGU_INTENSET_TRIGGERED15_Max (0x1UL)
  #define EGU_INTENSET_TRIGGERED15_Set (0x1UL)
  #define EGU_INTENSET_TRIGGERED15_Disabled (0x0UL)
  #define EGU_INTENSET_TRIGGERED15_Enabled (0x1UL)


/* EGU_INTENCLR: Disable interrupt */
  #define EGU_INTENCLR_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
  #define EGU_INTENCLR_TRIGGERED0_Pos (0UL)
  #define EGU_INTENCLR_TRIGGERED0_Msk (0x1UL << EGU_INTENCLR_TRIGGERED0_Pos)
  #define EGU_INTENCLR_TRIGGERED0_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED0_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED0_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED0_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED0_Enabled (0x1UL)

/* TRIGGERED1 @Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
  #define EGU_INTENCLR_TRIGGERED1_Pos (1UL)
  #define EGU_INTENCLR_TRIGGERED1_Msk (0x1UL << EGU_INTENCLR_TRIGGERED1_Pos)
  #define EGU_INTENCLR_TRIGGERED1_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED1_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED1_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED1_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED1_Enabled (0x1UL)

/* TRIGGERED2 @Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
  #define EGU_INTENCLR_TRIGGERED2_Pos (2UL)
  #define EGU_INTENCLR_TRIGGERED2_Msk (0x1UL << EGU_INTENCLR_TRIGGERED2_Pos)
  #define EGU_INTENCLR_TRIGGERED2_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED2_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED2_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED2_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED2_Enabled (0x1UL)

/* TRIGGERED3 @Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
  #define EGU_INTENCLR_TRIGGERED3_Pos (3UL)
  #define EGU_INTENCLR_TRIGGERED3_Msk (0x1UL << EGU_INTENCLR_TRIGGERED3_Pos)
  #define EGU_INTENCLR_TRIGGERED3_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED3_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED3_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED3_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED3_Enabled (0x1UL)

/* TRIGGERED4 @Bit 4 : Write '1' to disable interrupt for event TRIGGERED[4] */
  #define EGU_INTENCLR_TRIGGERED4_Pos (4UL)
  #define EGU_INTENCLR_TRIGGERED4_Msk (0x1UL << EGU_INTENCLR_TRIGGERED4_Pos)
  #define EGU_INTENCLR_TRIGGERED4_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED4_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED4_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED4_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED4_Enabled (0x1UL)

/* TRIGGERED5 @Bit 5 : Write '1' to disable interrupt for event TRIGGERED[5] */
  #define EGU_INTENCLR_TRIGGERED5_Pos (5UL)
  #define EGU_INTENCLR_TRIGGERED5_Msk (0x1UL << EGU_INTENCLR_TRIGGERED5_Pos)
  #define EGU_INTENCLR_TRIGGERED5_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED5_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED5_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED5_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED5_Enabled (0x1UL)

/* TRIGGERED6 @Bit 6 : Write '1' to disable interrupt for event TRIGGERED[6] */
  #define EGU_INTENCLR_TRIGGERED6_Pos (6UL)
  #define EGU_INTENCLR_TRIGGERED6_Msk (0x1UL << EGU_INTENCLR_TRIGGERED6_Pos)
  #define EGU_INTENCLR_TRIGGERED6_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED6_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED6_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED6_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED6_Enabled (0x1UL)

/* TRIGGERED7 @Bit 7 : Write '1' to disable interrupt for event TRIGGERED[7] */
  #define EGU_INTENCLR_TRIGGERED7_Pos (7UL)
  #define EGU_INTENCLR_TRIGGERED7_Msk (0x1UL << EGU_INTENCLR_TRIGGERED7_Pos)
  #define EGU_INTENCLR_TRIGGERED7_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED7_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED7_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED7_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED7_Enabled (0x1UL)

/* TRIGGERED8 @Bit 8 : Write '1' to disable interrupt for event TRIGGERED[8] */
  #define EGU_INTENCLR_TRIGGERED8_Pos (8UL)
  #define EGU_INTENCLR_TRIGGERED8_Msk (0x1UL << EGU_INTENCLR_TRIGGERED8_Pos)
  #define EGU_INTENCLR_TRIGGERED8_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED8_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED8_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED8_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED8_Enabled (0x1UL)

/* TRIGGERED9 @Bit 9 : Write '1' to disable interrupt for event TRIGGERED[9] */
  #define EGU_INTENCLR_TRIGGERED9_Pos (9UL)
  #define EGU_INTENCLR_TRIGGERED9_Msk (0x1UL << EGU_INTENCLR_TRIGGERED9_Pos)
  #define EGU_INTENCLR_TRIGGERED9_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED9_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED9_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED9_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED9_Enabled (0x1UL)

