pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGGERED10 @Bit 10 : Write '1' to disable interrupt for event TRIGGERED[10] */
  #define EGU_INTENCLR_TRIGGERED10_Pos (10UL)
  #define EGU_INTENCLR_TRIGGERED10_Msk (0x1UL << EGU_INTENCLR_TRIGGERED10_Pos)
  #define EGU_INTENCLR_TRIGGERED10_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED10_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED10_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED10_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED10_Enabled (0x1UL)

/* TRIGGERED11 @Bit 11 : Write '1' to disable interrupt for event TRIGGERED[11] */
  #define EGU_INTENCLR_TRIGGERED11_Pos (11UL)
  #define EGU_INTENCLR_TRIGGERED11_Msk (0x1UL << EGU_INTENCLR_TRIGGERED11_Pos)
  #define EGU_INTENCLR_TRIGGERED11_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED11_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED11_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED11_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED11_Enabled (0x1UL)

/* TRIGGERED12 @Bit 12 : Write '1' to disable interrupt for event TRIGGERED[12] */
  #define EGU_INTENCLR_TRIGGERED12_Pos (12UL)
  #define EGU_INTENCLR_TRIGGERED12_Msk (0x1UL << EGU_INTENCLR_TRIGGERED12_Pos)
  #define EGU_INTENCLR_TRIGGERED12_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED12_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED12_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED12_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED12_Enabled (0x1UL)

/* TRIGGERED13 @Bit 13 : Write '1' to disable interrupt for event TRIGGERED[13] */
  #define EGU_INTENCLR_TRIGGERED13_Pos (13UL)
  #define EGU_INTENCLR_TRIGGERED13_Msk (0x1UL << EGU_INTENCLR_TRIGGERED13_Pos)
  #define EGU_INTENCLR_TRIGGERED13_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED13_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED13_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED13_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED13_Enabled (0x1UL)

/* TRIGGERED14 @Bit 14 : Write '1' to disable interrupt for event TRIGGERED[14] */
  #define EGU_INTENCLR_TRIGGERED14_Pos (14UL)
  #define EGU_INTENCLR_TRIGGERED14_Msk (0x1UL << EGU_INTENCLR_TRIGGERED14_Pos)
  #define EGU_INTENCLR_TRIGGERED14_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED14_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED14_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED14_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED14_Enabled (0x1UL)

/* TRIGGERED15 @Bit 15 : Write '1' to disable interrupt for event TRIGGERED[15] */
  #define EGU_INTENCLR_TRIGGERED15_Pos (15UL)
  #define EGU_INTENCLR_TRIGGERED15_Msk (0x1UL << EGU_INTENCLR_TRIGGERED15_Pos)
  #define EGU_INTENCLR_TRIGGERED15_Min (0x0UL)
  #define EGU_INTENCLR_TRIGGERED15_Max (0x1UL)
  #define EGU_INTENCLR_TRIGGERED15_Clear (0x1UL)
  #define EGU_INTENCLR_TRIGGERED15_Disabled (0x0UL)
  #define EGU_INTENCLR_TRIGGERED15_Enabled (0x1UL)


/* EGU_INTPEND: Pending interrupts */
  #define EGU_INTPEND_ResetValue (0x00000000UL)

/* TRIGGERED0 @Bit 0 : Read pending status of interrupt for event TRIGGERED[0] */
  #define EGU_INTPEND_TRIGGERED0_Pos (0UL)
  #define EGU_INTPEND_TRIGGERED0_Msk (0x1UL << EGU_INTPEND_TRIGGERED0_Pos)
  #define EGU_INTPEND_TRIGGERED0_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED0_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED0_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED0_Pending (0x1UL)

/* TRIGGERED1 @Bit 1 : Read pending status of interrupt for event TRIGGERED[1] */
  #define EGU_INTPEND_TRIGGERED1_Pos (1UL)
  #define EGU_INTPEND_TRIGGERED1_Msk (0x1UL << EGU_INTPEND_TRIGGERED1_Pos)
  #define EGU_INTPEND_TRIGGERED1_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED1_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED1_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED1_Pending (0x1UL)

/* TRIGGERED2 @Bit 2 : Read pending status of interrupt for event TRIGGERED[2] */
  #define EGU_INTPEND_TRIGGERED2_Pos (2UL)
  #define EGU_INTPEND_TRIGGERED2_Msk (0x1UL << EGU_INTPEND_TRIGGERED2_Pos)
  #define EGU_INTPEND_TRIGGERED2_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED2_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED2_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED2_Pending (0x1UL)

/* TRIGGERED3 @Bit 3 : Read pending status of interrupt for event TRIGGERED[3] */
  #define EGU_INTPEND_TRIGGERED3_Pos (3UL)
  #define EGU_INTPEND_TRIGGERED3_Msk (0x1UL << EGU_INTPEND_TRIGGERED3_Pos)
  #define EGU_INTPEND_TRIGGERED3_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED3_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED3_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED3_Pending (0x1UL)

/* TRIGGERED4 @Bit 4 : Read pending status of interrupt for event TRIGGERED[4] */
  #define EGU_INTPEND_TRIGGERED4_Pos (4UL)
  #define EGU_INTPEND_TRIGGERED4_Msk (0x1UL << EGU_INTPEND_TRIGGERED4_Pos)
  #define EGU_INTPEND_TRIGGERED4_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED4_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED4_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED4_Pending (0x1UL)

/* TRIGGERED5 @Bit 5 : Read pending status of interrupt for event TRIGGERED[5] */
  #define EGU_INTPEND_TRIGGERED5_Pos (5UL)
  #define EGU_INTPEND_TRIGGERED5_Msk (0x1UL << EGU_INTPEND_TRIGGERED5_Pos)
  #define EGU_INTPEND_TRIGGERED5_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED5_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED5_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED5_Pending (0x1UL)

/* TRIGGERED6 @Bit 6 : Read pending status of interrupt for event TRIGGERED[6] */
  #define EGU_INTPEND_TRIGGERED6_Pos (6UL)
  #define EGU_INTPEND_TRIGGERED6_Msk (0x1UL << EGU_INTPEND_TRIGGERED6_Pos)
  #define EGU_INTPEND_TRIGGERED6_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED6_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED6_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED6_Pending (0x1UL)

/* TRIGGERED7 @Bit 7 : Read pending status of interrupt for event TRIGGERED[7] */
  #define EGU_INTPEND_TRIGGERED7_Pos (7UL)
  #define EGU_INTPEND_TRIGGERED7_Msk (0x1UL << EGU_INTPEND_TRIGGERED7_Pos)
  #define EGU_INTPEND_TRIGGERED7_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED7_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED7_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED7_Pending (0x1UL)

/* TRIGGERED8 @Bit 8 : Read pending status of interrupt for event TRIGGERED[8] */
  #define EGU_INTPEND_TRIGGERED8_Pos (8UL)
  #define EGU_INTPEND_TRIGGERED8_Msk (0x1UL << EGU_INTPEND_TRIGGERED8_Pos)
  #define EGU_INTPEND_TRIGGERED8_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED8_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED8_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED8_Pending (0x1UL)

/* TRIGGERED9 @Bit 9 : Read pending status of interrupt for event TRIGGERED[9] */
  #define EGU_INTPEND_TRIGGERED9_Pos (9UL)
  #define EGU_INTPEND_TRIGGERED9_Msk (0x1UL << EGU_INTPEND_TRIGGERED9_Pos)
  #define EGU_INTPEND_TRIGGERED9_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED9_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED9_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED9_Pending (0x1UL)

/* TRIGGERED10 @Bit 10 : Read pending status of interrupt for event TRIGGERED[10] */
  #define EGU_INTPEND_TRIGGERED10_Pos (10UL)
  #define EGU_INTPEND_TRIGGERED10_Msk (0x1UL << EGU_INTPEND_TRIGGERED10_Pos)
  #define EGU_INTPEND_TRIGGERED10_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED10_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED10_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED10_Pending (0x1UL)

/* TRIGGERED11 @Bit 11 : Read pending status of interrupt for event TRIGGERED[11] */
  #define EGU_INTPEND_TRIGGERED11_Pos (11UL)
  #define EGU_INTPEND_TRIGGERED11_Msk (0x1UL << EGU_INTPEND_TRIGGERED11_Pos)
  #define EGU_INTPEND_TRIGGERED11_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED11_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED11_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED11_Pending (0x1UL)

/* TRIGGERED12 @Bit 12 : Read pending status of interrupt for event TRIGGERED[12] */
  #define EGU_INTPEND_TRIGGERED12_Pos (12UL)
  #define EGU_INTPEND_TRIGGERED12_Msk (0x1UL << EGU_INTPEND_TRIGGERED12_Pos)
  #define EGU_INTPEND_TRIGGERED12_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED12_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED12_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED12_Pending (0x1UL)

/* TRIGGERED13 @Bit 13 : Read pending status of interrupt for event TRIGGERED[13] */
  #define EGU_INTPEND_TRIGGERED13_Pos (13UL)
  #define EGU_INTPEND_TRIGGERED13_Msk (0x1UL << EGU_INTPEND_TRIGGERED13_Pos)
  #define EGU_INTPEND_TRIGGERED13_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED13_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED13_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED13_Pending (0x1UL)

/* TRIGGERED14 @Bit 14 : Read pending status of interrupt for event TRIGGERED[14] */
  #define EGU_INTPEND_TRIGGERED14_Pos (14UL)
  #define EGU_INTPEND_TRIGGERED14_Msk (0x1UL << EGU_INTPEND_TRIGGERED14_Pos)
  #define EGU_INTPEND_TRIGGERED14_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED14_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED14_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED14_Pending (0x1UL)

/* TRIGGERED15 @Bit 15 : Read pending status of interrupt for event TRIGGERED[15] */
  #define EGU_INTPEND_TRIGGERED15_Pos (15UL)
  #define EGU_INTPEND_TRIGGERED15_Msk (0x1UL << EGU_INTPEND_TRIGGERED15_Pos)
  #define EGU_INTPEND_TRIGGERED15_Min (0x0UL)
  #define EGU_INTPEND_TRIGGERED15_Max (0x1UL)
  #define EGU_INTPEND_TRIGGERED15_NotPending (0x0UL)
  #define EGU_INTPEND_TRIGGERED15_Pending (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ETB                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct ETB ======================================================== */
/**
  * @brief Embedded Trace Buffer
  */
  typedef struct {
    __IM uint32_t RESERVED;
    __IM uint32_t RDP;
    __IM uint32_t RESERVED1;
    __IM uint32_t STS;
    __IM uint32_t RRD;
    __IOM uint32_t RRP;
    __IOM uint32_t RWP;
    __IOM uint32_t TRG;
    __IOM uint32_t CTL;
    __IOM uint32_t RWD;
    __IM uint32_t RESERVED2[182];
    __IM uint32_t FFSR;
    __IOM uint32_t FFCR;
    __IM uint32_t RESERVED3[758];
    __OM uint32_t ITMISCOP0;
    __OM uint32_t ITTRFLINACK;                       /*!< (@ 0x00000EE4) Integration Test Trigger In and Flush In Acknowledge
                                                                         Register*/
    __IM uint32_t ITTRFLIN;
    __IM uint32_t ITATBDATA0;
    __OM uint32_t ITATBCTR2;
    __IM uint32_t ITATBCTR1;
    __IM uint32_t ITATBCTR0;
    __IM uint32_t RESERVED4;
    __IOM uint32_t ITCTRL;
    __IM uint32_t RESERVED5[39];
    __IOM uint32_t CLAIMSET;
    __IOM uint32_t CLAIMCLR;
    __IM uint32_t RESERVED6[2];
    __OM uint32_t LAR;
    __IM uint32_t LSR;
    __IM uint32_t AUTHSTATUS;
    __IM uint32_t RESERVED7[3];
    __IM uint32_t DEVID;
    __IM uint32_t DEVTYPE;
    __IM uint32_t PERIPHID4;
    __IM uint32_t RESERVED8[3];
    __IM uint32_t PERIPHID0;
    __IM uint32_t PERIPHID1;
    __IM uint32_t PERIPHID2;
    __IM uint32_t PERIPHID3;
    __IM uint32_t COMPID0;
    __IM uint32_t COMPID1;
    __IM uint32_t COMPID2;
    __IM uint32_t COMPID3;
  } NRF_ETB_Type;

/* ETB_RDP: ETB RAM Depth Register */
  #define ETB_RDP_ResetValue (0x00000000UL)

/* ETB_RAM_DEPTH @Bits 0..31 : Defines the depth, in words, of the trace RAM. */
  #define ETB_RDP_ETB_RAM_DEPTH_Pos (0UL)
  #define ETB_RDP_ETB_RAM_DEPTH_Msk (0xFFFFFFFFUL << ETB_RDP_ETB_RAM_DEPTH_Pos)


/* ETB_STS: ETB Status Register */
  #define ETB_STS_ResetValue (0x00000008UL)

/* FULL @Bit 0 : RAM Full. The flag indicates when the RAM write pointer has wrapped around. */
  #define ETB_STS_FULL_Pos (0UL)
  #define ETB_STS_FULL_Msk (0x1UL << ETB_STS_FULL_Pos)

/* TRIGGERED @Bit 1 : The Triggered bit is set when a trigger has been observed. This does not indicate that a trigger has been
                      embedded in the trace data by the formatter, but is determined by the programming of the Formatter and
                      Flush Control Register. */

