pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETB_STS_TRIGGERED_Pos (1UL)
  #define ETB_STS_TRIGGERED_Msk (0x1UL << ETB_STS_TRIGGERED_Pos)

/* ACQCOMP @Bit 2 : The acquisition complete flag indicates that capture has been completed when the formatter stops because of
                    any of the methods defined in the Formatter and Flush Control Register, or TraceCaptEn = 0. This also
                    results in FtStopped in the Formatter and Flush Status Register going HIGH. */

  #define ETB_STS_ACQCOMP_Pos (2UL)
  #define ETB_STS_ACQCOMP_Msk (0x1UL << ETB_STS_ACQCOMP_Pos)

/* FTEMPTY @Bit 3 : Formatter pipeline empty. All data stored to RAM. */
  #define ETB_STS_FTEMPTY_Pos (3UL)
  #define ETB_STS_FTEMPTY_Msk (0x1UL << ETB_STS_FTEMPTY_Pos)


/* ETB_RRD: ETB RAM Read Data Register */
  #define ETB_RRD_ResetValue (0x00000000UL)

/* RAM_READ_DATA @Bits 0..31 : Data read from the ETB Trace RAM. */
  #define ETB_RRD_RAM_READ_DATA_Pos (0UL)
  #define ETB_RRD_RAM_READ_DATA_Msk (0xFFFFFFFFUL << ETB_RRD_RAM_READ_DATA_Pos)


/* ETB_RRP: ETB RAM Read Pointer Register */
  #define ETB_RRP_ResetValue (0x00000000UL)

/* RAM_READ_POINTER @Bits 0..9 : Sets the read pointer used to read entries from the Trace RAM over the APB interface. */
  #define ETB_RRP_RAM_READ_POINTER_Pos (0UL)
  #define ETB_RRP_RAM_READ_POINTER_Msk (0x3FFUL << ETB_RRP_RAM_READ_POINTER_Pos)


/* ETB_RWP: ETB RAM Write Pointer Register */
  #define ETB_RWP_ResetValue (0x00000000UL)

/* RAM_WRITE_POINTER @Bits 0..9 : Sets the write pointer used to write entries from the CoreSight bus into the Trace RAM. */
  #define ETB_RWP_RAM_WRITE_POINTER_Pos (0UL)
  #define ETB_RWP_RAM_WRITE_POINTER_Msk (0x3FFUL << ETB_RWP_RAM_WRITE_POINTER_Pos)


/* ETB_TRG: ETB Trigger Counter Register */
  #define ETB_TRG_ResetValue (0x00000000UL)

/* TRIGGER_COUNTER @Bits 0..9 : The counter is used as follows:Trace after - The counter is set to a large value, slightly less
                                than the number of entries in the RAM. Trace before - The counter is set to a small value. Trace
                                about - The counter is set to half the depth of the Trace RAM. This register must not be written
                                to when trace capture is enabled (FtStopped=0, TraceCaptEn=1). If a write is attempted, the
                                register is not updated. A read access is permitted with trace capture enabled. */

  #define ETB_TRG_TRIGGER_COUNTER_Pos (0UL)
  #define ETB_TRG_TRIGGER_COUNTER_Msk (0x3FFUL << ETB_TRG_TRIGGER_COUNTER_Pos)


/* ETB_CTL: ETB Control Register */
  #define ETB_CTL_ResetValue (0x00000000UL)

/* TRACECAPTEN @Bit 0 : ETB Trace Capture Enable. This is the master enable bit forcing FtStopped HIGH when TraceCaptEn is LOW.
                        When capture is disabled, any remaining data in the ATB formatter is stored to RAM. When all data is
                        stored the formatter outputs FtStopped. Capture is fully disabled, or complete, when FtStopped goes
                        HIGH. See ETB Formatter and Flush Status Register, FFSR, 0x300. */

  #define ETB_CTL_TRACECAPTEN_Pos (0UL)
  #define ETB_CTL_TRACECAPTEN_Msk (0x1UL << ETB_CTL_TRACECAPTEN_Pos)


/* ETB_RWD: ETB RAM Write Data Register */
  #define ETB_RWD_ResetValue (0x00000000UL)

/* RAM_WRITE_DATA @Bits 0..31 : Data written to the ETB Trace RAM. When trace capture is disabled, the contents of this register
                                are placed into the ETB Trace RAM when this register is written to. Writing to this register
                                increments the RAM Write Pointer Register. If trace capture is enabled, and this register is
                                accessed, then a read from this register outputs 0xFFFFFFFF. Reads of this register never
                                increment the RAM Write Pointer Register. A constant stream of 1s being output corresponds to a
                                synchronization output from the ETB. If a write access is attempted, the data is not written
                                into Trace RAM. */

  #define ETB_RWD_RAM_WRITE_DATA_Pos (0UL)
  #define ETB_RWD_RAM_WRITE_DATA_Msk (0xFFFFFFFFUL << ETB_RWD_RAM_WRITE_DATA_Pos)


/* ETB_FFSR: ETB Formatter and Flush Status Register */
  #define ETB_FFSR_ResetValue (0x00000002UL)

/* FLINPROG @Bit 0 : Flush In Progress. This is an indication of the current state of afvalids. */
  #define ETB_FFSR_FLINPROG_Pos (0UL)
  #define ETB_FFSR_FLINPROG_Msk (0x1UL << ETB_FFSR_FLINPROG_Pos)

/* FTSTOPPED @Bit 1 : Formatter stopped. The formatter has received a stop request signal and all trace data and post-amble has
                      been output. Any more trace data on the ATB interface is ignored and atreadys goes HIGH. */

  #define ETB_FFSR_FTSTOPPED_Pos (1UL)
  #define ETB_FFSR_FTSTOPPED_Msk (0x1UL << ETB_FFSR_FTSTOPPED_Pos)


/* ETB_FFCR: ETB Formatter and Flush Control Register */
  #define ETB_FFCR_ResetValue (0x00000000UL)

/* ENFTC @Bit 0 : Do not embed Triggers into the formatted stream. Trace disable cycles and triggers are indicated by TRACECTL,
                  where fitted. Can only be changed when FtStopped is HIGH. This bit is clear on reset. */

  #define ETB_FFCR_ENFTC_Pos (0UL)
  #define ETB_FFCR_ENFTC_Msk (0x1UL << ETB_FFCR_ENFTC_Pos)

/* ENFCONT @Bit 1 : Continuous mode in the ETB corresponds to normal mode with the embedding of triggers. Can only be changed
                    when FtStopped is HIGH. This bit is clear on reset. */

  #define ETB_FFCR_ENFCONT_Pos (1UL)
  #define ETB_FFCR_ENFCONT_Msk (0x1UL << ETB_FFCR_ENFCONT_Pos)

/* FONFLIN @Bit 4 : Set this bit to enable use of the flushin connection. This is clear on reset. */
  #define ETB_FFCR_FONFLIN_Pos (4UL)
  #define ETB_FFCR_FONFLIN_Msk (0x1UL << ETB_FFCR_FONFLIN_Pos)

/* FONTRIG @Bit 5 : Generate flush using Trigger event. Set this bit to cause a flush of data in the system when a Trigger Event
                    occurs. This bit is clear on reset. A Trigger Event is defined as when the Trigger counter reaches zero
                    (where fitted) or, in the case of the trigger counter being zero (or not fitted), when trigin is HIGH. */

