pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETB_FFCR_FONTRIG_Pos (5UL)
  #define ETB_FFCR_FONTRIG_Msk (0x1UL << ETB_FFCR_FONTRIG_Pos)

/* FONMAN @Bit 6 : Setting this bit causes a flush to be generated. This is cleared when this flush has been serviced. This bit
                   is clear on reset. */

  #define ETB_FFCR_FONMAN_Pos (6UL)
  #define ETB_FFCR_FONMAN_Msk (0x1UL << ETB_FFCR_FONMAN_Pos)

/* TRIGIN @Bit 8 : Indicate a trigger on trigin being asserted. */
  #define ETB_FFCR_TRIGIN_Pos (8UL)
  #define ETB_FFCR_TRIGIN_Msk (0x1UL << ETB_FFCR_TRIGIN_Pos)

/* TRIGEVT @Bit 9 : Indicate a trigger on a Trigger Event. */
  #define ETB_FFCR_TRIGEVT_Pos (9UL)
  #define ETB_FFCR_TRIGEVT_Msk (0x1UL << ETB_FFCR_TRIGEVT_Pos)

/* TRIGFL @Bit 10 : Indicates a trigger on Flush completion (afreadys being returned). */
  #define ETB_FFCR_TRIGFL_Pos (10UL)
  #define ETB_FFCR_TRIGFL_Msk (0x1UL << ETB_FFCR_TRIGFL_Pos)

/* STOPFL @Bit 12 : This forces the FIFO to drain off any part-completed packets. Setting this bit enables this function but
                    this is clear on reset (disabled). */

  #define ETB_FFCR_STOPFL_Pos (12UL)
  #define ETB_FFCR_STOPFL_Msk (0x1UL << ETB_FFCR_STOPFL_Pos)

/* STOPTRIG @Bit 13 : Stop the formatter after a Trigger Event is observed. Reset to disabled (zero). */
  #define ETB_FFCR_STOPTRIG_Pos (13UL)
  #define ETB_FFCR_STOPTRIG_Msk (0x1UL << ETB_FFCR_STOPTRIG_Pos)


/* ETB_ITMISCOP0: Integration Test Miscellaneous Output Register 0 */
  #define ETB_ITMISCOP0_ResetValue (0x00000000UL)

/* ACQCOMP @Bit 0 : Set the value of acqcomp. */
  #define ETB_ITMISCOP0_ACQCOMP_Pos (0UL)
  #define ETB_ITMISCOP0_ACQCOMP_Msk (0x1UL << ETB_ITMISCOP0_ACQCOMP_Pos)

/* FULL @Bit 1 : Set the value of full output port. */
  #define ETB_ITMISCOP0_FULL_Pos (1UL)
  #define ETB_ITMISCOP0_FULL_Msk (0x1UL << ETB_ITMISCOP0_FULL_Pos)


/* ETB_ITTRFLINACK: Integration Test Trigger In and Flush In Acknowledge Register */
  #define ETB_ITTRFLINACK_ResetValue (0x00000000UL)

/* TRIGINACK @Bit 0 : Set the value of triginack. */
  #define ETB_ITTRFLINACK_TRIGINACK_Pos (0UL)
  #define ETB_ITTRFLINACK_TRIGINACK_Msk (0x1UL << ETB_ITTRFLINACK_TRIGINACK_Pos)

/* FLUSHINACK @Bit 1 : Set the value of flushinack. */
  #define ETB_ITTRFLINACK_FLUSHINACK_Pos (1UL)
  #define ETB_ITTRFLINACK_FLUSHINACK_Msk (0x1UL << ETB_ITTRFLINACK_FLUSHINACK_Pos)


/* ETB_ITTRFLIN: Integration Test Trigger In and Flush In Register */
  #define ETB_ITTRFLIN_ResetValue (0x00000000UL)

/* TRIGIN @Bit 0 : Read the value of trigin. */
  #define ETB_ITTRFLIN_TRIGIN_Pos (0UL)
  #define ETB_ITTRFLIN_TRIGIN_Msk (0x1UL << ETB_ITTRFLIN_TRIGIN_Pos)

/* FLUSHIN @Bit 1 : Read the value of flushin. */
  #define ETB_ITTRFLIN_FLUSHIN_Pos (1UL)
  #define ETB_ITTRFLIN_FLUSHIN_Msk (0x1UL << ETB_ITTRFLIN_FLUSHIN_Pos)


/* ETB_ITATBDATA0: Integration Test ATB Data Register 0 */
  #define ETB_ITATBDATA0_ResetValue (0x00000000UL)

/* ATDATA_0 @Bit 0 : Read the value of atdatas[0]. */
  #define ETB_ITATBDATA0_ATDATA_0_Pos (0UL)
  #define ETB_ITATBDATA0_ATDATA_0_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_0_Pos)

/* ATDATA_7 @Bit 1 : Read the value of atdatas[7]. */
  #define ETB_ITATBDATA0_ATDATA_7_Pos (1UL)
  #define ETB_ITATBDATA0_ATDATA_7_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_7_Pos)

/* ATDATA_15 @Bit 2 : Read the value of atdatas[15]. */
  #define ETB_ITATBDATA0_ATDATA_15_Pos (2UL)
  #define ETB_ITATBDATA0_ATDATA_15_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_15_Pos)

/* ATDATA_23 @Bit 3 : Read the value of atdatas[23]. */
  #define ETB_ITATBDATA0_ATDATA_23_Pos (3UL)
  #define ETB_ITATBDATA0_ATDATA_23_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_23_Pos)

/* ATDATA_31 @Bit 4 : Read the value of atdatas[31]. */
  #define ETB_ITATBDATA0_ATDATA_31_Pos (4UL)
  #define ETB_ITATBDATA0_ATDATA_31_Msk (0x1UL << ETB_ITATBDATA0_ATDATA_31_Pos)


/* ETB_ITATBCTR2: Integration Test ATB Control Register 2 */
  #define ETB_ITATBCTR2_ResetValue (0x00000000UL)

/* ATREADYS @Bit 0 : Set the value of atreadys. */
  #define ETB_ITATBCTR2_ATREADYS_Pos (0UL)
  #define ETB_ITATBCTR2_ATREADYS_Msk (0x1UL << ETB_ITATBCTR2_ATREADYS_Pos)

/* AFVALIDS @Bit 1 : Set the value of afvalids. */
  #define ETB_ITATBCTR2_AFVALIDS_Pos (1UL)
  #define ETB_ITATBCTR2_AFVALIDS_Msk (0x1UL << ETB_ITATBCTR2_AFVALIDS_Pos)


/* ETB_ITATBCTR1: Integration Test ATB Control Register 1 */
  #define ETB_ITATBCTR1_ResetValue (0x00000000UL)

/* ATID @Bits 0..6 : Read the value of atids. */
  #define ETB_ITATBCTR1_ATID_Pos (0UL)
  #define ETB_ITATBCTR1_ATID_Msk (0x7FUL << ETB_ITATBCTR1_ATID_Pos)


/* ETB_ITATBCTR0: Integration Test ATB Control Register 0 */
  #define ETB_ITATBCTR0_ResetValue (0x00000000UL)

/* ATVALID @Bit 0 : Read the value of atvalids. */
  #define ETB_ITATBCTR0_ATVALID_Pos (0UL)
  #define ETB_ITATBCTR0_ATVALID_Msk (0x1UL << ETB_ITATBCTR0_ATVALID_Pos)

/* AFREADY @Bit 1 : Read the value of afreadys. */
  #define ETB_ITATBCTR0_AFREADY_Pos (1UL)
  #define ETB_ITATBCTR0_AFREADY_Msk (0x1UL << ETB_ITATBCTR0_AFREADY_Pos)

/* ATBYTES @Bits 8..9 : Read the value of atbytess. */
  #define ETB_ITATBCTR0_ATBYTES_Pos (8UL)
  #define ETB_ITATBCTR0_ATBYTES_Msk (0x3UL << ETB_ITATBCTR0_ATBYTES_Pos)


/* ETB_ITCTRL: Integration Mode Control Register */
  #define ETB_ITCTRL_ResetValue (0x00000000UL)

/* INTEGRATION_MODE @Bit 0 : Allows the component to switch from functional mode to integration mode or back. */
  #define ETB_ITCTRL_INTEGRATION_MODE_Pos (0UL)
  #define ETB_ITCTRL_INTEGRATION_MODE_Msk (0x1UL << ETB_ITCTRL_INTEGRATION_MODE_Pos)


/* ETB_CLAIMSET: Claim Tag Set Register */
  #define ETB_CLAIMSET_ResetValue (0x0000000FUL)

/* CLAIMSET @Bits 0..3 : This claim tag bit is implemented */
  #define ETB_CLAIMSET_CLAIMSET_Pos (0UL)
  #define ETB_CLAIMSET_CLAIMSET_Msk (0xFUL << ETB_CLAIMSET_CLAIMSET_Pos)


/* ETB_CLAIMCLR: Claim Tag Clear Register */
  #define ETB_CLAIMCLR_ResetValue (0x00000000UL)

/* CLAIMCLR @Bits 0..3 : The value present reflects the current setting of the Claim Tag. */
  #define ETB_CLAIMCLR_CLAIMCLR_Pos (0UL)
  #define ETB_CLAIMCLR_CLAIMCLR_Msk (0xFUL << ETB_CLAIMCLR_CLAIMCLR_Pos)


/* ETB_LAR: Lock Access Register */
  #define ETB_LAR_ResetValue (0x00000000UL)

/* ACCESS_W @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. A write of any value other than
                          0xC5ACCE55 will have the affect of removing write access. */

  #define ETB_LAR_ACCESS_W_Pos (0UL)
  #define ETB_LAR_ACCESS_W_Msk (0xFFFFFFFFUL << ETB_LAR_ACCESS_W_Pos)


/* ETB_LSR: Lock Status Register */
  #define ETB_LSR_ResetValue (0x00000003UL)

/* LOCKEXIST @Bit 0 : Indicates that a lock control mechanism exists for this device. This bit reads as 0 when read from an
                      external debugger (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers. */

  #define ETB_LSR_LOCKEXIST_Pos (0UL)
  #define ETB_LSR_LOCKEXIST_Msk (0x1UL << ETB_LSR_LOCKEXIST_Pos)

