pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LOCKGRANT @Bit 1 : Returns the current status of the Lock. This bit reads as 0 when read from an external debugger
                      (paddrdbg31 = 1) since external debugger accesses are not subject to Lock Registers. */

  #define ETB_LSR_LOCKGRANT_Pos (1UL)
  #define ETB_LSR_LOCKGRANT_Msk (0x1UL << ETB_LSR_LOCKGRANT_Pos)

/* LOCKTYPE @Bit 2 : Indicates if the Lock Access Register (0xFB0) is implemented as 8-bit or 32-bit */
  #define ETB_LSR_LOCKTYPE_Pos (2UL)
  #define ETB_LSR_LOCKTYPE_Msk (0x1UL << ETB_LSR_LOCKTYPE_Pos)


/* ETB_AUTHSTATUS: Authentication Status Register */
  #define ETB_AUTHSTATUS_ResetValue (0x00000000UL)

/* NSID @Bits 0..1 : Indicates the security level for non-secure invasive debug */
  #define ETB_AUTHSTATUS_NSID_Pos (0UL)
  #define ETB_AUTHSTATUS_NSID_Msk (0x3UL << ETB_AUTHSTATUS_NSID_Pos)

/* NSNID @Bits 2..3 : Indicates the security level for non-secure non-invasive debug */
  #define ETB_AUTHSTATUS_NSNID_Pos (2UL)
  #define ETB_AUTHSTATUS_NSNID_Msk (0x3UL << ETB_AUTHSTATUS_NSNID_Pos)

/* SID @Bits 4..5 : Indicates the security level for secure invasive debug */
  #define ETB_AUTHSTATUS_SID_Pos (4UL)
  #define ETB_AUTHSTATUS_SID_Msk (0x3UL << ETB_AUTHSTATUS_SID_Pos)

/* SNID @Bits 6..7 : Indicates the security level for secure non-invasive debug */
  #define ETB_AUTHSTATUS_SNID_Pos (6UL)
  #define ETB_AUTHSTATUS_SNID_Msk (0x3UL << ETB_AUTHSTATUS_SNID_Pos)


/* ETB_DEVID: Device Configuration Register */
  #define ETB_DEVID_ResetValue (0x00000000UL)

/* EXTMUXNUM @Bits 0..4 : When non-zero this value indicates the type/number of ATB multiplexing present on the input to the
                          ATB. */

  #define ETB_DEVID_EXTMUXNUM_Pos (0UL)
  #define ETB_DEVID_EXTMUXNUM_Msk (0x1FUL << ETB_DEVID_EXTMUXNUM_Pos)

/* RAMCLK @Bit 5 : This bit returns 0 on reads indicating that the ETB RAM operates synchronously to atclk. */
  #define ETB_DEVID_RAMCLK_Pos (5UL)
  #define ETB_DEVID_RAMCLK_Msk (0x1UL << ETB_DEVID_RAMCLK_Pos)


/* ETB_DEVTYPE: Device Type Identifier Register */
  #define ETB_DEVTYPE_ResetValue (0x00000021UL)

/* MAJOR_TYPE @Bits 0..3 : Major classification grouping for this debug/trace component */
  #define ETB_DEVTYPE_MAJOR_TYPE_Pos (0UL)
  #define ETB_DEVTYPE_MAJOR_TYPE_Msk (0xFUL << ETB_DEVTYPE_MAJOR_TYPE_Pos)

/* SUB_TYPE @Bits 4..7 : Sub-classification within the major category */
  #define ETB_DEVTYPE_SUB_TYPE_Pos (4UL)
  #define ETB_DEVTYPE_SUB_TYPE_Msk (0xFUL << ETB_DEVTYPE_SUB_TYPE_Pos)


/* ETB_PERIPHID4: Peripheral ID4 Register */
  #define ETB_PERIPHID4_ResetValue (0x00000004UL)

/* DES_2 @Bits 0..3 : JEDEC continuation code indicating the designer of the component (along with the identity code) */
  #define ETB_PERIPHID4_DES_2_Pos (0UL)
  #define ETB_PERIPHID4_DES_2_Msk (0xFUL << ETB_PERIPHID4_DES_2_Pos)

/* SIZE @Bits 4..7 : This is a 4-bit value that indicates the total contiguous size of the memory window used by this component
                     in powers of 2 from the standard 4KB. If a component only requires the standard 4KB then this should read
                     as 0x0, 4KB only, for 8KB set to 0x1, 16KB == 0x2, 32KB == 0x3, and so on. */

  #define ETB_PERIPHID4_SIZE_Pos (4UL)
  #define ETB_PERIPHID4_SIZE_Msk (0xFUL << ETB_PERIPHID4_SIZE_Pos)


/* ETB_PERIPHID0: Peripheral ID0 Register */
  #define ETB_PERIPHID0_ResetValue (0x00000007UL)

/* PART_0 @Bits 0..7 : Bits [7:0] of the component's part number. This is selected by the designer of the component. */
  #define ETB_PERIPHID0_PART_0_Pos (0UL)
  #define ETB_PERIPHID0_PART_0_Msk (0xFFUL << ETB_PERIPHID0_PART_0_Pos)


/* ETB_PERIPHID1: Peripheral ID1 Register */
  #define ETB_PERIPHID1_ResetValue (0x000000B9UL)

/* PART_1 @Bits 0..3 : Bits [11:8] of the component's part number. This is selected by the designer of the component. */
  #define ETB_PERIPHID1_PART_1_Pos (0UL)
  #define ETB_PERIPHID1_PART_1_Msk (0xFUL << ETB_PERIPHID1_PART_1_Pos)

/* DES_0 @Bits 4..7 : Bits 3:0 of the JEDEC identity code indicating the designer of the component (along with the continuation
                      code) */

  #define ETB_PERIPHID1_DES_0_Pos (4UL)
  #define ETB_PERIPHID1_DES_0_Msk (0xFUL << ETB_PERIPHID1_DES_0_Pos)


/* ETB_PERIPHID2: Peripheral ID2 Register */
  #define ETB_PERIPHID2_ResetValue (0x0000004BUL)

/* DES_1 @Bits 0..2 : Bits 6:4 of the JEDEC identity code indicating the designer of the component (along with the continuation
                      code) */

  #define ETB_PERIPHID2_DES_1_Pos (0UL)
  #define ETB_PERIPHID2_DES_1_Msk (0x7UL << ETB_PERIPHID2_DES_1_Pos)

/* JEDEC @Bit 3 : Always set. Indicates that a JEDEC assigned value is used */
  #define ETB_PERIPHID2_JEDEC_Pos (3UL)
  #define ETB_PERIPHID2_JEDEC_Msk (0x1UL << ETB_PERIPHID2_JEDEC_Pos)

/* REVISION @Bits 4..7 : The Revision field is an incremental value starting at 0x0 for the first design of this component. This
                         only increases by 1 for both major and minor revisions and is simply used as a look-up to establish the
                         exact major/minor revision. */

  #define ETB_PERIPHID2_REVISION_Pos (4UL)
  #define ETB_PERIPHID2_REVISION_Msk (0xFUL << ETB_PERIPHID2_REVISION_Pos)


/* ETB_PERIPHID3: Peripheral ID3 Register */
  #define ETB_PERIPHID3_ResetValue (0x00000000UL)

/* CMOD @Bits 0..3 : Where the component is reusable IP, this value indicates if the customer has modified the behavior of the
                     component. In most cases this field is zero. */

  #define ETB_PERIPHID3_CMOD_Pos (0UL)
  #define ETB_PERIPHID3_CMOD_Msk (0xFUL << ETB_PERIPHID3_CMOD_Pos)

/* REVAND @Bits 4..7 : This field indicates minor errata fixes specific to this design, for example metal fixes after
                       implementation. In most cases this field is zero. It is recommended that component designers ensure this
                       field can be changed by a metal fix if required, for example by driving it from registers that reset to
                       zero. */

  #define ETB_PERIPHID3_REVAND_Pos (4UL)
  #define ETB_PERIPHID3_REVAND_Msk (0xFUL << ETB_PERIPHID3_REVAND_Pos)


/* ETB_COMPID0: Component ID0 Register */
  #define ETB_COMPID0_ResetValue (0x0000000DUL)

/* PRMBL_0 @Bits 0..7 : Contains bits [7:0] of the component identification */
  #define ETB_COMPID0_PRMBL_0_Pos (0UL)
  #define ETB_COMPID0_PRMBL_0_Msk (0xFFUL << ETB_COMPID0_PRMBL_0_Pos)


/* ETB_COMPID1: Component ID1 Register */
  #define ETB_COMPID1_ResetValue (0x00000090UL)

/* PRMBL_1 @Bits 0..3 : Contains bits [11:8] of the component identification */
  #define ETB_COMPID1_PRMBL_1_Pos (0UL)
  #define ETB_COMPID1_PRMBL_1_Msk (0xFUL << ETB_COMPID1_PRMBL_1_Pos)

