pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ETM_TRCPRGCTLR: Enables the trace unit. */
  #define ETM_TRCPRGCTLR_ResetValue (0x00000000UL)

/* EN @Bit 0 : Trace unit enable bit */
  #define ETM_TRCPRGCTLR_EN_Pos (0UL)
  #define ETM_TRCPRGCTLR_EN_Msk (0x1UL << ETM_TRCPRGCTLR_EN_Pos)
  #define ETM_TRCPRGCTLR_EN_Min (0x0UL)
  #define ETM_TRCPRGCTLR_EN_Max (0x1UL)
  #define ETM_TRCPRGCTLR_EN_Disabled (0x0UL)         /*!< The trace unit is disabled. All trace resources are inactive and no
                                                          trace is generated.*/
  #define ETM_TRCPRGCTLR_EN_Enabled (0x1UL)


/* ETM_TRCPROCSELR: Controls which PE to trace. Might ignore writes when the trace unit is enabled or not idle. Before writing
                     to this register, ensure that TRCSTATR.IDLE == 1 so that the trace unit can synchronize with the chosen PE.
                     Implemented if TRCIDR3.NUMPROC is greater than zero. */

  #define ETM_TRCPROCSELR_ResetValue (0x00000000UL)

/* PROCSEL @Bits 0..4 : PE select bits that select the PE to trace. */
  #define ETM_TRCPROCSELR_PROCSEL_Pos (0UL)
  #define ETM_TRCPROCSELR_PROCSEL_Msk (0x1FUL << ETM_TRCPROCSELR_PROCSEL_Pos)


/* ETM_TRCSTATR: Idle status bit */
  #define ETM_TRCSTATR_ResetValue (0x00000000UL)

/* IDLE @Bit 0 : Trace unit enable bit */
  #define ETM_TRCSTATR_IDLE_Pos (0UL)
  #define ETM_TRCSTATR_IDLE_Msk (0x1UL << ETM_TRCSTATR_IDLE_Pos)
  #define ETM_TRCSTATR_IDLE_Min (0x0UL)
  #define ETM_TRCSTATR_IDLE_Max (0x1UL)
  #define ETM_TRCSTATR_IDLE_NotIdle (0x0UL)
  #define ETM_TRCSTATR_IDLE_Idle (0x1UL)

/* PMSTABLE @Bit 1 : Programmers' model stable bit */
  #define ETM_TRCSTATR_PMSTABLE_Pos (1UL)
  #define ETM_TRCSTATR_PMSTABLE_Msk (0x1UL << ETM_TRCSTATR_PMSTABLE_Pos)
  #define ETM_TRCSTATR_PMSTABLE_Min (0x0UL)
  #define ETM_TRCSTATR_PMSTABLE_Max (0x1UL)
  #define ETM_TRCSTATR_PMSTABLE_NotStable (0x0UL)
  #define ETM_TRCSTATR_PMSTABLE_Stable (0x1UL)


/* ETM_TRCCONFIGR: Controls the tracing options This register must always be programmed as part of trace unit initialization.
                    Might ignore writes when the trace unit is enabled or not idle. */

  #define ETM_TRCCONFIGR_ResetValue (0x00000000UL)

/* LOADASP0INST @Bit 1 : Instruction P0 load field. This field controls whether load instructions are traced as P0 instructions.
                         */

  #define ETM_TRCCONFIGR_LOADASP0INST_Pos (1UL)
  #define ETM_TRCCONFIGR_LOADASP0INST_Msk (0x1UL << ETM_TRCCONFIGR_LOADASP0INST_Pos)
  #define ETM_TRCCONFIGR_LOADASP0INST_Min (0x0UL)
  #define ETM_TRCCONFIGR_LOADASP0INST_Max (0x1UL)
  #define ETM_TRCCONFIGR_LOADASP0INST_No (0x0UL)
  #define ETM_TRCCONFIGR_LOADASP0INST_Yes (0x1UL)

/* STOREASP0INST @Bit 2 : Instruction P0 field. This field controls whether store instructions are traced as P0 instructions. */
  #define ETM_TRCCONFIGR_STOREASP0INST_Pos (2UL)
  #define ETM_TRCCONFIGR_STOREASP0INST_Msk (0x1UL << ETM_TRCCONFIGR_STOREASP0INST_Pos)
  #define ETM_TRCCONFIGR_STOREASP0INST_Min (0x0UL)
  #define ETM_TRCCONFIGR_STOREASP0INST_Max (0x1UL)
  #define ETM_TRCCONFIGR_STOREASP0INST_No (0x0UL)
  #define ETM_TRCCONFIGR_STOREASP0INST_Yes (0x1UL)

/* BB @Bit 3 : Branch broadcast mode bit. */
  #define ETM_TRCCONFIGR_BB_Pos (3UL)
  #define ETM_TRCCONFIGR_BB_Msk (0x1UL << ETM_TRCCONFIGR_BB_Pos)
  #define ETM_TRCCONFIGR_BB_Min (0x0UL)
  #define ETM_TRCCONFIGR_BB_Max (0x1UL)
  #define ETM_TRCCONFIGR_BB_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_BB_Enabled (0x1UL)

/* CCI @Bit 4 : Cycle counting instruction trace bit. */
  #define ETM_TRCCONFIGR_CCI_Pos (4UL)
  #define ETM_TRCCONFIGR_CCI_Msk (0x1UL << ETM_TRCCONFIGR_CCI_Pos)
  #define ETM_TRCCONFIGR_CCI_Min (0x0UL)
  #define ETM_TRCCONFIGR_CCI_Max (0x1UL)
  #define ETM_TRCCONFIGR_CCI_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_CCI_Enabled (0x1UL)

/* CID @Bit 6 : Context ID tracing bit. */
  #define ETM_TRCCONFIGR_CID_Pos (6UL)
  #define ETM_TRCCONFIGR_CID_Msk (0x1UL << ETM_TRCCONFIGR_CID_Pos)
  #define ETM_TRCCONFIGR_CID_Min (0x0UL)
  #define ETM_TRCCONFIGR_CID_Max (0x1UL)
  #define ETM_TRCCONFIGR_CID_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_CID_Enabled (0x1UL)

/* VMID @Bit 7 : Virtual context identifier tracing bit. */
  #define ETM_TRCCONFIGR_VMID_Pos (7UL)
  #define ETM_TRCCONFIGR_VMID_Msk (0x1UL << ETM_TRCCONFIGR_VMID_Pos)
  #define ETM_TRCCONFIGR_VMID_Min (0x0UL)
  #define ETM_TRCCONFIGR_VMID_Max (0x1UL)
  #define ETM_TRCCONFIGR_VMID_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_VMID_Enabled (0x1UL)

/* COND @Bits 8..10 : Conditional instruction tracing bit. */
  #define ETM_TRCCONFIGR_COND_Pos (8UL)
  #define ETM_TRCCONFIGR_COND_Msk (0x7UL << ETM_TRCCONFIGR_COND_Pos)
  #define ETM_TRCCONFIGR_COND_Min (0x0UL)
  #define ETM_TRCCONFIGR_COND_Max (0x7UL)
  #define ETM_TRCCONFIGR_COND_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_COND_LoadOnly (0x1UL)
  #define ETM_TRCCONFIGR_COND_StoreOnly (0x2UL)
  #define ETM_TRCCONFIGR_COND_LoadAndStore (0x3UL)
  #define ETM_TRCCONFIGR_COND_All (0x7UL)

/* TS @Bit 11 : Global timestamp tracing bit. */
  #define ETM_TRCCONFIGR_TS_Pos (11UL)
  #define ETM_TRCCONFIGR_TS_Msk (0x1UL << ETM_TRCCONFIGR_TS_Pos)
  #define ETM_TRCCONFIGR_TS_Min (0x0UL)
  #define ETM_TRCCONFIGR_TS_Max (0x1UL)
  #define ETM_TRCCONFIGR_TS_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_TS_Enabled (0x1UL)

/* RS @Bit 12 : Return stack enable bit. */
  #define ETM_TRCCONFIGR_RS_Pos (12UL)
  #define ETM_TRCCONFIGR_RS_Msk (0x1UL << ETM_TRCCONFIGR_RS_Pos)
  #define ETM_TRCCONFIGR_RS_Min (0x0UL)
  #define ETM_TRCCONFIGR_RS_Max (0x1UL)
  #define ETM_TRCCONFIGR_RS_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_RS_Enabled (0x1UL)

/* QE @Bits 13..14 : Q element enable field. */
  #define ETM_TRCCONFIGR_QE_Pos (13UL)
  #define ETM_TRCCONFIGR_QE_Msk (0x3UL << ETM_TRCCONFIGR_QE_Pos)
  #define ETM_TRCCONFIGR_QE_Min (0x0UL)
  #define ETM_TRCCONFIGR_QE_Max (0x3UL)
  #define ETM_TRCCONFIGR_QE_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_QE_OnlyWithoutInstCounts (0x1UL) /*!< Q elements with instruction counts are enabled. Q elements
                                                               without instruction counts are disabled.*/
  #define ETM_TRCCONFIGR_QE_Enabled (0x3UL)

/* VMIDOPT @Bit 15 : Control bit to select the Virtual context identifier value used by the trace unit, both for trace
                     generation and in the Virtual context identifier comparators. */

  #define ETM_TRCCONFIGR_VMIDOPT_Pos (15UL)
  #define ETM_TRCCONFIGR_VMIDOPT_Msk (0x1UL << ETM_TRCCONFIGR_VMIDOPT_Pos)
  #define ETM_TRCCONFIGR_VMIDOPT_Min (0x0UL)
  #define ETM_TRCCONFIGR_VMIDOPT_Max (0x1UL)
  #define ETM_TRCCONFIGR_VMIDOPT_VTTBR_EL2 (0x0UL)   /*!< VTTBR_EL2.VMID is used. If the trace unit supports a Virtual context
                                                          identifier larger than the VTTBR_EL2.VMID, the upper unused bits are
                                                          always zero. If the trace unit supports a Virtual context identifier
                                                          larger than 8 bits and if the VTCR_EL2.VS bit forces use of an 8-bit
                                                          Virtual context identifier, bits [15:8] of the trace unit Virtual
                                                          context identifier are always zero.*/
  #define ETM_TRCCONFIGR_VMIDOPT_CONTEXTIDR_EL2 (0x1UL)

/* DA @Bit 16 : Data address tracing bit. */
  #define ETM_TRCCONFIGR_DA_Pos (16UL)
  #define ETM_TRCCONFIGR_DA_Msk (0x1UL << ETM_TRCCONFIGR_DA_Pos)
  #define ETM_TRCCONFIGR_DA_Min (0x0UL)
  #define ETM_TRCCONFIGR_DA_Max (0x1UL)
  #define ETM_TRCCONFIGR_DA_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_DA_Enabled (0x1UL)

/* DV @Bit 17 : Data value tracing bit. */
  #define ETM_TRCCONFIGR_DV_Pos (17UL)
  #define ETM_TRCCONFIGR_DV_Msk (0x1UL << ETM_TRCCONFIGR_DV_Pos)
  #define ETM_TRCCONFIGR_DV_Min (0x0UL)
  #define ETM_TRCCONFIGR_DV_Max (0x1UL)
  #define ETM_TRCCONFIGR_DV_Disabled (0x0UL)
  #define ETM_TRCCONFIGR_DV_Enabled (0x1UL)


/* ETM_TRCEVENTCTL0R: Controls the tracing of arbitrary events. If the selected event occurs a trace element is generated in the
                       trace stream according to the settings in TRCEVENTCTL1R.DATAEN and TRCEVENTCTL1R.INSTEN. */

  #define ETM_TRCEVENTCTL0R_ResetValue (0x00000000UL)

/* EVENT @Bits 0..7 : Select which event should generate trace elements. */
  #define ETM_TRCEVENTCTL0R_EVENT_Pos (0UL)
  #define ETM_TRCEVENTCTL0R_EVENT_Msk (0xFFUL << ETM_TRCEVENTCTL0R_EVENT_Pos)
  #define ETM_TRCEVENTCTL0R_EVENT_Min (0x00UL)
  #define ETM_TRCEVENTCTL0R_EVENT_Max (0xFFUL)


/* ETM_TRCEVENTCTL1R: Controls the behavior of the events that TRCEVENTCTL0R selects. This register must always be programmed as
                       part of trace unit initialization. Might ignore writes when the trace unit is enabled or not idle. */

