pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCEVENTCTL1R_ResetValue (0x00000000UL)

/* INSTEN0 @Bit 0 : Instruction event enable field. */
  #define ETM_TRCEVENTCTL1R_INSTEN0_Pos (0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN0_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN0_Pos)
  #define ETM_TRCEVENTCTL1R_INSTEN0_Min (0x0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN0_Max (0x1UL)
  #define ETM_TRCEVENTCTL1R_INSTEN0_Disabled (0x0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN0_Enabled (0x1UL)  /*!< The trace unit generates an Event element for event 0, in the
                                                          instruction trace stream.*/

/* INSTEN1 @Bit 1 : Instruction event enable field. */
  #define ETM_TRCEVENTCTL1R_INSTEN1_Pos (1UL)
  #define ETM_TRCEVENTCTL1R_INSTEN1_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN1_Pos)
  #define ETM_TRCEVENTCTL1R_INSTEN1_Min (0x0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN1_Max (0x1UL)
  #define ETM_TRCEVENTCTL1R_INSTEN1_Disabled (0x0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN1_Enabled (0x1UL)  /*!< The trace unit generates an Event element for event 1, in the
                                                          instruction trace stream.*/

/* INSTEN2 @Bit 2 : Instruction event enable field. */
  #define ETM_TRCEVENTCTL1R_INSTEN2_Pos (2UL)
  #define ETM_TRCEVENTCTL1R_INSTEN2_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN2_Pos)
  #define ETM_TRCEVENTCTL1R_INSTEN2_Min (0x0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN2_Max (0x1UL)
  #define ETM_TRCEVENTCTL1R_INSTEN2_Disabled (0x0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN2_Enabled (0x1UL)  /*!< The trace unit generates an Event element for event 2, in the
                                                          instruction trace stream.*/

/* INSTEN3 @Bit 3 : Instruction event enable field. */
  #define ETM_TRCEVENTCTL1R_INSTEN3_Pos (3UL)
  #define ETM_TRCEVENTCTL1R_INSTEN3_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN3_Pos)
  #define ETM_TRCEVENTCTL1R_INSTEN3_Min (0x0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN3_Max (0x1UL)
  #define ETM_TRCEVENTCTL1R_INSTEN3_Disabled (0x0UL)
  #define ETM_TRCEVENTCTL1R_INSTEN3_Enabled (0x1UL)  /*!< The trace unit generates an Event element for event 3, in the
                                                          instruction trace stream.*/

/* DATAEN @Bit 4 : Data event enable bit. */
  #define ETM_TRCEVENTCTL1R_DATAEN_Pos (4UL)
  #define ETM_TRCEVENTCTL1R_DATAEN_Msk (0x1UL << ETM_TRCEVENTCTL1R_DATAEN_Pos)
  #define ETM_TRCEVENTCTL1R_DATAEN_Min (0x0UL)
  #define ETM_TRCEVENTCTL1R_DATAEN_Max (0x1UL)
  #define ETM_TRCEVENTCTL1R_DATAEN_Disabled (0x0UL)
  #define ETM_TRCEVENTCTL1R_DATAEN_Enabled (0x1UL)   /*!< The trace unit generates an Event element in the data trace stream if
                                                          event 0 occurs.*/

/* ATB @Bit 11 : AMBA Trace Bus (ATB) trigger enable bit. */
  #define ETM_TRCEVENTCTL1R_ATB_Pos (11UL)
  #define ETM_TRCEVENTCTL1R_ATB_Msk (0x1UL << ETM_TRCEVENTCTL1R_ATB_Pos)
  #define ETM_TRCEVENTCTL1R_ATB_Min (0x0UL)
  #define ETM_TRCEVENTCTL1R_ATB_Max (0x1UL)
  #define ETM_TRCEVENTCTL1R_ATB_Disabled (0x0UL)
  #define ETM_TRCEVENTCTL1R_ATB_Enabled (0x1UL)      /*!< ATB trigger is enabled. If a CoreSight ATB interface is implemented
                                                          then when event 0 occurs the trace unit generates an ATB event.*/

/* LPOVERRIDE @Bit 12 : Low-power state behavior override bit. Controls how a trace unit behaves in low-power state. */
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Pos (12UL)
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Msk (0x1UL << ETM_TRCEVENTCTL1R_LPOVERRIDE_Pos)
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Min (0x0UL)
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Max (0x1UL)
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Disabled (0x0UL) /*!< Trace unit low-power state behavior is not affected. That is, the
                                                             trace unit is enabled to enter low-power state.*/
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Enabled (0x1UL) /*!< Trace unit low-power state behavior is overridden. That is, entry to
                                                            a low-power state does not affect the trace unit resources or trace
                                                            generation.*/


/* ETM_TRCSTALLCTLR: Enables trace unit functionality that prevents trace unit buffer overflows. Might ignore writes when the
                      trace unit is enabled or not idle. Must be programmed if TRCIDR3.STALLCTL == 1. */

  #define ETM_TRCSTALLCTLR_ResetValue (0x00000000UL)

/* LEVEL @Bits 0..3 : Threshold level field. If LEVEL is nonzero then a trace unit might suppress the generation of: Global
                      timestamps in the instruction trace stream and the data trace stream. Cycle counting in the instruction
                      trace stream, although the cumulative cycle count remains correct. */

  #define ETM_TRCSTALLCTLR_LEVEL_Pos (0UL)
  #define ETM_TRCSTALLCTLR_LEVEL_Msk (0xFUL << ETM_TRCSTALLCTLR_LEVEL_Pos)
  #define ETM_TRCSTALLCTLR_LEVEL_Min (0x0UL)
  #define ETM_TRCSTALLCTLR_LEVEL_Max (0xFUL)

/* ISTALL @Bit 8 : Instruction stall bit. Controls if a trace unit can stall the PE when the instruction trace buffer space is
                   less than LEVEL. */

  #define ETM_TRCSTALLCTLR_ISTALL_Pos (8UL)
  #define ETM_TRCSTALLCTLR_ISTALL_Msk (0x1UL << ETM_TRCSTALLCTLR_ISTALL_Pos)
  #define ETM_TRCSTALLCTLR_ISTALL_Min (0x0UL)
  #define ETM_TRCSTALLCTLR_ISTALL_Max (0x1UL)
  #define ETM_TRCSTALLCTLR_ISTALL_Disabled (0x0UL)
  #define ETM_TRCSTALLCTLR_ISTALL_Enabled (0x1UL)

/* DSTALL @Bit 9 : Data stall bit. Controls if a trace unit can stall the PE when the data trace buffer space is less than
                   LEVEL. */

  #define ETM_TRCSTALLCTLR_DSTALL_Pos (9UL)
  #define ETM_TRCSTALLCTLR_DSTALL_Msk (0x1UL << ETM_TRCSTALLCTLR_DSTALL_Pos)
  #define ETM_TRCSTALLCTLR_DSTALL_Min (0x0UL)
  #define ETM_TRCSTALLCTLR_DSTALL_Max (0x1UL)
  #define ETM_TRCSTALLCTLR_DSTALL_Disabled (0x0UL)
  #define ETM_TRCSTALLCTLR_DSTALL_Enabled (0x1UL)

