pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INSTPRIORITY @Bit 10 : Prioritize instruction trace bit. Controls if a trace unit can prioritize instruction trace when the
                          instruction trace buffer space is less than LEVEL. */

  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Pos (10UL)
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Msk (0x1UL << ETM_TRCSTALLCTLR_INSTPRIORITY_Pos)
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Min (0x0UL)
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Max (0x1UL)
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Disabled (0x0UL)
  #define ETM_TRCSTALLCTLR_INSTPRIORITY_Enabled (0x1UL) /*!< The trace unit can prioritize instruction trace. A trace unit might
                                                             prioritize instruction trace by preventing output of data trace, or
                                                             other means which ensure that the instruction trace has a higher
                                                             priority than the data trace.*/

/* DATADISCARDLOAD @Bit 11 : Data discard field. Controls if a trace unit can discard data trace elements on a load when the
                             data trace buffer space is less than LEVEL. */

  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Pos (11UL)
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Msk (0x1UL << ETM_TRCSTALLCTLR_DATADISCARDLOAD_Pos) /*!< Bit mask of DATADISCARDLOAD
                                                                            field.*/
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Min (0x0UL)
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Max (0x1UL)
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Disabled (0x0UL)
  #define ETM_TRCSTALLCTLR_DATADISCARDLOAD_Enabled (0x1UL) /*!< The trace unit can discard P1 and P2 elements associated with
                                                                data loads.*/

/* DATADISCARDSTORE @Bit 12 : Data discard field. Controls if a trace unit can discard data trace elements on a store when the
                              data trace buffer space is less than LEVEL. */

  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Pos (12UL)
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Msk (0x1UL << ETM_TRCSTALLCTLR_DATADISCARDSTORE_Pos) /*!< Bit mask of
                                                                            DATADISCARDSTORE field.*/
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Min (0x0UL)
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Max (0x1UL)
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Disabled (0x0UL)
  #define ETM_TRCSTALLCTLR_DATADISCARDSTORE_Enabled (0x1UL) /*!< The trace unit can discard P1 and P2 elements associated with
                                                                 data stores.*/

/* NOOVERFLOW @Bit 13 : Trace overflow prevention bit. */
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Pos (13UL)
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Msk (0x1UL << ETM_TRCSTALLCTLR_NOOVERFLOW_Pos)
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Min (0x0UL)
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Max (0x1UL)
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Disabled (0x0UL)
  #define ETM_TRCSTALLCTLR_NOOVERFLOW_Enabled (0x1UL) /*!< Trace overflow prevention is enabled. This might cause a significant
                                                           performance impact.*/


/* ETM_TRCTSCTLR: Controls the insertion of global timestamps in the trace streams. When the selected event is triggered, the
                   trace unit inserts a global timestamp into the trace streams. Might ignore writes when the trace unit is
                   enabled or not idle. Must be programmed if TRCCONFIGR.TS == 1. */

  #define ETM_TRCTSCTLR_ResetValue (0x00000000UL)

/* EVENT @Bits 0..7 : Select which event should generate time stamps. */
  #define ETM_TRCTSCTLR_EVENT_Pos (0UL)
  #define ETM_TRCTSCTLR_EVENT_Msk (0xFFUL << ETM_TRCTSCTLR_EVENT_Pos)
  #define ETM_TRCTSCTLR_EVENT_Min (0x00UL)
  #define ETM_TRCTSCTLR_EVENT_Max (0xFFUL)


/* ETM_TRCSYNCPR: Controls how often trace synchronization requests occur. Might ignore writes when the trace unit is enabled or
                   not idle. If writes are permitted then the register must be programmed. */

  #define ETM_TRCSYNCPR_ResetValue (0x00000000UL)

/* PERIOD @Bits 0..4 : Controls how many bytes of trace, the sum of instruction and data, that a trace unit can generate before
                       a trace synchronization request occurs. The number of bytes is always a power of two, calculated by
                       2^PERIOD */

  #define ETM_TRCSYNCPR_PERIOD_Pos (0UL)
  #define ETM_TRCSYNCPR_PERIOD_Msk (0x1FUL << ETM_TRCSYNCPR_PERIOD_Pos)
  #define ETM_TRCSYNCPR_PERIOD_Min (0x00UL)
  #define ETM_TRCSYNCPR_PERIOD_Max (0x1FUL)
  #define ETM_TRCSYNCPR_PERIOD_Disabled (0x00UL)     /*!< Trace synchronization requests are disabled. This setting does not
                                                          disable other types of trace synchronization request.*/


/* ETM_TRCCCCTLR: Sets the threshold value for cycle counting. Might ignore writes when the trace unit is enabled or not idle.
                   Must be programmed if TRCCONFIGR.CCI==1. */

  #define ETM_TRCCCCTLR_ResetValue (0x00000000UL)

/* THRESHOLD @Bits 0..11 : Sets the threshold value for instruction trace cycle counting. */
  #define ETM_TRCCCCTLR_THRESHOLD_Pos (0UL)
  #define ETM_TRCCCCTLR_THRESHOLD_Msk (0xFFFUL << ETM_TRCCCCTLR_THRESHOLD_Pos)
  #define ETM_TRCCCCTLR_THRESHOLD_Min (0x000UL)
  #define ETM_TRCCCCTLR_THRESHOLD_Max (0x7FFUL)


/* ETM_TRCBBCTLR: Controls which regions in the memory map are enabled to use branch broadcasting. Might ignore writes when the
                   trace unit is enabled or not idle. Must be programmed if TRCCONFIGR.BB == 1. */

  #define ETM_TRCBBCTLR_ResetValue (0x00000000UL)

/* RANGE0 @Bit 0 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[0] controls the selection of address range
                   comparator pair 0. */

  #define ETM_TRCBBCTLR_RANGE0_Pos (0UL)
  #define ETM_TRCBBCTLR_RANGE0_Msk (0x1UL << ETM_TRCBBCTLR_RANGE0_Pos)
  #define ETM_TRCBBCTLR_RANGE0_Min (0x0UL)
  #define ETM_TRCBBCTLR_RANGE0_Max (0x1UL)
  #define ETM_TRCBBCTLR_RANGE0_Disabled (0x0UL)      /*!< The address range that address range comparator pair 0 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE0_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE1 @Bit 1 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[1] controls the selection of address range
                   comparator pair 1. */

