pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCBBCTLR_RANGE1_Pos (1UL)
  #define ETM_TRCBBCTLR_RANGE1_Msk (0x1UL << ETM_TRCBBCTLR_RANGE1_Pos)
  #define ETM_TRCBBCTLR_RANGE1_Min (0x0UL)
  #define ETM_TRCBBCTLR_RANGE1_Max (0x1UL)
  #define ETM_TRCBBCTLR_RANGE1_Disabled (0x0UL)      /*!< The address range that address range comparator pair 1 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE1_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE2 @Bit 2 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[2] controls the selection of address range
                   comparator pair 2. */

  #define ETM_TRCBBCTLR_RANGE2_Pos (2UL)
  #define ETM_TRCBBCTLR_RANGE2_Msk (0x1UL << ETM_TRCBBCTLR_RANGE2_Pos)
  #define ETM_TRCBBCTLR_RANGE2_Min (0x0UL)
  #define ETM_TRCBBCTLR_RANGE2_Max (0x1UL)
  #define ETM_TRCBBCTLR_RANGE2_Disabled (0x0UL)      /*!< The address range that address range comparator pair 2 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE2_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE3 @Bit 3 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[3] controls the selection of address range
                   comparator pair 3. */

  #define ETM_TRCBBCTLR_RANGE3_Pos (3UL)
  #define ETM_TRCBBCTLR_RANGE3_Msk (0x1UL << ETM_TRCBBCTLR_RANGE3_Pos)
  #define ETM_TRCBBCTLR_RANGE3_Min (0x0UL)
  #define ETM_TRCBBCTLR_RANGE3_Max (0x1UL)
  #define ETM_TRCBBCTLR_RANGE3_Disabled (0x0UL)      /*!< The address range that address range comparator pair 3 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE3_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE4 @Bit 4 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[4] controls the selection of address range
                   comparator pair 4. */

  #define ETM_TRCBBCTLR_RANGE4_Pos (4UL)
  #define ETM_TRCBBCTLR_RANGE4_Msk (0x1UL << ETM_TRCBBCTLR_RANGE4_Pos)
  #define ETM_TRCBBCTLR_RANGE4_Min (0x0UL)
  #define ETM_TRCBBCTLR_RANGE4_Max (0x1UL)
  #define ETM_TRCBBCTLR_RANGE4_Disabled (0x0UL)      /*!< The address range that address range comparator pair 4 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE4_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE5 @Bit 5 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[5] controls the selection of address range
                   comparator pair 5. */

  #define ETM_TRCBBCTLR_RANGE5_Pos (5UL)
  #define ETM_TRCBBCTLR_RANGE5_Msk (0x1UL << ETM_TRCBBCTLR_RANGE5_Pos)
  #define ETM_TRCBBCTLR_RANGE5_Min (0x0UL)
  #define ETM_TRCBBCTLR_RANGE5_Max (0x1UL)
  #define ETM_TRCBBCTLR_RANGE5_Disabled (0x0UL)      /*!< The address range that address range comparator pair 5 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE5_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE6 @Bit 6 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[6] controls the selection of address range
                   comparator pair 6. */

  #define ETM_TRCBBCTLR_RANGE6_Pos (6UL)
  #define ETM_TRCBBCTLR_RANGE6_Msk (0x1UL << ETM_TRCBBCTLR_RANGE6_Pos)
  #define ETM_TRCBBCTLR_RANGE6_Min (0x0UL)
  #define ETM_TRCBBCTLR_RANGE6_Max (0x1UL)
  #define ETM_TRCBBCTLR_RANGE6_Disabled (0x0UL)      /*!< The address range that address range comparator pair 6 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE6_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE7 @Bit 7 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[7] controls the selection of address range
                   comparator pair 7. */

  #define ETM_TRCBBCTLR_RANGE7_Pos (7UL)
  #define ETM_TRCBBCTLR_RANGE7_Msk (0x1UL << ETM_TRCBBCTLR_RANGE7_Pos)
  #define ETM_TRCBBCTLR_RANGE7_Min (0x0UL)
  #define ETM_TRCBBCTLR_RANGE7_Max (0x1UL)
  #define ETM_TRCBBCTLR_RANGE7_Disabled (0x0UL)      /*!< The address range that address range comparator pair 7 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE7_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/


/* ETM_TRCTRACEIDR: Sets the trace ID for instruction trace. If data trace is enabled then it also sets the trace ID for data
                     trace, to (trace ID for instruction trace) + 1. This register must always be programmed as part of trace
                     unit initialization. Might ignore writes when the trace unit is enabled or not idle. */

  #define ETM_TRCTRACEIDR_ResetValue (0x00000000UL)

