pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRACEID @Bits 0..6 : Trace ID field. Sets the trace ID value for instruction trace. Bit[0] must be zero if data trace is
                        enabled. If data trace is enabled then a trace unit sets the trace ID for data trace, to TRACEID+1. */

  #define ETM_TRCTRACEIDR_TRACEID_Pos (0UL)
  #define ETM_TRCTRACEIDR_TRACEID_Msk (0x7FUL << ETM_TRCTRACEIDR_TRACEID_Pos)


/* ETM_TRCQCTLR: Controls when Q elements are enabled. Might ignore writes when the trace unit is enabled or not idle. This
                  register must be programmed if it is implemented and TRCCONFIGR.QE is set to any value other than 0b00. */

  #define ETM_TRCQCTLR_ResetValue (0x00000000UL)

/* RANGE0 @Bit 0 : Specifies the address range comparators to be used for controlling Q elements. */
  #define ETM_TRCQCTLR_RANGE0_Pos (0UL)
  #define ETM_TRCQCTLR_RANGE0_Msk (0x1UL << ETM_TRCQCTLR_RANGE0_Pos)
  #define ETM_TRCQCTLR_RANGE0_Min (0x0UL)
  #define ETM_TRCQCTLR_RANGE0_Max (0x1UL)
  #define ETM_TRCQCTLR_RANGE0_Disabled (0x0UL)
  #define ETM_TRCQCTLR_RANGE0_Enabled (0x1UL)

/* RANGE1 @Bit 1 : Specifies the address range comparators to be used for controlling Q elements. */
  #define ETM_TRCQCTLR_RANGE1_Pos (1UL)
  #define ETM_TRCQCTLR_RANGE1_Msk (0x1UL << ETM_TRCQCTLR_RANGE1_Pos)
  #define ETM_TRCQCTLR_RANGE1_Min (0x0UL)
  #define ETM_TRCQCTLR_RANGE1_Max (0x1UL)
  #define ETM_TRCQCTLR_RANGE1_Disabled (0x0UL)
  #define ETM_TRCQCTLR_RANGE1_Enabled (0x1UL)

/* RANGE2 @Bit 2 : Specifies the address range comparators to be used for controlling Q elements. */
  #define ETM_TRCQCTLR_RANGE2_Pos (2UL)
  #define ETM_TRCQCTLR_RANGE2_Msk (0x1UL << ETM_TRCQCTLR_RANGE2_Pos)
  #define ETM_TRCQCTLR_RANGE2_Min (0x0UL)
  #define ETM_TRCQCTLR_RANGE2_Max (0x1UL)
  #define ETM_TRCQCTLR_RANGE2_Disabled (0x0UL)
  #define ETM_TRCQCTLR_RANGE2_Enabled (0x1UL)

/* RANGE3 @Bit 3 : Specifies the address range comparators to be used for controlling Q elements. */
  #define ETM_TRCQCTLR_RANGE3_Pos (3UL)
  #define ETM_TRCQCTLR_RANGE3_Msk (0x1UL << ETM_TRCQCTLR_RANGE3_Pos)
  #define ETM_TRCQCTLR_RANGE3_Min (0x0UL)
  #define ETM_TRCQCTLR_RANGE3_Max (0x1UL)
  #define ETM_TRCQCTLR_RANGE3_Disabled (0x0UL)
  #define ETM_TRCQCTLR_RANGE3_Enabled (0x1UL)

/* RANGE4 @Bit 4 : Specifies the address range comparators to be used for controlling Q elements. */
  #define ETM_TRCQCTLR_RANGE4_Pos (4UL)
  #define ETM_TRCQCTLR_RANGE4_Msk (0x1UL << ETM_TRCQCTLR_RANGE4_Pos)
  #define ETM_TRCQCTLR_RANGE4_Min (0x0UL)
  #define ETM_TRCQCTLR_RANGE4_Max (0x1UL)
  #define ETM_TRCQCTLR_RANGE4_Disabled (0x0UL)
  #define ETM_TRCQCTLR_RANGE4_Enabled (0x1UL)

/* RANGE5 @Bit 5 : Specifies the address range comparators to be used for controlling Q elements. */
  #define ETM_TRCQCTLR_RANGE5_Pos (5UL)
  #define ETM_TRCQCTLR_RANGE5_Msk (0x1UL << ETM_TRCQCTLR_RANGE5_Pos)
  #define ETM_TRCQCTLR_RANGE5_Min (0x0UL)
  #define ETM_TRCQCTLR_RANGE5_Max (0x1UL)
  #define ETM_TRCQCTLR_RANGE5_Disabled (0x0UL)
  #define ETM_TRCQCTLR_RANGE5_Enabled (0x1UL)

/* RANGE6 @Bit 6 : Specifies the address range comparators to be used for controlling Q elements. */
  #define ETM_TRCQCTLR_RANGE6_Pos (6UL)
  #define ETM_TRCQCTLR_RANGE6_Msk (0x1UL << ETM_TRCQCTLR_RANGE6_Pos)
  #define ETM_TRCQCTLR_RANGE6_Min (0x0UL)
  #define ETM_TRCQCTLR_RANGE6_Max (0x1UL)
  #define ETM_TRCQCTLR_RANGE6_Disabled (0x0UL)
  #define ETM_TRCQCTLR_RANGE6_Enabled (0x1UL)

/* RANGE7 @Bit 7 : Specifies the address range comparators to be used for controlling Q elements. */
  #define ETM_TRCQCTLR_RANGE7_Pos (7UL)
  #define ETM_TRCQCTLR_RANGE7_Msk (0x1UL << ETM_TRCQCTLR_RANGE7_Pos)
  #define ETM_TRCQCTLR_RANGE7_Min (0x0UL)
  #define ETM_TRCQCTLR_RANGE7_Max (0x1UL)
  #define ETM_TRCQCTLR_RANGE7_Disabled (0x0UL)
  #define ETM_TRCQCTLR_RANGE7_Enabled (0x1UL)

/* MODE @Bit 8 : Selects whether the address range comparators selected by the RANGE field indicate address ranges where the
                 trace unit is permitted to generate Q elements or address ranges where the trace unit is not permitted to
                 generate Q elements: */

  #define ETM_TRCQCTLR_MODE_Pos (8UL)
  #define ETM_TRCQCTLR_MODE_Msk (0x1UL << ETM_TRCQCTLR_MODE_Pos)
  #define ETM_TRCQCTLR_MODE_Min (0x0UL)
  #define ETM_TRCQCTLR_MODE_Max (0x1UL)
  #define ETM_TRCQCTLR_MODE_Exclude (0x0UL)          /*!< Exclude mode. The address range comparators selected by the RANGE
                                                          field indicate address ranges where the trace unit cannot generate Q
                                                          elements. If no ranges are selected, Q elements are permitted across
                                                          the entire memory map.*/
  #define ETM_TRCQCTLR_MODE_Include (0x1UL)          /*!< Include mode. The address range comparators selected by the RANGE
                                                          field indicate address ranges where the trace unit can generate Q
                                                          elements. If all the implemented bits in RANGE are set to 0 then Q
                                                          elements are disabled.*/


/* ETM_TRCVICTLR: Controls instruction trace filtering. Might ignore writes when the trace unit is enabled or not idle. Only
                   returns stable data when TRCSTATR.PMSTABLE == 1. Must be programmed, particularly to set the value of the
                   SSSTATUS bit, which sets the state of the start/stop logic. */

  #define ETM_TRCVICTLR_ResetValue (0x00000000UL)

/* EVENT_SEL @Bits 0..4 : Select which resource number should be filtered. */
  #define ETM_TRCVICTLR_EVENT_SEL_Pos (0UL)
  #define ETM_TRCVICTLR_EVENT_SEL_Msk (0x1FUL << ETM_TRCVICTLR_EVENT_SEL_Pos)
  #define ETM_TRCVICTLR_EVENT_SEL_Min (0x0UL)
  #define ETM_TRCVICTLR_EVENT_SEL_Max (0x1UL)
  #define ETM_TRCVICTLR_EVENT_SEL_Disabled (0x00UL)
  #define ETM_TRCVICTLR_EVENT_SEL_Enabled (0x01UL)

/* SSSTATUS @Bit 9 : When TRCIDR4.NUMACPAIRS > 0 or TRCIDR4.NUMPC > 0, this bit returns the status of the start/stop logic. */
  #define ETM_TRCVICTLR_SSSTATUS_Pos (9UL)
  #define ETM_TRCVICTLR_SSSTATUS_Msk (0x1UL << ETM_TRCVICTLR_SSSTATUS_Pos)
  #define ETM_TRCVICTLR_SSSTATUS_Min (0x0UL)
  #define ETM_TRCVICTLR_SSSTATUS_Max (0x1UL)
  #define ETM_TRCVICTLR_SSSTATUS_Stopped (0x0UL)
  #define ETM_TRCVICTLR_SSSTATUS_Started (0x1UL)

/* TRCRESET @Bit 10 : Controls whether a trace unit must trace a Reset exception. */
  #define ETM_TRCVICTLR_TRCRESET_Pos (10UL)
  #define ETM_TRCVICTLR_TRCRESET_Msk (0x1UL << ETM_TRCVICTLR_TRCRESET_Pos)
  #define ETM_TRCVICTLR_TRCRESET_Min (0x0UL)
  #define ETM_TRCVICTLR_TRCRESET_Max (0x1UL)
  #define ETM_TRCVICTLR_TRCRESET_Disabled (0x0UL)    /*!< The trace unit does not trace a Reset exception unless it traces the
                                                          exception or instruction immediately prior to the Reset exception.*/
  #define ETM_TRCVICTLR_TRCRESET_Enabled (0x1UL)

/* TRCERR @Bit 11 : When TRCIDR3.TRCERR==1, this bit controls whether a trace unit must trace a System error exception. */
  #define ETM_TRCVICTLR_TRCERR_Pos (11UL)
  #define ETM_TRCVICTLR_TRCERR_Msk (0x1UL << ETM_TRCVICTLR_TRCERR_Pos)
  #define ETM_TRCVICTLR_TRCERR_Min (0x0UL)
  #define ETM_TRCVICTLR_TRCERR_Max (0x1UL)
  #define ETM_TRCVICTLR_TRCERR_Disabled (0x0UL)      /*!< The trace unit does not trace a System error exception unless it
                                                          traces the exception or instruction immediately prior to the System
                                                          error exception.*/
  #define ETM_TRCVICTLR_TRCERR_Enabled (0x1UL)       /*!< The trace unit always traces a System error exception, regardless of
                                                          the value of ViewInst.*/

/* EXLEVEL0_S @Bit 16 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding
                        Exception level 0. */

  #define ETM_TRCVICTLR_EXLEVEL0_S_Pos (16UL)
  #define ETM_TRCVICTLR_EXLEVEL0_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL0_S_Pos)
  #define ETM_TRCVICTLR_EXLEVEL0_S_Min (0x0UL)
  #define ETM_TRCVICTLR_EXLEVEL0_S_Max (0x1UL)
  #define ETM_TRCVICTLR_EXLEVEL0_S_Disabled (0x1UL)  /*!< The trace unit does not generate instruction trace, in Secure state,
                                                          for Exception level 0.*/
  #define ETM_TRCVICTLR_EXLEVEL0_S_Enabled (0x0UL)   /*!< The trace unit generates instruction trace, in Secure state, for
                                                          Exception level 0.*/

/* EXLEVEL1_S @Bit 17 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding
                        Exception level 1. */

  #define ETM_TRCVICTLR_EXLEVEL1_S_Pos (17UL)
  #define ETM_TRCVICTLR_EXLEVEL1_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL1_S_Pos)
  #define ETM_TRCVICTLR_EXLEVEL1_S_Min (0x0UL)
  #define ETM_TRCVICTLR_EXLEVEL1_S_Max (0x1UL)
  #define ETM_TRCVICTLR_EXLEVEL1_S_Disabled (0x1UL)  /*!< The trace unit does not generate instruction trace, in Secure state,
                                                          for Exception level 1.*/
  #define ETM_TRCVICTLR_EXLEVEL1_S_Enabled (0x0UL)   /*!< The trace unit generates instruction trace, in Secure state, for
                                                          Exception level 1.*/

