pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EXLEVEL2_S @Bit 18 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding
                        Exception level 2. */

  #define ETM_TRCVICTLR_EXLEVEL2_S_Pos (18UL)
  #define ETM_TRCVICTLR_EXLEVEL2_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL2_S_Pos)
  #define ETM_TRCVICTLR_EXLEVEL2_S_Min (0x0UL)
  #define ETM_TRCVICTLR_EXLEVEL2_S_Max (0x1UL)
  #define ETM_TRCVICTLR_EXLEVEL2_S_Disabled (0x1UL)  /*!< The trace unit does not generate instruction trace, in Secure state,
                                                          for Exception level 2.*/
  #define ETM_TRCVICTLR_EXLEVEL2_S_Enabled (0x0UL)   /*!< The trace unit generates instruction trace, in Secure state, for
                                                          Exception level 2.*/

/* EXLEVEL3_S @Bit 19 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding
                        Exception level 3. */

  #define ETM_TRCVICTLR_EXLEVEL3_S_Pos (19UL)
  #define ETM_TRCVICTLR_EXLEVEL3_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL3_S_Pos)
  #define ETM_TRCVICTLR_EXLEVEL3_S_Min (0x0UL)
  #define ETM_TRCVICTLR_EXLEVEL3_S_Max (0x1UL)
  #define ETM_TRCVICTLR_EXLEVEL3_S_Disabled (0x1UL)  /*!< The trace unit does not generate instruction trace, in Secure state,
                                                          for Exception level 3.*/
  #define ETM_TRCVICTLR_EXLEVEL3_S_Enabled (0x0UL)   /*!< The trace unit generates instruction trace, in Secure state, for
                                                          Exception level 3.*/

/* EXLEVEL0_NS @Bit 20 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding
                         Exception level 0. */

  #define ETM_TRCVICTLR_EXLEVEL0_NS_Pos (20UL)
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL0_NS_Pos)
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Min (0x0UL)
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Max (0x1UL)
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure
                                                          state, for Exception level 0.*/
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Enabled (0x0UL)  /*!< The trace unit generates instruction trace, in Non-secure state, for
                                                          Exception level 0.*/

/* EXLEVEL1_NS @Bit 21 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding
                         Exception level 1. */

  #define ETM_TRCVICTLR_EXLEVEL1_NS_Pos (21UL)
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL1_NS_Pos)
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Min (0x0UL)
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Max (0x1UL)
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure
                                                          state, for Exception level 1.*/
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Enabled (0x0UL)  /*!< The trace unit generates instruction trace, in Non-secure state, for
                                                          Exception level 1.*/

/* EXLEVEL2_NS @Bit 22 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding
                         Exception level 2. */

  #define ETM_TRCVICTLR_EXLEVEL2_NS_Pos (22UL)
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL2_NS_Pos)
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Min (0x0UL)
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Max (0x1UL)
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure
                                                          state, for Exception level 2.*/
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Enabled (0x0UL)  /*!< The trace unit generates instruction trace, in Non-secure state, for
                                                          Exception level 2.*/

/* EXLEVEL3_NS @Bit 23 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding
                         Exception level 3. */

  #define ETM_TRCVICTLR_EXLEVEL3_NS_Pos (23UL)
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL3_NS_Pos)
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Min (0x0UL)
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Max (0x1UL)
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure
                                                          state, for Exception level 3.*/
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Enabled (0x0UL)  /*!< The trace unit generates instruction trace, in Non-secure state, for
                                                          Exception level 3.*/


/* ETM_TRCVIIECTLR: ViewInst exclude control. Might ignore writes when the trace unit is enabled or not idle. This register must
                     be programmed when one or more address comparators are implemented. */

  #define ETM_TRCVIIECTLR_ResetValue (0x00000000UL)

/* INCLUDE0 @Bit 0 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE0_Pos (0UL)
  #define ETM_TRCVIIECTLR_INCLUDE0_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE0_Pos)
  #define ETM_TRCVIIECTLR_INCLUDE0_Min (0x0UL)
  #define ETM_TRCVIIECTLR_INCLUDE0_Max (0x1UL)
  #define ETM_TRCVIIECTLR_INCLUDE0_Disabled (0x0UL)  /*!< The address range that address range comparator pair 0 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE0_Enabled (0x1UL)   /*!< The address range that address range comparator pair 0 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE1 @Bit 1 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE1_Pos (1UL)
  #define ETM_TRCVIIECTLR_INCLUDE1_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE1_Pos)
  #define ETM_TRCVIIECTLR_INCLUDE1_Min (0x0UL)
  #define ETM_TRCVIIECTLR_INCLUDE1_Max (0x1UL)
  #define ETM_TRCVIIECTLR_INCLUDE1_Disabled (0x0UL)  /*!< The address range that address range comparator pair 1 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE1_Enabled (0x1UL)   /*!< The address range that address range comparator pair 1 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE2 @Bit 2 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE2_Pos (2UL)
  #define ETM_TRCVIIECTLR_INCLUDE2_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE2_Pos)
  #define ETM_TRCVIIECTLR_INCLUDE2_Min (0x0UL)
  #define ETM_TRCVIIECTLR_INCLUDE2_Max (0x1UL)
  #define ETM_TRCVIIECTLR_INCLUDE2_Disabled (0x0UL)  /*!< The address range that address range comparator pair 2 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE2_Enabled (0x1UL)   /*!< The address range that address range comparator pair 2 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE3 @Bit 3 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

