pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCVIIECTLR_INCLUDE3_Pos (3UL)
  #define ETM_TRCVIIECTLR_INCLUDE3_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE3_Pos)
  #define ETM_TRCVIIECTLR_INCLUDE3_Min (0x0UL)
  #define ETM_TRCVIIECTLR_INCLUDE3_Max (0x1UL)
  #define ETM_TRCVIIECTLR_INCLUDE3_Disabled (0x0UL)  /*!< The address range that address range comparator pair 3 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE3_Enabled (0x1UL)   /*!< The address range that address range comparator pair 3 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE4 @Bit 4 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE4_Pos (4UL)
  #define ETM_TRCVIIECTLR_INCLUDE4_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE4_Pos)
  #define ETM_TRCVIIECTLR_INCLUDE4_Min (0x0UL)
  #define ETM_TRCVIIECTLR_INCLUDE4_Max (0x1UL)
  #define ETM_TRCVIIECTLR_INCLUDE4_Disabled (0x0UL)  /*!< The address range that address range comparator pair 4 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE4_Enabled (0x1UL)   /*!< The address range that address range comparator pair 4 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE5 @Bit 5 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE5_Pos (5UL)
  #define ETM_TRCVIIECTLR_INCLUDE5_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE5_Pos)
  #define ETM_TRCVIIECTLR_INCLUDE5_Min (0x0UL)
  #define ETM_TRCVIIECTLR_INCLUDE5_Max (0x1UL)
  #define ETM_TRCVIIECTLR_INCLUDE5_Disabled (0x0UL)  /*!< The address range that address range comparator pair 5 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE5_Enabled (0x1UL)   /*!< The address range that address range comparator pair 5 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE6 @Bit 6 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE6_Pos (6UL)
  #define ETM_TRCVIIECTLR_INCLUDE6_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE6_Pos)
  #define ETM_TRCVIIECTLR_INCLUDE6_Min (0x0UL)
  #define ETM_TRCVIIECTLR_INCLUDE6_Max (0x1UL)
  #define ETM_TRCVIIECTLR_INCLUDE6_Disabled (0x0UL)  /*!< The address range that address range comparator pair 6 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE6_Enabled (0x1UL)   /*!< The address range that address range comparator pair 6 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE7 @Bit 7 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE7_Pos (7UL)
  #define ETM_TRCVIIECTLR_INCLUDE7_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE7_Pos)
  #define ETM_TRCVIIECTLR_INCLUDE7_Min (0x0UL)
  #define ETM_TRCVIIECTLR_INCLUDE7_Max (0x1UL)
  #define ETM_TRCVIIECTLR_INCLUDE7_Disabled (0x0UL)  /*!< The address range that address range comparator pair 7 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE7_Enabled (0x1UL)   /*!< The address range that address range comparator pair 7 defines, is
                                                          selected for ViewInst include control.*/

/* EXCLUDE0 @Bit 16 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE0_Pos (16UL)
  #define ETM_TRCVIIECTLR_EXCLUDE0_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE0_Pos)
  #define ETM_TRCVIIECTLR_EXCLUDE0_Min (0x0UL)
  #define ETM_TRCVIIECTLR_EXCLUDE0_Max (0x1UL)
  #define ETM_TRCVIIECTLR_EXCLUDE0_Disabled (0x0UL)  /*!< The address range that address range comparator pair 0 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE0_Enabled (0x1UL)   /*!< The address range that address range comparator pair 0 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE1 @Bit 17 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE1_Pos (17UL)
  #define ETM_TRCVIIECTLR_EXCLUDE1_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE1_Pos)
  #define ETM_TRCVIIECTLR_EXCLUDE1_Min (0x0UL)
  #define ETM_TRCVIIECTLR_EXCLUDE1_Max (0x1UL)
  #define ETM_TRCVIIECTLR_EXCLUDE1_Disabled (0x0UL)  /*!< The address range that address range comparator pair 1 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE1_Enabled (0x1UL)   /*!< The address range that address range comparator pair 1 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE2 @Bit 18 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE2_Pos (18UL)
  #define ETM_TRCVIIECTLR_EXCLUDE2_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE2_Pos)
  #define ETM_TRCVIIECTLR_EXCLUDE2_Min (0x0UL)
  #define ETM_TRCVIIECTLR_EXCLUDE2_Max (0x1UL)
  #define ETM_TRCVIIECTLR_EXCLUDE2_Disabled (0x0UL)  /*!< The address range that address range comparator pair 2 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE2_Enabled (0x1UL)   /*!< The address range that address range comparator pair 2 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE3 @Bit 19 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE3_Pos (19UL)
  #define ETM_TRCVIIECTLR_EXCLUDE3_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE3_Pos)
  #define ETM_TRCVIIECTLR_EXCLUDE3_Min (0x0UL)
  #define ETM_TRCVIIECTLR_EXCLUDE3_Max (0x1UL)
  #define ETM_TRCVIIECTLR_EXCLUDE3_Disabled (0x0UL)  /*!< The address range that address range comparator pair 3 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE3_Enabled (0x1UL)   /*!< The address range that address range comparator pair 3 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE4 @Bit 20 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

