pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCVIIECTLR_EXCLUDE4_Pos (20UL)
  #define ETM_TRCVIIECTLR_EXCLUDE4_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE4_Pos)
  #define ETM_TRCVIIECTLR_EXCLUDE4_Min (0x0UL)
  #define ETM_TRCVIIECTLR_EXCLUDE4_Max (0x1UL)
  #define ETM_TRCVIIECTLR_EXCLUDE4_Disabled (0x0UL)  /*!< The address range that address range comparator pair 4 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE4_Enabled (0x1UL)   /*!< The address range that address range comparator pair 4 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE5 @Bit 21 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE5_Pos (21UL)
  #define ETM_TRCVIIECTLR_EXCLUDE5_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE5_Pos)
  #define ETM_TRCVIIECTLR_EXCLUDE5_Min (0x0UL)
  #define ETM_TRCVIIECTLR_EXCLUDE5_Max (0x1UL)
  #define ETM_TRCVIIECTLR_EXCLUDE5_Disabled (0x0UL)  /*!< The address range that address range comparator pair 5 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE5_Enabled (0x1UL)   /*!< The address range that address range comparator pair 5 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE6 @Bit 22 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE6_Pos (22UL)
  #define ETM_TRCVIIECTLR_EXCLUDE6_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE6_Pos)
  #define ETM_TRCVIIECTLR_EXCLUDE6_Min (0x0UL)
  #define ETM_TRCVIIECTLR_EXCLUDE6_Max (0x1UL)
  #define ETM_TRCVIIECTLR_EXCLUDE6_Disabled (0x0UL)  /*!< The address range that address range comparator pair 6 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE6_Enabled (0x1UL)   /*!< The address range that address range comparator pair 6 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE7 @Bit 23 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE7_Pos (23UL)
  #define ETM_TRCVIIECTLR_EXCLUDE7_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE7_Pos)
  #define ETM_TRCVIIECTLR_EXCLUDE7_Min (0x0UL)
  #define ETM_TRCVIIECTLR_EXCLUDE7_Max (0x1UL)
  #define ETM_TRCVIIECTLR_EXCLUDE7_Disabled (0x0UL)  /*!< The address range that address range comparator pair 7 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE7_Enabled (0x1UL)   /*!< The address range that address range comparator pair 7 defines, is
                                                          selected for ViewInst exclude control.*/


/* ETM_TRCVISSCTLR: Use this to set, or read, the single address comparators that control the ViewInst start/stop logic. The
                     start/stop logic is active for an instruction which causes a start and remains active up to and including
                     an instruction which causes a stop, and then the start/stop logic becomes inactive. Might ignore writes
                     when the trace unit is enabled or not idle. If implemented then this register must be programmed. */

  #define ETM_TRCVISSCTLR_ResetValue (0x00000000UL)

/* START0 @Bit 0 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START0_Pos (0UL)
  #define ETM_TRCVISSCTLR_START0_Msk (0x1UL << ETM_TRCVISSCTLR_START0_Pos)
  #define ETM_TRCVISSCTLR_START0_Min (0x0UL)
  #define ETM_TRCVISSCTLR_START0_Max (0x1UL)
  #define ETM_TRCVISSCTLR_START0_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_START0_Enabled (0x1UL)

/* START1 @Bit 1 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START1_Pos (1UL)
  #define ETM_TRCVISSCTLR_START1_Msk (0x1UL << ETM_TRCVISSCTLR_START1_Pos)
  #define ETM_TRCVISSCTLR_START1_Min (0x0UL)
  #define ETM_TRCVISSCTLR_START1_Max (0x1UL)
  #define ETM_TRCVISSCTLR_START1_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_START1_Enabled (0x1UL)

/* START2 @Bit 2 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START2_Pos (2UL)
  #define ETM_TRCVISSCTLR_START2_Msk (0x1UL << ETM_TRCVISSCTLR_START2_Pos)
  #define ETM_TRCVISSCTLR_START2_Min (0x0UL)
  #define ETM_TRCVISSCTLR_START2_Max (0x1UL)
  #define ETM_TRCVISSCTLR_START2_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_START2_Enabled (0x1UL)

/* START3 @Bit 3 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START3_Pos (3UL)
  #define ETM_TRCVISSCTLR_START3_Msk (0x1UL << ETM_TRCVISSCTLR_START3_Pos)
  #define ETM_TRCVISSCTLR_START3_Min (0x0UL)
  #define ETM_TRCVISSCTLR_START3_Max (0x1UL)
  #define ETM_TRCVISSCTLR_START3_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_START3_Enabled (0x1UL)

/* START4 @Bit 4 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START4_Pos (4UL)
  #define ETM_TRCVISSCTLR_START4_Msk (0x1UL << ETM_TRCVISSCTLR_START4_Pos)
  #define ETM_TRCVISSCTLR_START4_Min (0x0UL)
  #define ETM_TRCVISSCTLR_START4_Max (0x1UL)
  #define ETM_TRCVISSCTLR_START4_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_START4_Enabled (0x1UL)

/* START5 @Bit 5 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

