pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCVISSCTLR_START5_Pos (5UL)
  #define ETM_TRCVISSCTLR_START5_Msk (0x1UL << ETM_TRCVISSCTLR_START5_Pos)
  #define ETM_TRCVISSCTLR_START5_Min (0x0UL)
  #define ETM_TRCVISSCTLR_START5_Max (0x1UL)
  #define ETM_TRCVISSCTLR_START5_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_START5_Enabled (0x1UL)

/* START6 @Bit 6 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START6_Pos (6UL)
  #define ETM_TRCVISSCTLR_START6_Msk (0x1UL << ETM_TRCVISSCTLR_START6_Pos)
  #define ETM_TRCVISSCTLR_START6_Min (0x0UL)
  #define ETM_TRCVISSCTLR_START6_Max (0x1UL)
  #define ETM_TRCVISSCTLR_START6_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_START6_Enabled (0x1UL)

/* START7 @Bit 7 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START7_Pos (7UL)
  #define ETM_TRCVISSCTLR_START7_Msk (0x1UL << ETM_TRCVISSCTLR_START7_Pos)
  #define ETM_TRCVISSCTLR_START7_Min (0x0UL)
  #define ETM_TRCVISSCTLR_START7_Max (0x1UL)
  #define ETM_TRCVISSCTLR_START7_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_START7_Enabled (0x1UL)

/* STOP0 @Bit 16 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP0_Pos (16UL)
  #define ETM_TRCVISSCTLR_STOP0_Msk (0x1UL << ETM_TRCVISSCTLR_STOP0_Pos)
  #define ETM_TRCVISSCTLR_STOP0_Min (0x0UL)
  #define ETM_TRCVISSCTLR_STOP0_Max (0x1UL)
  #define ETM_TRCVISSCTLR_STOP0_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_STOP0_Enabled (0x1UL)

/* STOP1 @Bit 17 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP1_Pos (17UL)
  #define ETM_TRCVISSCTLR_STOP1_Msk (0x1UL << ETM_TRCVISSCTLR_STOP1_Pos)
  #define ETM_TRCVISSCTLR_STOP1_Min (0x0UL)
  #define ETM_TRCVISSCTLR_STOP1_Max (0x1UL)
  #define ETM_TRCVISSCTLR_STOP1_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_STOP1_Enabled (0x1UL)

/* STOP2 @Bit 18 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP2_Pos (18UL)
  #define ETM_TRCVISSCTLR_STOP2_Msk (0x1UL << ETM_TRCVISSCTLR_STOP2_Pos)
  #define ETM_TRCVISSCTLR_STOP2_Min (0x0UL)
  #define ETM_TRCVISSCTLR_STOP2_Max (0x1UL)
  #define ETM_TRCVISSCTLR_STOP2_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_STOP2_Enabled (0x1UL)

/* STOP3 @Bit 19 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP3_Pos (19UL)
  #define ETM_TRCVISSCTLR_STOP3_Msk (0x1UL << ETM_TRCVISSCTLR_STOP3_Pos)
  #define ETM_TRCVISSCTLR_STOP3_Min (0x0UL)
  #define ETM_TRCVISSCTLR_STOP3_Max (0x1UL)
  #define ETM_TRCVISSCTLR_STOP3_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_STOP3_Enabled (0x1UL)

/* STOP4 @Bit 20 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP4_Pos (20UL)
  #define ETM_TRCVISSCTLR_STOP4_Msk (0x1UL << ETM_TRCVISSCTLR_STOP4_Pos)
  #define ETM_TRCVISSCTLR_STOP4_Min (0x0UL)
  #define ETM_TRCVISSCTLR_STOP4_Max (0x1UL)
  #define ETM_TRCVISSCTLR_STOP4_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_STOP4_Enabled (0x1UL)

/* STOP5 @Bit 21 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP5_Pos (21UL)
  #define ETM_TRCVISSCTLR_STOP5_Msk (0x1UL << ETM_TRCVISSCTLR_STOP5_Pos)
  #define ETM_TRCVISSCTLR_STOP5_Min (0x0UL)
  #define ETM_TRCVISSCTLR_STOP5_Max (0x1UL)
  #define ETM_TRCVISSCTLR_STOP5_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_STOP5_Enabled (0x1UL)

/* STOP6 @Bit 22 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP6_Pos (22UL)
  #define ETM_TRCVISSCTLR_STOP6_Msk (0x1UL << ETM_TRCVISSCTLR_STOP6_Pos)
  #define ETM_TRCVISSCTLR_STOP6_Min (0x0UL)
  #define ETM_TRCVISSCTLR_STOP6_Max (0x1UL)
  #define ETM_TRCVISSCTLR_STOP6_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_STOP6_Enabled (0x1UL)

/* STOP7 @Bit 23 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   stopping trace */

  #define ETM_TRCVISSCTLR_STOP7_Pos (23UL)
  #define ETM_TRCVISSCTLR_STOP7_Msk (0x1UL << ETM_TRCVISSCTLR_STOP7_Pos)
  #define ETM_TRCVISSCTLR_STOP7_Min (0x0UL)
  #define ETM_TRCVISSCTLR_STOP7_Max (0x1UL)
  #define ETM_TRCVISSCTLR_STOP7_Disabled (0x0UL)
  #define ETM_TRCVISSCTLR_STOP7_Enabled (0x1UL)


/* ETM_TRCVIPCSSCTLR: Use this to set, or read, which PE comparator inputs can control the ViewInst start/stop logic. Might
                       ignore writes when the trace unit is enabled or not idle. If implemented then this register must be
                       programmed. */

  #define ETM_TRCVIPCSSCTLR_ResetValue (0x00000000UL)

/* START0 @Bit 0 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START0_Pos (0UL)
  #define ETM_TRCVIPCSSCTLR_START0_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START0_Pos)
  #define ETM_TRCVIPCSSCTLR_START0_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_START0_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_START0_Disabled (0x0UL)  /*!< The single PE comparator input 0, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START0_Enabled (0x1UL)

/* START1 @Bit 1 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

