pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCVIPCSSCTLR_START1_Pos (1UL)
  #define ETM_TRCVIPCSSCTLR_START1_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START1_Pos)
  #define ETM_TRCVIPCSSCTLR_START1_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_START1_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_START1_Disabled (0x0UL)  /*!< The single PE comparator input 1, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START1_Enabled (0x1UL)

/* START2 @Bit 2 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START2_Pos (2UL)
  #define ETM_TRCVIPCSSCTLR_START2_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START2_Pos)
  #define ETM_TRCVIPCSSCTLR_START2_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_START2_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_START2_Disabled (0x0UL)  /*!< The single PE comparator input 2, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START2_Enabled (0x1UL)

/* START3 @Bit 3 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START3_Pos (3UL)
  #define ETM_TRCVIPCSSCTLR_START3_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START3_Pos)
  #define ETM_TRCVIPCSSCTLR_START3_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_START3_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_START3_Disabled (0x0UL)  /*!< The single PE comparator input 3, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START3_Enabled (0x1UL)

/* START4 @Bit 4 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START4_Pos (4UL)
  #define ETM_TRCVIPCSSCTLR_START4_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START4_Pos)
  #define ETM_TRCVIPCSSCTLR_START4_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_START4_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_START4_Disabled (0x0UL)  /*!< The single PE comparator input 4, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START4_Enabled (0x1UL)

/* START5 @Bit 5 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START5_Pos (5UL)
  #define ETM_TRCVIPCSSCTLR_START5_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START5_Pos)
  #define ETM_TRCVIPCSSCTLR_START5_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_START5_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_START5_Disabled (0x0UL)  /*!< The single PE comparator input 5, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START5_Enabled (0x1UL)

/* START6 @Bit 6 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START6_Pos (6UL)
  #define ETM_TRCVIPCSSCTLR_START6_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START6_Pos)
  #define ETM_TRCVIPCSSCTLR_START6_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_START6_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_START6_Disabled (0x0UL)  /*!< The single PE comparator input 6, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START6_Enabled (0x1UL)

/* START7 @Bit 7 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START7_Pos (7UL)
  #define ETM_TRCVIPCSSCTLR_START7_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START7_Pos)
  #define ETM_TRCVIPCSSCTLR_START7_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_START7_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_START7_Disabled (0x0UL)  /*!< The single PE comparator input 7, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START7_Enabled (0x1UL)

/* STOP0 @Bit 16 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP0_Pos (16UL)
  #define ETM_TRCVIPCSSCTLR_STOP0_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP0_Pos)
  #define ETM_TRCVIPCSSCTLR_STOP0_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP0_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_STOP0_Disabled (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP0_Enabled (0x1UL)

/* STOP1 @Bit 17 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP1_Pos (17UL)
  #define ETM_TRCVIPCSSCTLR_STOP1_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP1_Pos)
  #define ETM_TRCVIPCSSCTLR_STOP1_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP1_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_STOP1_Disabled (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP1_Enabled (0x1UL)

/* STOP2 @Bit 18 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP2_Pos (18UL)
  #define ETM_TRCVIPCSSCTLR_STOP2_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP2_Pos)
  #define ETM_TRCVIPCSSCTLR_STOP2_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP2_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_STOP2_Disabled (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP2_Enabled (0x1UL)

/* STOP3 @Bit 19 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP3_Pos (19UL)
  #define ETM_TRCVIPCSSCTLR_STOP3_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP3_Pos)
  #define ETM_TRCVIPCSSCTLR_STOP3_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP3_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_STOP3_Disabled (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP3_Enabled (0x1UL)

