pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* STOP4 @Bit 20 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP4_Pos (20UL)
  #define ETM_TRCVIPCSSCTLR_STOP4_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP4_Pos)
  #define ETM_TRCVIPCSSCTLR_STOP4_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP4_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_STOP4_Disabled (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP4_Enabled (0x1UL)

/* STOP5 @Bit 21 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP5_Pos (21UL)
  #define ETM_TRCVIPCSSCTLR_STOP5_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP5_Pos)
  #define ETM_TRCVIPCSSCTLR_STOP5_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP5_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_STOP5_Disabled (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP5_Enabled (0x1UL)

/* STOP6 @Bit 22 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP6_Pos (22UL)
  #define ETM_TRCVIPCSSCTLR_STOP6_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP6_Pos)
  #define ETM_TRCVIPCSSCTLR_STOP6_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP6_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_STOP6_Disabled (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP6_Enabled (0x1UL)

/* STOP7 @Bit 23 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP7_Pos (23UL)
  #define ETM_TRCVIPCSSCTLR_STOP7_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP7_Pos)
  #define ETM_TRCVIPCSSCTLR_STOP7_Min (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP7_Max (0x1UL)
  #define ETM_TRCVIPCSSCTLR_STOP7_Disabled (0x0UL)
  #define ETM_TRCVIPCSSCTLR_STOP7_Enabled (0x1UL)


/* ETM_TRCVDCTLR: Controls data trace filtering. Might ignore writes when the trace unit is enabled or not idle. This register
                   must be programmed when data tracing is enabled, that is, when either TRCCONFIGR.DA == 1 or TRCCONFIGR.DV ==
                   1. */

  #define ETM_TRCVDCTLR_ResetValue (0x00000000UL)

/* EVENT0 @Bit 0 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT0_Pos (0UL)
  #define ETM_TRCVDCTLR_EVENT0_Msk (0x1UL << ETM_TRCVDCTLR_EVENT0_Pos)
  #define ETM_TRCVDCTLR_EVENT0_Min (0x0UL)
  #define ETM_TRCVDCTLR_EVENT0_Max (0x1UL)
  #define ETM_TRCVDCTLR_EVENT0_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_EVENT0_Enabled (0x1UL)

/* EVENT1 @Bit 1 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT1_Pos (1UL)
  #define ETM_TRCVDCTLR_EVENT1_Msk (0x1UL << ETM_TRCVDCTLR_EVENT1_Pos)
  #define ETM_TRCVDCTLR_EVENT1_Min (0x0UL)
  #define ETM_TRCVDCTLR_EVENT1_Max (0x1UL)
  #define ETM_TRCVDCTLR_EVENT1_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_EVENT1_Enabled (0x1UL)

/* EVENT2 @Bit 2 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT2_Pos (2UL)
  #define ETM_TRCVDCTLR_EVENT2_Msk (0x1UL << ETM_TRCVDCTLR_EVENT2_Pos)
  #define ETM_TRCVDCTLR_EVENT2_Min (0x0UL)
  #define ETM_TRCVDCTLR_EVENT2_Max (0x1UL)
  #define ETM_TRCVDCTLR_EVENT2_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_EVENT2_Enabled (0x1UL)

/* EVENT3 @Bit 3 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT3_Pos (3UL)
  #define ETM_TRCVDCTLR_EVENT3_Msk (0x1UL << ETM_TRCVDCTLR_EVENT3_Pos)
  #define ETM_TRCVDCTLR_EVENT3_Min (0x0UL)
  #define ETM_TRCVDCTLR_EVENT3_Max (0x1UL)
  #define ETM_TRCVDCTLR_EVENT3_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_EVENT3_Enabled (0x1UL)

/* EVENT4 @Bit 4 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT4_Pos (4UL)
  #define ETM_TRCVDCTLR_EVENT4_Msk (0x1UL << ETM_TRCVDCTLR_EVENT4_Pos)
  #define ETM_TRCVDCTLR_EVENT4_Min (0x0UL)
  #define ETM_TRCVDCTLR_EVENT4_Max (0x1UL)
  #define ETM_TRCVDCTLR_EVENT4_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_EVENT4_Enabled (0x1UL)

/* EVENT5 @Bit 5 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT5_Pos (5UL)
  #define ETM_TRCVDCTLR_EVENT5_Msk (0x1UL << ETM_TRCVDCTLR_EVENT5_Pos)
  #define ETM_TRCVDCTLR_EVENT5_Min (0x0UL)
  #define ETM_TRCVDCTLR_EVENT5_Max (0x1UL)
  #define ETM_TRCVDCTLR_EVENT5_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_EVENT5_Enabled (0x1UL)

/* EVENT6 @Bit 6 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT6_Pos (6UL)
  #define ETM_TRCVDCTLR_EVENT6_Msk (0x1UL << ETM_TRCVDCTLR_EVENT6_Pos)
  #define ETM_TRCVDCTLR_EVENT6_Min (0x0UL)
  #define ETM_TRCVDCTLR_EVENT6_Max (0x1UL)
  #define ETM_TRCVDCTLR_EVENT6_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_EVENT6_Enabled (0x1UL)

/* EVENT7 @Bit 7 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT7_Pos (7UL)
  #define ETM_TRCVDCTLR_EVENT7_Msk (0x1UL << ETM_TRCVDCTLR_EVENT7_Pos)
  #define ETM_TRCVDCTLR_EVENT7_Min (0x0UL)
  #define ETM_TRCVDCTLR_EVENT7_Max (0x1UL)
  #define ETM_TRCVDCTLR_EVENT7_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_EVENT7_Enabled (0x1UL)

/* SPREL @Bits 8..9 : Controls whether a trace unit traces data for transfers that are relative to the Stack Pointer (SP). */
  #define ETM_TRCVDCTLR_SPREL_Pos (8UL)
  #define ETM_TRCVDCTLR_SPREL_Msk (0x3UL << ETM_TRCVDCTLR_SPREL_Pos)
  #define ETM_TRCVDCTLR_SPREL_Min (0x0UL)
  #define ETM_TRCVDCTLR_SPREL_Max (0x3UL)
  #define ETM_TRCVDCTLR_SPREL_Enabled (0x0UL)
  #define ETM_TRCVDCTLR_SPREL_DataOnly (0x2UL)       /*!< The trace unit does not trace the address portion of SP-relative
                                                          transfers. If data value tracing is enabled then the trace unit
                                                          generates a P1 data address element.*/
  #define ETM_TRCVDCTLR_SPREL_Disabled (0x3UL)       /*!< The trace unit does not trace the address or value portions of
                                                          SP-relative transfers.*/

/* PCREL @Bit 10 : Controls whether a trace unit traces data for transfers that are relative to the Program Counter (PC). */
  #define ETM_TRCVDCTLR_PCREL_Pos (10UL)
  #define ETM_TRCVDCTLR_PCREL_Msk (0x1UL << ETM_TRCVDCTLR_PCREL_Pos)
  #define ETM_TRCVDCTLR_PCREL_Min (0x0UL)
  #define ETM_TRCVDCTLR_PCREL_Max (0x1UL)
  #define ETM_TRCVDCTLR_PCREL_Enabled (0x0UL)
  #define ETM_TRCVDCTLR_PCREL_Disabled (0x1UL)       /*!< The trace unit does not trace the address or value portions of
                                                          PC-relative transfers.*/

/* TBI @Bit 11 : Controls which information a trace unit populates in bits[63:56] of the data address. */
  #define ETM_TRCVDCTLR_TBI_Pos (11UL)
  #define ETM_TRCVDCTLR_TBI_Msk (0x1UL << ETM_TRCVDCTLR_TBI_Pos)
  #define ETM_TRCVDCTLR_TBI_Min (0x0UL)
  #define ETM_TRCVDCTLR_TBI_Max (0x1UL)
  #define ETM_TRCVDCTLR_TBI_SignExtend (0x0UL)       /*!< The trace unit assigns bits[63:56] to have the same value as bit[55]
                                                          of the data address, that is, it sign-extends the value.*/
  #define ETM_TRCVDCTLR_TBI_Copy (0x1UL)             /*!< The trace unit assigns bits[63:56] to have the same value as
                                                          bits[63:56] of the data address.*/

/* TRCEXDATA @Bit 12 : Controls the tracing of data transfers for exceptions and exception returns on Armv6-M, Armv7-M, and
                       Armv8-M PEs. */

  #define ETM_TRCVDCTLR_TRCEXDATA_Pos (12UL)
  #define ETM_TRCVDCTLR_TRCEXDATA_Msk (0x1UL << ETM_TRCVDCTLR_TRCEXDATA_Pos)
  #define ETM_TRCVDCTLR_TRCEXDATA_Min (0x0UL)
  #define ETM_TRCVDCTLR_TRCEXDATA_Max (0x1UL)
  #define ETM_TRCVDCTLR_TRCEXDATA_Disabled (0x0UL)
  #define ETM_TRCVDCTLR_TRCEXDATA_Enabled (0x1UL)    /*!< Exception and exception return data transfers are traced if the other
                                                          aspects of ViewData indicate that the data transfers must be traced.*/


