pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EXCLUDE7 @Bit 23 : Selects which single address comparators are in use with ViewData exclude control. */
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Pos (23UL)
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Msk (0x1UL << ETM_TRCVDSACCTLR_EXCLUDE7_Pos)
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Min (0x0UL)
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Max (0x1UL)
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Disabled (0x0UL) /*!< The single address comparator 7, is not selected for ViewData exclude
                                                          control.*/
  #define ETM_TRCVDSACCTLR_EXCLUDE7_Enabled (0x1UL)  /*!< The single address comparator 7, s selected for ViewData exclude
                                                          control.*/


/* ETM_TRCVDARCCTLR: ViewData include / exclude control. Might ignore writes when the trace unit is enabled or not idle. This
                      register must be programmed when one or more address comparators are implemented. */

  #define ETM_TRCVDARCCTLR_ResetValue (0x00000000UL)

/* INCLUDE0 @Bit 0 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */

  #define ETM_TRCVDARCCTLR_INCLUDE0_Pos (0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE0_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE0_Pos)
  #define ETM_TRCVDARCCTLR_INCLUDE0_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE0_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE0_Disabled (0x0UL) /*!< The address range that address range comparator 0 defines, is not
                                                          selected for ViewData include control.*/
  #define ETM_TRCVDARCCTLR_INCLUDE0_Enabled (0x1UL)  /*!< The address range that address range comparator 0 defines, is selected
                                                          for ViewData include control.*/

/* INCLUDE1 @Bit 1 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */

  #define ETM_TRCVDARCCTLR_INCLUDE1_Pos (1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE1_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE1_Pos)
  #define ETM_TRCVDARCCTLR_INCLUDE1_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE1_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE1_Disabled (0x0UL) /*!< The address range that address range comparator 1 defines, is not
                                                          selected for ViewData include control.*/
  #define ETM_TRCVDARCCTLR_INCLUDE1_Enabled (0x1UL)  /*!< The address range that address range comparator 1 defines, is selected
                                                          for ViewData include control.*/

/* INCLUDE2 @Bit 2 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */

  #define ETM_TRCVDARCCTLR_INCLUDE2_Pos (2UL)
  #define ETM_TRCVDARCCTLR_INCLUDE2_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE2_Pos)
  #define ETM_TRCVDARCCTLR_INCLUDE2_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE2_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE2_Disabled (0x0UL) /*!< The address range that address range comparator 2 defines, is not
                                                          selected for ViewData include control.*/
  #define ETM_TRCVDARCCTLR_INCLUDE2_Enabled (0x1UL)  /*!< The address range that address range comparator 2 defines, is selected
                                                          for ViewData include control.*/

/* INCLUDE3 @Bit 3 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */

  #define ETM_TRCVDARCCTLR_INCLUDE3_Pos (3UL)
  #define ETM_TRCVDARCCTLR_INCLUDE3_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE3_Pos)
  #define ETM_TRCVDARCCTLR_INCLUDE3_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE3_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE3_Disabled (0x0UL) /*!< The address range that address range comparator 3 defines, is not
                                                          selected for ViewData include control.*/
  #define ETM_TRCVDARCCTLR_INCLUDE3_Enabled (0x1UL)  /*!< The address range that address range comparator 3 defines, is selected
                                                          for ViewData include control.*/

/* INCLUDE4 @Bit 4 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */

  #define ETM_TRCVDARCCTLR_INCLUDE4_Pos (4UL)
  #define ETM_TRCVDARCCTLR_INCLUDE4_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE4_Pos)
  #define ETM_TRCVDARCCTLR_INCLUDE4_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE4_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE4_Disabled (0x0UL) /*!< The address range that address range comparator 4 defines, is not
                                                          selected for ViewData include control.*/
  #define ETM_TRCVDARCCTLR_INCLUDE4_Enabled (0x1UL)  /*!< The address range that address range comparator 4 defines, is selected
                                                          for ViewData include control.*/

/* INCLUDE5 @Bit 5 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */

  #define ETM_TRCVDARCCTLR_INCLUDE5_Pos (5UL)
  #define ETM_TRCVDARCCTLR_INCLUDE5_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE5_Pos)
  #define ETM_TRCVDARCCTLR_INCLUDE5_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE5_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE5_Disabled (0x0UL) /*!< The address range that address range comparator 5 defines, is not
                                                          selected for ViewData include control.*/
  #define ETM_TRCVDARCCTLR_INCLUDE5_Enabled (0x1UL)  /*!< The address range that address range comparator 5 defines, is selected
                                                          for ViewData include control.*/

/* INCLUDE6 @Bit 6 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */

  #define ETM_TRCVDARCCTLR_INCLUDE6_Pos (6UL)
  #define ETM_TRCVDARCCTLR_INCLUDE6_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE6_Pos)
  #define ETM_TRCVDARCCTLR_INCLUDE6_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE6_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE6_Disabled (0x0UL) /*!< The address range that address range comparator 6 defines, is not
                                                          selected for ViewData include control.*/
  #define ETM_TRCVDARCCTLR_INCLUDE6_Enabled (0x1UL)  /*!< The address range that address range comparator 6 defines, is selected
                                                          for ViewData include control.*/

/* INCLUDE7 @Bit 7 : Include range field. Selects which address range comparator pairs are in use with ViewData include control.
                     */

  #define ETM_TRCVDARCCTLR_INCLUDE7_Pos (7UL)
  #define ETM_TRCVDARCCTLR_INCLUDE7_Msk (0x1UL << ETM_TRCVDARCCTLR_INCLUDE7_Pos)
  #define ETM_TRCVDARCCTLR_INCLUDE7_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_INCLUDE7_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_INCLUDE7_Disabled (0x0UL) /*!< The address range that address range comparator 7 defines, is not
                                                          selected for ViewData include control.*/
  #define ETM_TRCVDARCCTLR_INCLUDE7_Enabled (0x1UL)  /*!< The address range that address range comparator 7 defines, is selected
                                                          for ViewData include control.*/

/* EXCLUDE0 @Bit 16 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */

  #define ETM_TRCVDARCCTLR_EXCLUDE0_Pos (16UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE0_Pos)
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Disabled (0x0UL) /*!< The address range that address range comparator 0 defines, is not
                                                          selected for ViewData exclude control.*/
  #define ETM_TRCVDARCCTLR_EXCLUDE0_Enabled (0x1UL)  /*!< The address range that address range comparator 0 defines, s selected
                                                          for ViewData exclude control.*/

