pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EXCLUDE1 @Bit 17 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */

  #define ETM_TRCVDARCCTLR_EXCLUDE1_Pos (17UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE1_Pos)
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Disabled (0x0UL) /*!< The address range that address range comparator 1 defines, is not
                                                          selected for ViewData exclude control.*/
  #define ETM_TRCVDARCCTLR_EXCLUDE1_Enabled (0x1UL)  /*!< The address range that address range comparator 1 defines, s selected
                                                          for ViewData exclude control.*/

/* EXCLUDE2 @Bit 18 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */

  #define ETM_TRCVDARCCTLR_EXCLUDE2_Pos (18UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE2_Pos)
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Disabled (0x0UL) /*!< The address range that address range comparator 2 defines, is not
                                                          selected for ViewData exclude control.*/
  #define ETM_TRCVDARCCTLR_EXCLUDE2_Enabled (0x1UL)  /*!< The address range that address range comparator 2 defines, s selected
                                                          for ViewData exclude control.*/

/* EXCLUDE3 @Bit 19 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */

  #define ETM_TRCVDARCCTLR_EXCLUDE3_Pos (19UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE3_Pos)
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Disabled (0x0UL) /*!< The address range that address range comparator 3 defines, is not
                                                          selected for ViewData exclude control.*/
  #define ETM_TRCVDARCCTLR_EXCLUDE3_Enabled (0x1UL)  /*!< The address range that address range comparator 3 defines, s selected
                                                          for ViewData exclude control.*/

/* EXCLUDE4 @Bit 20 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */

  #define ETM_TRCVDARCCTLR_EXCLUDE4_Pos (20UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE4_Pos)
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Disabled (0x0UL) /*!< The address range that address range comparator 4 defines, is not
                                                          selected for ViewData exclude control.*/
  #define ETM_TRCVDARCCTLR_EXCLUDE4_Enabled (0x1UL)  /*!< The address range that address range comparator 4 defines, s selected
                                                          for ViewData exclude control.*/

/* EXCLUDE5 @Bit 21 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */

  #define ETM_TRCVDARCCTLR_EXCLUDE5_Pos (21UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE5_Pos)
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Disabled (0x0UL) /*!< The address range that address range comparator 5 defines, is not
                                                          selected for ViewData exclude control.*/
  #define ETM_TRCVDARCCTLR_EXCLUDE5_Enabled (0x1UL)  /*!< The address range that address range comparator 5 defines, s selected
                                                          for ViewData exclude control.*/

/* EXCLUDE6 @Bit 22 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */

  #define ETM_TRCVDARCCTLR_EXCLUDE6_Pos (22UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE6_Pos)
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Disabled (0x0UL) /*!< The address range that address range comparator 6 defines, is not
                                                          selected for ViewData exclude control.*/
  #define ETM_TRCVDARCCTLR_EXCLUDE6_Enabled (0x1UL)  /*!< The address range that address range comparator 6 defines, s selected
                                                          for ViewData exclude control.*/

/* EXCLUDE7 @Bit 23 : Exclude range field. Selects which address range comparator pairs are in use with ViewData exclude
                      control. */

  #define ETM_TRCVDARCCTLR_EXCLUDE7_Pos (23UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Msk (0x1UL << ETM_TRCVDARCCTLR_EXCLUDE7_Pos)
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Min (0x0UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Max (0x1UL)
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Disabled (0x0UL) /*!< The address range that address range comparator 7 defines, is not
                                                          selected for ViewData exclude control.*/
  #define ETM_TRCVDARCCTLR_EXCLUDE7_Enabled (0x1UL)  /*!< The address range that address range comparator 7 defines, s selected
                                                          for ViewData exclude control.*/


/* ETM_TRCSEQEVR: Moves the sequencer state according to programmed events. Might ignore writes when the trace unit is enabled
                   or not idle. When the sequencer is used, all sequencer state transitions must be programmed with a valid
                   event. */

