pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCSEQEVR_MaxCount (3UL)
  #define ETM_TRCSEQEVR_MaxIndex (2UL)
  #define ETM_TRCSEQEVR_MinIndex (0UL)
  #define ETM_TRCSEQEVR_ResetValue (0x00000000UL)

/* F0 @Bit 0 : Forward field. */
  #define ETM_TRCSEQEVR_F0_Pos (0UL)
  #define ETM_TRCSEQEVR_F0_Msk (0x1UL << ETM_TRCSEQEVR_F0_Pos)
  #define ETM_TRCSEQEVR_F0_Min (0x0UL)
  #define ETM_TRCSEQEVR_F0_Max (0x1UL)
  #define ETM_TRCSEQEVR_F0_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_F0_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/

/* F1 @Bit 1 : Forward field. */
  #define ETM_TRCSEQEVR_F1_Pos (1UL)
  #define ETM_TRCSEQEVR_F1_Msk (0x1UL << ETM_TRCSEQEVR_F1_Pos)
  #define ETM_TRCSEQEVR_F1_Min (0x0UL)
  #define ETM_TRCSEQEVR_F1_Max (0x1UL)
  #define ETM_TRCSEQEVR_F1_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_F1_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/

/* F2 @Bit 2 : Forward field. */
  #define ETM_TRCSEQEVR_F2_Pos (2UL)
  #define ETM_TRCSEQEVR_F2_Msk (0x1UL << ETM_TRCSEQEVR_F2_Pos)
  #define ETM_TRCSEQEVR_F2_Min (0x0UL)
  #define ETM_TRCSEQEVR_F2_Max (0x1UL)
  #define ETM_TRCSEQEVR_F2_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_F2_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/

/* F3 @Bit 3 : Forward field. */
  #define ETM_TRCSEQEVR_F3_Pos (3UL)
  #define ETM_TRCSEQEVR_F3_Msk (0x1UL << ETM_TRCSEQEVR_F3_Pos)
  #define ETM_TRCSEQEVR_F3_Min (0x0UL)
  #define ETM_TRCSEQEVR_F3_Max (0x1UL)
  #define ETM_TRCSEQEVR_F3_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_F3_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/

/* F4 @Bit 4 : Forward field. */
  #define ETM_TRCSEQEVR_F4_Pos (4UL)
  #define ETM_TRCSEQEVR_F4_Msk (0x1UL << ETM_TRCSEQEVR_F4_Pos)
  #define ETM_TRCSEQEVR_F4_Min (0x0UL)
  #define ETM_TRCSEQEVR_F4_Max (0x1UL)
  #define ETM_TRCSEQEVR_F4_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_F4_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/

/* F5 @Bit 5 : Forward field. */
  #define ETM_TRCSEQEVR_F5_Pos (5UL)
  #define ETM_TRCSEQEVR_F5_Msk (0x1UL << ETM_TRCSEQEVR_F5_Pos)
  #define ETM_TRCSEQEVR_F5_Min (0x0UL)
  #define ETM_TRCSEQEVR_F5_Max (0x1UL)
  #define ETM_TRCSEQEVR_F5_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_F5_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/

/* F6 @Bit 6 : Forward field. */
  #define ETM_TRCSEQEVR_F6_Pos (6UL)
  #define ETM_TRCSEQEVR_F6_Msk (0x1UL << ETM_TRCSEQEVR_F6_Pos)
  #define ETM_TRCSEQEVR_F6_Min (0x0UL)
  #define ETM_TRCSEQEVR_F6_Max (0x1UL)
  #define ETM_TRCSEQEVR_F6_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_F6_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/

/* F7 @Bit 7 : Forward field. */
  #define ETM_TRCSEQEVR_F7_Pos (7UL)
  #define ETM_TRCSEQEVR_F7_Msk (0x1UL << ETM_TRCSEQEVR_F7_Pos)
  #define ETM_TRCSEQEVR_F7_Min (0x0UL)
  #define ETM_TRCSEQEVR_F7_Max (0x1UL)
  #define ETM_TRCSEQEVR_F7_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_F7_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n to
                                                          state n+1.*/

/* B0 @Bit 8 : Backward field. */
  #define ETM_TRCSEQEVR_B0_Pos (8UL)
  #define ETM_TRCSEQEVR_B0_Msk (0x1UL << ETM_TRCSEQEVR_B0_Pos)
  #define ETM_TRCSEQEVR_B0_Min (0x0UL)
  #define ETM_TRCSEQEVR_B0_Max (0x1UL)
  #define ETM_TRCSEQEVR_B0_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_B0_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/

/* B1 @Bit 9 : Backward field. */
  #define ETM_TRCSEQEVR_B1_Pos (9UL)
  #define ETM_TRCSEQEVR_B1_Msk (0x1UL << ETM_TRCSEQEVR_B1_Pos)
  #define ETM_TRCSEQEVR_B1_Min (0x0UL)
  #define ETM_TRCSEQEVR_B1_Max (0x1UL)
  #define ETM_TRCSEQEVR_B1_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_B1_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/

/* B2 @Bit 10 : Backward field. */
  #define ETM_TRCSEQEVR_B2_Pos (10UL)
  #define ETM_TRCSEQEVR_B2_Msk (0x1UL << ETM_TRCSEQEVR_B2_Pos)
  #define ETM_TRCSEQEVR_B2_Min (0x0UL)
  #define ETM_TRCSEQEVR_B2_Max (0x1UL)
  #define ETM_TRCSEQEVR_B2_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_B2_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/

/* B3 @Bit 11 : Backward field. */
  #define ETM_TRCSEQEVR_B3_Pos (11UL)
  #define ETM_TRCSEQEVR_B3_Msk (0x1UL << ETM_TRCSEQEVR_B3_Pos)
  #define ETM_TRCSEQEVR_B3_Min (0x0UL)
  #define ETM_TRCSEQEVR_B3_Max (0x1UL)
  #define ETM_TRCSEQEVR_B3_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_B3_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/

/* B4 @Bit 12 : Backward field. */
  #define ETM_TRCSEQEVR_B4_Pos (12UL)
  #define ETM_TRCSEQEVR_B4_Msk (0x1UL << ETM_TRCSEQEVR_B4_Pos)
  #define ETM_TRCSEQEVR_B4_Min (0x0UL)
  #define ETM_TRCSEQEVR_B4_Max (0x1UL)
  #define ETM_TRCSEQEVR_B4_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_B4_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/

/* B5 @Bit 13 : Backward field. */
  #define ETM_TRCSEQEVR_B5_Pos (13UL)
  #define ETM_TRCSEQEVR_B5_Msk (0x1UL << ETM_TRCSEQEVR_B5_Pos)
  #define ETM_TRCSEQEVR_B5_Min (0x0UL)
  #define ETM_TRCSEQEVR_B5_Max (0x1UL)
  #define ETM_TRCSEQEVR_B5_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_B5_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/

/* B6 @Bit 14 : Backward field. */
  #define ETM_TRCSEQEVR_B6_Pos (14UL)
  #define ETM_TRCSEQEVR_B6_Msk (0x1UL << ETM_TRCSEQEVR_B6_Pos)
  #define ETM_TRCSEQEVR_B6_Min (0x0UL)
  #define ETM_TRCSEQEVR_B6_Max (0x1UL)
  #define ETM_TRCSEQEVR_B6_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_B6_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/

/* B7 @Bit 15 : Backward field. */
  #define ETM_TRCSEQEVR_B7_Pos (15UL)
  #define ETM_TRCSEQEVR_B7_Msk (0x1UL << ETM_TRCSEQEVR_B7_Pos)
  #define ETM_TRCSEQEVR_B7_Min (0x0UL)
  #define ETM_TRCSEQEVR_B7_Max (0x1UL)
  #define ETM_TRCSEQEVR_B7_Disabled (0x0UL)
  #define ETM_TRCSEQEVR_B7_Enabled (0x1UL)           /*!< When the event occurs then the sequencer state moves from state n+1 to
                                                          state n.*/


/* ETM_TRCSEQRSTEVR: Moves the sequencer to state 0 when a programmed event occurs. Might ignore writes when the trace unit is
                      enabled or not idle. When the sequencer is used, all sequencer state transitions must be programmed with a
                      valid event. */

