pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCSEQRSTEVR_ResetValue (0x00000000UL)

/* EVENT @Bits 0..7 : Select which event should reset the sequencer. */
  #define ETM_TRCSEQRSTEVR_EVENT_Pos (0UL)
  #define ETM_TRCSEQRSTEVR_EVENT_Msk (0xFFUL << ETM_TRCSEQRSTEVR_EVENT_Pos)
  #define ETM_TRCSEQRSTEVR_EVENT_Min (0x00UL)
  #define ETM_TRCSEQRSTEVR_EVENT_Max (0xFFUL)


/* ETM_TRCSEQSTR: Use this to set, or read, the sequencer state. Might ignore writes when the trace unit is enabled or not idle.
                   Only returns stable data when TRCSTATR.PMSTABLE == 1. When the sequencer is used, all sequencer state
                   transitions must be programmed with a valid event. */

  #define ETM_TRCSEQSTR_ResetValue (0x00000000UL)

/* STATE @Bits 0..1 : Sets or returns the state of the sequencer. */
  #define ETM_TRCSEQSTR_STATE_Pos (0UL)
  #define ETM_TRCSEQSTR_STATE_Msk (0x3UL << ETM_TRCSEQSTR_STATE_Pos)
  #define ETM_TRCSEQSTR_STATE_Min (0x0UL)
  #define ETM_TRCSEQSTR_STATE_Max (0x3UL)
  #define ETM_TRCSEQSTR_STATE_State0 (0x0UL)
  #define ETM_TRCSEQSTR_STATE_State1 (0x1UL)
  #define ETM_TRCSEQSTR_STATE_State2 (0x2UL)
  #define ETM_TRCSEQSTR_STATE_State3 (0x3UL)


/* ETM_TRCEXTINSELR: Use this to set, or read, which external inputs are resources to the trace unit. Might ignore writes when
                      the trace unit is enabled or not idle. Only returns stable data when TRCSTATR.PMSTABLE == 1. When the
                      sequencer is used, all sequencer state transitions must be programmed with a valid event. */

  #define ETM_TRCEXTINSELR_ResetValue (0x00000000UL)

/* SEL0 @Bits 0..7 : Each field in this collection selects an external input as a resource for the trace unit. */
  #define ETM_TRCEXTINSELR_SEL0_Pos (0UL)
  #define ETM_TRCEXTINSELR_SEL0_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL0_Pos)
  #define ETM_TRCEXTINSELR_SEL0_Min (0x00UL)
  #define ETM_TRCEXTINSELR_SEL0_Max (0xFFUL)

/* SEL1 @Bits 8..15 : Each field in this collection selects an external input as a resource for the trace unit. */
  #define ETM_TRCEXTINSELR_SEL1_Pos (8UL)
  #define ETM_TRCEXTINSELR_SEL1_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL1_Pos)
  #define ETM_TRCEXTINSELR_SEL1_Min (0x00UL)
  #define ETM_TRCEXTINSELR_SEL1_Max (0xFFUL)

/* SEL2 @Bits 16..23 : Each field in this collection selects an external input as a resource for the trace unit. */
  #define ETM_TRCEXTINSELR_SEL2_Pos (16UL)
  #define ETM_TRCEXTINSELR_SEL2_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL2_Pos)
  #define ETM_TRCEXTINSELR_SEL2_Min (0x00UL)
  #define ETM_TRCEXTINSELR_SEL2_Max (0xFFUL)

/* SEL3 @Bits 24..31 : Each field in this collection selects an external input as a resource for the trace unit. */
  #define ETM_TRCEXTINSELR_SEL3_Pos (24UL)
  #define ETM_TRCEXTINSELR_SEL3_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL3_Pos)
  #define ETM_TRCEXTINSELR_SEL3_Min (0x00UL)
  #define ETM_TRCEXTINSELR_SEL3_Max (0xFFUL)


/* ETM_TRCCNTRLDVR: This sets or returns the reload count value for counter n. Might ignore writes when the trace unit is
                     enabled or not idle. */

  #define ETM_TRCCNTRLDVR_MaxCount (4UL)
  #define ETM_TRCCNTRLDVR_MaxIndex (3UL)
  #define ETM_TRCCNTRLDVR_MinIndex (0UL)
  #define ETM_TRCCNTRLDVR_ResetValue (0x00000000UL)

/* VALUE @Bits 0..15 : Contains the reload value for counter n. When a reload event occurs for counter n then the trace unit
                       copies the VALUEn field into counter n. */

  #define ETM_TRCCNTRLDVR_VALUE_Pos (0UL)
  #define ETM_TRCCNTRLDVR_VALUE_Msk (0xFFFFUL << ETM_TRCCNTRLDVR_VALUE_Pos)
  #define ETM_TRCCNTRLDVR_VALUE_Min (0x0000UL)
  #define ETM_TRCCNTRLDVR_VALUE_Max (0xFFFFUL)


/* ETM_TRCCNTCTLR: Controls the operation of counter n. Might ignore writes when the trace unit is enabled or not idle. */
  #define ETM_TRCCNTCTLR_MaxCount (4UL)
  #define ETM_TRCCNTCTLR_MaxIndex (3UL)
  #define ETM_TRCCNTCTLR_MinIndex (0UL)
  #define ETM_TRCCNTCTLR_ResetValue (0x00000000UL)

/* CNTEVENT @Bits 0..7 : Selects an event, that when it occurs causes counter n to decrement. */
  #define ETM_TRCCNTCTLR_CNTEVENT_Pos (0UL)
  #define ETM_TRCCNTCTLR_CNTEVENT_Msk (0xFFUL << ETM_TRCCNTCTLR_CNTEVENT_Pos)
  #define ETM_TRCCNTCTLR_CNTEVENT_Min (0x00UL)
  #define ETM_TRCCNTCTLR_CNTEVENT_Max (0xFFUL)

/* RLDEVENT @Bits 8..15 : Selects an event, that when it occurs causes a reload event for counter n. */
  #define ETM_TRCCNTCTLR_RLDEVENT_Pos (8UL)
  #define ETM_TRCCNTCTLR_RLDEVENT_Msk (0xFFUL << ETM_TRCCNTCTLR_RLDEVENT_Pos)
  #define ETM_TRCCNTCTLR_RLDEVENT_Min (0x00UL)
  #define ETM_TRCCNTCTLR_RLDEVENT_Max (0xFFUL)

/* RLDSELF @Bit 16 : Controls whether a reload event occurs for counter n, when counter n reaches zero. */
  #define ETM_TRCCNTCTLR_RLDSELF_Pos (16UL)
  #define ETM_TRCCNTCTLR_RLDSELF_Msk (0x1UL << ETM_TRCCNTCTLR_RLDSELF_Pos)
  #define ETM_TRCCNTCTLR_RLDSELF_Min (0x0UL)
  #define ETM_TRCCNTCTLR_RLDSELF_Max (0x1UL)
  #define ETM_TRCCNTCTLR_RLDSELF_Disabled (0x0UL)
  #define ETM_TRCCNTCTLR_RLDSELF_Enabled (0x1UL)

/* CNTCHAIN @Bit 17 : For TRCCNTCTLR3 and TRCCNTCTLR1, this bit controls whether counter n decrements when a reload event occurs
                      for counter n-1. */

  #define ETM_TRCCNTCTLR_CNTCHAIN_Pos (17UL)
  #define ETM_TRCCNTCTLR_CNTCHAIN_Msk (0x1UL << ETM_TRCCNTCTLR_CNTCHAIN_Pos)
  #define ETM_TRCCNTCTLR_CNTCHAIN_Min (0x0UL)
  #define ETM_TRCCNTCTLR_CNTCHAIN_Max (0x1UL)
  #define ETM_TRCCNTCTLR_CNTCHAIN_Disabled (0x0UL)   /*!< Counter n does not decrement when a reload event for counter n-1
                                                          occurs.*/
  #define ETM_TRCCNTCTLR_CNTCHAIN_Enabled (0x1UL)    /*!< Counter n decrements when a reload event for counter n-1 occurs. This
                                                          concatenates counter n and counter n-1, to provide a larger count
                                                          value.*/


/* ETM_TRCCNTVR: This sets or returns the value of counter n. The count value is only stable when TRCSTATR.PMSTABLE == 1. If
                  software uses counter n then it must write to this register to set the initial counter value. Might ignore
                  writes when the trace unit is enabled or not idle. */

