pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETM_TRCCNTVR_MaxCount (4UL)
  #define ETM_TRCCNTVR_MaxIndex (3UL)
  #define ETM_TRCCNTVR_MinIndex (0UL)
  #define ETM_TRCCNTVR_ResetValue (0x00000000UL)

/* VALUE @Bits 0..15 : Contains the count value of counter n. */
  #define ETM_TRCCNTVR_VALUE_Pos (0UL)
  #define ETM_TRCCNTVR_VALUE_Msk (0xFFFFUL << ETM_TRCCNTVR_VALUE_Pos)
  #define ETM_TRCCNTVR_VALUE_Min (0x0000UL)
  #define ETM_TRCCNTVR_VALUE_Max (0xFFFFUL)


/* ETM_TRCRSCTLR: Controls the selection of the resources in the trace unit. Might ignore writes when the trace unit is enabled
                   or not idle. If software selects a non-implemented resource then CONSTRAINED UNPREDICTABLE behavior of the
                   resource selector occurs, so the resource selector might fire unexpectedly or might not fire. Reads of the
                   TRCRSCTLRn might return UNKNOWN. */

  #define ETM_TRCRSCTLR_MaxCount (30UL)
  #define ETM_TRCRSCTLR_MaxIndex (31UL)
  #define ETM_TRCRSCTLR_MinIndex (2UL)
  #define ETM_TRCRSCTLR_ResetValue (0x00000000UL)

/* EN @Bit 0 : Trace unit enable bit */
  #define ETM_TRCRSCTLR_EN_Pos (0UL)
  #define ETM_TRCRSCTLR_EN_Msk (0x1UL << ETM_TRCRSCTLR_EN_Pos)
  #define ETM_TRCRSCTLR_EN_Min (0x0UL)
  #define ETM_TRCRSCTLR_EN_Max (0x1UL)
  #define ETM_TRCRSCTLR_EN_Disabled (0x0UL)          /*!< The trace unit is disabled. All trace resources are inactive and no
                                                          trace is generated.*/
  #define ETM_TRCRSCTLR_EN_Enabled (0x1UL)


/* ETM_TRCSSCCR0: Controls the single-shot comparator. */
  #define ETM_TRCSSCCR0_ResetValue (0x00000000UL)

/* RST @Bit 24 : Enables the single-shot comparator resource to be reset when it occurs, to enable another comparator match to
                 be detected */

  #define ETM_TRCSSCCR0_RST_Pos (24UL)
  #define ETM_TRCSSCCR0_RST_Msk (0x1UL << ETM_TRCSSCCR0_RST_Pos)
  #define ETM_TRCSSCCR0_RST_Min (0x0UL)
  #define ETM_TRCSSCCR0_RST_Max (0x1UL)
  #define ETM_TRCSSCCR0_RST_Disabled (0x0UL)
  #define ETM_TRCSSCCR0_RST_Enabled (0x1UL)


/* ETM_TRCSSCSR0: Indicates the status of the single-shot comparators. TRCSSCSR0 is sensitive toinstruction addresses. */
  #define ETM_TRCSSCSR0_ResetValue (0x00000000UL)

/* INST @Bit 0 : Instruction address comparator support */
  #define ETM_TRCSSCSR0_INST_Pos (0UL)
  #define ETM_TRCSSCSR0_INST_Msk (0x1UL << ETM_TRCSSCSR0_INST_Pos)
  #define ETM_TRCSSCSR0_INST_Min (0x0UL)
  #define ETM_TRCSSCSR0_INST_Max (0x1UL)
  #define ETM_TRCSSCSR0_INST_False (0x0UL)
  #define ETM_TRCSSCSR0_INST_True (0x1UL)

/* DA @Bit 1 : Data address comparator support */
  #define ETM_TRCSSCSR0_DA_Pos (1UL)
  #define ETM_TRCSSCSR0_DA_Msk (0x1UL << ETM_TRCSSCSR0_DA_Pos)
  #define ETM_TRCSSCSR0_DA_Min (0x0UL)
  #define ETM_TRCSSCSR0_DA_Max (0x1UL)
  #define ETM_TRCSSCSR0_DA_False (0x0UL)
  #define ETM_TRCSSCSR0_DA_True (0x1UL)

/* DV @Bit 2 : Data value comparator support */
  #define ETM_TRCSSCSR0_DV_Pos (2UL)
  #define ETM_TRCSSCSR0_DV_Msk (0x1UL << ETM_TRCSSCSR0_DV_Pos)
  #define ETM_TRCSSCSR0_DV_Min (0x0UL)
  #define ETM_TRCSSCSR0_DV_Max (0x1UL)
  #define ETM_TRCSSCSR0_DV_False (0x0UL)
  #define ETM_TRCSSCSR0_DV_True (0x1UL)

/* PC @Bit 3 : Process counter value comparator support */
  #define ETM_TRCSSCSR0_PC_Pos (3UL)
  #define ETM_TRCSSCSR0_PC_Msk (0x1UL << ETM_TRCSSCSR0_PC_Pos)
  #define ETM_TRCSSCSR0_PC_Min (0x0UL)
  #define ETM_TRCSSCSR0_PC_Max (0x1UL)
  #define ETM_TRCSSCSR0_PC_False (0x0UL)
  #define ETM_TRCSSCSR0_PC_True (0x1UL)

/* STATUS @Bit 31 : Single-shot status. This indicates whether any of the selected comparators have matched. */
  #define ETM_TRCSSCSR0_STATUS_Pos (31UL)
  #define ETM_TRCSSCSR0_STATUS_Msk (0x1UL << ETM_TRCSSCSR0_STATUS_Pos)
  #define ETM_TRCSSCSR0_STATUS_Min (0x0UL)
  #define ETM_TRCSSCSR0_STATUS_Max (0x1UL)
  #define ETM_TRCSSCSR0_STATUS_NoMatch (0x0UL)
  #define ETM_TRCSSCSR0_STATUS_Match (0x1UL)


/* ETM_TRCSSPCICR0: Selects the processor comparator inputs for Single-shot control. */
  #define ETM_TRCSSPCICR0_ResetValue (0x00000000UL)

/* PC0 @Bit 0 : Selects processor comparator 0 inputs for Single-shot control */
  #define ETM_TRCSSPCICR0_PC0_Pos (0UL)
  #define ETM_TRCSSPCICR0_PC0_Msk (0x1UL << ETM_TRCSSPCICR0_PC0_Pos)
  #define ETM_TRCSSPCICR0_PC0_Min (0x0UL)
  #define ETM_TRCSSPCICR0_PC0_Max (0x1UL)
  #define ETM_TRCSSPCICR0_PC0_Disabled (0x0UL)
  #define ETM_TRCSSPCICR0_PC0_Enabled (0x1UL)

/* PC1 @Bit 1 : Selects processor comparator 1 inputs for Single-shot control */
  #define ETM_TRCSSPCICR0_PC1_Pos (1UL)
  #define ETM_TRCSSPCICR0_PC1_Msk (0x1UL << ETM_TRCSSPCICR0_PC1_Pos)
  #define ETM_TRCSSPCICR0_PC1_Min (0x0UL)
  #define ETM_TRCSSPCICR0_PC1_Max (0x1UL)
  #define ETM_TRCSSPCICR0_PC1_Disabled (0x0UL)
  #define ETM_TRCSSPCICR0_PC1_Enabled (0x1UL)

/* PC2 @Bit 2 : Selects processor comparator 2 inputs for Single-shot control */
  #define ETM_TRCSSPCICR0_PC2_Pos (2UL)
  #define ETM_TRCSSPCICR0_PC2_Msk (0x1UL << ETM_TRCSSPCICR0_PC2_Pos)
  #define ETM_TRCSSPCICR0_PC2_Min (0x0UL)
  #define ETM_TRCSSPCICR0_PC2_Max (0x1UL)
  #define ETM_TRCSSPCICR0_PC2_Disabled (0x0UL)
  #define ETM_TRCSSPCICR0_PC2_Enabled (0x1UL)

/* PC3 @Bit 3 : Selects processor comparator 3 inputs for Single-shot control */
  #define ETM_TRCSSPCICR0_PC3_Pos (3UL)
  #define ETM_TRCSSPCICR0_PC3_Msk (0x1UL << ETM_TRCSSPCICR0_PC3_Pos)
  #define ETM_TRCSSPCICR0_PC3_Min (0x0UL)
  #define ETM_TRCSSPCICR0_PC3_Max (0x1UL)
  #define ETM_TRCSSPCICR0_PC3_Disabled (0x0UL)
  #define ETM_TRCSSPCICR0_PC3_Enabled (0x1UL)


/* ETM_TRCPDCR: Controls the single-shot comparator. */
  #define ETM_TRCPDCR_ResetValue (0x00000000UL)

/* PU @Bit 24 : Power up request, to request that power to ETM and access to the trace registers is maintained. */
  #define ETM_TRCPDCR_PU_Pos (24UL)
  #define ETM_TRCPDCR_PU_Msk (0x1UL << ETM_TRCPDCR_PU_Pos)
  #define ETM_TRCPDCR_PU_Min (0x0UL)
  #define ETM_TRCPDCR_PU_Max (0x1UL)
  #define ETM_TRCPDCR_PU_Disabled (0x0UL)
  #define ETM_TRCPDCR_PU_Enabled (0x1UL)


/* ETM_TRCPDSR: Indicates the power down status of the ETM. */
  #define ETM_TRCPDSR_ResetValue (0x00000000UL)

