pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* POWER @Bit 0 : Indicates ETM is powered up */
  #define ETM_TRCPDSR_POWER_Pos (0UL)
  #define ETM_TRCPDSR_POWER_Msk (0x1UL << ETM_TRCPDSR_POWER_Pos)
  #define ETM_TRCPDSR_POWER_Min (0x0UL)
  #define ETM_TRCPDSR_POWER_Max (0x1UL)
  #define ETM_TRCPDSR_POWER_NotPoweredUp (0x0UL)
  #define ETM_TRCPDSR_POWER_PoweredUp (0x1UL)

/* STICKYPD @Bit 1 : Sticky power down state. This bit is set to 1 when power to the ETM registers is removed, to indicate that
                     programming state has been lost. It is cleared after a read of the TRCPDSR */

  #define ETM_TRCPDSR_STICKYPD_Pos (1UL)
  #define ETM_TRCPDSR_STICKYPD_Msk (0x1UL << ETM_TRCPDSR_STICKYPD_Pos)
  #define ETM_TRCPDSR_STICKYPD_Min (0x0UL)
  #define ETM_TRCPDSR_STICKYPD_Max (0x1UL)
  #define ETM_TRCPDSR_STICKYPD_NotPoweredDown (0x0UL) /*!< Trace register power has not been removed since the TRCPDSR was last
                                                           read.*/
  #define ETM_TRCPDSR_STICKYPD_PoweredDown (0x1UL)   /*!< Trace register power has been removed since the TRCPDSR was last
                                                          read.*/


/* ETM_TRCITATBIDR: Sets the state of output pins. */
  #define ETM_TRCITATBIDR_ResetValue (0x00000000UL)

/* ID0 @Bit 0 : Drives the ATIDMI[0] output pin. */
  #define ETM_TRCITATBIDR_ID0_Pos (0UL)
  #define ETM_TRCITATBIDR_ID0_Msk (0x1UL << ETM_TRCITATBIDR_ID0_Pos)

/* ID1 @Bit 1 : Drives the ATIDMI[1] output pin. */
  #define ETM_TRCITATBIDR_ID1_Pos (1UL)
  #define ETM_TRCITATBIDR_ID1_Msk (0x1UL << ETM_TRCITATBIDR_ID1_Pos)

/* ID2 @Bit 2 : Drives the ATIDMI[2] output pin. */
  #define ETM_TRCITATBIDR_ID2_Pos (2UL)
  #define ETM_TRCITATBIDR_ID2_Msk (0x1UL << ETM_TRCITATBIDR_ID2_Pos)

/* ID3 @Bit 3 : Drives the ATIDMI[3] output pin. */
  #define ETM_TRCITATBIDR_ID3_Pos (3UL)
  #define ETM_TRCITATBIDR_ID3_Msk (0x1UL << ETM_TRCITATBIDR_ID3_Pos)

/* ID4 @Bit 4 : Drives the ATIDMI[4] output pin. */
  #define ETM_TRCITATBIDR_ID4_Pos (4UL)
  #define ETM_TRCITATBIDR_ID4_Msk (0x1UL << ETM_TRCITATBIDR_ID4_Pos)

/* ID5 @Bit 5 : Drives the ATIDMI[5] output pin. */
  #define ETM_TRCITATBIDR_ID5_Pos (5UL)
  #define ETM_TRCITATBIDR_ID5_Msk (0x1UL << ETM_TRCITATBIDR_ID5_Pos)

/* ID6 @Bit 6 : Drives the ATIDMI[6] output pin. */
  #define ETM_TRCITATBIDR_ID6_Pos (6UL)
  #define ETM_TRCITATBIDR_ID6_Msk (0x1UL << ETM_TRCITATBIDR_ID6_Pos)


/* ETM_TRCITIATBINR: Reads the state of the input pins. */
  #define ETM_TRCITIATBINR_ResetValue (0x00000000UL)

/* ATVALID @Bit 0 : Returns the value of the ATVALIDMI input pin. */
  #define ETM_TRCITIATBINR_ATVALID_Pos (0UL)
  #define ETM_TRCITIATBINR_ATVALID_Msk (0x1UL << ETM_TRCITIATBINR_ATVALID_Pos)

/* AFREADY @Bit 1 : Returns the value of the AFREADYMI input pin. */
  #define ETM_TRCITIATBINR_AFREADY_Pos (1UL)
  #define ETM_TRCITIATBINR_AFREADY_Msk (0x1UL << ETM_TRCITIATBINR_AFREADY_Pos)


/* ETM_TRCITIATBOUTR: Sets the state of the output pins. */
  #define ETM_TRCITIATBOUTR_ResetValue (0x00000000UL)

/* ATVALID @Bit 0 : Drives the ATVALIDMI output pin. */
  #define ETM_TRCITIATBOUTR_ATVALID_Pos (0UL)
  #define ETM_TRCITIATBOUTR_ATVALID_Msk (0x1UL << ETM_TRCITIATBOUTR_ATVALID_Pos)

/* AFREADY @Bit 1 : Drives the AFREADYMI output pin. */
  #define ETM_TRCITIATBOUTR_AFREADY_Pos (1UL)
  #define ETM_TRCITIATBOUTR_AFREADY_Msk (0x1UL << ETM_TRCITIATBOUTR_AFREADY_Pos)


/* ETM_TRCITCTRL: Enables topology detection or integration testing, by putting ETM-M33 into integration mode. */
  #define ETM_TRCITCTRL_ResetValue (0x00000000UL)

/* IME @Bit 0 : Integration mode enable */
  #define ETM_TRCITCTRL_IME_Pos (0UL)
  #define ETM_TRCITCTRL_IME_Msk (0x1UL << ETM_TRCITCTRL_IME_Pos)
  #define ETM_TRCITCTRL_IME_Min (0x0UL)
  #define ETM_TRCITCTRL_IME_Max (0x1UL)
  #define ETM_TRCITCTRL_IME_Disabled (0x0UL)
  #define ETM_TRCITCTRL_IME_Enabled (0x1UL)


/* ETM_TRCCLAIMSET: Sets bits in the claim tag and determines the number of claim tag bits implemented. */
  #define ETM_TRCCLAIMSET_ResetValue (0x00000000UL)

/* SET0 @Bit 0 : Claim tag set register */
  #define ETM_TRCCLAIMSET_SET0_Pos (0UL)
  #define ETM_TRCCLAIMSET_SET0_Msk (0x1UL << ETM_TRCCLAIMSET_SET0_Pos)
  #define ETM_TRCCLAIMSET_SET0_Min (0x0UL)
  #define ETM_TRCCLAIMSET_SET0_Max (0x1UL)
  #define ETM_TRCCLAIMSET_SET0_NotSet (0x0UL)
  #define ETM_TRCCLAIMSET_SET0_Set (0x1UL)
  #define ETM_TRCCLAIMSET_SET0_Claim (0x1UL)

/* SET1 @Bit 1 : Claim tag set register */
  #define ETM_TRCCLAIMSET_SET1_Pos (1UL)
  #define ETM_TRCCLAIMSET_SET1_Msk (0x1UL << ETM_TRCCLAIMSET_SET1_Pos)
  #define ETM_TRCCLAIMSET_SET1_Min (0x0UL)
  #define ETM_TRCCLAIMSET_SET1_Max (0x1UL)
  #define ETM_TRCCLAIMSET_SET1_NotSet (0x0UL)
  #define ETM_TRCCLAIMSET_SET1_Set (0x1UL)
  #define ETM_TRCCLAIMSET_SET1_Claim (0x1UL)

/* SET2 @Bit 2 : Claim tag set register */
  #define ETM_TRCCLAIMSET_SET2_Pos (2UL)
  #define ETM_TRCCLAIMSET_SET2_Msk (0x1UL << ETM_TRCCLAIMSET_SET2_Pos)
  #define ETM_TRCCLAIMSET_SET2_Min (0x0UL)
  #define ETM_TRCCLAIMSET_SET2_Max (0x1UL)
  #define ETM_TRCCLAIMSET_SET2_NotSet (0x0UL)
  #define ETM_TRCCLAIMSET_SET2_Set (0x1UL)
  #define ETM_TRCCLAIMSET_SET2_Claim (0x1UL)

/* SET3 @Bit 3 : Claim tag set register */
  #define ETM_TRCCLAIMSET_SET3_Pos (3UL)
  #define ETM_TRCCLAIMSET_SET3_Msk (0x1UL << ETM_TRCCLAIMSET_SET3_Pos)
  #define ETM_TRCCLAIMSET_SET3_Min (0x0UL)
  #define ETM_TRCCLAIMSET_SET3_Max (0x1UL)
  #define ETM_TRCCLAIMSET_SET3_NotSet (0x0UL)
  #define ETM_TRCCLAIMSET_SET3_Set (0x1UL)
  #define ETM_TRCCLAIMSET_SET3_Claim (0x1UL)


/* ETM_TRCCLAIMCLR: Clears bits in the claim tag and determines the current value of the claim tag. */
  #define ETM_TRCCLAIMCLR_ResetValue (0x00000000UL)

/* CLR0 @Bit 0 : Claim tag clear register */
  #define ETM_TRCCLAIMCLR_CLR0_Pos (0UL)
  #define ETM_TRCCLAIMCLR_CLR0_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR0_Pos)
  #define ETM_TRCCLAIMCLR_CLR0_Min (0x0UL)
  #define ETM_TRCCLAIMCLR_CLR0_Max (0x1UL)
  #define ETM_TRCCLAIMCLR_CLR0_NotSet (0x0UL)
  #define ETM_TRCCLAIMCLR_CLR0_Set (0x1UL)
  #define ETM_TRCCLAIMCLR_CLR0_Clear (0x1UL)

