pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CLR1 @Bit 1 : Claim tag clear register */
  #define ETM_TRCCLAIMCLR_CLR1_Pos (1UL)
  #define ETM_TRCCLAIMCLR_CLR1_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR1_Pos)
  #define ETM_TRCCLAIMCLR_CLR1_Min (0x0UL)
  #define ETM_TRCCLAIMCLR_CLR1_Max (0x1UL)
  #define ETM_TRCCLAIMCLR_CLR1_NotSet (0x0UL)
  #define ETM_TRCCLAIMCLR_CLR1_Set (0x1UL)
  #define ETM_TRCCLAIMCLR_CLR1_Clear (0x1UL)

/* CLR2 @Bit 2 : Claim tag clear register */
  #define ETM_TRCCLAIMCLR_CLR2_Pos (2UL)
  #define ETM_TRCCLAIMCLR_CLR2_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR2_Pos)
  #define ETM_TRCCLAIMCLR_CLR2_Min (0x0UL)
  #define ETM_TRCCLAIMCLR_CLR2_Max (0x1UL)
  #define ETM_TRCCLAIMCLR_CLR2_NotSet (0x0UL)
  #define ETM_TRCCLAIMCLR_CLR2_Set (0x1UL)
  #define ETM_TRCCLAIMCLR_CLR2_Clear (0x1UL)

/* CLR3 @Bit 3 : Claim tag clear register */
  #define ETM_TRCCLAIMCLR_CLR3_Pos (3UL)
  #define ETM_TRCCLAIMCLR_CLR3_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR3_Pos)
  #define ETM_TRCCLAIMCLR_CLR3_Min (0x0UL)
  #define ETM_TRCCLAIMCLR_CLR3_Max (0x1UL)
  #define ETM_TRCCLAIMCLR_CLR3_NotSet (0x0UL)
  #define ETM_TRCCLAIMCLR_CLR3_Set (0x1UL)
  #define ETM_TRCCLAIMCLR_CLR3_Clear (0x1UL)


/* ETM_TRCAUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define ETM_TRCAUTHSTATUS_ResetValue (0x00000000UL)

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define ETM_TRCAUTHSTATUS_NSID_Pos (0UL)
  #define ETM_TRCAUTHSTATUS_NSID_Msk (0x3UL << ETM_TRCAUTHSTATUS_NSID_Pos)
  #define ETM_TRCAUTHSTATUS_NSID_Min (0x0UL)
  #define ETM_TRCAUTHSTATUS_NSID_Max (0x1UL)
  #define ETM_TRCAUTHSTATUS_NSID_NotImplemented (0x0UL)
  #define ETM_TRCAUTHSTATUS_NSID_Implemented (0x1UL)

/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define ETM_TRCAUTHSTATUS_NSNID_Pos (2UL)
  #define ETM_TRCAUTHSTATUS_NSNID_Msk (0x3UL << ETM_TRCAUTHSTATUS_NSNID_Pos)
  #define ETM_TRCAUTHSTATUS_NSNID_Min (0x0UL)
  #define ETM_TRCAUTHSTATUS_NSNID_Max (0x1UL)
  #define ETM_TRCAUTHSTATUS_NSNID_NotImplemented (0x0UL)
  #define ETM_TRCAUTHSTATUS_NSNID_Implemented (0x1UL)

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define ETM_TRCAUTHSTATUS_SID_Pos (4UL)
  #define ETM_TRCAUTHSTATUS_SID_Msk (0x3UL << ETM_TRCAUTHSTATUS_SID_Pos)
  #define ETM_TRCAUTHSTATUS_SID_Min (0x0UL)
  #define ETM_TRCAUTHSTATUS_SID_Max (0x1UL)
  #define ETM_TRCAUTHSTATUS_SID_NotImplemented (0x0UL)
  #define ETM_TRCAUTHSTATUS_SID_Implemented (0x1UL)

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define ETM_TRCAUTHSTATUS_SNID_Pos (6UL)
  #define ETM_TRCAUTHSTATUS_SNID_Msk (0x3UL << ETM_TRCAUTHSTATUS_SNID_Pos)
  #define ETM_TRCAUTHSTATUS_SNID_Min (0x0UL)
  #define ETM_TRCAUTHSTATUS_SNID_Max (0x1UL)
  #define ETM_TRCAUTHSTATUS_SNID_NotImplemented (0x0UL)
  #define ETM_TRCAUTHSTATUS_SNID_Implemented (0x1UL)


/* ETM_TRCDEVARCH: The TRCDEVARCH identifies ETM-M33 as an ETMv4.2 component */
  #define ETM_TRCDEVARCH_ResetValue (0x00000000UL)

/* ARCHID @Bits 0..15 : Architecture ID */
  #define ETM_TRCDEVARCH_ARCHID_Pos (0UL)
  #define ETM_TRCDEVARCH_ARCHID_Msk (0xFFFFUL << ETM_TRCDEVARCH_ARCHID_Pos)
  #define ETM_TRCDEVARCH_ARCHID_Min (0x4A13UL)
  #define ETM_TRCDEVARCH_ARCHID_Max (0x4A13UL)
  #define ETM_TRCDEVARCH_ARCHID_ETMv42 (0x4A13UL)

/* REVISION @Bits 16..19 : Architecture revision */
  #define ETM_TRCDEVARCH_REVISION_Pos (16UL)
  #define ETM_TRCDEVARCH_REVISION_Msk (0xFUL << ETM_TRCDEVARCH_REVISION_Pos)
  #define ETM_TRCDEVARCH_REVISION_Min (0x2UL)
  #define ETM_TRCDEVARCH_REVISION_Max (0x2UL)
  #define ETM_TRCDEVARCH_REVISION_v2 (0x2UL)

/* PRESENT @Bit 20 : This register is implemented */
  #define ETM_TRCDEVARCH_PRESENT_Pos (20UL)
  #define ETM_TRCDEVARCH_PRESENT_Msk (0x1UL << ETM_TRCDEVARCH_PRESENT_Pos)
  #define ETM_TRCDEVARCH_PRESENT_Min (0x0UL)
  #define ETM_TRCDEVARCH_PRESENT_Max (0x1UL)
  #define ETM_TRCDEVARCH_PRESENT_Absent (0x0UL)
  #define ETM_TRCDEVARCH_PRESENT_Present (0x1UL)

/* ARCHITECT @Bits 21..31 : Defines the architect of the component */
  #define ETM_TRCDEVARCH_ARCHITECT_Pos (21UL)
  #define ETM_TRCDEVARCH_ARCHITECT_Msk (0x7FFUL << ETM_TRCDEVARCH_ARCHITECT_Pos)
  #define ETM_TRCDEVARCH_ARCHITECT_Min (0x23BUL)
  #define ETM_TRCDEVARCH_ARCHITECT_Max (0x23BUL)
  #define ETM_TRCDEVARCH_ARCHITECT_Arm (0x23BUL)


/* ETM_TRCDEVTYPE: Controls the single-shot comparator. */
  #define ETM_TRCDEVTYPE_ResetValue (0x00000000UL)

/* MAJOR @Bits 0..3 : The main type of the component */
  #define ETM_TRCDEVTYPE_MAJOR_Pos (0UL)
  #define ETM_TRCDEVTYPE_MAJOR_Msk (0xFUL << ETM_TRCDEVTYPE_MAJOR_Pos)
  #define ETM_TRCDEVTYPE_MAJOR_Min (0x3UL)
  #define ETM_TRCDEVTYPE_MAJOR_Max (0x3UL)
  #define ETM_TRCDEVTYPE_MAJOR_TraceSource (0x3UL)

/* SUB @Bits 4..7 : The sub-type of the component */
  #define ETM_TRCDEVTYPE_SUB_Pos (4UL)
  #define ETM_TRCDEVTYPE_SUB_Msk (0xFUL << ETM_TRCDEVTYPE_SUB_Pos)
  #define ETM_TRCDEVTYPE_SUB_Min (0x1UL)
  #define ETM_TRCDEVTYPE_SUB_Max (0x1UL)
  #define ETM_TRCDEVTYPE_SUB_ProcessorTrace (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            ETR                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct ETR ======================================================== */
/**
  * @brief Embedded Trace Router
  */
  typedef struct {
    __IM uint32_t RESERVED;
    __IOM uint32_t RSZ;
    __IM uint32_t RESERVED1;
    __IM uint32_t STS;
    __IM uint32_t RRD;
    __IOM uint32_t RRP;
    __IOM uint32_t RWP;
    __IOM uint32_t TRG;
    __IOM uint32_t CTL;
    __OM uint32_t RWD;
    __IOM uint32_t MODE;
    __IM uint32_t LBUFLEVEL;
    __IM uint32_t CBUFLEVEL;
    __IOM uint32_t BUFWM;
    __IOM uint32_t RRPHI;
    __IOM uint32_t RWPHI;
    __IM uint32_t RESERVED2[52];
    __IOM uint32_t AXICTL;
    __IM uint32_t RESERVED3;
    __IOM uint32_t DBALO;
    __IOM uint32_t DBAHI;
    __IM uint32_t RESERVED4[120];
    __IM uint32_t FFSR;
    __IOM uint32_t FFCR;
    __IOM uint32_t PSCR;
    __IM uint32_t RESERVED5[756];
    __OM uint32_t ITATBMCTR0;                        /*!< (@ 0x00000EDC) Integration Test ATB Master Interface Control 0
                                                                         Register*/
    __OM uint32_t ITMISCOP0;
    __IM uint32_t RESERVED6;
    __IM uint32_t ITTRFLIN;
    __IM uint32_t ITATBDATA0;
    __OM uint32_t ITATBCTR2;
    __IM uint32_t ITATBCTR1;
    __IM uint32_t ITATBCTR0;
    __IM uint32_t RESERVED7;
    __IOM uint32_t ITCTRL;
    __IM uint32_t RESERVED8[39];
    __IOM uint32_t CLAIMSET;
    __IOM uint32_t CLAIMCLR;
    __IM uint32_t RESERVED9[2];
    __OM uint32_t LAR;
    __IM uint32_t LSR;
    __IM uint32_t AUTHSTATUS;
    __IM uint32_t RESERVED10[3];
    __IM uint32_t DEVID;
    __IM uint32_t DEVTYPE;
    __IM uint32_t PERIPHID4;
    __IM uint32_t RESERVED11[3];
    __IM uint32_t PERIPHID0;
    __IM uint32_t PERIPHID1;
    __IM uint32_t PERIPHID2;
    __IM uint32_t PERIPHID3;
    __IM uint32_t COMPID0;
    __IM uint32_t COMPID1;
    __IM uint32_t COMPID2;
    __IM uint32_t COMPID3;
  } NRF_ETR_Type;

/* ETR_RSZ: RAM Size register */
  #define ETR_RSZ_ResetValue (0x00000000UL)

/* RSZ @Bits 0..30 : Size of the RAM in 32-bit words. */
  #define ETR_RSZ_RSZ_Pos (0UL)
  #define ETR_RSZ_RSZ_Msk (0x7FFFFFFFUL << ETR_RSZ_RSZ_Pos)


