pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ETR_STS: Status Register */
  #define ETR_STS_ResetValue (0x0000000CUL)

/* FULL @Bit 0 : This bit can be used to help determine how much of the trace buffer contains valid data. */
  #define ETR_STS_FULL_Pos (0UL)
  #define ETR_STS_FULL_Msk (0x1UL << ETR_STS_FULL_Pos)

/* TRIGGERED @Bit 1 : The Triggered bit is set when trace capture is in progress and the TMC has detected a trigger event. */
  #define ETR_STS_TRIGGERED_Pos (1UL)
  #define ETR_STS_TRIGGERED_Msk (0x1UL << ETR_STS_TRIGGERED_Pos)

/* TMCREADY @Bit 2 : TMC ready */
  #define ETR_STS_TMCREADY_Pos (2UL)
  #define ETR_STS_TMCREADY_Msk (0x1UL << ETR_STS_TMCREADY_Pos)

/* FTEMPTY @Bit 3 : This bit is set when trace capture has stopped, and all internal pipelines and buffers have drained. */
  #define ETR_STS_FTEMPTY_Pos (3UL)
  #define ETR_STS_FTEMPTY_Msk (0x1UL << ETR_STS_FTEMPTY_Pos)

/* EMPTY @Bit 4 : If set, this bit indicates that the TMC does not contain any valid trace data in the trace memory. */
  #define ETR_STS_EMPTY_Pos (4UL)
  #define ETR_STS_EMPTY_Msk (0x1UL << ETR_STS_EMPTY_Pos)

/* MEMERR @Bit 5 : This bit indicates that an error has occurred on the AXI master interface. */
  #define ETR_STS_MEMERR_Pos (5UL)
  #define ETR_STS_MEMERR_Msk (0x1UL << ETR_STS_MEMERR_Pos)


/* ETR_RRD: RAM Read Data Register */
  #define ETR_RRD_ResetValue (0x00000000UL)

/* RRD @Bits 0..31 : Reads return data from Trace RAM */
  #define ETR_RRD_RRD_Pos (0UL)
  #define ETR_RRD_RRD_Msk (0xFFFFFFFFUL << ETR_RRD_RRD_Pos)


/* ETR_RRP: RAM Read Pointer Register */
  #define ETR_RRP_ResetValue (0x00000000UL)

/* RRP @Bits 0..8 : This value represents the location in trace memory that will be accessed on a subsequent RRD read. */
  #define ETR_RRP_RRP_Pos (0UL)
  #define ETR_RRP_RRP_Msk (0x1FFUL << ETR_RRP_RRP_Pos)


/* ETR_RWP: RAM Write Pointer Register */
  #define ETR_RWP_ResetValue (0x00000000UL)

/* RWP @Bits 0..31 : This value represents the location in trace memory that will be accessed on a subsequent write to the trace
                     memory. */

  #define ETR_RWP_RWP_Pos (0UL)
  #define ETR_RWP_RWP_Msk (0xFFFFFFFFUL << ETR_RWP_RWP_Pos)


/* ETR_TRG: Trigger Counter Register */
  #define ETR_TRG_ResetValue (0x00000000UL)

/* TRG @Bits 0..31 : This count represents the number of 32-bit words between a TRIGIN/trigger packet and a trigger event. */
  #define ETR_TRG_TRG_Pos (0UL)
  #define ETR_TRG_TRG_Msk (0xFFFFFFFFUL << ETR_TRG_TRG_Pos)


/* ETR_CTL: Control Register */
  #define ETR_CTL_ResetValue (0x00000000UL)

/* TRACECAPTEN @Bit 0 : Setting this bit to 1 enables the TMC to capture trace data. */
  #define ETR_CTL_TRACECAPTEN_Pos (0UL)
  #define ETR_CTL_TRACECAPTEN_Msk (0x1UL << ETR_CTL_TRACECAPTEN_Pos)


/* ETR_RWD: RAM Write Data Register */
  #define ETR_RWD_ResetValue (0x00000000UL)

/* RWD @Bits 0..31 : Data written to this register is placed in the Trace RAM. */
  #define ETR_RWD_RWD_Pos (0UL)
  #define ETR_RWD_RWD_Msk (0xFFFFFFFFUL << ETR_RWD_RWD_Pos)


/* ETR_MODE: Mode Register */
  #define ETR_MODE_ResetValue (0x00000000UL)

/* MODE @Bits 0..1 : Selects the operating mode. */
  #define ETR_MODE_MODE_Pos (0UL)
  #define ETR_MODE_MODE_Msk (0x3UL << ETR_MODE_MODE_Pos)
  #define ETR_MODE_MODE_Min (0x0UL)
  #define ETR_MODE_MODE_Max (0x1UL)
  #define ETR_MODE_MODE_CIRCULARBUF (0x0UL)
  #define ETR_MODE_MODE_FIFO (0x1UL)


/* ETR_LBUFLEVEL: Latched Buffer Fill Level */
  #define ETR_LBUFLEVEL_ResetValue (0x00000000UL)

/* LBUFLEVEL @Bits 0..30 : Indicates the maximum fill level of the trace memory in 32-bit words since this register was last
                           read. */

  #define ETR_LBUFLEVEL_LBUFLEVEL_Pos (0UL)
  #define ETR_LBUFLEVEL_LBUFLEVEL_Msk (0x7FFFFFFFUL << ETR_LBUFLEVEL_LBUFLEVEL_Pos)


/* ETR_CBUFLEVEL: Current Buffer Fill Level */
  #define ETR_CBUFLEVEL_ResetValue (0x00000000UL)

/* CBUFLEVEL @Bits 0..7 : Indicates the current fill level of the trace memory in 32-bit words. */
  #define ETR_CBUFLEVEL_CBUFLEVEL_Pos (0UL)
  #define ETR_CBUFLEVEL_CBUFLEVEL_Msk (0xFFUL << ETR_CBUFLEVEL_CBUFLEVEL_Pos)


/* ETR_BUFWM: Buffer Level Water Mark */
  #define ETR_BUFWM_ResetValue (0x00000000UL)

/* BUFWM @Bits 0..6 : Indicates the desired threshold vacancy level in 32-bit words in the trace memory. */
  #define ETR_BUFWM_BUFWM_Pos (0UL)
  #define ETR_BUFWM_BUFWM_Msk (0x7FUL << ETR_BUFWM_BUFWM_Pos)


/* ETR_RRPHI: RAM Read Pointer High Register */
  #define ETR_RRPHI_ResetValue (0x00000000UL)

/* RRPHI @Bits 0..7 : Bits[39:32] of the read pointer */
  #define ETR_RRPHI_RRPHI_Pos (0UL)
  #define ETR_RRPHI_RRPHI_Msk (0xFFUL << ETR_RRPHI_RRPHI_Pos)


/* ETR_RWPHI: RAM Write Pointer High Register */
  #define ETR_RWPHI_ResetValue (0x00000000UL)

/* RWPHI @Bits 0..7 : Bits[39:32] of the write pointer */
  #define ETR_RWPHI_RWPHI_Pos (0UL)
  #define ETR_RWPHI_RWPHI_Msk (0xFFUL << ETR_RWPHI_RWPHI_Pos)


/* ETR_AXICTL: AXI Control Register */
  #define ETR_AXICTL_ResetValue (0x00000000UL)

/* PROTCTRLBIT0 @Bit 0 : This bit controls the value driven on ARPROTM[0]/AWPROTM[0] on the AXI interface when performing AXI
                         transfers. */

  #define ETR_AXICTL_PROTCTRLBIT0_Pos (0UL)
  #define ETR_AXICTL_PROTCTRLBIT0_Msk (0x1UL << ETR_AXICTL_PROTCTRLBIT0_Pos)

/* PROTCTRLBIT1 @Bit 1 : This bit controls the value driven on ARPROTM[1]/AWPROTM[1] on the AXI interface when performing AXI
                         transfers. */

  #define ETR_AXICTL_PROTCTRLBIT1_Pos (1UL)
  #define ETR_AXICTL_PROTCTRLBIT1_Msk (0x1UL << ETR_AXICTL_PROTCTRLBIT1_Pos)

/* CACHECTRLBIT0 @Bit 2 : This bit controls the value driven on the ARCACHEM[0]/AWCACHEM[0] signal on the AXI interface when
                          performing AXI transfers. */

  #define ETR_AXICTL_CACHECTRLBIT0_Pos (2UL)
  #define ETR_AXICTL_CACHECTRLBIT0_Msk (0x1UL << ETR_AXICTL_CACHECTRLBIT0_Pos)

/* CACHECTRLBIT1 @Bit 3 : This bit controls the value driven on the ARCACHEM[1]/AWCACHEM[1] signal on the AXI interface when
                          performing AXI transfers. */

  #define ETR_AXICTL_CACHECTRLBIT1_Pos (3UL)
  #define ETR_AXICTL_CACHECTRLBIT1_Msk (0x1UL << ETR_AXICTL_CACHECTRLBIT1_Pos)

/* CACHECTRLBIT2 @Bit 4 : This bit controls the value driven on the ARCACHEM[2]/AWCACHEM[2] signal on the AXI interface when
                          performing AXI transfers. */

  #define ETR_AXICTL_CACHECTRLBIT2_Pos (4UL)
  #define ETR_AXICTL_CACHECTRLBIT2_Msk (0x1UL << ETR_AXICTL_CACHECTRLBIT2_Pos)

/* CACHECTRLBIT3 @Bit 5 : This bit controls the value driven on the ARCACHEM[3]/AWCACHEM[3] signal on the AXI interface when
                          performing AXI transfers. */

