pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define ETR_AXICTL_CACHECTRLBIT3_Pos (5UL)
  #define ETR_AXICTL_CACHECTRLBIT3_Msk (0x1UL << ETR_AXICTL_CACHECTRLBIT3_Pos)

/* SCATTERGATHERMODE @Bit 7 : This bit indicates whether trace memory is accessed as a single buffer in system memory or as a
                              linked-list based scatter-gather memory. */

  #define ETR_AXICTL_SCATTERGATHERMODE_Pos (7UL)
  #define ETR_AXICTL_SCATTERGATHERMODE_Msk (0x1UL << ETR_AXICTL_SCATTERGATHERMODE_Pos) /*!< Bit mask of SCATTERGATHERMODE
                                                                            field.*/

/* WRBURSTLEN @Bits 8..11 : This field indicates the maximum number of data transfers that can occur within each burst initiated
                            by the TMC on the AXI interface. */

  #define ETR_AXICTL_WRBURSTLEN_Pos (8UL)
  #define ETR_AXICTL_WRBURSTLEN_Msk (0xFUL << ETR_AXICTL_WRBURSTLEN_Pos)


/* ETR_DBALO: Data Buffer Address Low Register */
  #define ETR_DBALO_ResetValue (0x00000000UL)

/* BUFADDRLO @Bits 0..31 : Holds the lower 32 bits of the 40-bit address used to locate the trace buffer in system memory */
  #define ETR_DBALO_BUFADDRLO_Pos (0UL)
  #define ETR_DBALO_BUFADDRLO_Msk (0xFFFFFFFFUL << ETR_DBALO_BUFADDRLO_Pos)


/* ETR_DBAHI: Data Buffer Address High Register */
  #define ETR_DBAHI_ResetValue (0x00000000UL)

/* BUFADDRHI @Bits 0..7 : Holds the upper 8 bits of the 40-bit address used to locate the trace buffer in system memory */
  #define ETR_DBAHI_BUFADDRHI_Pos (0UL)
  #define ETR_DBAHI_BUFADDRHI_Msk (0xFFUL << ETR_DBAHI_BUFADDRHI_Pos)


/* ETR_FFSR: Formatter and Flush Status Register */
  #define ETR_FFSR_ResetValue (0x00000002UL)

/* FLINPROG @Bit 0 : This bit indicates whether the TMC is currently processing a flush on the ATB slave port. This bit reflects
                     the status of the AFVALIDS output. The flush initiation is controlled by the flush-control bits in the FFCR
                     register. */

  #define ETR_FFSR_FLINPROG_Pos (0UL)
  #define ETR_FFSR_FLINPROG_Msk (0x1UL << ETR_FFSR_FLINPROG_Pos)

/* FTSTOPPED @Bit 1 : This bit behaves the same way as the FtEmpty bit in the STS register, 0x00C. */
  #define ETR_FFSR_FTSTOPPED_Pos (1UL)
  #define ETR_FFSR_FTSTOPPED_Msk (0x1UL << ETR_FFSR_FTSTOPPED_Pos)


/* ETR_FFCR: Formatter and Flush Control Register */
  #define ETR_FFCR_ResetValue (0x00000000UL)

/* ENFT @Bit 0 : If this bit is set, formatting is enabled. */
  #define ETR_FFCR_ENFT_Pos (0UL)
  #define ETR_FFCR_ENFT_Msk (0x1UL << ETR_FFCR_ENFT_Pos)

/* ENTI @Bit 1 : Setting this bit enables the insertion of triggers in the formatted trace stream. */
  #define ETR_FFCR_ENTI_Pos (1UL)
  #define ETR_FFCR_ENTI_Msk (0x1UL << ETR_FFCR_ENTI_Pos)

/* FONFLIN @Bit 4 : Setting this bit enables the detection of transitions on the FLUSHIN input by the TMC. */
  #define ETR_FFCR_FONFLIN_Pos (4UL)
  #define ETR_FFCR_FONFLIN_Msk (0x1UL << ETR_FFCR_FONFLIN_Pos)

/* FONTRIGEVT @Bit 5 : Setting this bit generates a flush when a Trigger event occurs. */
  #define ETR_FFCR_FONTRIGEVT_Pos (5UL)
  #define ETR_FFCR_FONTRIGEVT_Msk (0x1UL << ETR_FFCR_FONTRIGEVT_Pos)

/* FLUSHMAN @Bit 6 : Manually generate a flush of the system. */
  #define ETR_FFCR_FLUSHMAN_Pos (6UL)
  #define ETR_FFCR_FLUSHMAN_Msk (0x1UL << ETR_FFCR_FLUSHMAN_Pos)

/* TRIGONTRIGIN @Bit 8 : If this bit is set, a trigger is indicated on the trace stream when a rising edge is detected on the
                         TRIGIN input. */

  #define ETR_FFCR_TRIGONTRIGIN_Pos (8UL)
  #define ETR_FFCR_TRIGONTRIGIN_Msk (0x1UL << ETR_FFCR_TRIGONTRIGIN_Pos)

/* TRIGONTRIGEVT @Bit 9 : If this bit is set, a trigger is indicated on the output trace stream when a Trigger Event occurs. */
  #define ETR_FFCR_TRIGONTRIGEVT_Pos (9UL)
  #define ETR_FFCR_TRIGONTRIGEVT_Msk (0x1UL << ETR_FFCR_TRIGONTRIGEVT_Pos)

/* TRIGONFL @Bit 10 : If this bit is set, a trigger is indicated on the trace stream on AFREADYS being returned. */
  #define ETR_FFCR_TRIGONFL_Pos (10UL)
  #define ETR_FFCR_TRIGONFL_Msk (0x1UL << ETR_FFCR_TRIGONFL_Pos)

/* STOPONFL @Bit 12 : If this bit is set, the formatter is stopped on completion of a flush operation. */
  #define ETR_FFCR_STOPONFL_Pos (12UL)
  #define ETR_FFCR_STOPONFL_Msk (0x1UL << ETR_FFCR_STOPONFL_Pos)

/* STOPONTRIGEVT @Bit 13 : If this bit is set, the formatter is stopped when a Trigger Event has been observed. */
  #define ETR_FFCR_STOPONTRIGEVT_Pos (13UL)
  #define ETR_FFCR_STOPONTRIGEVT_Msk (0x1UL << ETR_FFCR_STOPONTRIGEVT_Pos)

/* DRAINBUFFER @Bit 14 : This bit is used to enable draining of the trace data through the ATB Master interface after the
                         formatter has stopped. */

  #define ETR_FFCR_DRAINBUFFER_Pos (14UL)
  #define ETR_FFCR_DRAINBUFFER_Msk (0x1UL << ETR_FFCR_DRAINBUFFER_Pos)


/* ETR_PSCR: Periodic Synchronization Counter Register */
  #define ETR_PSCR_ResetValue (0x00000000UL)

/* PSCOUNT @Bits 0..4 : The reload value of the Synchronization Counter */
  #define ETR_PSCR_PSCOUNT_Pos (0UL)
  #define ETR_PSCR_PSCOUNT_Msk (0x1FUL << ETR_PSCR_PSCOUNT_Pos)


/* ETR_ITATBMCTR0: Integration Test ATB Master Interface Control 0 Register */
  #define ETR_ITATBMCTR0_ResetValue (0x00000000UL)

/* ATVALIDM @Bit 0 : Set the value of ATVALIDM output */
  #define ETR_ITATBMCTR0_ATVALIDM_Pos (0UL)
  #define ETR_ITATBMCTR0_ATVALIDM_Msk (0x1UL << ETR_ITATBMCTR0_ATVALIDM_Pos)

/* AFREADYM @Bit 1 : Set the value of AFREADYM output */
  #define ETR_ITATBMCTR0_AFREADYM_Pos (1UL)
  #define ETR_ITATBMCTR0_AFREADYM_Msk (0x1UL << ETR_ITATBMCTR0_AFREADYM_Pos)

/* ATBYTESM @Bits 8..9 : Control the value of ATBYTESM output from TMC. The value written to this field is driven on the
                         ATBYTESM output of the TMC. */

  #define ETR_ITATBMCTR0_ATBYTESM_Pos (8UL)
  #define ETR_ITATBMCTR0_ATBYTESM_Msk (0x3UL << ETR_ITATBMCTR0_ATBYTESM_Pos)


/* ETR_ITMISCOP0: Integration Test Miscellaneous Output Register 0 */
  #define ETR_ITMISCOP0_ResetValue (0x00000000UL)

/* ACQCOMP @Bit 0 : Set the value of the ACQCOMP output. */
  #define ETR_ITMISCOP0_ACQCOMP_Pos (0UL)
  #define ETR_ITMISCOP0_ACQCOMP_Msk (0x1UL << ETR_ITMISCOP0_ACQCOMP_Pos)

