pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* FULL @Bit 1 : Set the value of the FULL output. */
  #define ETR_ITMISCOP0_FULL_Pos (1UL)
  #define ETR_ITMISCOP0_FULL_Msk (0x1UL << ETR_ITMISCOP0_FULL_Pos)


/* ETR_ITTRFLIN: Integration Test Trigger In and Flush In Register */
  #define ETR_ITTRFLIN_ResetValue (0x00000000UL)

/* TRIGIN @Bit 0 : Read the value of the TRIGIN input. */
  #define ETR_ITTRFLIN_TRIGIN_Pos (0UL)
  #define ETR_ITTRFLIN_TRIGIN_Msk (0x1UL << ETR_ITTRFLIN_TRIGIN_Pos)

/* FLUSHIN @Bit 1 : Read the value of the FLUSHIN input. */
  #define ETR_ITTRFLIN_FLUSHIN_Pos (1UL)
  #define ETR_ITTRFLIN_FLUSHIN_Msk (0x1UL << ETR_ITTRFLIN_FLUSHIN_Pos)


/* ETR_ITATBDATA0: Integration Test ATB Data Register 0 */
  #define ETR_ITATBDATA0_ResetValue (0x00000000UL)

/* ATDATASBIT0 @Bit 0 : Read the value of ATDATAS[0] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT0_Pos (0UL)
  #define ETR_ITATBDATA0_ATDATASBIT0_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT0_Pos)

/* ATDATASBIT7 @Bit 1 : Read the value of ATDATAS[7] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT7_Pos (1UL)
  #define ETR_ITATBDATA0_ATDATASBIT7_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT7_Pos)

/* ATDATASBIT15 @Bit 2 : Read the value of ATDATAS[15] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT15_Pos (2UL)
  #define ETR_ITATBDATA0_ATDATASBIT15_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT15_Pos)

/* ATDATASBIT23 @Bit 3 : Read the value of ATDATAS[23] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT23_Pos (3UL)
  #define ETR_ITATBDATA0_ATDATASBIT23_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT23_Pos)

/* ATDATASBIT31 @Bit 4 : Read the value of ATDATAS[31] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT31_Pos (4UL)
  #define ETR_ITATBDATA0_ATDATASBIT31_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT31_Pos)

/* ATDATASBIT39 @Bit 5 : Read the value of ATDATAS[39] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT39_Pos (5UL)
  #define ETR_ITATBDATA0_ATDATASBIT39_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT39_Pos)

/* ATDATASBIT47 @Bit 6 : Read the value of ATDATAS[47] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT47_Pos (6UL)
  #define ETR_ITATBDATA0_ATDATASBIT47_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT47_Pos)

/* ATDATASBIT55 @Bit 7 : Read the value of ATDATAS[55] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT55_Pos (7UL)
  #define ETR_ITATBDATA0_ATDATASBIT55_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT55_Pos)

/* ATDATASBIT63 @Bit 8 : Read the value of ATDATAS[63] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT63_Pos (8UL)
  #define ETR_ITATBDATA0_ATDATASBIT63_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT63_Pos)

/* ATDATASBIT71 @Bit 9 : Read the value of ATDATAS[71] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT71_Pos (9UL)
  #define ETR_ITATBDATA0_ATDATASBIT71_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT71_Pos)

/* ATDATASBIT79 @Bit 10 : Read the value of ATDATAS[79] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT79_Pos (10UL)
  #define ETR_ITATBDATA0_ATDATASBIT79_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT79_Pos)

/* ATDATASBIT87 @Bit 11 : Read the value of ATDATAS[87] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT87_Pos (11UL)
  #define ETR_ITATBDATA0_ATDATASBIT87_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT87_Pos)

/* ATDATASBIT95 @Bit 12 : Read the value of ATDATAS[95] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT95_Pos (12UL)
  #define ETR_ITATBDATA0_ATDATASBIT95_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT95_Pos)

/* ATDATASBIT103 @Bit 13 : Read the value of ATDATAS[103] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT103_Pos (13UL)
  #define ETR_ITATBDATA0_ATDATASBIT103_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT103_Pos)

/* ATDATASBIT111 @Bit 14 : Read the value of ATDATAS[111] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT111_Pos (14UL)
  #define ETR_ITATBDATA0_ATDATASBIT111_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT111_Pos)

/* ATDATASBIT119 @Bit 15 : Read the value of ATDATAS[119] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT119_Pos (15UL)
  #define ETR_ITATBDATA0_ATDATASBIT119_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT119_Pos)

/* ATDATASBIT127 @Bit 16 : Read the value of ATDATAS[127] input to TMC */
  #define ETR_ITATBDATA0_ATDATASBIT127_Pos (16UL)
  #define ETR_ITATBDATA0_ATDATASBIT127_Msk (0x1UL << ETR_ITATBDATA0_ATDATASBIT127_Pos)


/* ETR_ITATBCTR2: Integration Test ATB Control 2 Register */
  #define ETR_ITATBCTR2_ResetValue (0x00000000UL)

/* ATREADYS @Bit 0 : Set the value of ATREADYS output */
  #define ETR_ITATBCTR2_ATREADYS_Pos (0UL)
  #define ETR_ITATBCTR2_ATREADYS_Msk (0x1UL << ETR_ITATBCTR2_ATREADYS_Pos)

/* AFVALIDS @Bit 1 : Set the value of AFVALIDS output */
  #define ETR_ITATBCTR2_AFVALIDS_Pos (1UL)
  #define ETR_ITATBCTR2_AFVALIDS_Msk (0x1UL << ETR_ITATBCTR2_AFVALIDS_Pos)

/* SYNCREQS @Bit 2 : Set the value of SYNCREQS output */
  #define ETR_ITATBCTR2_SYNCREQS_Pos (2UL)
  #define ETR_ITATBCTR2_SYNCREQS_Msk (0x1UL << ETR_ITATBCTR2_SYNCREQS_Pos)


/* ETR_ITATBCTR1: Integration Test ATB Control 1 Register */
  #define ETR_ITATBCTR1_ResetValue (0x00000000UL)

/* ATIDS @Bits 0..6 : Read the value of ATIDS input to TMC */
  #define ETR_ITATBCTR1_ATIDS_Pos (0UL)
  #define ETR_ITATBCTR1_ATIDS_Msk (0x7FUL << ETR_ITATBCTR1_ATIDS_Pos)


/* ETR_ITATBCTR0: Integration Test ATB Control 0 Register */
  #define ETR_ITATBCTR0_ResetValue (0x00000000UL)

/* ATVALIDS @Bit 0 : Read the value of ATVALIDS input to TMC */
  #define ETR_ITATBCTR0_ATVALIDS_Pos (0UL)
  #define ETR_ITATBCTR0_ATVALIDS_Msk (0x1UL << ETR_ITATBCTR0_ATVALIDS_Pos)

/* AFREADYS @Bit 1 : Read the value of AFREADYS input to TMC */
  #define ETR_ITATBCTR0_AFREADYS_Pos (1UL)
  #define ETR_ITATBCTR0_AFREADYS_Msk (0x1UL << ETR_ITATBCTR0_AFREADYS_Pos)

/* ATBYTESS @Bits 8..9 : Read the value of ATBYTESS input to TMC */
  #define ETR_ITATBCTR0_ATBYTESS_Pos (8UL)
  #define ETR_ITATBCTR0_ATBYTESS_Msk (0x3UL << ETR_ITATBCTR0_ATBYTESS_Pos)


/* ETR_ITCTRL: Integration Mode Control Register */
  #define ETR_ITCTRL_ResetValue (0x00000000UL)

/* INTEGRATION_MODE @Bit 0 : Allows the component to switch from functional mode to integration mode or back. */
  #define ETR_ITCTRL_INTEGRATION_MODE_Pos (0UL)
  #define ETR_ITCTRL_INTEGRATION_MODE_Msk (0x1UL << ETR_ITCTRL_INTEGRATION_MODE_Pos)


