pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ETR_CLAIMSET: Claim Tag Set Register */
  #define ETR_CLAIMSET_ResetValue (0x0000000FUL)

/* CLAIMSET @Bits 0..3 : This claim tag bit is implemented */
  #define ETR_CLAIMSET_CLAIMSET_Pos (0UL)
  #define ETR_CLAIMSET_CLAIMSET_Msk (0xFUL << ETR_CLAIMSET_CLAIMSET_Pos)


/* ETR_CLAIMCLR: Claim Tag Clear Register */
  #define ETR_CLAIMCLR_ResetValue (0x00000000UL)

/* CLAIMCLR @Bits 0..3 : The value present reflects the current setting of the Claim Tag. */
  #define ETR_CLAIMCLR_CLAIMCLR_Pos (0UL)
  #define ETR_CLAIMCLR_CLAIMCLR_Msk (0xFUL << ETR_CLAIMCLR_CLAIMCLR_Pos)


/* ETR_LAR: Lock Access Register */
  #define ETR_LAR_ResetValue (0x00000000UL)

/* ACCESS_W @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. A write of any value other than
                          0xC5ACCE55 will have the affect of removing write access. */

  #define ETR_LAR_ACCESS_W_Pos (0UL)
  #define ETR_LAR_ACCESS_W_Msk (0xFFFFFFFFUL << ETR_LAR_ACCESS_W_Pos)


/* ETR_LSR: Lock Status Register */
  #define ETR_LSR_ResetValue (0x00000003UL)

/* LOCKEXIST @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define ETR_LSR_LOCKEXIST_Pos (0UL)
  #define ETR_LSR_LOCKEXIST_Msk (0x1UL << ETR_LSR_LOCKEXIST_Pos)

/* LOCKGRANT @Bit 1 : Returns the current status of the Lock. */
  #define ETR_LSR_LOCKGRANT_Pos (1UL)
  #define ETR_LSR_LOCKGRANT_Msk (0x1UL << ETR_LSR_LOCKGRANT_Pos)

/* LOCKTYPE @Bit 2 : Indicates if the Lock Access Register (0xFB0) is implemented as 8-bit or 32-bit */
  #define ETR_LSR_LOCKTYPE_Pos (2UL)
  #define ETR_LSR_LOCKTYPE_Msk (0x1UL << ETR_LSR_LOCKTYPE_Pos)
  #define ETR_LSR_LOCKTYPE_Min (0x0UL)
  #define ETR_LSR_LOCKTYPE_Max (0x0UL)
  #define ETR_LSR_LOCKTYPE_32BIT (0x0UL)


/* ETR_AUTHSTATUS: Authentication Status Register */
  #define ETR_AUTHSTATUS_ResetValue (0x00000000UL)

/* NSID @Bits 0..1 : Indicates the security level for non-secure invasive debug */
  #define ETR_AUTHSTATUS_NSID_Pos (0UL)
  #define ETR_AUTHSTATUS_NSID_Msk (0x3UL << ETR_AUTHSTATUS_NSID_Pos)
  #define ETR_AUTHSTATUS_NSID_Min (0x2UL)
  #define ETR_AUTHSTATUS_NSID_Max (0x3UL)
  #define ETR_AUTHSTATUS_NSID_DISABLED (0x2UL)
  #define ETR_AUTHSTATUS_NSID_ENABLED (0x3UL)

/* NSNID @Bits 2..3 : Indicates the security level for non-secure non-invasive debug */
  #define ETR_AUTHSTATUS_NSNID_Pos (2UL)
  #define ETR_AUTHSTATUS_NSNID_Msk (0x3UL << ETR_AUTHSTATUS_NSNID_Pos)
  #define ETR_AUTHSTATUS_NSNID_Min (0x0UL)
  #define ETR_AUTHSTATUS_NSNID_Max (0x0UL)
  #define ETR_AUTHSTATUS_NSNID_NONE (0x0UL)

/* SID @Bits 4..5 : Indicates the security level for secure invasive debug */
  #define ETR_AUTHSTATUS_SID_Pos (4UL)
  #define ETR_AUTHSTATUS_SID_Msk (0x3UL << ETR_AUTHSTATUS_SID_Pos)
  #define ETR_AUTHSTATUS_SID_Min (0x2UL)
  #define ETR_AUTHSTATUS_SID_Max (0x3UL)
  #define ETR_AUTHSTATUS_SID_DISABLED (0x2UL)        /*!< Functionality disabled. This return value occurs when DBGEN is LOW or
                                                          SPIDEN is LOW.*/
  #define ETR_AUTHSTATUS_SID_ENABLED (0x3UL)         /*!< Functionality enabled. This return value occurs when DBGEN and SPIDEN
                                                          are HIGH.*/

/* SNID @Bits 6..7 : Indicates the security level for secure non-invasive debug */
  #define ETR_AUTHSTATUS_SNID_Pos (6UL)
  #define ETR_AUTHSTATUS_SNID_Msk (0x3UL << ETR_AUTHSTATUS_SNID_Pos)
  #define ETR_AUTHSTATUS_SNID_Min (0x0UL)
  #define ETR_AUTHSTATUS_SNID_Max (0x0UL)
  #define ETR_AUTHSTATUS_SNID_NONE (0x0UL)


/* ETR_DEVID: Device Configuration Register */
  #define ETR_DEVID_ResetValue (0x00000300UL)

/* ATBINPORTCOUNT @Bits 0..4 : This value indicates the type/number of ATB multiplexing present on the input ATB. */
  #define ETR_DEVID_ATBINPORTCOUNT_Pos (0UL)
  #define ETR_DEVID_ATBINPORTCOUNT_Msk (0x1FUL << ETR_DEVID_ATBINPORTCOUNT_Pos)

/* CLKSCHEME @Bit 5 : This value indicates the TMC RAM clocking scheme used, ie. whether the TMC RAM operates synchronously or
                      asynchronously to CLK. */

  #define ETR_DEVID_CLKSCHEME_Pos (5UL)
  #define ETR_DEVID_CLKSCHEME_Msk (0x1UL << ETR_DEVID_CLKSCHEME_Pos)
  #define ETR_DEVID_CLKSCHEME_Min (0x0UL)
  #define ETR_DEVID_CLKSCHEME_Max (0x0UL)
  #define ETR_DEVID_CLKSCHEME_SYNC (0x0UL)

/* CONFIGTYPE @Bits 6..7 : This value indicates TMC configuration type. */
  #define ETR_DEVID_CONFIGTYPE_Pos (6UL)
  #define ETR_DEVID_CONFIGTYPE_Msk (0x3UL << ETR_DEVID_CONFIGTYPE_Pos)
  #define ETR_DEVID_CONFIGTYPE_Min (0x0UL)
  #define ETR_DEVID_CONFIGTYPE_Max (0x2UL)
  #define ETR_DEVID_CONFIGTYPE_ETB (0x0UL)
  #define ETR_DEVID_CONFIGTYPE_ETR (0x1UL)
  #define ETR_DEVID_CONFIGTYPE_ETF (0x2UL)

/* MEMWIDTH @Bits 8..10 : This value indicates the width of the Memory interface databus. */
  #define ETR_DEVID_MEMWIDTH_Pos (8UL)
  #define ETR_DEVID_MEMWIDTH_Msk (0x7UL << ETR_DEVID_MEMWIDTH_Pos)
  #define ETR_DEVID_MEMWIDTH_Min (0x2UL)
  #define ETR_DEVID_MEMWIDTH_Max (0x5UL)
  #define ETR_DEVID_MEMWIDTH_32BIT (0x2UL)
  #define ETR_DEVID_MEMWIDTH_64BIT (0x3UL)
  #define ETR_DEVID_MEMWIDTH_128BIT (0x4UL)
  #define ETR_DEVID_MEMWIDTH_256BIT (0x5UL)

/* WBUF_DEPTH @Bits 11..13 : This value indicates, in powers of two, the number of entries in the Write buffer. Each entry is of
                             size ATB_DATA_WIDTH. */

  #define ETR_DEVID_WBUF_DEPTH_Pos (11UL)
  #define ETR_DEVID_WBUF_DEPTH_Msk (0x7UL << ETR_DEVID_WBUF_DEPTH_Pos)
  #define ETR_DEVID_WBUF_DEPTH_Min (0x2UL)
  #define ETR_DEVID_WBUF_DEPTH_Max (0x5UL)
  #define ETR_DEVID_WBUF_DEPTH_4ENTRIES (0x2UL)
  #define ETR_DEVID_WBUF_DEPTH_8ENTRIES (0x3UL)
  #define ETR_DEVID_WBUF_DEPTH_16ENTRIES (0x4UL)
  #define ETR_DEVID_WBUF_DEPTH_32ENTRIES (0x5UL)


/* ETR_DEVTYPE: Device Type Identifier Register */
  #define ETR_DEVTYPE_ResetValue (0x00000021UL)

/* MAJOR_TYPE @Bits 0..3 : Major classification grouping for this debug/trace component */
  #define ETR_DEVTYPE_MAJOR_TYPE_Pos (0UL)
  #define ETR_DEVTYPE_MAJOR_TYPE_Msk (0xFUL << ETR_DEVTYPE_MAJOR_TYPE_Pos)
  #define ETR_DEVTYPE_MAJOR_TYPE_Min (0x1UL)
  #define ETR_DEVTYPE_MAJOR_TYPE_Max (0x1UL)
  #define ETR_DEVTYPE_MAJOR_TYPE_SINK (0x1UL)

/* SUB_TYPE @Bits 4..7 : Sub-classification within the major category */
  #define ETR_DEVTYPE_SUB_TYPE_Pos (4UL)
  #define ETR_DEVTYPE_SUB_TYPE_Msk (0xFUL << ETR_DEVTYPE_SUB_TYPE_Pos)
  #define ETR_DEVTYPE_SUB_TYPE_Min (0x2UL)
  #define ETR_DEVTYPE_SUB_TYPE_Max (0x2UL)
  #define ETR_DEVTYPE_SUB_TYPE (0x2UL)               /*!< This component captures the trace data into RAM that can be drained
                                                          through APB.*/


/* ETR_PERIPHID4: Peripheral ID4 Register */
  #define ETR_PERIPHID4_ResetValue (0x00000004UL)

/* JEP106_CONT @Bits 0..3 : JEDEC continuation code indicating the designer of the component (along with the identity code) */
  #define ETR_PERIPHID4_JEP106_CONT_Pos (0UL)
  #define ETR_PERIPHID4_JEP106_CONT_Msk (0xFUL << ETR_PERIPHID4_JEP106_CONT_Pos)

/* FOURKB_COUNT @Bits 4..7 : This is a 4-bit value that indicates the total contiguous size of the memory window used by this
                             component in powers of 2 from the standard 4KB. If a component only requires the standard 4KB then
                             this should read as 0x0, 4KB only, for 8KB set to 0x1, 16KB == 0x2, 32KB == 0x3, and so on. */

  #define ETR_PERIPHID4_FOURKB_COUNT_Pos (4UL)
  #define ETR_PERIPHID4_FOURKB_COUNT_Msk (0xFUL << ETR_PERIPHID4_FOURKB_COUNT_Pos)


