pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EXMIF_CORE_SSICADDRESS_CTRLR0: This register controls the serial data transfer. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_ResetValue (0x00004007UL)

/* DFS @Bits 0..4 : Data Frame Size. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Pos)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_Max (0x1FUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_01_BIT (0x00UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_02_BIT (0x01UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_03_BIT (0x02UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_04_BIT (0x03UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_05_BIT (0x04UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_06_BIT (0x05UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_07_BIT (0x06UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_08_BIT (0x07UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_09_BIT (0x08UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_10_BIT (0x09UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_11_BIT (0x0AUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_12_BIT (0x0BUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_13_BIT (0x0CUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_14_BIT (0x0DUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_15_BIT (0x0EUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_16_BIT (0x0FUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_17_BIT (0x10UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_18_BIT (0x11UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_19_BIT (0x12UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_20_BIT (0x13UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_21_BIT (0x14UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_22_BIT (0x15UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_23_BIT (0x16UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_24_BIT (0x17UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_25_BIT (0x18UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_26_BIT (0x19UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_27_BIT (0x1AUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_28_BIT (0x1BUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_29_BIT (0x1CUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_30_BIT (0x1DUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_31_BIT (0x1EUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_DFS_DFS_32_BIT (0x1FUL)

/* FRF @Bits 6..7 : Frame Format. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Pos (6UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Pos)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_Max (0x2UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_SPI (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_SSP (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_FRF_MICROWIRE (0x2UL)

/* SCPH @Bit 8 : Serial Clock Phase. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Pos (8UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Pos)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_MIDDLE_BIT (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPH_START_BIT (0x1UL)

/* SCPOL @Bit 9 : Serial Clock Polarity. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Pos (9UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Pos) /*!< Bit mask of SCPOL
                                                                            field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_INACTIVE_HIGH (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SCPOL_INACTIVE_LOW (0x1UL)

/* TMOD @Bits 10..11 : Transfer Mode. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Pos (10UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Pos)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_Max (0x3UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_TX_AND_RX (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_TX_ONLY (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_RX_ONLY (0x2UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_TMOD_EEPROM_READ (0x3UL)

/* SLVOE @Bit 12 : Slave Output Enable. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Pos (12UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Pos) /*!< Bit mask of SLVOE
                                                                            field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_ENABLED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SLVOE_DISABLED (0x1UL)

/* SRL @Bit 13 : Shift Register Loop. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Pos (13UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Pos)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_NORMAL_MODE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SRL_TESTING_MODE (0x1UL)

/* SSTE @Bit 14 : Slave Select Toggle Enable. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Pos (14UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Pos)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_TOGGLE_DISABLE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSTE_TOGGLE_EN (0x1UL)

/* CFS @Bits 16..19 : Control Frame Size. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Pos (16UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Msk (0xFUL << EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Pos)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_Max (0xFUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_01_BIT (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_02_BIT (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_03_BIT (0x2UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_04_BIT (0x3UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_05_BIT (0x4UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_06_BIT (0x5UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_07_BIT (0x6UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_08_BIT (0x7UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_09_BIT (0x8UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_10_BIT (0x9UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_11_BIT (0xAUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_12_BIT (0xBUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_13_BIT (0xCUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_14_BIT (0xDUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_15_BIT (0xEUL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_CFS_SIZE_16_BIT (0xFUL)

