pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SPIFRF @Bits 22..23 : SPI Frame Format */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_Pos (22UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_Pos) /*!< Bit mask of SPIFRF
                                                                            field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_Max (0x3UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_SPI_STANDARD (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_SPI_DUAL (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_SPI_QUAD (0x2UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIFRF_SPI_OCTAL (0x3UL)

/* SPIHYPERBUSEN @Bit 24 : SPI Hyperbus Frame format enable. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIHYPERBUSEN_Pos (24UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIHYPERBUSEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SPIHYPERBUSEN_Pos) /*!< Bit
                                                                            mask of SPIHYPERBUSEN field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIHYPERBUSEN_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIHYPERBUSEN_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIHYPERBUSEN_DISABLE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIHYPERBUSEN_ENABLE (0x1UL)

/* SPIDWSEN @Bit 25 : Enable Dynamic wait states in SPI mode of operation. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIDWSEN_Pos (25UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIDWSEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SPIDWSEN_Pos) /*!< Bit mask of
                                                                            SPIDWSEN field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIDWSEN_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIDWSEN_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIDWSEN_DISABLE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SPIDWSEN_ENABLE (0x1UL)

/* SSIISMST @Bit 31 : This field selects if DWC_ssi is working in Master or Slave mode */
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSIISMST_Pos (31UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSIISMST_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_CTRLR0_SSIISMST_Pos) /*!< Bit mask of
                                                                            SSIISMST field.*/
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSIISMST_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSIISMST_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSIISMST_SLAVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR0_SSIISMST_MASTER (0x1UL)


/* EXMIF_CORE_SSICADDRESS_CTRLR1: This register exists only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR1_ResetValue (0x00000000UL)

/* NDF @Bits 0..15 : Number of Data Frames. */
  #define EXMIF_CORE_SSICADDRESS_CTRLR1_NDF_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_CTRLR1_NDF_Msk (0xFFFFUL << EXMIF_CORE_SSICADDRESS_CTRLR1_NDF_Pos)


/* EXMIF_CORE_SSICADDRESS_SSIENR: This register enables and disables the DWC_ssi. */
  #define EXMIF_CORE_SSICADDRESS_SSIENR_ResetValue (0x00000000UL)

/* SSICEN @Bit 0 : SSI Enable. */
  #define EXMIF_CORE_SSICADDRESS_SSIENR_SSICEN_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_SSIENR_SSICEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SSIENR_SSICEN_Pos) /*!< Bit mask of SSICEN
                                                                            field.*/
  #define EXMIF_CORE_SSICADDRESS_SSIENR_SSICEN_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SSIENR_SSICEN_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SSIENR_SSICEN_DISABLE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SSIENR_SSICEN_ENABLED (0x1UL)


/* EXMIF_CORE_SSICADDRESS_MWCR: This register controls the direction of the data word for the half-duplex Microwire serial
                                 protocol. */

  #define EXMIF_CORE_SSICADDRESS_MWCR_ResetValue (0x00000000UL)

/* MWMOD @Bit 0 : Microwire Transfer Mode. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Pos)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_NON_SEQUENTIAL (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MWMOD_SEQUENTIAL (0x1UL)

/* MDD @Bit 1 : Microwire Control. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Pos (1UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MDD_Pos)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_RECEIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MDD_TRANSMIT (0x1UL)

/* MHS @Bit 2 : Microwire Handshaking. */
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Pos (2UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MWCR_MHS_Pos)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_DISABLE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_MWCR_MHS_ENABLED (0x1UL)


/* EXMIF_CORE_SSICADDRESS_SER: This register is valid only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_SER_ResetValue (0x00000000UL)

/* SER @Bits 0..1 : Slave Select Enable Flag. */
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SER_SER_Pos)
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SER_SER_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SER_SER_NOTSELECTED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SER_SER_SELECTED (0x1UL)


/* EXMIF_CORE_SSICADDRESS_BAUDR: This register is valid only when the DWC_ssi is configured as a master device. */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_ResetValue (0x00000000UL)

/* SCKDV @Bits 1..15 : SSI Clock Divider. */
  #define EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Pos (1UL)
  #define EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Msk (0x7FFFUL << EXMIF_CORE_SSICADDRESS_BAUDR_SCKDV_Pos) /*!< Bit mask of SCKDV
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_TXFTLR: This register controls the threshold value for the transmit FIFO memory.. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_ResetValue (0x00000000UL)

/* TFT @Bits 0..4 : Transmit FIFO Threshold. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_TXFTLR_TFT_Pos)

/* TXFTHR @Bits 16..20 : Transfer start FIFO level. */
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Pos (16UL)
  #define EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_TXFTLR_TXFTHR_Pos) /*!< Bit mask of TXFTHR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_RXFTLR: This register controls the threshold value for the receive FIFO memory.. */
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_ResetValue (0x00000000UL)

/* RFT @Bits 0..4 : Receive FIFO Threshold. */
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_RXFTLR_RFT_Pos)


