pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EXMIF_CORE_SSICADDRESS_TXFLR: This register contains the number of valid data entries in the transmit FIFO memory. */
  #define EXMIF_CORE_SSICADDRESS_TXFLR_ResetValue (0x00000000UL)

/* TXTFL @Bits 0..5 : Transmit FIFO Level. */
  #define EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Msk (0x3FUL << EXMIF_CORE_SSICADDRESS_TXFLR_TXTFL_Pos) /*!< Bit mask of TXTFL
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_RXFLR: This register contains the number of valid data entries in the receive FIFO memory. */
  #define EXMIF_CORE_SSICADDRESS_RXFLR_ResetValue (0x00000000UL)

/* RXTFL @Bits 0..5 : Receive FIFO Level. */
  #define EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Msk (0x3FUL << EXMIF_CORE_SSICADDRESS_RXFLR_RXTFL_Pos) /*!< Bit mask of RXTFL
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_SR: This is a read-only register used to indicate the current transfer status, FIFO status, and any
                               transmission/reception errors that may have occurred. */

  #define EXMIF_CORE_SSICADDRESS_SR_ResetValue (0x00000006UL)

/* BUSY @Bit 0 : SSI Busy Flag. */
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_BUSY_Pos)
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_BUSY_ACTIVE (0x1UL)

/* TFNF @Bit 1 : Transmit FIFO Not Full. */
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Pos (1UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TFNF_Pos)
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_FULL (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TFNF_NOT_FULL (0x1UL)

/* TFE @Bit 2 : Transmit FIFO Empty. */
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Pos (2UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TFE_Pos)
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_NOT_EMPTY (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TFE_EMPTY (0x1UL)

/* RFNE @Bit 3 : Receive FIFO Not Empty. */
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Pos (3UL)
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_RFNE_Pos)
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_EMPTY (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_RFNE_NOT_EMPTY (0x1UL)

/* RFF @Bit 4 : Receive FIFO Full. */
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Pos (4UL)
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_RFF_Pos)
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_NOT_FULL (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_RFF_FULL (0x1UL)

/* TXE @Bit 5 : Transmission Error. */
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Pos (5UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_TXE_Pos)
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_NO_ERROR (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_TXE_TX_ERROR (0x1UL)

/* DCOL @Bit 6 : Data Collision Error. */
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Pos (6UL)
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SR_DCOL_Pos)
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_NO_ERROR_CONDITION (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SR_DCOL_TX_COLLISION_ERROR (0x1UL)


/* EXMIF_CORE_SSICADDRESS_IMR: This read/write register masks or enables all interrupts generated by the DWC_ssi. */
  #define EXMIF_CORE_SSICADDRESS_IMR_ResetValue (0x000000FFUL)

/* TXEIM @Bit 0 : Transmit FIFO Empty Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXEIM_UNMASKED (0x1UL)

/* TXOIM @Bit 1 : Transmit FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Pos (1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXOIM_UNMASKED (0x1UL)

/* RXUIM @Bit 2 : Receive FIFO Underflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Pos (2UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXUIM_UNMASKED (0x1UL)

/* RXOIM @Bit 3 : Receive FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Pos (3UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXOIM_UNMASKED (0x1UL)

/* RXFIM @Bit 4 : Receive FIFO Full Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Pos (4UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_RXFIM_UNMASKED (0x1UL)

