pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MSTIM @Bit 5 : Multi-Master Contention Interrupt Mask. */
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Pos (5UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_MSTIM_UNMASKED (0x1UL)

/* XRXOIM @Bit 6 : XIP Receive FIFO Overflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Pos (6UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_XRXOIM_UNMASKED (0x1UL)

/* TXUIM @Bit 7 : Transmit FIFO Underflow Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Pos (7UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_TXUIM_UNMASKED (0x1UL)

/* DONEM @Bit 11 : SSI Done Interrupt Mask */
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Pos (11UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_IMR_DONEM_Pos)
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_MASKED (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_IMR_DONEM_UNMASKED (0x1UL)


/* EXMIF_CORE_SSICADDRESS_ISR: This register reports the status of the DWC_ssi interrupts after they have been masked. */
  #define EXMIF_CORE_SSICADDRESS_ISR_ResetValue (0x00000000UL)

/* TXEIS @Bit 0 : Transmit FIFO Empty Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXEIS_ACTIVE (0x1UL)

/* TXOIS @Bit 1 : Transmit FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Pos (1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXOIS_ACTIVE (0x1UL)

/* RXUIS @Bit 2 : Receive FIFO Underflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Pos (2UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXUIS_ACTIVE (0x1UL)

/* RXOIS @Bit 3 : Receive FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Pos (3UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXOIS_ACTIVE (0x1UL)

/* RXFIS @Bit 4 : Receive FIFO Full Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Pos (4UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_RXFIS_ACTIVE (0x1UL)

/* MSTIS @Bit 5 : Multi-Master Contention Interrupt Status. */
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Pos (5UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_MSTIS_ACTIVE (0x1UL)

/* XRXOIS @Bit 6 : XIP Receive FIFO Overflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Pos (6UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_XRXOIS_ACTIVE (0x1UL)

/* TXUIS @Bit 7 : Transmit FIFO Underflow Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Pos (7UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_TXUIS_ACTIVE (0x1UL)

/* DONES @Bit 11 : SSI Done Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Pos (11UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ISR_DONES_Pos)
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_ISR_DONES_ACTIVE (0x1UL)


/* EXMIF_CORE_SSICADDRESS_RISR: Raw Interrupt Status Register */
  #define EXMIF_CORE_SSICADDRESS_RISR_ResetValue (0x00000000UL)

/* TXEIR @Bit 0 : Transmit FIFO Empty Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Pos)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXEIR_ACTIVE (0x1UL)

/* TXOIR @Bit 1 : Transmit FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Pos (1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Pos)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXOIR_ACTIVE (0x1UL)

/* RXUIR @Bit 2 : Receive FIFO Underflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Pos (2UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Pos)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXUIR_ACTIVE (0x1UL)

/* RXOIR @Bit 3 : Receive FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Pos (3UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Pos)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXOIR_ACTIVE (0x1UL)

/* RXFIR @Bit 4 : Receive FIFO Full Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Pos (4UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Pos)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_RXFIR_ACTIVE (0x1UL)

