pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MSTIR @Bit 5 : Multi-Master Contention Raw Interrupt Status. */
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Pos (5UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Pos)
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_MSTIR_ACTIVE (0x1UL)

/* XRXOIR @Bit 6 : XIP Receive FIFO Overflow Raw Interrupt Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Pos (6UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Pos) /*!< Bit mask of XRXOIR
                                                                            field.*/
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_XRXOIR_ACTIVE (0x1UL)

/* TXUIR @Bit 7 : Transmit FIFO Underflow Interrupt Raw Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Pos (7UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Pos)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_TXUIR_ACTIVE (0x1UL)

/* DONER @Bit 11 : SSI Done Interrupt Raw Status */
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_Pos (11UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RISR_DONER_Pos)
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_Max (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_INACTIVE (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_RISR_DONER_ACTIVE (0x1UL)


/* EXMIF_CORE_SSICADDRESS_TXEICR: Transmit FIFO Error Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_TXEICR_ResetValue (0x00000000UL)

/* TXEICR @Bit 0 : Clear Transmit FIFO Overflow/Underflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_TXEICR_TXEICR_Pos) /*!< Bit mask of TXEICR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_RXOICR: Receive FIFO Overflow Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_RXOICR_ResetValue (0x00000000UL)

/* RXOICR @Bit 0 : Clear Receive FIFO Overflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXOICR_RXOICR_Pos) /*!< Bit mask of RXOICR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_RXUICR: Receive FIFO Underflow Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_RXUICR_ResetValue (0x00000000UL)

/* RXUICR @Bit 0 : Clear Receive FIFO Underflow Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXUICR_RXUICR_Pos) /*!< Bit mask of RXUICR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_MSTICR: Multi-Master Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_ResetValue (0x00000000UL)

/* MSTICR @Bit 0 : Clear Multi-Master Contention Interrupt. */
  #define EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_MSTICR_MSTICR_Pos) /*!< Bit mask of MSTICR
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_ICR: Interrupt Clear Register */
  #define EXMIF_CORE_SSICADDRESS_ICR_ResetValue (0x00000000UL)

/* ICR @Bit 0 : Clear Interrupts. */
  #define EXMIF_CORE_SSICADDRESS_ICR_ICR_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_ICR_ICR_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_ICR_ICR_Pos)


/* EXMIF_CORE_SSICADDRESS_IDR: This register contains the peripherals identification code, which is written into the register at
                                configuration time using coreConsultant. */

  #define EXMIF_CORE_SSICADDRESS_IDR_ResetValue (0x00010003UL)

/* IDCODE @Bits 0..31 : Identification code. */
  #define EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_IDR_IDCODE_Pos) /*!< Bit mask of IDCODE
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_SSICVERSIONID: This read-only register stores the specific DWC_ssi component version. */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_ResetValue (0x3130332AUL)

/* SSICCOMPVERSION @Bits 0..31 : Contains the hex representation of the Synopsys component version. */
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_SSICVERSIONID_SSICCOMPVERSION_Pos)
                                                                            /*!< Bit mask of SSICCOMPVERSION field.*/


/* EXMIF_CORE_SSICADDRESS_DR: The DWC_ssi data register is a 32-bit read/write buffer for the transmit/receive FIFOs. */
  #define EXMIF_CORE_SSICADDRESS_DR_MaxCount (36UL)
  #define EXMIF_CORE_SSICADDRESS_DR_MaxIndex (35UL)
  #define EXMIF_CORE_SSICADDRESS_DR_MinIndex (0UL)
  #define EXMIF_CORE_SSICADDRESS_DR_ResetValue (0x00000000UL)

/* DR @Bits 0..31 : Data Register. */
  #define EXMIF_CORE_SSICADDRESS_DR_DR_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_DR_DR_Msk (0xFFFFFFFFUL << EXMIF_CORE_SSICADDRESS_DR_DR_Pos)


/* EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY: This register is only valid when the DWC_ssi is configured with rxd sample delay logic
                                          (SSIC_HAS_RX_SAMPLE_DELAY==1). */

  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_ResetValue (0x00000000UL)

