pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RSD @Bits 0..7 : Receive Data (rxd) Sample Delay. */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Msk (0xFFUL << EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_RSD_Pos) /*!< Bit mask of
                                                                            RSD field.*/

/* SE @Bit 16 : Receive Data (rxd) Sampling Edge. */
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Pos (16UL)
  #define EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_RXSAMPLEDELAY_SE_Pos) /*!< Bit mask of SE
                                                                            field.*/


/* EXMIF_CORE_SSICADDRESS_SPICTRLR0: This register is used to control the serial data transfer in enhanced SPI mode of
                                      operation. */

  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ResetValue (0x00000A00UL)

/* TRANSTYPE @Bits 0..1 : Address and instruction transfer format. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Pos (0UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Pos) /*!< Bit mask
                                                                            of TRANSTYPE field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_Max (0x3UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT0 (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT1 (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT2 (0x2UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_TRANSTYPE_TT3 (0x3UL)

/* ADDRL @Bits 2..5 : This bit defines Length of Address to be transmitted. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Pos (2UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Msk (0xFUL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Pos) /*!< Bit mask of
                                                                            ADDRL field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_Max (0xFUL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L0 (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L4 (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L8 (0x2UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L12 (0x3UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L16 (0x4UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L20 (0x5UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L24 (0x6UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L28 (0x7UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L32 (0x8UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L36 (0x9UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L40 (0xAUL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L44 (0xBUL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L48 (0xCUL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L52 (0xDUL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L56 (0xEUL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_ADDRL_ADDR_L60 (0xFUL)

/* XIPMDBITEN @Bit 7 : Mode bits enable in XIP mode. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Pos (7UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPMDBITEN_Pos) /*!< Bit
                                                                            mask of XIPMDBITEN field.*/

/* INSTL @Bits 8..9 : Dual/Quad/Octal mode instruction length in bits. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Pos (8UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Msk (0x3UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Pos) /*!< Bit mask of
                                                                            INSTL field.*/
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Min (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_Max (0x3UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L0 (0x0UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L4 (0x1UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L8 (0x2UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTL_INST_L16 (0x3UL)

/* WAITCYCLES @Bits 11..15 : Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Pos (11UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Msk (0x1FUL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_WAITCYCLES_Pos) /*!< Bit
                                                                            mask of WAITCYCLES field.*/

/* SPIDDREN @Bit 16 : SPI DDR Enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Pos (16UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIDDREN_Pos) /*!< Bit mask
                                                                            of SPIDDREN field.*/

/* INSTDDREN @Bit 17 : Instruction DDR Enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Pos (17UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_INSTDDREN_Pos) /*!< Bit mask
                                                                            of INSTDDREN field.*/

/* SPIRXDSEN @Bit 18 : Read data strobe enable bit. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Pos (18UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_SPIRXDSEN_Pos) /*!< Bit mask
                                                                            of SPIRXDSEN field.*/

/* XIPDFSHC @Bit 19 : Fix DFS for XIP transfers. */
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Pos (19UL)
  #define EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Msk (0x1UL << EXMIF_CORE_SSICADDRESS_SPICTRLR0_XIPDFSHC_Pos) /*!< Bit mask
                                                                            of XIPDFSHC field.*/

