pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MDBITSEN @Bit 12 : Mode bits enable in XIP mode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_MDBITSEN_Pos (12UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_MDBITSEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_MDBITSEN_Pos) /*!< Bit mask
                                                                            of MDBITSEN field.*/

/* WAITCYCLES @Bits 13..17 : Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_WAITCYCLES_Pos (13UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_WAITCYCLES_Msk (0x1FUL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_WAITCYCLES_Pos) /*!< Bit
                                                                            mask of WAITCYCLES field.*/

/* DFSHC @Bit 18 : Fix DFS for XIP transfers. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DFSHC_Pos (18UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DFSHC_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DFSHC_Pos) /*!< Bit mask of
                                                                            DFSHC field.*/

/* DDREN @Bit 19 : SPI DDR Enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DDREN_Pos (19UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DDREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_DDREN_Pos) /*!< Bit mask of
                                                                            DDREN field.*/

/* INSTDDREN @Bit 20 : Instruction DDR Enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTDDREN_Pos (20UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTDDREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTDDREN_Pos) /*!< Bit
                                                                            mask of INSTDDREN field.*/

/* RXDSEN @Bit 21 : Read data strobe enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSEN_Pos (21UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSEN_Pos) /*!< Bit mask of
                                                                            RXDSEN field.*/

/* INSTEN @Bit 22 : XIP instruction enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTEN_Pos (22UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_INSTEN_Pos) /*!< Bit mask of
                                                                            INSTEN field.*/

/* CONTXFEREN @Bit 23 : Enable continuous transfer in XIP mode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_CONTXFEREN_Pos (23UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_CONTXFEREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_CONTXFEREN_Pos) /*!< Bit
                                                                            mask of CONTXFEREN field.*/

/* XIPHYPERBUSEN @Bit 24 : SPI Hyperbus Frame format enable for XIP transfers. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPHYPERBUSEN_Pos (24UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPHYPERBUSEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPHYPERBUSEN_Pos)
                                                                            /*!< Bit mask of XIPHYPERBUSEN field.*/

/* RXDSSIGEN @Bit 25 : Enable rxds signaling during address and command phase of Hyperbus transfer. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSSIGEN_Pos (25UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSSIGEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_RXDSSIGEN_Pos) /*!< Bit
                                                                            mask of RXDSSIGEN field.*/

/* XIPMBL @Bits 26..27 : XIP Mode bits length. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Pos (26UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Pos) /*!< Bit mask of
                                                                            XIPMBL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Min (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_Max (0x3UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_MBL_2 (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_MBL_4 (0x1UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_MBL_8 (0x2UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPMBL_MBL_16 (0x3UL)

/* XIPPREFETCHEN @Bit 29 : Enables XIP pre-fetch functionality in DWC_ssi. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPPREFETCHEN_Pos (29UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPPREFETCHEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPCTRL_XIPPREFETCHEN_Pos)
                                                                            /*!< Bit mask of XIPPREFETCHEN field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XRXOICR: XIP Receive FIFO Overflow Interrupt Clear Register */
  #define EXMIF_CORE_SSICXIPADDRESS_XRXOICR_ResetValue (0x00000000UL)

/* XRXOICR @Bit 0 : Clear XIP Receive FIFO Overflow Interrupt. */
  #define EXMIF_CORE_SSICXIPADDRESS_XRXOICR_XRXOICR_Pos (0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XRXOICR_XRXOICR_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XRXOICR_XRXOICR_Pos) /*!< Bit mask
                                                                            of XRXOICR field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST: This Register is valid only when both SSIC_XIP_WRITE_REG_EN is set to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_ResetValue (0x00000000UL)

/* INCRWRITEINST @Bits 0..15 : XIP Write INCR transfer opcode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_INCRWRITEINST_Pos (0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_INCRWRITEINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_INCRWRITEINST_Pos)
                                                                            /*!< Bit mask of INCRWRITEINST field.*/

/* RSVDINCRINST16TO31 @Bits 16..31 : Reserved bits - Read Only */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_RSVDINCRINST16TO31_Pos (16UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_RSVDINCRINST16TO31_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITEINCRINST_RSVDINCRINST16TO31_Pos)
                                                                            /*!< Bit mask of RSVDINCRINST16TO31 field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST: This Register is valid only when both SSIC_XIP_WRITE_REG_EN is set to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_ResetValue (0x00000000UL)

/* WRAPWRITEINST @Bits 0..15 : XIP Write WRAP transfer opcode. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_WRAPWRITEINST_Pos (0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_WRAPWRITEINST_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_WRAPWRITEINST_Pos)
                                                                            /*!< Bit mask of WRAPWRITEINST field.*/

