pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RSVDWRAPINST16TO31 @Bits 16..31 : Reserved bits - Read Only */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_RSVDWRAPINST16TO31_Pos (16UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_RSVDWRAPINST16TO31_Msk (0xFFFFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITEWRAPINST_RSVDWRAPINST16TO31_Pos)
                                                                            /*!< Bit mask of RSVDWRAPINST16TO31 field.*/


/* EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL: This Register is valid only when SSIC_XIP_WRITE_REG_EN is equal to 1. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_ResetValue (0x00000002UL)

/* WRFRF @Bits 0..1 : SPI Frame Format */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Pos (0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Pos) /*!< Bit
                                                                            mask of WRFRF field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Min (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_Max (0x3UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_RSVD (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_SPI_DUAL (0x1UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_SPI_QUAD (0x2UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRFRF_SPI_OCTAL (0x3UL)

/* WRTRANSTYPE @Bits 2..3 : Address and instruction transfer format. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Pos (2UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Pos)
                                                                            /*!< Bit mask of WRTRANSTYPE field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Min (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_Max (0x3UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_TT0 (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_TT1 (0x1UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_TT2 (0x2UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRTRANSTYPE_TT3 (0x3UL)

/* WRADDRL @Bits 4..7 : This bit defines Length of Address to be transmitted. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Pos (4UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Msk (0xFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Pos) /*!<
                                                                            Bit mask of WRADDRL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Min (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_Max (0x8UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L0 (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L4 (0x1UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L8 (0x2UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L12 (0x3UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L16 (0x4UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L20 (0x5UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L24 (0x6UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L28 (0x7UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRADDRL_ADDR_L32 (0x8UL)

/* WRINSTL @Bits 8..9 : Dual/Quad/Octal mode instruction length in bits. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Pos (8UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Pos) /*!<
                                                                            Bit mask of WRINSTL field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Min (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_Max (0x3UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_INST_L0 (0x0UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_INST_L4 (0x1UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_INST_L8 (0x2UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTL_INST_L16 (0x3UL)

/* WRSPIDDREN @Bit 10 : SPI DDR Enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRSPIDDREN_Pos (10UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRSPIDDREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRSPIDDREN_Pos)
                                                                            /*!< Bit mask of WRSPIDDREN field.*/

/* WRINSTDDREN @Bit 11 : Instruction DDR Enable bit. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTDDREN_Pos (11UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTDDREN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_WRINSTDDREN_Pos)
                                                                            /*!< Bit mask of WRINSTDDREN field.*/

/* XIPWRHYPERBUSEN @Bit 12 : SPI Hyperbus Frame format enable for XIP Write transfers. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRHYPERBUSEN_Pos (12UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRHYPERBUSEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRHYPERBUSEN_Pos)
                                                                            /*!< Bit mask of XIPWRHYPERBUSEN field.*/

/* XIPWRRXDSSIGEN @Bit 13 : Enable rxds signaling during address and command phase of Hyperbus transfer. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRRXDSSIGEN_Pos (13UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRRXDSSIGEN_Msk (0x1UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRRXDSSIGEN_Pos)
                                                                            /*!< Bit mask of XIPWRRXDSSIGEN field.*/

/* RSVDXIPWRITECTRL14TO15 @Bits 14..15 : Reserved bits - Read Only */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL14TO15_Pos (14UL) /*!< Position of RSVDXIPWRITECTRL14TO15
                                                                            field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL14TO15_Msk (0x3UL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL14TO15_Pos)
                                                                            /*!< Bit mask of RSVDXIPWRITECTRL14TO15 field.*/

