pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* XIPWRWAITCYCLES @Bits 16..20 : Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception. */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRWAITCYCLES_Pos (16UL)
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRWAITCYCLES_Msk (0x1FUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_XIPWRWAITCYCLES_Pos)
                                                                            /*!< Bit mask of XIPWRWAITCYCLES field.*/

/* RSVDXIPWRITECTRL21TO31 @Bits 21..31 : Reserved bits - Read Only */
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL21TO31_Pos (21UL) /*!< Position of RSVDXIPWRITECTRL21TO31
                                                                            field.*/
  #define EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL21TO31_Msk (0x7FFUL << EXMIF_CORE_SSICXIPADDRESS_XIPWRITECTRL_RSVDXIPWRITECTRL21TO31_Pos)
                                                                            /*!< Bit mask of RSVDXIPWRITECTRL21TO31 field.*/



/* ==================================================== Struct EXMIF_CORE ==================================================== */
/**
  * @brief CORE [EXMIF_CORE] (unspecified)
  */
typedef struct {
  __IOM NRF_EXMIF_CORE_SSICADDRESS_Type SSICADDRESS;
  __IOM NRF_EXMIF_CORE_SSICXIPADDRESS_Type SSICXIPADDRESS;
} NRF_EXMIF_CORE_Type;

/* ====================================================== Struct EXMIF ======================================================= */
/**
  * @brief External Memory Interface
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED[3];
    __IOM uint32_t LOCKEDACCESS;                     /*!< (@ 0x00000014) Enable or disable locked APB access to serial memory
                                                                         controller.*/
    __IM uint32_t RESERVED1;
    __IOM uint32_t RESET;
    __IM uint32_t RESERVED2[56];
    __IOM uint32_t EVENTS_CORE;                      /*!< (@ 0x00000100) Event indicating that interrupt triggered at EXMIF
                                                                         core*/
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000104) Event indicating that the START task is completed and
                                                                         the EXMIF has started.*/
    __IM uint32_t RESERVED3[126];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED4[60];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_EXMIF_EXTCONF1_Type EXTCONF1;
      struct {
        __IM uint32_t RESERVED5[2];
        __IOM NRF_EXMIF_EXTCONF2_Type EXTCONF2;
      };
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
    __IM uint32_t RESERVED6[55];
    __IOM NRF_EXMIF_CORE_Type CORE;
  } NRF_EXMIF_Type;

/* EXMIF_TASKS_START: Start operation. */
  #define EXMIF_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start operation. */
  #define EXMIF_TASKS_START_TASKS_START_Pos (0UL)
  #define EXMIF_TASKS_START_TASKS_START_Msk (0x1UL << EXMIF_TASKS_START_TASKS_START_Pos)
  #define EXMIF_TASKS_START_TASKS_START_Min (0x1UL)
  #define EXMIF_TASKS_START_TASKS_START_Max (0x1UL)
  #define EXMIF_TASKS_START_TASKS_START_Trigger (0x1UL)


/* EXMIF_TASKS_STOP: Stop operation. */
  #define EXMIF_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop operation. */
  #define EXMIF_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define EXMIF_TASKS_STOP_TASKS_STOP_Msk (0x1UL << EXMIF_TASKS_STOP_TASKS_STOP_Pos)
  #define EXMIF_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define EXMIF_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define EXMIF_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* EXMIF_LOCKEDACCESS: Enable or disable locked APB access to serial memory controller. */
  #define EXMIF_LOCKEDACCESS_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable or disable locked APB access to SSI. */
  #define EXMIF_LOCKEDACCESS_ENABLE_Pos (0UL)
  #define EXMIF_LOCKEDACCESS_ENABLE_Msk (0x1UL << EXMIF_LOCKEDACCESS_ENABLE_Pos)
  #define EXMIF_LOCKEDACCESS_ENABLE_Min (0x0UL)
  #define EXMIF_LOCKEDACCESS_ENABLE_Max (0x1UL)
  #define EXMIF_LOCKEDACCESS_ENABLE_Disabled (0x0UL)
  #define EXMIF_LOCKEDACCESS_ENABLE_Enabled (0x1UL)


/* EXMIF_RESET: Reset the external memory. */
  #define EXMIF_RESET_ResetValue (0x00000000UL)

/* RESET @Bit 0 : (unspecified) */
  #define EXMIF_RESET_RESET_Pos (0UL)
  #define EXMIF_RESET_RESET_Msk (0x1UL << EXMIF_RESET_RESET_Pos)
  #define EXMIF_RESET_RESET_Min (0x0UL)
  #define EXMIF_RESET_RESET_Max (0x1UL)
  #define EXMIF_RESET_RESET_Clear (0x0UL)
  #define EXMIF_RESET_RESET_Set (0x1UL)


/* EXMIF_EVENTS_CORE: Event indicating that interrupt triggered at EXMIF core */
  #define EXMIF_EVENTS_CORE_ResetValue (0x00000000UL)

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at EXMIF core */
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Pos (0UL)
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << EXMIF_EVENTS_CORE_EVENTS_CORE_Pos)
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL)
  #define EXMIF_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL)


/* EXMIF_EVENTS_STARTED: Event indicating that the START task is completed and the EXMIF has started. */
  #define EXMIF_EVENTS_STARTED_ResetValue (0x00000000UL)

/* EVENTS_STARTED @Bit 0 : Event indicating that the START task is completed and the EXMIF has started. */
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL)
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << EXMIF_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL)
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL)
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL)
  #define EXMIF_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL)


/* EXMIF_INTEN: Enable or disable interrupt */
  #define EXMIF_INTEN_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define EXMIF_INTEN_CORE_Pos (0UL)
  #define EXMIF_INTEN_CORE_Msk (0x1UL << EXMIF_INTEN_CORE_Pos)
  #define EXMIF_INTEN_CORE_Min (0x0UL)
  #define EXMIF_INTEN_CORE_Max (0x1UL)
  #define EXMIF_INTEN_CORE_Disabled (0x0UL)
  #define EXMIF_INTEN_CORE_Enabled (0x1UL)

/* STARTED @Bit 1 : Enable or disable interrupt for event STARTED */
  #define EXMIF_INTEN_STARTED_Pos (1UL)
  #define EXMIF_INTEN_STARTED_Msk (0x1UL << EXMIF_INTEN_STARTED_Pos)
  #define EXMIF_INTEN_STARTED_Min (0x0UL)
  #define EXMIF_INTEN_STARTED_Max (0x1UL)
  #define EXMIF_INTEN_STARTED_Disabled (0x0UL)
  #define EXMIF_INTEN_STARTED_Enabled (0x1UL)


/* EXMIF_INTENSET: Enable interrupt */
  #define EXMIF_INTENSET_ResetValue (0x00000000UL)

