pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define EXMIF_INTENSET_CORE_Pos (0UL)
  #define EXMIF_INTENSET_CORE_Msk (0x1UL << EXMIF_INTENSET_CORE_Pos)
  #define EXMIF_INTENSET_CORE_Min (0x0UL)
  #define EXMIF_INTENSET_CORE_Max (0x1UL)
  #define EXMIF_INTENSET_CORE_Set (0x1UL)
  #define EXMIF_INTENSET_CORE_Disabled (0x0UL)
  #define EXMIF_INTENSET_CORE_Enabled (0x1UL)

/* STARTED @Bit 1 : Write '1' to enable interrupt for event STARTED */
  #define EXMIF_INTENSET_STARTED_Pos (1UL)
  #define EXMIF_INTENSET_STARTED_Msk (0x1UL << EXMIF_INTENSET_STARTED_Pos)
  #define EXMIF_INTENSET_STARTED_Min (0x0UL)
  #define EXMIF_INTENSET_STARTED_Max (0x1UL)
  #define EXMIF_INTENSET_STARTED_Set (0x1UL)
  #define EXMIF_INTENSET_STARTED_Disabled (0x0UL)
  #define EXMIF_INTENSET_STARTED_Enabled (0x1UL)


/* EXMIF_INTENCLR: Disable interrupt */
  #define EXMIF_INTENCLR_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define EXMIF_INTENCLR_CORE_Pos (0UL)
  #define EXMIF_INTENCLR_CORE_Msk (0x1UL << EXMIF_INTENCLR_CORE_Pos)
  #define EXMIF_INTENCLR_CORE_Min (0x0UL)
  #define EXMIF_INTENCLR_CORE_Max (0x1UL)
  #define EXMIF_INTENCLR_CORE_Clear (0x1UL)
  #define EXMIF_INTENCLR_CORE_Disabled (0x0UL)
  #define EXMIF_INTENCLR_CORE_Enabled (0x1UL)

/* STARTED @Bit 1 : Write '1' to disable interrupt for event STARTED */
  #define EXMIF_INTENCLR_STARTED_Pos (1UL)
  #define EXMIF_INTENCLR_STARTED_Msk (0x1UL << EXMIF_INTENCLR_STARTED_Pos)
  #define EXMIF_INTENCLR_STARTED_Min (0x0UL)
  #define EXMIF_INTENCLR_STARTED_Max (0x1UL)
  #define EXMIF_INTENCLR_STARTED_Clear (0x1UL)
  #define EXMIF_INTENCLR_STARTED_Disabled (0x0UL)
  #define EXMIF_INTENCLR_STARTED_Enabled (0x1UL)


/* EXMIF_INTPEND: Pending interrupts */
  #define EXMIF_INTPEND_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define EXMIF_INTPEND_CORE_Pos (0UL)
  #define EXMIF_INTPEND_CORE_Msk (0x1UL << EXMIF_INTPEND_CORE_Pos)
  #define EXMIF_INTPEND_CORE_Min (0x0UL)
  #define EXMIF_INTPEND_CORE_Max (0x1UL)
  #define EXMIF_INTPEND_CORE_NotPending (0x0UL)
  #define EXMIF_INTPEND_CORE_Pending (0x1UL)

/* STARTED @Bit 1 : Read pending status of interrupt for event STARTED */
  #define EXMIF_INTPEND_STARTED_Pos (1UL)
  #define EXMIF_INTPEND_STARTED_Msk (0x1UL << EXMIF_INTPEND_STARTED_Pos)
  #define EXMIF_INTPEND_STARTED_Min (0x0UL)
  #define EXMIF_INTPEND_STARTED_Max (0x1UL)
  #define EXMIF_INTPEND_STARTED_NotPending (0x0UL)
  #define EXMIF_INTPEND_STARTED_Pending (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           FICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct FICR_BLE ===================================================== */
/**
  * @brief BLE [FICR_BLE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDRTYPE;
  __IM  uint32_t  ADDR[2];
  __IM  uint32_t  ER[4];
  __IM  uint32_t  IR[4];
} NRF_FICR_BLE_Type;

/* FICR_BLE_ADDRTYPE: Device address type. */
  #define FICR_BLE_ADDRTYPE_ResetValue (0xFFFFFFFFUL)

/* TYPE @Bit 0 : Device address type. */
  #define FICR_BLE_ADDRTYPE_TYPE_Pos (0UL)
  #define FICR_BLE_ADDRTYPE_TYPE_Msk (0x1UL << FICR_BLE_ADDRTYPE_TYPE_Pos)
  #define FICR_BLE_ADDRTYPE_TYPE_Min (0x0UL)
  #define FICR_BLE_ADDRTYPE_TYPE_Max (0x1UL)
  #define FICR_BLE_ADDRTYPE_TYPE_Public (0x0UL)
  #define FICR_BLE_ADDRTYPE_TYPE_Random (0x1UL)


/* FICR_BLE_ADDR: 48 bit device address. */
  #define FICR_BLE_ADDR_MaxCount (2UL)
  #define FICR_BLE_ADDR_MaxIndex (1UL)
  #define FICR_BLE_ADDR_MinIndex (0UL)
  #define FICR_BLE_ADDR_ResetValue (0xFFFFFFFFUL)

/* ADDR @Bits 0..31 : Device address [n]. */
  #define FICR_BLE_ADDR_ADDR_Pos (0UL)
  #define FICR_BLE_ADDR_ADDR_Msk (0xFFFFFFFFUL << FICR_BLE_ADDR_ADDR_Pos)


/* FICR_BLE_ER: Encryption Root. */
  #define FICR_BLE_ER_MaxCount (4UL)
  #define FICR_BLE_ER_MaxIndex (3UL)
  #define FICR_BLE_ER_MinIndex (0UL)
  #define FICR_BLE_ER_ResetValue (0xFFFFFFFFUL)

/* ER @Bits 0..31 : Encryption root word [n]. */
  #define FICR_BLE_ER_ER_Pos (0UL)
  #define FICR_BLE_ER_ER_Msk (0xFFFFFFFFUL << FICR_BLE_ER_ER_Pos)


/* FICR_BLE_IR: Identity Root. */
  #define FICR_BLE_IR_MaxCount (4UL)
  #define FICR_BLE_IR_MaxIndex (3UL)
  #define FICR_BLE_IR_MinIndex (0UL)
  #define FICR_BLE_IR_ResetValue (0xFFFFFFFFUL)

/* IR @Bits 0..31 : Identity root word [n]. */
  #define FICR_BLE_IR_IR_Pos (0UL)
  #define FICR_BLE_IR_IR_Msk (0xFFFFFFFFUL << FICR_BLE_IR_IR_Pos)



/* ==================================================== Struct FICR_INFO ===================================================== */
/**
  * @brief INFO [FICR_INFO] Device info
  */
typedef struct {
  __IM  uint32_t  CONFIGID;
  __IM  uint32_t  PART;
  __IM  uint32_t  VARIANT;                           /*!< (@ 0x00000008) Part Variant, Hardware version and Production
                                                                         configuration*/
  __IM  uint32_t  PACKAGE;
  __IM  uint32_t  RAM;
  __IM  uint32_t  MRAM;
  __IM  uint32_t  CODEPAGESIZE;
  __IM  uint32_t  CODESIZE;
  __IM  uint32_t  DEVICETYPE;
} NRF_FICR_INFO_Type;

/* FICR_INFO_CONFIGID: Configuration identifier */
  #define FICR_INFO_CONFIGID_ResetValue (0xFFFFFFFFUL)

/* HWID @Bits 0..15 : Identification number for the HW */
  #define FICR_INFO_CONFIGID_HWID_Pos (0UL)
  #define FICR_INFO_CONFIGID_HWID_Msk (0xFFFFUL << FICR_INFO_CONFIGID_HWID_Pos)


/* FICR_INFO_PART: Part code */
  #define FICR_INFO_PART_ResetValue (0xFFFFFFFFUL)

/* PART @Bits 0..31 : Part code */
  #define FICR_INFO_PART_PART_Pos (0UL)
  #define FICR_INFO_PART_PART_Msk (0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos)
  #define FICR_INFO_PART_PART_Min (0xFFFFFFFFUL)
  #define FICR_INFO_PART_PART_Max (0xFFFFFFFFUL)
  #define FICR_INFO_PART_PART_Unspecified (0xFFFFFFFFUL)


/* FICR_INFO_VARIANT: Part Variant, Hardware version and Production configuration */
  #define FICR_INFO_VARIANT_ResetValue (0xFFFFFFFFUL)

