pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VARIANT @Bits 0..31 : Part Variant, Hardware version and Production configuration, encoded as ASCII */
  #define FICR_INFO_VARIANT_VARIANT_Pos (0UL)
  #define FICR_INFO_VARIANT_VARIANT_Msk (0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos)
  #define FICR_INFO_VARIANT_VARIANT_Min (0xFFFFFFFFUL)
  #define FICR_INFO_VARIANT_VARIANT_Max (0xFFFFFFFFUL)
  #define FICR_INFO_VARIANT_VARIANT_Unspecified (0xFFFFFFFFUL)


/* FICR_INFO_PACKAGE: Package option */
  #define FICR_INFO_PACKAGE_ResetValue (0xFFFFFFFFUL)

/* PACKAGE @Bits 0..31 : Package option */
  #define FICR_INFO_PACKAGE_PACKAGE_Pos (0UL)
  #define FICR_INFO_PACKAGE_PACKAGE_Msk (0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos)
  #define FICR_INFO_PACKAGE_PACKAGE_Min (0xFFFFFFFFUL)
  #define FICR_INFO_PACKAGE_PACKAGE_Max (0xFFFFFFFFUL)
  #define FICR_INFO_PACKAGE_PACKAGE_Unspecified (0xFFFFFFFFUL)


/* FICR_INFO_RAM: RAM variant */
  #define FICR_INFO_RAM_ResetValue (0xFFFFFFFFUL)

/* RAM @Bits 0..31 : RAM variant */
  #define FICR_INFO_RAM_RAM_Pos (0UL)
  #define FICR_INFO_RAM_RAM_Msk (0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos)
  #define FICR_INFO_RAM_RAM_Min (0xFFFFFFFFUL)
  #define FICR_INFO_RAM_RAM_Max (0xFFFFFFFFUL)
  #define FICR_INFO_RAM_RAM_Unspecified (0xFFFFFFFFUL)


/* FICR_INFO_MRAM: MRAM variant */
  #define FICR_INFO_MRAM_ResetValue (0xFFFFFFFFUL)

/* MRAM @Bits 0..31 : MRAM variant */
  #define FICR_INFO_MRAM_MRAM_Pos (0UL)
  #define FICR_INFO_MRAM_MRAM_Msk (0xFFFFFFFFUL << FICR_INFO_MRAM_MRAM_Pos)
  #define FICR_INFO_MRAM_MRAM_Min (0xFFFFFFFFUL)
  #define FICR_INFO_MRAM_MRAM_Max (0xFFFFFFFFUL)
  #define FICR_INFO_MRAM_MRAM_Unspecified (0xFFFFFFFFUL)


/* FICR_INFO_CODEPAGESIZE: Code memory page size in bytes */
  #define FICR_INFO_CODEPAGESIZE_ResetValue (0x00001000UL)

/* CODEPAGESIZE @Bits 0..31 : Code memory page size in bytes */
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Pos (0UL)
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Msk (0xFFFFFFFFUL << FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Pos) /*!< Bit mask of
                                                                            CODEPAGESIZE field.*/
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Min (0xFFFFFFFFUL)
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Max (0xFFFFFFFFUL)
  #define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Unspecified (0xFFFFFFFFUL)


/* FICR_INFO_CODESIZE: Code memory size */
  #define FICR_INFO_CODESIZE_ResetValue (0x00000100UL)

/* CODESIZE @Bits 0..31 : Code memory size in number of pages */
  #define FICR_INFO_CODESIZE_CODESIZE_Pos (0UL)
  #define FICR_INFO_CODESIZE_CODESIZE_Msk (0xFFFFFFFFUL << FICR_INFO_CODESIZE_CODESIZE_Pos)
  #define FICR_INFO_CODESIZE_CODESIZE_Min (0xFFFFFFFFUL)
  #define FICR_INFO_CODESIZE_CODESIZE_Max (0xFFFFFFFFUL)
  #define FICR_INFO_CODESIZE_CODESIZE_Unspecified (0xFFFFFFFFUL)


/* FICR_INFO_DEVICETYPE: Device type */
  #define FICR_INFO_DEVICETYPE_ResetValue (0x00000000UL)

/* DEVICETYPE @Bits 0..31 : Device type */
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Pos (0UL)
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Msk (0xFFFFFFFFUL << FICR_INFO_DEVICETYPE_DEVICETYPE_Pos) /*!< Bit mask of DEVICETYPE
                                                                            field.*/
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Min (0x0UL)
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Max (0xFFFFFFFFUL)
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_Die (0x00000000UL)
  #define FICR_INFO_DEVICETYPE_DEVICETYPE_FPGA (0xFFFFFFFFUL)



/* =========================================== Struct FICR_SIPINFO_OVERRIDE_LFOSC ============================================ */
/**
  * @brief LFOSC [FICR_SIPINFO_OVERRIDE_LFOSC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) LF oscillator configuration. Note. This configuration
                                                                         overrides corresponding LF oscillator configuration in
                                                                         BICR when set.*/
  __IOM uint32_t  LFXOCONFIG;                        /*!< (@ 0x00000004) LFXO configuration. Note. This configuration overrides
                                                                         corresponding LFXO configuration in BICR when set.*/
  __IOM uint32_t  LFXOCAL;                           /*!< (@ 0x00000008) LFXO calibration needed. Must be written to 0xFFFFFFFF
                                                                         after any modification of the LFXO board circuit, load
                                                                         capacitance, or crystal swap. Note. This configuration
                                                                         overrides corresponding LFXO calibration in BICR when
                                                                         set.*/
  __IOM uint32_t  LFRCAUTOCALCONFIG;                 /*!< (@ 0x0000000C) LFRC autocalibration configuration. Note. This
                                                                         configuration overrides corresponding LFRC
                                                                         autocalibration configuration in BICR when set.*/
} NRF_FICR_SIPINFO_OVERRIDE_LFOSC_Type;

/* FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG: LF oscillator configuration. Note. This configuration overrides corresponding LF
                                        oscillator configuration in BICR when set. */

  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_ResetValue (0xFFFFFFFFUL)

/* SRC @Bits 0..3 : LF oscillator source. */
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_Pos (0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_Msk (0xFUL << FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_Pos) /*!< Bit mask of SRC
                                                                            field.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_Min (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_Max (0xFUL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_Unconfigured (0xFUL) /*!< LF oscillator source is unconfigured. Default will be
                                                                           used.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_LFXO (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_LFRC (0x1UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_LFLPRC (0x2UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_CONFIG_SRC_Synth (0x3UL)


/* FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG: LFXO configuration. Note. This configuration overrides corresponding LFXO
                                            configuration in BICR when set. */

