pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ResetValue (0xFFFFFFFFUL)

/* ACCURACY @Bits 0..3 : LFXO crystal or external signal accuracy. */
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_Pos (0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_Msk (0xFUL << FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_Pos)
                                                                            /*!< Bit mask of ACCURACY field.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_Min (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_Max (0xFUL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_Unconfigured (0xFUL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_500ppm (0x0UL) /*!< LFXO crystal or external signal has an accuracy of
                                                                            500 ppm.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_250ppm (0x1UL) /*!< LFXO crystal or external signal has an accuracy of
                                                                            250 ppm.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_150ppm (0x2UL) /*!< LFXO crystal or external signal has an accuracy of
                                                                            150 ppm.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_100ppm (0x3UL) /*!< LFXO crystal or external signal has an accuracy of
                                                                            100 ppm.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_75ppm (0x4UL) /*!< LFXO crystal or external signal has an accuracy of
                                                                            75 ppm.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_50ppm (0x5UL) /*!< LFXO crystal or external signal has an accuracy of
                                                                            50 ppm.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_30ppm (0x6UL) /*!< LFXO crystal or external signal has an accuracy of
                                                                            30 ppm.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_ACCURACY_20ppm (0x7UL) /*!< LFXO crystal or external signal has an accuracy of
                                                                            20 ppm.*/

/* MODE @Bits 4..6 : LFXO mode. LFXO will not start unless MODE is configured. */
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_Pos (4UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_Msk (0x7UL << FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_Pos) /*!< Bit
                                                                            mask of MODE field.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_Min (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_Max (0x7UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_Unconfigured (0x7UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_Pierce (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_PIXO (0x1UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_ExtSine (0x2UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_MODE_ExtSquare (0x3UL)

/* LOADCAP @Bits 8..15 : Built-in load capacitors selection in 1 pF steps. Max. value 25 pF. */
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_LOADCAP_Pos (8UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_LOADCAP_Msk (0xFFUL << FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_LOADCAP_Pos) /*!<
                                                                            Bit mask of LOADCAP field.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_LOADCAP_Min (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_LOADCAP_Max (0xFFUL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_LOADCAP_Unconfigured (0xFFUL) /*!< The built-in load capacitors is
                                                                            unconfigured. LFXO will not start unless LOADCAP is
                                                                            configured.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_LOADCAP_External (0x00UL) /*!< Do not use the built-in load capacitors, only
                                                                            external capacitors will be used.*/

/* TIME @Bits 16..27 : LFXO startup time in ms. */
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_TIME_Pos (16UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_TIME_Msk (0xFFFUL << FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_TIME_Pos) /*!< Bit
                                                                            mask of TIME field.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_TIME_Min (0xFFFUL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_TIME_Max (0xFFFUL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCONFIG_TIME_Unconfigured (0xFFFUL)


/* FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCAL: LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the
                                         LFXO board circuit, load capacitance, or crystal swap. Note. This configuration
                                         overrides corresponding LFXO calibration in BICR when set. */

  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCAL_ResetValue (0xFFFFFFFFUL)

/* LFXOCAL @Bits 0..31 : LFXO calibration needed. Must be written to 0xFFFFFFFF after any modification of the LFXO board
                         circuit, load capacitance, or crystal swap. */

  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCAL_LFXOCAL_Pos (0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCAL_LFXOCAL_Msk (0xFFFFFFFFUL << FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCAL_LFXOCAL_Pos) /*!<
                                                                            Bit mask of LFXOCAL field.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCAL_LFXOCAL_Min (0xFFFFFFFFUL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCAL_LFXOCAL_Max (0xFFFFFFFFUL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFXOCAL_LFXOCAL_Calibrate (0xFFFFFFFFUL)


