pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG: LFRC autocalibration configuration. Note. This configuration overrides
                                                   corresponding LFRC autocalibration configuration in BICR when set. */

  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_ResetValue (0xFFFFFFFFUL) /*!< Reset value of LFRCAUTOCALCONFIG
                                                                            register.*/

/* TEMPINTERVAL @Bits 0..6 : Temperature measurement interval in 0.25 s steps. */
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Pos (0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Msk (0x7FUL << FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_TEMPINTERVAL_Pos)
                                                                            /*!< Bit mask of TEMPINTERVAL field.*/

/* TEMPDELTA @Bits 8..13 : Temperature delta that should trigger a calibration in 0.25 degrees steps. */
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Pos (8UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Msk (0x3FUL << FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_TEMPDELTA_Pos)
                                                                            /*!< Bit mask of TEMPDELTA field.*/

/* INTERVALMAXNO @Bits 16..20 : Maximum number of TEMPINTERVAL periods in between calibrations, independent of temperature
                                changes. */

  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Pos (16UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Msk (0x1FUL << FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_INTERVALMAXNO_Pos)
                                                                            /*!< Bit mask of INTERVALMAXNO field.*/

/* ENABLE @Bit 31 : LFRC.AUTOCALCONFIG register enable. */
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Pos (31UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Msk (0x1UL << FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Pos)
                                                                            /*!< Bit mask of ENABLE field.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Min (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Max (0x1UL)
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Enabled (0x0UL) /*!< LFRC.AUTOCALCONFIG register has been
                                                                            configured and can be used.*/
  #define FICR_SIPINFO_OVERRIDE_LFOSC_LFRCAUTOCALCONFIG_ENABLE_Disabled (0x1UL) /*!< LFRC.AUTOCALCONFIG register has not been
                                                                            configured and cannot be used.*/



/* ========================================== Struct FICR_SIPINFO_OVERRIDE_HFXO64M =========================================== */
/**
  * @brief HFXO64M [FICR_SIPINFO_OVERRIDE_HFXO64M] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000000) HFXO64M configuration. Note. This configuration
                                                                         overrides corresponding XO configuration in BICR when
                                                                         set.*/
  __IM  uint32_t  RESERVED;
} NRF_FICR_SIPINFO_OVERRIDE_HFXO64M_Type;

/* FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG: HFXO64M configuration. Note. This configuration overrides corresponding XO
                                          configuration in BICR when set. */

  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_ResetValue (0xFFFFFFFFUL)

/* MODE @Bits 0..2 : HFXO64M mode. */
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Pos (0UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Msk (0x7UL << FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Pos) /*!< Bit mask
                                                                            of MODE field.*/
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Min (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Max (0x7UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Unconfigured (0x7UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Normal (0x0UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_TCXO (0x1UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Crystal2 (0x2UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Crystal3 (0x3UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Crystal4 (0x4UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Crystal5 (0x5UL)
  #define FICR_SIPINFO_OVERRIDE_HFXO64M_CONFIG_MODE_Crystal6 (0x6UL)



/* ============================================== Struct FICR_SIPINFO_OVERRIDE =============================================== */
/**
  * @brief OVERRIDE [FICR_SIPINFO_OVERRIDE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_SIPINFO_OVERRIDE_LFOSC_Type LFOSC;
  __IOM NRF_FICR_SIPINFO_OVERRIDE_HFXO64M_Type HFXO64M;
} NRF_FICR_SIPINFO_OVERRIDE_Type;


/* =================================================== Struct FICR_SIPINFO =================================================== */
/**
  * @brief SIPINFO [FICR_SIPINFO] SIP-specific device info
  */
typedef struct {
  __IM  uint32_t  PARTNO;
  __IM  uint8_t   HWREVISION[4];
  __IM  uint8_t   VARIANT[4];
  __IM  uint32_t  PMICVERSION;
  __IM  uint8_t   TESTSITE[4];
  __IM  uint32_t  LOT;                               /*!< (@ 0x00000014) Lot number + test index in hex format (number digits
                                                                         0-9).*/
  __IM  uint8_t   TESTPROGRAMID[4];
  __IM  uint32_t  OSATPARTNO;
  __IM  uint8_t   HWBUILDVERSION[4];
  __IOM NRF_FICR_SIPINFO_OVERRIDE_Type OVERRIDE;
} NRF_FICR_SIPINFO_Type;

/* FICR_SIPINFO_PARTNO: SIP part number */
  #define FICR_SIPINFO_PARTNO_ResetValue (0xFFFFFFFFUL)

/* PARTNO @Bits 0..31 : (unspecified) */
  #define FICR_SIPINFO_PARTNO_PARTNO_Pos (0UL)
  #define FICR_SIPINFO_PARTNO_PARTNO_Msk (0xFFFFFFFFUL << FICR_SIPINFO_PARTNO_PARTNO_Pos)


/* FICR_SIPINFO_HWREVISION: SIP hardware revision, encoded in ASCII, ex B0A or B1A */
  #define FICR_SIPINFO_HWREVISION_MaxCount (4UL)
  #define FICR_SIPINFO_HWREVISION_MaxIndex (3UL)
  #define FICR_SIPINFO_HWREVISION_MinIndex (0UL)
  #define FICR_SIPINFO_HWREVISION_ResetValue (0xFFUL)

/* HWREVISION @Bits 0..7 : (unspecified) */
  #define FICR_SIPINFO_HWREVISION_HWREVISION_Pos (0UL)
  #define FICR_SIPINFO_HWREVISION_HWREVISION_Msk (0xFFUL << FICR_SIPINFO_HWREVISION_HWREVISION_Pos) /*!< Bit mask of HWREVISION
                                                                            field.*/


/* FICR_SIPINFO_VARIANT: SIP VARIANT, encoded in ASCII, ex SIAA, SIBA or SICA */
  #define FICR_SIPINFO_VARIANT_MaxCount (4UL)
  #define FICR_SIPINFO_VARIANT_MaxIndex (3UL)
  #define FICR_SIPINFO_VARIANT_MinIndex (0UL)
  #define FICR_SIPINFO_VARIANT_ResetValue (0xFFUL)

/* VARIANT @Bits 0..7 : (unspecified) */
  #define FICR_SIPINFO_VARIANT_VARIANT_Pos (0UL)
  #define FICR_SIPINFO_VARIANT_VARIANT_Msk (0xFFUL << FICR_SIPINFO_VARIANT_VARIANT_Pos)


/* FICR_SIPINFO_PMICVERSION: PMIC version */
  #define FICR_SIPINFO_PMICVERSION_ResetValue (0x00000000UL)

/* PMICVERSION @Bits 0..31 : PMIC version, incremental code */
  #define FICR_SIPINFO_PMICVERSION_PMICVERSION_Pos (0UL)
  #define FICR_SIPINFO_PMICVERSION_PMICVERSION_Msk (0xFFFFFFFFUL << FICR_SIPINFO_PMICVERSION_PMICVERSION_Pos) /*!< Bit mask of
                                                                            PMICVERSION field.*/


/* FICR_SIPINFO_LOT: Lot number + test index in hex format (number digits 0-9). */
  #define FICR_SIPINFO_LOT_ResetValue (0x00000000UL)

/* LOTID @Bits 0..23 : Lot number in hex format */
  #define FICR_SIPINFO_LOT_LOTID_Pos (0UL)
  #define FICR_SIPINFO_LOT_LOTID_Msk (0xFFFFFFUL << FICR_SIPINFO_LOT_LOTID_Pos)

