pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TESTID @Bits 24..31 : Test ID in hex format */
  #define FICR_SIPINFO_LOT_TESTID_Pos (24UL)
  #define FICR_SIPINFO_LOT_TESTID_Msk (0xFFUL << FICR_SIPINFO_LOT_TESTID_Pos)


/* FICR_SIPINFO_OSATPARTNO: OSAT part number */
  #define FICR_SIPINFO_OSATPARTNO_ResetValue (0xFFFFFFFFUL)

/* OSATPARTNO @Bits 0..31 : (unspecified) */
  #define FICR_SIPINFO_OSATPARTNO_OSATPARTNO_Pos (0UL)
  #define FICR_SIPINFO_OSATPARTNO_OSATPARTNO_Msk (0xFFFFFFFFUL << FICR_SIPINFO_OSATPARTNO_OSATPARTNO_Pos) /*!< Bit mask of
                                                                            OSATPARTNO field.*/



/* ============================================== Struct FICR_TRIM_GLOBAL_SAADC ============================================== */
/**
  * @brief SAADC [FICR_TRIM_GLOBAL_SAADC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CALVREF;
  __IM  uint32_t  CALGAIN[3];
  __IM  uint32_t  CALOFFSET;
  __IM  uint32_t  LINCALCOEFF[6];
  __IM  uint32_t  CALIREF;
  __IM  uint32_t  CALVREFTC;
} NRF_FICR_TRIM_GLOBAL_SAADC_Type;

/* FICR_TRIM_GLOBAL_SAADC_CALVREF: Trim value for GLOBAL.SAADC.CALVREF */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREF_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREF_VALUE_Pos (0UL)
  #define FICR_TRIM_GLOBAL_SAADC_CALVREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALVREF_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_CALGAIN: Trim value for GLOBAL.SAADC.CALGAIN */
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_MaxCount (3UL)
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_MaxIndex (2UL)
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_MinIndex (0UL)
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_VALUE_Pos (0UL)
  #define FICR_TRIM_GLOBAL_SAADC_CALGAIN_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALGAIN_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_CALOFFSET: Trim value for GLOBAL.SAADC.CALOFFSET */
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Pos (0UL)
  #define FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALOFFSET_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF: Trim value for GLOBAL.SAADC.LINCALCOEFF */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxCount (6UL)
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MaxIndex (5UL)
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_MinIndex (0UL)
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos (0UL)
  #define FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_LINCALCOEFF_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_CALIREF: Trim value for GLOBAL.SAADC.CALIREF */
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Pos (0UL)
  #define FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALIREF_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/


/* FICR_TRIM_GLOBAL_SAADC_CALVREFTC: Trim value for GLOBAL.SAADC.CALVREFTC */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREFTC_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_SAADC_CALVREFTC_VALUE_Pos (0UL)
  #define FICR_TRIM_GLOBAL_SAADC_CALVREFTC_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_SAADC_CALVREFTC_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/



/* =========================================== Struct FICR_TRIM_GLOBAL_CANPLL_TRIM =========================================== */
/**
  * @brief TRIM [FICR_TRIM_GLOBAL_CANPLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CTUNE;
} NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type;

/* FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE: Trim value for GLOBAL.CANPLL.TRIM.CTUNE */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos (0UL)
  #define FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_CANPLL_TRIM_CTUNE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================= Struct FICR_TRIM_GLOBAL_CANPLL ============================================== */
/**
  * @brief CANPLL [FICR_TRIM_GLOBAL_CANPLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_TRIM_Type TRIM;
} NRF_FICR_TRIM_GLOBAL_CANPLL_Type;


/* ============================================== Struct FICR_TRIM_GLOBAL_COMP =============================================== */
/**
  * @brief COMP [FICR_TRIM_GLOBAL_COMP] (unspecified)
  */
typedef struct {
  __IM  uint32_t  REFTRIM;
  __IM  uint32_t  RESERVED;
} NRF_FICR_TRIM_GLOBAL_COMP_Type;

/* FICR_TRIM_GLOBAL_COMP_REFTRIM: Trim value for GLOBAL.COMP.REFTRIM */
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Pos (0UL)
  #define FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_GLOBAL_COMP_REFTRIM_VALUE_Pos) /*!< Bit mask of
                                                                            VALUE field.*/



/* ================================================= Struct FICR_TRIM_GLOBAL ================================================= */
/**
  * @brief GLOBAL [FICR_TRIM_GLOBAL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_GLOBAL_SAADC_Type SAADC;
  __IM  uint32_t  RESERVED[2];
  __IOM NRF_FICR_TRIM_GLOBAL_CANPLL_Type CANPLL;
  __IM  uint32_t  RESERVED1[3];
  __IOM NRF_FICR_TRIM_GLOBAL_COMP_Type COMP;
} NRF_FICR_TRIM_GLOBAL_Type;


/* ========================================= Struct FICR_TRIM_APPLICATION_HSFLL_TRIM ========================================= */
/**
  * @brief TRIM [FICR_TRIM_APPLICATION_HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;
  __IM  uint32_t  COARSE[6];
  __IM  uint32_t  FINE[6];
} NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_Type;

