pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP: Trim value for APPLICATION.HSFLL.TRIM.VSUP */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Pos (0UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_VSUP_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE: Trim value for APPLICATION.HSFLL.TRIM.COARSE */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MaxCount (6UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MaxIndex (5UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_MinIndex (0UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Pos (0UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_COARSE_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/


/* FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE: Trim value for APPLICATION.HSFLL.TRIM.FINE */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MaxCount (6UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MaxIndex (5UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_MinIndex (0UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Pos (0UL)
  #define FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_HSFLL_TRIM_FINE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_APPLICATION_HSFLL ============================================ */
/**
  * @brief HSFLL [FICR_TRIM_APPLICATION_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_HSFLL_TRIM_Type TRIM;
} NRF_FICR_TRIM_APPLICATION_HSFLL_Type;


/* ===================================== Struct FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE ====================================== */
/**
  * @brief BLOCKTYPE [FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;
} NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_Type;
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MaxCount (4UL)
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MaxIndex (3UL)
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_MinIndex (0UL)

/* FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM: Trim value for APPLICATION.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL)
  #define FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* ========================================== Struct FICR_TRIM_APPLICATION_MEMCONF =========================================== */
/**
  * @brief MEMCONF [FICR_TRIM_APPLICATION_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[4];
} NRF_FICR_TRIM_APPLICATION_MEMCONF_Type;


/* ============================================== Struct FICR_TRIM_APPLICATION =============================================== */
/**
  * @brief APPLICATION [FICR_TRIM_APPLICATION] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_APPLICATION_HSFLL_Type HSFLL;
  __IOM NRF_FICR_TRIM_APPLICATION_MEMCONF_Type MEMCONF;
} NRF_FICR_TRIM_APPLICATION_Type;


/* ========================================== Struct FICR_TRIM_RADIOCORE_HSFLL_TRIM ========================================== */
/**
  * @brief TRIM [FICR_TRIM_RADIOCORE_HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  VSUP;
  __IM  uint32_t  COARSE[6];
  __IM  uint32_t  FINE[6];
} NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_Type;

/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP: Trim value for RADIOCORE.HSFLL.TRIM.VSUP */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Pos (0UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_VSUP_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE: Trim value for RADIOCORE.HSFLL.TRIM.COARSE */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_MaxCount (6UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_MaxIndex (5UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_MinIndex (0UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Pos (0UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_COARSE_VALUE_Pos) /*!<
                                                                            Bit mask of VALUE field.*/


/* FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE: Trim value for RADIOCORE.HSFLL.TRIM.FINE */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_MaxCount (6UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_MaxIndex (5UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_MinIndex (0UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Pos (0UL)
  #define FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_HSFLL_TRIM_FINE_VALUE_Pos) /*!< Bit
                                                                            mask of VALUE field.*/



/* ============================================ Struct FICR_TRIM_RADIOCORE_HSFLL ============================================= */
/**
  * @brief HSFLL [FICR_TRIM_RADIOCORE_HSFLL] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_HSFLL_TRIM_Type TRIM;
} NRF_FICR_TRIM_RADIOCORE_HSFLL_Type;


