pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ====================================== Struct FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE ======================================= */
/**
  * @brief BLOCKTYPE [FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IM  uint32_t  TRIM;
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type;
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MaxCount (4UL)
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MaxIndex (3UL)
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_MinIndex (0UL)

/* FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM: Trim value for RADIOCORE.MEMCONF.BLOCKTYPE[n].TRIM */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_ResetValue (0xFFFFFFFFUL)

/* VALUE @Bits 0..31 : Trim value */
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos (0UL)
  #define FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Msk (0xFFFFFFFFUL << FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_TRIM_VALUE_Pos)
                                                                            /*!< Bit mask of VALUE field.*/



/* =========================================== Struct FICR_TRIM_RADIOCORE_MEMCONF ============================================ */
/**
  * @brief MEMCONF [FICR_TRIM_RADIOCORE_MEMCONF] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[4];
} NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type;


/* =============================================== Struct FICR_TRIM_RADIOCORE ================================================ */
/**
  * @brief RADIOCORE [FICR_TRIM_RADIOCORE] (unspecified)
  */
typedef struct {
  __IOM NRF_FICR_TRIM_RADIOCORE_HSFLL_Type HSFLL;
  __IOM NRF_FICR_TRIM_RADIOCORE_MEMCONF_Type MEMCONF;
  __IM  uint32_t  RESERVED[11];
} NRF_FICR_TRIM_RADIOCORE_Type;


/* ==================================================== Struct FICR_TRIM ===================================================== */
/**
  * @brief TRIM [FICR_TRIM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[145];
  __IOM NRF_FICR_TRIM_GLOBAL_Type GLOBAL;
  __IOM NRF_FICR_TRIM_APPLICATION_Type APPLICATION;
  __IOM NRF_FICR_TRIM_RADIOCORE_Type RADIOCORE;
  __IM  uint32_t  RESERVED1[231];
} NRF_FICR_TRIM_Type;

/* ======================================================= Struct FICR ======================================================= */
/**
  * @brief Factory Information Configuration Registers
  */
  typedef struct {
    __IM uint32_t RESERVED[3];
    __IOM NRF_FICR_BLE_Type BLE;
    __IM uint32_t RESERVED1[6];
    __IOM NRF_FICR_INFO_Type INFO;
    __IM uint32_t RESERVED2[3];
    __IOM NRF_FICR_SIPINFO_Type SIPINFO;
    __IM uint32_t RESERVED3[17];
    __IOM NRF_FICR_TRIM_Type TRIM;
  } NRF_FICR_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           GPIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct GPIO_PORTCNF =================================================== */
/**
  * @brief PORTCNF [GPIO_PORTCNF] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DRIVECTRL;                         /*!< (@ 0x00000000) Drive control for impedance matching of the pins in
                                                                         this port*/
} NRF_GPIO_PORTCNF_Type;

/* GPIO_PORTCNF_DRIVECTRL: Drive control for impedance matching of the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_ResetValue (0x00000000UL)

/* IMPEDANCE50 @Bit 0 : Enable 50 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Pos (0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Pos) /*!< Bit mask of IMPEDANCE50
                                                                            field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Min (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Max (0x1UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Disable (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE50_Enable (0x1UL)

/* IMPEDANCE100 @Bit 1 : Enable 100 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Pos (1UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Pos) /*!< Bit mask of
                                                                            IMPEDANCE100 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Min (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Max (0x1UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Disable (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE100_Enable (0x1UL)

/* IMPEDANCE200 @Bit 2 : Enable 200 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Pos (2UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Pos) /*!< Bit mask of
                                                                            IMPEDANCE200 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Min (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Max (0x1UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Disable (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE200_Enable (0x1UL)

/* IMPEDANCE400 @Bit 3 : Enable 400 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Pos (3UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Pos) /*!< Bit mask of
                                                                            IMPEDANCE400 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Min (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Max (0x1UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Disable (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE400_Enable (0x1UL)

