pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* IMPEDANCE800 @Bit 4 : Enable 800 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Pos (4UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Pos) /*!< Bit mask of
                                                                            IMPEDANCE800 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Min (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Max (0x1UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Disable (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE800_Enable (0x1UL)

/* IMPEDANCE1600 @Bit 5 : Enable 1600 ohms impedance to the pins in this port */
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Pos (5UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Msk (0x1UL << GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Pos) /*!< Bit mask of
                                                                            IMPEDANCE1600 field.*/
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Min (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Max (0x1UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Disable (0x0UL)
  #define GPIO_PORTCNF_DRIVECTRL_IMPEDANCE1600_Enable (0x1UL)


/* ======================================================= Struct GPIO ======================================================= */
/**
  * @brief GPIO Port
  */
  typedef struct {
    __IOM uint32_t OUT;
    __IOM uint32_t OUTSET;
    __IOM uint32_t OUTCLR;
    __IM uint32_t IN;
    __IOM uint32_t DIR;
    __IOM uint32_t DIRSET;
    __IOM uint32_t DIRCLR;
    __IM uint32_t RESERVED;
    __IOM uint32_t LATCH;                            /*!< (@ 0x00000020) Latch register indicating what GPIO pins that have met
                                                                         the criteria set in the PIN_CNF[n].SENSE registers*/
    __IOM uint32_t DETECTMODE;                       /*!< (@ 0x00000024) Select between default DETECT signal behavior and
                                                                         LDETECT mode*/
    __IOM uint32_t RETAIN;                           /*!< (@ 0x00000028) Enable retention for those GPIO registers marked as
                                                                         retained*/
    __IM uint32_t RESERVED1;
    __IOM NRF_GPIO_PORTCNF_Type PORTCNF;
    __IM uint32_t RESERVED2[19];
    __IOM uint32_t PIN_CNF[32];
  } NRF_GPIO_Type;

/* GPIO_OUT: Write GPIO port */
  #define GPIO_OUT_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUT_PIN0_Pos (0UL)
  #define GPIO_OUT_PIN0_Msk (0x1UL << GPIO_OUT_PIN0_Pos)
  #define GPIO_OUT_PIN0_Min (0x0UL)
  #define GPIO_OUT_PIN0_Max (0x1UL)
  #define GPIO_OUT_PIN0_Low (0x0UL)
  #define GPIO_OUT_PIN0_High (0x1UL)

/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_OUT_PIN1_Pos (1UL)
  #define GPIO_OUT_PIN1_Msk (0x1UL << GPIO_OUT_PIN1_Pos)
  #define GPIO_OUT_PIN1_Min (0x0UL)
  #define GPIO_OUT_PIN1_Max (0x1UL)
  #define GPIO_OUT_PIN1_Low (0x0UL)
  #define GPIO_OUT_PIN1_High (0x1UL)

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_OUT_PIN2_Pos (2UL)
  #define GPIO_OUT_PIN2_Msk (0x1UL << GPIO_OUT_PIN2_Pos)
  #define GPIO_OUT_PIN2_Min (0x0UL)
  #define GPIO_OUT_PIN2_Max (0x1UL)
  #define GPIO_OUT_PIN2_Low (0x0UL)
  #define GPIO_OUT_PIN2_High (0x1UL)

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_OUT_PIN3_Pos (3UL)
  #define GPIO_OUT_PIN3_Msk (0x1UL << GPIO_OUT_PIN3_Pos)
  #define GPIO_OUT_PIN3_Min (0x0UL)
  #define GPIO_OUT_PIN3_Max (0x1UL)
  #define GPIO_OUT_PIN3_Low (0x0UL)
  #define GPIO_OUT_PIN3_High (0x1UL)

/* PIN4 @Bit 4 : Pin 4 */
  #define GPIO_OUT_PIN4_Pos (4UL)
  #define GPIO_OUT_PIN4_Msk (0x1UL << GPIO_OUT_PIN4_Pos)
  #define GPIO_OUT_PIN4_Min (0x0UL)
  #define GPIO_OUT_PIN4_Max (0x1UL)
  #define GPIO_OUT_PIN4_Low (0x0UL)
  #define GPIO_OUT_PIN4_High (0x1UL)

/* PIN5 @Bit 5 : Pin 5 */
  #define GPIO_OUT_PIN5_Pos (5UL)
  #define GPIO_OUT_PIN5_Msk (0x1UL << GPIO_OUT_PIN5_Pos)
  #define GPIO_OUT_PIN5_Min (0x0UL)
  #define GPIO_OUT_PIN5_Max (0x1UL)
  #define GPIO_OUT_PIN5_Low (0x0UL)
  #define GPIO_OUT_PIN5_High (0x1UL)

/* PIN6 @Bit 6 : Pin 6 */
  #define GPIO_OUT_PIN6_Pos (6UL)
  #define GPIO_OUT_PIN6_Msk (0x1UL << GPIO_OUT_PIN6_Pos)
  #define GPIO_OUT_PIN6_Min (0x0UL)
  #define GPIO_OUT_PIN6_Max (0x1UL)
  #define GPIO_OUT_PIN6_Low (0x0UL)
  #define GPIO_OUT_PIN6_High (0x1UL)

/* PIN7 @Bit 7 : Pin 7 */
  #define GPIO_OUT_PIN7_Pos (7UL)
  #define GPIO_OUT_PIN7_Msk (0x1UL << GPIO_OUT_PIN7_Pos)
  #define GPIO_OUT_PIN7_Min (0x0UL)
  #define GPIO_OUT_PIN7_Max (0x1UL)
  #define GPIO_OUT_PIN7_Low (0x0UL)
  #define GPIO_OUT_PIN7_High (0x1UL)

/* PIN8 @Bit 8 : Pin 8 */
  #define GPIO_OUT_PIN8_Pos (8UL)
  #define GPIO_OUT_PIN8_Msk (0x1UL << GPIO_OUT_PIN8_Pos)
  #define GPIO_OUT_PIN8_Min (0x0UL)
  #define GPIO_OUT_PIN8_Max (0x1UL)
  #define GPIO_OUT_PIN8_Low (0x0UL)
  #define GPIO_OUT_PIN8_High (0x1UL)

/* PIN9 @Bit 9 : Pin 9 */
  #define GPIO_OUT_PIN9_Pos (9UL)
  #define GPIO_OUT_PIN9_Msk (0x1UL << GPIO_OUT_PIN9_Pos)
  #define GPIO_OUT_PIN9_Min (0x0UL)
  #define GPIO_OUT_PIN9_Max (0x1UL)
  #define GPIO_OUT_PIN9_Low (0x0UL)
  #define GPIO_OUT_PIN9_High (0x1UL)

/* PIN10 @Bit 10 : Pin 10 */
  #define GPIO_OUT_PIN10_Pos (10UL)
  #define GPIO_OUT_PIN10_Msk (0x1UL << GPIO_OUT_PIN10_Pos)
  #define GPIO_OUT_PIN10_Min (0x0UL)
  #define GPIO_OUT_PIN10_Max (0x1UL)
  #define GPIO_OUT_PIN10_Low (0x0UL)
  #define GPIO_OUT_PIN10_High (0x1UL)

/* PIN11 @Bit 11 : Pin 11 */
  #define GPIO_OUT_PIN11_Pos (11UL)
  #define GPIO_OUT_PIN11_Msk (0x1UL << GPIO_OUT_PIN11_Pos)
  #define GPIO_OUT_PIN11_Min (0x0UL)
  #define GPIO_OUT_PIN11_Max (0x1UL)
  #define GPIO_OUT_PIN11_Low (0x0UL)
  #define GPIO_OUT_PIN11_High (0x1UL)

/* PIN12 @Bit 12 : Pin 12 */
  #define GPIO_OUT_PIN12_Pos (12UL)
  #define GPIO_OUT_PIN12_Msk (0x1UL << GPIO_OUT_PIN12_Pos)
  #define GPIO_OUT_PIN12_Min (0x0UL)
  #define GPIO_OUT_PIN12_Max (0x1UL)
  #define GPIO_OUT_PIN12_Low (0x0UL)
  #define GPIO_OUT_PIN12_High (0x1UL)

/* PIN13 @Bit 13 : Pin 13 */
  #define GPIO_OUT_PIN13_Pos (13UL)
  #define GPIO_OUT_PIN13_Msk (0x1UL << GPIO_OUT_PIN13_Pos)
  #define GPIO_OUT_PIN13_Min (0x0UL)
  #define GPIO_OUT_PIN13_Max (0x1UL)
  #define GPIO_OUT_PIN13_Low (0x0UL)
  #define GPIO_OUT_PIN13_High (0x1UL)

/* PIN14 @Bit 14 : Pin 14 */
  #define GPIO_OUT_PIN14_Pos (14UL)
  #define GPIO_OUT_PIN14_Msk (0x1UL << GPIO_OUT_PIN14_Pos)
  #define GPIO_OUT_PIN14_Min (0x0UL)
  #define GPIO_OUT_PIN14_Max (0x1UL)
  #define GPIO_OUT_PIN14_Low (0x0UL)
  #define GPIO_OUT_PIN14_High (0x1UL)

