pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN15 @Bit 15 : Pin 15 */
  #define GPIO_OUT_PIN15_Pos (15UL)
  #define GPIO_OUT_PIN15_Msk (0x1UL << GPIO_OUT_PIN15_Pos)
  #define GPIO_OUT_PIN15_Min (0x0UL)
  #define GPIO_OUT_PIN15_Max (0x1UL)
  #define GPIO_OUT_PIN15_Low (0x0UL)
  #define GPIO_OUT_PIN15_High (0x1UL)

/* PIN16 @Bit 16 : Pin 16 */
  #define GPIO_OUT_PIN16_Pos (16UL)
  #define GPIO_OUT_PIN16_Msk (0x1UL << GPIO_OUT_PIN16_Pos)
  #define GPIO_OUT_PIN16_Min (0x0UL)
  #define GPIO_OUT_PIN16_Max (0x1UL)
  #define GPIO_OUT_PIN16_Low (0x0UL)
  #define GPIO_OUT_PIN16_High (0x1UL)

/* PIN17 @Bit 17 : Pin 17 */
  #define GPIO_OUT_PIN17_Pos (17UL)
  #define GPIO_OUT_PIN17_Msk (0x1UL << GPIO_OUT_PIN17_Pos)
  #define GPIO_OUT_PIN17_Min (0x0UL)
  #define GPIO_OUT_PIN17_Max (0x1UL)
  #define GPIO_OUT_PIN17_Low (0x0UL)
  #define GPIO_OUT_PIN17_High (0x1UL)

/* PIN18 @Bit 18 : Pin 18 */
  #define GPIO_OUT_PIN18_Pos (18UL)
  #define GPIO_OUT_PIN18_Msk (0x1UL << GPIO_OUT_PIN18_Pos)
  #define GPIO_OUT_PIN18_Min (0x0UL)
  #define GPIO_OUT_PIN18_Max (0x1UL)
  #define GPIO_OUT_PIN18_Low (0x0UL)
  #define GPIO_OUT_PIN18_High (0x1UL)

/* PIN19 @Bit 19 : Pin 19 */
  #define GPIO_OUT_PIN19_Pos (19UL)
  #define GPIO_OUT_PIN19_Msk (0x1UL << GPIO_OUT_PIN19_Pos)
  #define GPIO_OUT_PIN19_Min (0x0UL)
  #define GPIO_OUT_PIN19_Max (0x1UL)
  #define GPIO_OUT_PIN19_Low (0x0UL)
  #define GPIO_OUT_PIN19_High (0x1UL)

/* PIN20 @Bit 20 : Pin 20 */
  #define GPIO_OUT_PIN20_Pos (20UL)
  #define GPIO_OUT_PIN20_Msk (0x1UL << GPIO_OUT_PIN20_Pos)
  #define GPIO_OUT_PIN20_Min (0x0UL)
  #define GPIO_OUT_PIN20_Max (0x1UL)
  #define GPIO_OUT_PIN20_Low (0x0UL)
  #define GPIO_OUT_PIN20_High (0x1UL)

/* PIN21 @Bit 21 : Pin 21 */
  #define GPIO_OUT_PIN21_Pos (21UL)
  #define GPIO_OUT_PIN21_Msk (0x1UL << GPIO_OUT_PIN21_Pos)
  #define GPIO_OUT_PIN21_Min (0x0UL)
  #define GPIO_OUT_PIN21_Max (0x1UL)
  #define GPIO_OUT_PIN21_Low (0x0UL)
  #define GPIO_OUT_PIN21_High (0x1UL)

/* PIN22 @Bit 22 : Pin 22 */
  #define GPIO_OUT_PIN22_Pos (22UL)
  #define GPIO_OUT_PIN22_Msk (0x1UL << GPIO_OUT_PIN22_Pos)
  #define GPIO_OUT_PIN22_Min (0x0UL)
  #define GPIO_OUT_PIN22_Max (0x1UL)
  #define GPIO_OUT_PIN22_Low (0x0UL)
  #define GPIO_OUT_PIN22_High (0x1UL)

/* PIN23 @Bit 23 : Pin 23 */
  #define GPIO_OUT_PIN23_Pos (23UL)
  #define GPIO_OUT_PIN23_Msk (0x1UL << GPIO_OUT_PIN23_Pos)
  #define GPIO_OUT_PIN23_Min (0x0UL)
  #define GPIO_OUT_PIN23_Max (0x1UL)
  #define GPIO_OUT_PIN23_Low (0x0UL)
  #define GPIO_OUT_PIN23_High (0x1UL)

/* PIN24 @Bit 24 : Pin 24 */
  #define GPIO_OUT_PIN24_Pos (24UL)
  #define GPIO_OUT_PIN24_Msk (0x1UL << GPIO_OUT_PIN24_Pos)
  #define GPIO_OUT_PIN24_Min (0x0UL)
  #define GPIO_OUT_PIN24_Max (0x1UL)
  #define GPIO_OUT_PIN24_Low (0x0UL)
  #define GPIO_OUT_PIN24_High (0x1UL)

/* PIN25 @Bit 25 : Pin 25 */
  #define GPIO_OUT_PIN25_Pos (25UL)
  #define GPIO_OUT_PIN25_Msk (0x1UL << GPIO_OUT_PIN25_Pos)
  #define GPIO_OUT_PIN25_Min (0x0UL)
  #define GPIO_OUT_PIN25_Max (0x1UL)
  #define GPIO_OUT_PIN25_Low (0x0UL)
  #define GPIO_OUT_PIN25_High (0x1UL)

/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_OUT_PIN26_Pos (26UL)
  #define GPIO_OUT_PIN26_Msk (0x1UL << GPIO_OUT_PIN26_Pos)
  #define GPIO_OUT_PIN26_Min (0x0UL)
  #define GPIO_OUT_PIN26_Max (0x1UL)
  #define GPIO_OUT_PIN26_Low (0x0UL)
  #define GPIO_OUT_PIN26_High (0x1UL)

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_OUT_PIN27_Pos (27UL)
  #define GPIO_OUT_PIN27_Msk (0x1UL << GPIO_OUT_PIN27_Pos)
  #define GPIO_OUT_PIN27_Min (0x0UL)
  #define GPIO_OUT_PIN27_Max (0x1UL)
  #define GPIO_OUT_PIN27_Low (0x0UL)
  #define GPIO_OUT_PIN27_High (0x1UL)

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_OUT_PIN28_Pos (28UL)
  #define GPIO_OUT_PIN28_Msk (0x1UL << GPIO_OUT_PIN28_Pos)
  #define GPIO_OUT_PIN28_Min (0x0UL)
  #define GPIO_OUT_PIN28_Max (0x1UL)
  #define GPIO_OUT_PIN28_Low (0x0UL)
  #define GPIO_OUT_PIN28_High (0x1UL)

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_OUT_PIN29_Pos (29UL)
  #define GPIO_OUT_PIN29_Msk (0x1UL << GPIO_OUT_PIN29_Pos)
  #define GPIO_OUT_PIN29_Min (0x0UL)
  #define GPIO_OUT_PIN29_Max (0x1UL)
  #define GPIO_OUT_PIN29_Low (0x0UL)
  #define GPIO_OUT_PIN29_High (0x1UL)

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_OUT_PIN30_Pos (30UL)
  #define GPIO_OUT_PIN30_Msk (0x1UL << GPIO_OUT_PIN30_Pos)
  #define GPIO_OUT_PIN30_Min (0x0UL)
  #define GPIO_OUT_PIN30_Max (0x1UL)
  #define GPIO_OUT_PIN30_Low (0x0UL)
  #define GPIO_OUT_PIN30_High (0x1UL)

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_OUT_PIN31_Pos (31UL)
  #define GPIO_OUT_PIN31_Msk (0x1UL << GPIO_OUT_PIN31_Pos)
  #define GPIO_OUT_PIN31_Min (0x0UL)
  #define GPIO_OUT_PIN31_Max (0x1UL)
  #define GPIO_OUT_PIN31_Low (0x0UL)
  #define GPIO_OUT_PIN31_High (0x1UL)


/* GPIO_OUTSET: Set individual bits in GPIO port */
  #define GPIO_OUTSET_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUTSET_PIN0_Pos (0UL)
  #define GPIO_OUTSET_PIN0_Msk (0x1UL << GPIO_OUTSET_PIN0_Pos)
  #define GPIO_OUTSET_PIN0_Min (0x0UL)
  #define GPIO_OUTSET_PIN0_Max (0x1UL)
  #define GPIO_OUTSET_PIN0_Low (0x0UL)
  #define GPIO_OUTSET_PIN0_High (0x1UL)
  #define GPIO_OUTSET_PIN0_Set (0x1UL)

/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_OUTSET_PIN1_Pos (1UL)
  #define GPIO_OUTSET_PIN1_Msk (0x1UL << GPIO_OUTSET_PIN1_Pos)
  #define GPIO_OUTSET_PIN1_Min (0x0UL)
  #define GPIO_OUTSET_PIN1_Max (0x1UL)
  #define GPIO_OUTSET_PIN1_Low (0x0UL)
  #define GPIO_OUTSET_PIN1_High (0x1UL)
  #define GPIO_OUTSET_PIN1_Set (0x1UL)

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_OUTSET_PIN2_Pos (2UL)
  #define GPIO_OUTSET_PIN2_Msk (0x1UL << GPIO_OUTSET_PIN2_Pos)
  #define GPIO_OUTSET_PIN2_Min (0x0UL)
  #define GPIO_OUTSET_PIN2_Max (0x1UL)
  #define GPIO_OUTSET_PIN2_Low (0x0UL)
  #define GPIO_OUTSET_PIN2_High (0x1UL)
  #define GPIO_OUTSET_PIN2_Set (0x1UL)

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_OUTSET_PIN3_Pos (3UL)
  #define GPIO_OUTSET_PIN3_Msk (0x1UL << GPIO_OUTSET_PIN3_Pos)
  #define GPIO_OUTSET_PIN3_Min (0x0UL)
  #define GPIO_OUTSET_PIN3_Max (0x1UL)
  #define GPIO_OUTSET_PIN3_Low (0x0UL)
  #define GPIO_OUTSET_PIN3_High (0x1UL)
  #define GPIO_OUTSET_PIN3_Set (0x1UL)

