pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN23 @Bit 23 : Pin 23 */
  #define GPIO_OUTSET_PIN23_Pos (23UL)
  #define GPIO_OUTSET_PIN23_Msk (0x1UL << GPIO_OUTSET_PIN23_Pos)
  #define GPIO_OUTSET_PIN23_Min (0x0UL)
  #define GPIO_OUTSET_PIN23_Max (0x1UL)
  #define GPIO_OUTSET_PIN23_Low (0x0UL)
  #define GPIO_OUTSET_PIN23_High (0x1UL)
  #define GPIO_OUTSET_PIN23_Set (0x1UL)

/* PIN24 @Bit 24 : Pin 24 */
  #define GPIO_OUTSET_PIN24_Pos (24UL)
  #define GPIO_OUTSET_PIN24_Msk (0x1UL << GPIO_OUTSET_PIN24_Pos)
  #define GPIO_OUTSET_PIN24_Min (0x0UL)
  #define GPIO_OUTSET_PIN24_Max (0x1UL)
  #define GPIO_OUTSET_PIN24_Low (0x0UL)
  #define GPIO_OUTSET_PIN24_High (0x1UL)
  #define GPIO_OUTSET_PIN24_Set (0x1UL)

/* PIN25 @Bit 25 : Pin 25 */
  #define GPIO_OUTSET_PIN25_Pos (25UL)
  #define GPIO_OUTSET_PIN25_Msk (0x1UL << GPIO_OUTSET_PIN25_Pos)
  #define GPIO_OUTSET_PIN25_Min (0x0UL)
  #define GPIO_OUTSET_PIN25_Max (0x1UL)
  #define GPIO_OUTSET_PIN25_Low (0x0UL)
  #define GPIO_OUTSET_PIN25_High (0x1UL)
  #define GPIO_OUTSET_PIN25_Set (0x1UL)

/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_OUTSET_PIN26_Pos (26UL)
  #define GPIO_OUTSET_PIN26_Msk (0x1UL << GPIO_OUTSET_PIN26_Pos)
  #define GPIO_OUTSET_PIN26_Min (0x0UL)
  #define GPIO_OUTSET_PIN26_Max (0x1UL)
  #define GPIO_OUTSET_PIN26_Low (0x0UL)
  #define GPIO_OUTSET_PIN26_High (0x1UL)
  #define GPIO_OUTSET_PIN26_Set (0x1UL)

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_OUTSET_PIN27_Pos (27UL)
  #define GPIO_OUTSET_PIN27_Msk (0x1UL << GPIO_OUTSET_PIN27_Pos)
  #define GPIO_OUTSET_PIN27_Min (0x0UL)
  #define GPIO_OUTSET_PIN27_Max (0x1UL)
  #define GPIO_OUTSET_PIN27_Low (0x0UL)
  #define GPIO_OUTSET_PIN27_High (0x1UL)
  #define GPIO_OUTSET_PIN27_Set (0x1UL)

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_OUTSET_PIN28_Pos (28UL)
  #define GPIO_OUTSET_PIN28_Msk (0x1UL << GPIO_OUTSET_PIN28_Pos)
  #define GPIO_OUTSET_PIN28_Min (0x0UL)
  #define GPIO_OUTSET_PIN28_Max (0x1UL)
  #define GPIO_OUTSET_PIN28_Low (0x0UL)
  #define GPIO_OUTSET_PIN28_High (0x1UL)
  #define GPIO_OUTSET_PIN28_Set (0x1UL)

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_OUTSET_PIN29_Pos (29UL)
  #define GPIO_OUTSET_PIN29_Msk (0x1UL << GPIO_OUTSET_PIN29_Pos)
  #define GPIO_OUTSET_PIN29_Min (0x0UL)
  #define GPIO_OUTSET_PIN29_Max (0x1UL)
  #define GPIO_OUTSET_PIN29_Low (0x0UL)
  #define GPIO_OUTSET_PIN29_High (0x1UL)
  #define GPIO_OUTSET_PIN29_Set (0x1UL)

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_OUTSET_PIN30_Pos (30UL)
  #define GPIO_OUTSET_PIN30_Msk (0x1UL << GPIO_OUTSET_PIN30_Pos)
  #define GPIO_OUTSET_PIN30_Min (0x0UL)
  #define GPIO_OUTSET_PIN30_Max (0x1UL)
  #define GPIO_OUTSET_PIN30_Low (0x0UL)
  #define GPIO_OUTSET_PIN30_High (0x1UL)
  #define GPIO_OUTSET_PIN30_Set (0x1UL)

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_OUTSET_PIN31_Pos (31UL)
  #define GPIO_OUTSET_PIN31_Msk (0x1UL << GPIO_OUTSET_PIN31_Pos)
  #define GPIO_OUTSET_PIN31_Min (0x0UL)
  #define GPIO_OUTSET_PIN31_Max (0x1UL)
  #define GPIO_OUTSET_PIN31_Low (0x0UL)
  #define GPIO_OUTSET_PIN31_High (0x1UL)
  #define GPIO_OUTSET_PIN31_Set (0x1UL)


/* GPIO_OUTCLR: Clear individual bits in GPIO port */
  #define GPIO_OUTCLR_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUTCLR_PIN0_Pos (0UL)
  #define GPIO_OUTCLR_PIN0_Msk (0x1UL << GPIO_OUTCLR_PIN0_Pos)
  #define GPIO_OUTCLR_PIN0_Min (0x0UL)
  #define GPIO_OUTCLR_PIN0_Max (0x1UL)
  #define GPIO_OUTCLR_PIN0_Low (0x0UL)
  #define GPIO_OUTCLR_PIN0_High (0x1UL)
  #define GPIO_OUTCLR_PIN0_Clear (0x1UL)

/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_OUTCLR_PIN1_Pos (1UL)
  #define GPIO_OUTCLR_PIN1_Msk (0x1UL << GPIO_OUTCLR_PIN1_Pos)
  #define GPIO_OUTCLR_PIN1_Min (0x0UL)
  #define GPIO_OUTCLR_PIN1_Max (0x1UL)
  #define GPIO_OUTCLR_PIN1_Low (0x0UL)
  #define GPIO_OUTCLR_PIN1_High (0x1UL)
  #define GPIO_OUTCLR_PIN1_Clear (0x1UL)

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_OUTCLR_PIN2_Pos (2UL)
  #define GPIO_OUTCLR_PIN2_Msk (0x1UL << GPIO_OUTCLR_PIN2_Pos)
  #define GPIO_OUTCLR_PIN2_Min (0x0UL)
  #define GPIO_OUTCLR_PIN2_Max (0x1UL)
  #define GPIO_OUTCLR_PIN2_Low (0x0UL)
  #define GPIO_OUTCLR_PIN2_High (0x1UL)
  #define GPIO_OUTCLR_PIN2_Clear (0x1UL)

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_OUTCLR_PIN3_Pos (3UL)
  #define GPIO_OUTCLR_PIN3_Msk (0x1UL << GPIO_OUTCLR_PIN3_Pos)
  #define GPIO_OUTCLR_PIN3_Min (0x0UL)
  #define GPIO_OUTCLR_PIN3_Max (0x1UL)
  #define GPIO_OUTCLR_PIN3_Low (0x0UL)
  #define GPIO_OUTCLR_PIN3_High (0x1UL)
  #define GPIO_OUTCLR_PIN3_Clear (0x1UL)

/* PIN4 @Bit 4 : Pin 4 */
  #define GPIO_OUTCLR_PIN4_Pos (4UL)
  #define GPIO_OUTCLR_PIN4_Msk (0x1UL << GPIO_OUTCLR_PIN4_Pos)
  #define GPIO_OUTCLR_PIN4_Min (0x0UL)
  #define GPIO_OUTCLR_PIN4_Max (0x1UL)
  #define GPIO_OUTCLR_PIN4_Low (0x0UL)
  #define GPIO_OUTCLR_PIN4_High (0x1UL)
  #define GPIO_OUTCLR_PIN4_Clear (0x1UL)

/* PIN5 @Bit 5 : Pin 5 */
  #define GPIO_OUTCLR_PIN5_Pos (5UL)
  #define GPIO_OUTCLR_PIN5_Msk (0x1UL << GPIO_OUTCLR_PIN5_Pos)
  #define GPIO_OUTCLR_PIN5_Min (0x0UL)
  #define GPIO_OUTCLR_PIN5_Max (0x1UL)
  #define GPIO_OUTCLR_PIN5_Low (0x0UL)
  #define GPIO_OUTCLR_PIN5_High (0x1UL)
  #define GPIO_OUTCLR_PIN5_Clear (0x1UL)

/* PIN6 @Bit 6 : Pin 6 */
  #define GPIO_OUTCLR_PIN6_Pos (6UL)
  #define GPIO_OUTCLR_PIN6_Msk (0x1UL << GPIO_OUTCLR_PIN6_Pos)
  #define GPIO_OUTCLR_PIN6_Min (0x0UL)
  #define GPIO_OUTCLR_PIN6_Max (0x1UL)
  #define GPIO_OUTCLR_PIN6_Low (0x0UL)
  #define GPIO_OUTCLR_PIN6_High (0x1UL)
  #define GPIO_OUTCLR_PIN6_Clear (0x1UL)

/* PIN7 @Bit 7 : Pin 7 */
  #define GPIO_OUTCLR_PIN7_Pos (7UL)
  #define GPIO_OUTCLR_PIN7_Msk (0x1UL << GPIO_OUTCLR_PIN7_Pos)
  #define GPIO_OUTCLR_PIN7_Min (0x0UL)
  #define GPIO_OUTCLR_PIN7_Max (0x1UL)
  #define GPIO_OUTCLR_PIN7_Low (0x0UL)
  #define GPIO_OUTCLR_PIN7_High (0x1UL)
  #define GPIO_OUTCLR_PIN7_Clear (0x1UL)

/* PIN8 @Bit 8 : Pin 8 */
  #define GPIO_OUTCLR_PIN8_Pos (8UL)
  #define GPIO_OUTCLR_PIN8_Msk (0x1UL << GPIO_OUTCLR_PIN8_Pos)
  #define GPIO_OUTCLR_PIN8_Min (0x0UL)
  #define GPIO_OUTCLR_PIN8_Max (0x1UL)
  #define GPIO_OUTCLR_PIN8_Low (0x0UL)
  #define GPIO_OUTCLR_PIN8_High (0x1UL)
  #define GPIO_OUTCLR_PIN8_Clear (0x1UL)

