pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_IN_PIN1_Pos (1UL)
  #define GPIO_IN_PIN1_Msk (0x1UL << GPIO_IN_PIN1_Pos)
  #define GPIO_IN_PIN1_Min (0x0UL)
  #define GPIO_IN_PIN1_Max (0x1UL)
  #define GPIO_IN_PIN1_Low (0x0UL)
  #define GPIO_IN_PIN1_High (0x1UL)

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_IN_PIN2_Pos (2UL)
  #define GPIO_IN_PIN2_Msk (0x1UL << GPIO_IN_PIN2_Pos)
  #define GPIO_IN_PIN2_Min (0x0UL)
  #define GPIO_IN_PIN2_Max (0x1UL)
  #define GPIO_IN_PIN2_Low (0x0UL)
  #define GPIO_IN_PIN2_High (0x1UL)

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_IN_PIN3_Pos (3UL)
  #define GPIO_IN_PIN3_Msk (0x1UL << GPIO_IN_PIN3_Pos)
  #define GPIO_IN_PIN3_Min (0x0UL)
  #define GPIO_IN_PIN3_Max (0x1UL)
  #define GPIO_IN_PIN3_Low (0x0UL)
  #define GPIO_IN_PIN3_High (0x1UL)

/* PIN4 @Bit 4 : Pin 4 */
  #define GPIO_IN_PIN4_Pos (4UL)
  #define GPIO_IN_PIN4_Msk (0x1UL << GPIO_IN_PIN4_Pos)
  #define GPIO_IN_PIN4_Min (0x0UL)
  #define GPIO_IN_PIN4_Max (0x1UL)
  #define GPIO_IN_PIN4_Low (0x0UL)
  #define GPIO_IN_PIN4_High (0x1UL)

/* PIN5 @Bit 5 : Pin 5 */
  #define GPIO_IN_PIN5_Pos (5UL)
  #define GPIO_IN_PIN5_Msk (0x1UL << GPIO_IN_PIN5_Pos)
  #define GPIO_IN_PIN5_Min (0x0UL)
  #define GPIO_IN_PIN5_Max (0x1UL)
  #define GPIO_IN_PIN5_Low (0x0UL)
  #define GPIO_IN_PIN5_High (0x1UL)

/* PIN6 @Bit 6 : Pin 6 */
  #define GPIO_IN_PIN6_Pos (6UL)
  #define GPIO_IN_PIN6_Msk (0x1UL << GPIO_IN_PIN6_Pos)
  #define GPIO_IN_PIN6_Min (0x0UL)
  #define GPIO_IN_PIN6_Max (0x1UL)
  #define GPIO_IN_PIN6_Low (0x0UL)
  #define GPIO_IN_PIN6_High (0x1UL)

/* PIN7 @Bit 7 : Pin 7 */
  #define GPIO_IN_PIN7_Pos (7UL)
  #define GPIO_IN_PIN7_Msk (0x1UL << GPIO_IN_PIN7_Pos)
  #define GPIO_IN_PIN7_Min (0x0UL)
  #define GPIO_IN_PIN7_Max (0x1UL)
  #define GPIO_IN_PIN7_Low (0x0UL)
  #define GPIO_IN_PIN7_High (0x1UL)

/* PIN8 @Bit 8 : Pin 8 */
  #define GPIO_IN_PIN8_Pos (8UL)
  #define GPIO_IN_PIN8_Msk (0x1UL << GPIO_IN_PIN8_Pos)
  #define GPIO_IN_PIN8_Min (0x0UL)
  #define GPIO_IN_PIN8_Max (0x1UL)
  #define GPIO_IN_PIN8_Low (0x0UL)
  #define GPIO_IN_PIN8_High (0x1UL)

/* PIN9 @Bit 9 : Pin 9 */
  #define GPIO_IN_PIN9_Pos (9UL)
  #define GPIO_IN_PIN9_Msk (0x1UL << GPIO_IN_PIN9_Pos)
  #define GPIO_IN_PIN9_Min (0x0UL)
  #define GPIO_IN_PIN9_Max (0x1UL)
  #define GPIO_IN_PIN9_Low (0x0UL)
  #define GPIO_IN_PIN9_High (0x1UL)

/* PIN10 @Bit 10 : Pin 10 */
  #define GPIO_IN_PIN10_Pos (10UL)
  #define GPIO_IN_PIN10_Msk (0x1UL << GPIO_IN_PIN10_Pos)
  #define GPIO_IN_PIN10_Min (0x0UL)
  #define GPIO_IN_PIN10_Max (0x1UL)
  #define GPIO_IN_PIN10_Low (0x0UL)
  #define GPIO_IN_PIN10_High (0x1UL)

/* PIN11 @Bit 11 : Pin 11 */
  #define GPIO_IN_PIN11_Pos (11UL)
  #define GPIO_IN_PIN11_Msk (0x1UL << GPIO_IN_PIN11_Pos)
  #define GPIO_IN_PIN11_Min (0x0UL)
  #define GPIO_IN_PIN11_Max (0x1UL)
  #define GPIO_IN_PIN11_Low (0x0UL)
  #define GPIO_IN_PIN11_High (0x1UL)

/* PIN12 @Bit 12 : Pin 12 */
  #define GPIO_IN_PIN12_Pos (12UL)
  #define GPIO_IN_PIN12_Msk (0x1UL << GPIO_IN_PIN12_Pos)
  #define GPIO_IN_PIN12_Min (0x0UL)
  #define GPIO_IN_PIN12_Max (0x1UL)
  #define GPIO_IN_PIN12_Low (0x0UL)
  #define GPIO_IN_PIN12_High (0x1UL)

/* PIN13 @Bit 13 : Pin 13 */
  #define GPIO_IN_PIN13_Pos (13UL)
  #define GPIO_IN_PIN13_Msk (0x1UL << GPIO_IN_PIN13_Pos)
  #define GPIO_IN_PIN13_Min (0x0UL)
  #define GPIO_IN_PIN13_Max (0x1UL)
  #define GPIO_IN_PIN13_Low (0x0UL)
  #define GPIO_IN_PIN13_High (0x1UL)

/* PIN14 @Bit 14 : Pin 14 */
  #define GPIO_IN_PIN14_Pos (14UL)
  #define GPIO_IN_PIN14_Msk (0x1UL << GPIO_IN_PIN14_Pos)
  #define GPIO_IN_PIN14_Min (0x0UL)
  #define GPIO_IN_PIN14_Max (0x1UL)
  #define GPIO_IN_PIN14_Low (0x0UL)
  #define GPIO_IN_PIN14_High (0x1UL)

/* PIN15 @Bit 15 : Pin 15 */
  #define GPIO_IN_PIN15_Pos (15UL)
  #define GPIO_IN_PIN15_Msk (0x1UL << GPIO_IN_PIN15_Pos)
  #define GPIO_IN_PIN15_Min (0x0UL)
  #define GPIO_IN_PIN15_Max (0x1UL)
  #define GPIO_IN_PIN15_Low (0x0UL)
  #define GPIO_IN_PIN15_High (0x1UL)

/* PIN16 @Bit 16 : Pin 16 */
  #define GPIO_IN_PIN16_Pos (16UL)
  #define GPIO_IN_PIN16_Msk (0x1UL << GPIO_IN_PIN16_Pos)
  #define GPIO_IN_PIN16_Min (0x0UL)
  #define GPIO_IN_PIN16_Max (0x1UL)
  #define GPIO_IN_PIN16_Low (0x0UL)
  #define GPIO_IN_PIN16_High (0x1UL)

/* PIN17 @Bit 17 : Pin 17 */
  #define GPIO_IN_PIN17_Pos (17UL)
  #define GPIO_IN_PIN17_Msk (0x1UL << GPIO_IN_PIN17_Pos)
  #define GPIO_IN_PIN17_Min (0x0UL)
  #define GPIO_IN_PIN17_Max (0x1UL)
  #define GPIO_IN_PIN17_Low (0x0UL)
  #define GPIO_IN_PIN17_High (0x1UL)

/* PIN18 @Bit 18 : Pin 18 */
  #define GPIO_IN_PIN18_Pos (18UL)
  #define GPIO_IN_PIN18_Msk (0x1UL << GPIO_IN_PIN18_Pos)
  #define GPIO_IN_PIN18_Min (0x0UL)
  #define GPIO_IN_PIN18_Max (0x1UL)
  #define GPIO_IN_PIN18_Low (0x0UL)
  #define GPIO_IN_PIN18_High (0x1UL)

/* PIN19 @Bit 19 : Pin 19 */
  #define GPIO_IN_PIN19_Pos (19UL)
  #define GPIO_IN_PIN19_Msk (0x1UL << GPIO_IN_PIN19_Pos)
  #define GPIO_IN_PIN19_Min (0x0UL)
  #define GPIO_IN_PIN19_Max (0x1UL)
  #define GPIO_IN_PIN19_Low (0x0UL)
  #define GPIO_IN_PIN19_High (0x1UL)

/* PIN20 @Bit 20 : Pin 20 */
  #define GPIO_IN_PIN20_Pos (20UL)
  #define GPIO_IN_PIN20_Msk (0x1UL << GPIO_IN_PIN20_Pos)
  #define GPIO_IN_PIN20_Min (0x0UL)
  #define GPIO_IN_PIN20_Max (0x1UL)
  #define GPIO_IN_PIN20_Low (0x0UL)
  #define GPIO_IN_PIN20_High (0x1UL)

/* PIN21 @Bit 21 : Pin 21 */
  #define GPIO_IN_PIN21_Pos (21UL)
  #define GPIO_IN_PIN21_Msk (0x1UL << GPIO_IN_PIN21_Pos)
  #define GPIO_IN_PIN21_Min (0x0UL)
  #define GPIO_IN_PIN21_Max (0x1UL)
  #define GPIO_IN_PIN21_Low (0x0UL)
  #define GPIO_IN_PIN21_High (0x1UL)

/* PIN22 @Bit 22 : Pin 22 */
  #define GPIO_IN_PIN22_Pos (22UL)
  #define GPIO_IN_PIN22_Msk (0x1UL << GPIO_IN_PIN22_Pos)
  #define GPIO_IN_PIN22_Min (0x0UL)
  #define GPIO_IN_PIN22_Max (0x1UL)
  #define GPIO_IN_PIN22_Low (0x0UL)
  #define GPIO_IN_PIN22_High (0x1UL)

/* PIN23 @Bit 23 : Pin 23 */
  #define GPIO_IN_PIN23_Pos (23UL)
  #define GPIO_IN_PIN23_Msk (0x1UL << GPIO_IN_PIN23_Pos)
  #define GPIO_IN_PIN23_Min (0x0UL)
  #define GPIO_IN_PIN23_Max (0x1UL)
  #define GPIO_IN_PIN23_Low (0x0UL)
  #define GPIO_IN_PIN23_High (0x1UL)

/* PIN24 @Bit 24 : Pin 24 */
  #define GPIO_IN_PIN24_Pos (24UL)
  #define GPIO_IN_PIN24_Msk (0x1UL << GPIO_IN_PIN24_Pos)
  #define GPIO_IN_PIN24_Min (0x0UL)
  #define GPIO_IN_PIN24_Max (0x1UL)
  #define GPIO_IN_PIN24_Low (0x0UL)
  #define GPIO_IN_PIN24_High (0x1UL)

/* PIN25 @Bit 25 : Pin 25 */
  #define GPIO_IN_PIN25_Pos (25UL)
  #define GPIO_IN_PIN25_Msk (0x1UL << GPIO_IN_PIN25_Pos)
  #define GPIO_IN_PIN25_Min (0x0UL)
  #define GPIO_IN_PIN25_Max (0x1UL)
  #define GPIO_IN_PIN25_Low (0x0UL)
  #define GPIO_IN_PIN25_High (0x1UL)

