pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_IN_PIN26_Pos (26UL)
  #define GPIO_IN_PIN26_Msk (0x1UL << GPIO_IN_PIN26_Pos)
  #define GPIO_IN_PIN26_Min (0x0UL)
  #define GPIO_IN_PIN26_Max (0x1UL)
  #define GPIO_IN_PIN26_Low (0x0UL)
  #define GPIO_IN_PIN26_High (0x1UL)

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_IN_PIN27_Pos (27UL)
  #define GPIO_IN_PIN27_Msk (0x1UL << GPIO_IN_PIN27_Pos)
  #define GPIO_IN_PIN27_Min (0x0UL)
  #define GPIO_IN_PIN27_Max (0x1UL)
  #define GPIO_IN_PIN27_Low (0x0UL)
  #define GPIO_IN_PIN27_High (0x1UL)

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_IN_PIN28_Pos (28UL)
  #define GPIO_IN_PIN28_Msk (0x1UL << GPIO_IN_PIN28_Pos)
  #define GPIO_IN_PIN28_Min (0x0UL)
  #define GPIO_IN_PIN28_Max (0x1UL)
  #define GPIO_IN_PIN28_Low (0x0UL)
  #define GPIO_IN_PIN28_High (0x1UL)

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_IN_PIN29_Pos (29UL)
  #define GPIO_IN_PIN29_Msk (0x1UL << GPIO_IN_PIN29_Pos)
  #define GPIO_IN_PIN29_Min (0x0UL)
  #define GPIO_IN_PIN29_Max (0x1UL)
  #define GPIO_IN_PIN29_Low (0x0UL)
  #define GPIO_IN_PIN29_High (0x1UL)

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_IN_PIN30_Pos (30UL)
  #define GPIO_IN_PIN30_Msk (0x1UL << GPIO_IN_PIN30_Pos)
  #define GPIO_IN_PIN30_Min (0x0UL)
  #define GPIO_IN_PIN30_Max (0x1UL)
  #define GPIO_IN_PIN30_Low (0x0UL)
  #define GPIO_IN_PIN30_High (0x1UL)

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_IN_PIN31_Pos (31UL)
  #define GPIO_IN_PIN31_Msk (0x1UL << GPIO_IN_PIN31_Pos)
  #define GPIO_IN_PIN31_Min (0x0UL)
  #define GPIO_IN_PIN31_Max (0x1UL)
  #define GPIO_IN_PIN31_Low (0x0UL)
  #define GPIO_IN_PIN31_High (0x1UL)


/* GPIO_DIR: Direction of GPIO pins */
  #define GPIO_DIR_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_DIR_PIN0_Pos (0UL)
  #define GPIO_DIR_PIN0_Msk (0x1UL << GPIO_DIR_PIN0_Pos)
  #define GPIO_DIR_PIN0_Min (0x0UL)
  #define GPIO_DIR_PIN0_Max (0x1UL)
  #define GPIO_DIR_PIN0_Input (0x0UL)
  #define GPIO_DIR_PIN0_Output (0x1UL)

/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_DIR_PIN1_Pos (1UL)
  #define GPIO_DIR_PIN1_Msk (0x1UL << GPIO_DIR_PIN1_Pos)
  #define GPIO_DIR_PIN1_Min (0x0UL)
  #define GPIO_DIR_PIN1_Max (0x1UL)
  #define GPIO_DIR_PIN1_Input (0x0UL)
  #define GPIO_DIR_PIN1_Output (0x1UL)

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_DIR_PIN2_Pos (2UL)
  #define GPIO_DIR_PIN2_Msk (0x1UL << GPIO_DIR_PIN2_Pos)
  #define GPIO_DIR_PIN2_Min (0x0UL)
  #define GPIO_DIR_PIN2_Max (0x1UL)
  #define GPIO_DIR_PIN2_Input (0x0UL)
  #define GPIO_DIR_PIN2_Output (0x1UL)

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_DIR_PIN3_Pos (3UL)
  #define GPIO_DIR_PIN3_Msk (0x1UL << GPIO_DIR_PIN3_Pos)
  #define GPIO_DIR_PIN3_Min (0x0UL)
  #define GPIO_DIR_PIN3_Max (0x1UL)
  #define GPIO_DIR_PIN3_Input (0x0UL)
  #define GPIO_DIR_PIN3_Output (0x1UL)

/* PIN4 @Bit 4 : Pin 4 */
  #define GPIO_DIR_PIN4_Pos (4UL)
  #define GPIO_DIR_PIN4_Msk (0x1UL << GPIO_DIR_PIN4_Pos)
  #define GPIO_DIR_PIN4_Min (0x0UL)
  #define GPIO_DIR_PIN4_Max (0x1UL)
  #define GPIO_DIR_PIN4_Input (0x0UL)
  #define GPIO_DIR_PIN4_Output (0x1UL)

/* PIN5 @Bit 5 : Pin 5 */
  #define GPIO_DIR_PIN5_Pos (5UL)
  #define GPIO_DIR_PIN5_Msk (0x1UL << GPIO_DIR_PIN5_Pos)
  #define GPIO_DIR_PIN5_Min (0x0UL)
  #define GPIO_DIR_PIN5_Max (0x1UL)
  #define GPIO_DIR_PIN5_Input (0x0UL)
  #define GPIO_DIR_PIN5_Output (0x1UL)

/* PIN6 @Bit 6 : Pin 6 */
  #define GPIO_DIR_PIN6_Pos (6UL)
  #define GPIO_DIR_PIN6_Msk (0x1UL << GPIO_DIR_PIN6_Pos)
  #define GPIO_DIR_PIN6_Min (0x0UL)
  #define GPIO_DIR_PIN6_Max (0x1UL)
  #define GPIO_DIR_PIN6_Input (0x0UL)
  #define GPIO_DIR_PIN6_Output (0x1UL)

/* PIN7 @Bit 7 : Pin 7 */
  #define GPIO_DIR_PIN7_Pos (7UL)
  #define GPIO_DIR_PIN7_Msk (0x1UL << GPIO_DIR_PIN7_Pos)
  #define GPIO_DIR_PIN7_Min (0x0UL)
  #define GPIO_DIR_PIN7_Max (0x1UL)
  #define GPIO_DIR_PIN7_Input (0x0UL)
  #define GPIO_DIR_PIN7_Output (0x1UL)

/* PIN8 @Bit 8 : Pin 8 */
  #define GPIO_DIR_PIN8_Pos (8UL)
  #define GPIO_DIR_PIN8_Msk (0x1UL << GPIO_DIR_PIN8_Pos)
  #define GPIO_DIR_PIN8_Min (0x0UL)
  #define GPIO_DIR_PIN8_Max (0x1UL)
  #define GPIO_DIR_PIN8_Input (0x0UL)
  #define GPIO_DIR_PIN8_Output (0x1UL)

/* PIN9 @Bit 9 : Pin 9 */
  #define GPIO_DIR_PIN9_Pos (9UL)
  #define GPIO_DIR_PIN9_Msk (0x1UL << GPIO_DIR_PIN9_Pos)
  #define GPIO_DIR_PIN9_Min (0x0UL)
  #define GPIO_DIR_PIN9_Max (0x1UL)
  #define GPIO_DIR_PIN9_Input (0x0UL)
  #define GPIO_DIR_PIN9_Output (0x1UL)

/* PIN10 @Bit 10 : Pin 10 */
  #define GPIO_DIR_PIN10_Pos (10UL)
  #define GPIO_DIR_PIN10_Msk (0x1UL << GPIO_DIR_PIN10_Pos)
  #define GPIO_DIR_PIN10_Min (0x0UL)
  #define GPIO_DIR_PIN10_Max (0x1UL)
  #define GPIO_DIR_PIN10_Input (0x0UL)
  #define GPIO_DIR_PIN10_Output (0x1UL)

/* PIN11 @Bit 11 : Pin 11 */
  #define GPIO_DIR_PIN11_Pos (11UL)
  #define GPIO_DIR_PIN11_Msk (0x1UL << GPIO_DIR_PIN11_Pos)
  #define GPIO_DIR_PIN11_Min (0x0UL)
  #define GPIO_DIR_PIN11_Max (0x1UL)
  #define GPIO_DIR_PIN11_Input (0x0UL)
  #define GPIO_DIR_PIN11_Output (0x1UL)

/* PIN12 @Bit 12 : Pin 12 */
  #define GPIO_DIR_PIN12_Pos (12UL)
  #define GPIO_DIR_PIN12_Msk (0x1UL << GPIO_DIR_PIN12_Pos)
  #define GPIO_DIR_PIN12_Min (0x0UL)
  #define GPIO_DIR_PIN12_Max (0x1UL)
  #define GPIO_DIR_PIN12_Input (0x0UL)
  #define GPIO_DIR_PIN12_Output (0x1UL)

/* PIN13 @Bit 13 : Pin 13 */
  #define GPIO_DIR_PIN13_Pos (13UL)
  #define GPIO_DIR_PIN13_Msk (0x1UL << GPIO_DIR_PIN13_Pos)
  #define GPIO_DIR_PIN13_Min (0x0UL)
  #define GPIO_DIR_PIN13_Max (0x1UL)
  #define GPIO_DIR_PIN13_Input (0x0UL)
  #define GPIO_DIR_PIN13_Output (0x1UL)

/* PIN14 @Bit 14 : Pin 14 */
  #define GPIO_DIR_PIN14_Pos (14UL)
  #define GPIO_DIR_PIN14_Msk (0x1UL << GPIO_DIR_PIN14_Pos)
  #define GPIO_DIR_PIN14_Min (0x0UL)
  #define GPIO_DIR_PIN14_Max (0x1UL)
  #define GPIO_DIR_PIN14_Input (0x0UL)
  #define GPIO_DIR_PIN14_Output (0x1UL)

/* PIN15 @Bit 15 : Pin 15 */
  #define GPIO_DIR_PIN15_Pos (15UL)
  #define GPIO_DIR_PIN15_Msk (0x1UL << GPIO_DIR_PIN15_Pos)
  #define GPIO_DIR_PIN15_Min (0x0UL)
  #define GPIO_DIR_PIN15_Max (0x1UL)
  #define GPIO_DIR_PIN15_Input (0x0UL)
  #define GPIO_DIR_PIN15_Output (0x1UL)

/* PIN16 @Bit 16 : Pin 16 */
  #define GPIO_DIR_PIN16_Pos (16UL)
  #define GPIO_DIR_PIN16_Msk (0x1UL << GPIO_DIR_PIN16_Pos)
  #define GPIO_DIR_PIN16_Min (0x0UL)
  #define GPIO_DIR_PIN16_Max (0x1UL)
  #define GPIO_DIR_PIN16_Input (0x0UL)
  #define GPIO_DIR_PIN16_Output (0x1UL)

/* PIN17 @Bit 17 : Pin 17 */
  #define GPIO_DIR_PIN17_Pos (17UL)
  #define GPIO_DIR_PIN17_Msk (0x1UL << GPIO_DIR_PIN17_Pos)
  #define GPIO_DIR_PIN17_Min (0x0UL)
  #define GPIO_DIR_PIN17_Max (0x1UL)
  #define GPIO_DIR_PIN17_Input (0x0UL)
  #define GPIO_DIR_PIN17_Output (0x1UL)

