pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN18 @Bit 18 : Pin 18 */
  #define GPIO_DIR_PIN18_Pos (18UL)
  #define GPIO_DIR_PIN18_Msk (0x1UL << GPIO_DIR_PIN18_Pos)
  #define GPIO_DIR_PIN18_Min (0x0UL)
  #define GPIO_DIR_PIN18_Max (0x1UL)
  #define GPIO_DIR_PIN18_Input (0x0UL)
  #define GPIO_DIR_PIN18_Output (0x1UL)

/* PIN19 @Bit 19 : Pin 19 */
  #define GPIO_DIR_PIN19_Pos (19UL)
  #define GPIO_DIR_PIN19_Msk (0x1UL << GPIO_DIR_PIN19_Pos)
  #define GPIO_DIR_PIN19_Min (0x0UL)
  #define GPIO_DIR_PIN19_Max (0x1UL)
  #define GPIO_DIR_PIN19_Input (0x0UL)
  #define GPIO_DIR_PIN19_Output (0x1UL)

/* PIN20 @Bit 20 : Pin 20 */
  #define GPIO_DIR_PIN20_Pos (20UL)
  #define GPIO_DIR_PIN20_Msk (0x1UL << GPIO_DIR_PIN20_Pos)
  #define GPIO_DIR_PIN20_Min (0x0UL)
  #define GPIO_DIR_PIN20_Max (0x1UL)
  #define GPIO_DIR_PIN20_Input (0x0UL)
  #define GPIO_DIR_PIN20_Output (0x1UL)

/* PIN21 @Bit 21 : Pin 21 */
  #define GPIO_DIR_PIN21_Pos (21UL)
  #define GPIO_DIR_PIN21_Msk (0x1UL << GPIO_DIR_PIN21_Pos)
  #define GPIO_DIR_PIN21_Min (0x0UL)
  #define GPIO_DIR_PIN21_Max (0x1UL)
  #define GPIO_DIR_PIN21_Input (0x0UL)
  #define GPIO_DIR_PIN21_Output (0x1UL)

/* PIN22 @Bit 22 : Pin 22 */
  #define GPIO_DIR_PIN22_Pos (22UL)
  #define GPIO_DIR_PIN22_Msk (0x1UL << GPIO_DIR_PIN22_Pos)
  #define GPIO_DIR_PIN22_Min (0x0UL)
  #define GPIO_DIR_PIN22_Max (0x1UL)
  #define GPIO_DIR_PIN22_Input (0x0UL)
  #define GPIO_DIR_PIN22_Output (0x1UL)

/* PIN23 @Bit 23 : Pin 23 */
  #define GPIO_DIR_PIN23_Pos (23UL)
  #define GPIO_DIR_PIN23_Msk (0x1UL << GPIO_DIR_PIN23_Pos)
  #define GPIO_DIR_PIN23_Min (0x0UL)
  #define GPIO_DIR_PIN23_Max (0x1UL)
  #define GPIO_DIR_PIN23_Input (0x0UL)
  #define GPIO_DIR_PIN23_Output (0x1UL)

/* PIN24 @Bit 24 : Pin 24 */
  #define GPIO_DIR_PIN24_Pos (24UL)
  #define GPIO_DIR_PIN24_Msk (0x1UL << GPIO_DIR_PIN24_Pos)
  #define GPIO_DIR_PIN24_Min (0x0UL)
  #define GPIO_DIR_PIN24_Max (0x1UL)
  #define GPIO_DIR_PIN24_Input (0x0UL)
  #define GPIO_DIR_PIN24_Output (0x1UL)

/* PIN25 @Bit 25 : Pin 25 */
  #define GPIO_DIR_PIN25_Pos (25UL)
  #define GPIO_DIR_PIN25_Msk (0x1UL << GPIO_DIR_PIN25_Pos)
  #define GPIO_DIR_PIN25_Min (0x0UL)
  #define GPIO_DIR_PIN25_Max (0x1UL)
  #define GPIO_DIR_PIN25_Input (0x0UL)
  #define GPIO_DIR_PIN25_Output (0x1UL)

/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_DIR_PIN26_Pos (26UL)
  #define GPIO_DIR_PIN26_Msk (0x1UL << GPIO_DIR_PIN26_Pos)
  #define GPIO_DIR_PIN26_Min (0x0UL)
  #define GPIO_DIR_PIN26_Max (0x1UL)
  #define GPIO_DIR_PIN26_Input (0x0UL)
  #define GPIO_DIR_PIN26_Output (0x1UL)

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_DIR_PIN27_Pos (27UL)
  #define GPIO_DIR_PIN27_Msk (0x1UL << GPIO_DIR_PIN27_Pos)
  #define GPIO_DIR_PIN27_Min (0x0UL)
  #define GPIO_DIR_PIN27_Max (0x1UL)
  #define GPIO_DIR_PIN27_Input (0x0UL)
  #define GPIO_DIR_PIN27_Output (0x1UL)

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_DIR_PIN28_Pos (28UL)
  #define GPIO_DIR_PIN28_Msk (0x1UL << GPIO_DIR_PIN28_Pos)
  #define GPIO_DIR_PIN28_Min (0x0UL)
  #define GPIO_DIR_PIN28_Max (0x1UL)
  #define GPIO_DIR_PIN28_Input (0x0UL)
  #define GPIO_DIR_PIN28_Output (0x1UL)

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_DIR_PIN29_Pos (29UL)
  #define GPIO_DIR_PIN29_Msk (0x1UL << GPIO_DIR_PIN29_Pos)
  #define GPIO_DIR_PIN29_Min (0x0UL)
  #define GPIO_DIR_PIN29_Max (0x1UL)
  #define GPIO_DIR_PIN29_Input (0x0UL)
  #define GPIO_DIR_PIN29_Output (0x1UL)

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_DIR_PIN30_Pos (30UL)
  #define GPIO_DIR_PIN30_Msk (0x1UL << GPIO_DIR_PIN30_Pos)
  #define GPIO_DIR_PIN30_Min (0x0UL)
  #define GPIO_DIR_PIN30_Max (0x1UL)
  #define GPIO_DIR_PIN30_Input (0x0UL)
  #define GPIO_DIR_PIN30_Output (0x1UL)

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_DIR_PIN31_Pos (31UL)
  #define GPIO_DIR_PIN31_Msk (0x1UL << GPIO_DIR_PIN31_Pos)
  #define GPIO_DIR_PIN31_Min (0x0UL)
  #define GPIO_DIR_PIN31_Max (0x1UL)
  #define GPIO_DIR_PIN31_Input (0x0UL)
  #define GPIO_DIR_PIN31_Output (0x1UL)


/* GPIO_DIRSET: DIR set register */
  #define GPIO_DIRSET_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : Set as output pin 0 */
  #define GPIO_DIRSET_PIN0_Pos (0UL)
  #define GPIO_DIRSET_PIN0_Msk (0x1UL << GPIO_DIRSET_PIN0_Pos)
  #define GPIO_DIRSET_PIN0_Min (0x0UL)
  #define GPIO_DIRSET_PIN0_Max (0x1UL)
  #define GPIO_DIRSET_PIN0_Input (0x0UL)
  #define GPIO_DIRSET_PIN0_Output (0x1UL)
  #define GPIO_DIRSET_PIN0_Set (0x1UL)

/* PIN1 @Bit 1 : Set as output pin 1 */
  #define GPIO_DIRSET_PIN1_Pos (1UL)
  #define GPIO_DIRSET_PIN1_Msk (0x1UL << GPIO_DIRSET_PIN1_Pos)
  #define GPIO_DIRSET_PIN1_Min (0x0UL)
  #define GPIO_DIRSET_PIN1_Max (0x1UL)
  #define GPIO_DIRSET_PIN1_Input (0x0UL)
  #define GPIO_DIRSET_PIN1_Output (0x1UL)
  #define GPIO_DIRSET_PIN1_Set (0x1UL)

/* PIN2 @Bit 2 : Set as output pin 2 */
  #define GPIO_DIRSET_PIN2_Pos (2UL)
  #define GPIO_DIRSET_PIN2_Msk (0x1UL << GPIO_DIRSET_PIN2_Pos)
  #define GPIO_DIRSET_PIN2_Min (0x0UL)
  #define GPIO_DIRSET_PIN2_Max (0x1UL)
  #define GPIO_DIRSET_PIN2_Input (0x0UL)
  #define GPIO_DIRSET_PIN2_Output (0x1UL)
  #define GPIO_DIRSET_PIN2_Set (0x1UL)

/* PIN3 @Bit 3 : Set as output pin 3 */
  #define GPIO_DIRSET_PIN3_Pos (3UL)
  #define GPIO_DIRSET_PIN3_Msk (0x1UL << GPIO_DIRSET_PIN3_Pos)
  #define GPIO_DIRSET_PIN3_Min (0x0UL)
  #define GPIO_DIRSET_PIN3_Max (0x1UL)
  #define GPIO_DIRSET_PIN3_Input (0x0UL)
  #define GPIO_DIRSET_PIN3_Output (0x1UL)
  #define GPIO_DIRSET_PIN3_Set (0x1UL)

/* PIN4 @Bit 4 : Set as output pin 4 */
  #define GPIO_DIRSET_PIN4_Pos (4UL)
  #define GPIO_DIRSET_PIN4_Msk (0x1UL << GPIO_DIRSET_PIN4_Pos)
  #define GPIO_DIRSET_PIN4_Min (0x0UL)
  #define GPIO_DIRSET_PIN4_Max (0x1UL)
  #define GPIO_DIRSET_PIN4_Input (0x0UL)
  #define GPIO_DIRSET_PIN4_Output (0x1UL)
  #define GPIO_DIRSET_PIN4_Set (0x1UL)

/* PIN5 @Bit 5 : Set as output pin 5 */
  #define GPIO_DIRSET_PIN5_Pos (5UL)
  #define GPIO_DIRSET_PIN5_Msk (0x1UL << GPIO_DIRSET_PIN5_Pos)
  #define GPIO_DIRSET_PIN5_Min (0x0UL)
  #define GPIO_DIRSET_PIN5_Max (0x1UL)
  #define GPIO_DIRSET_PIN5_Input (0x0UL)
  #define GPIO_DIRSET_PIN5_Output (0x1UL)
  #define GPIO_DIRSET_PIN5_Set (0x1UL)

/* PIN6 @Bit 6 : Set as output pin 6 */
  #define GPIO_DIRSET_PIN6_Pos (6UL)
  #define GPIO_DIRSET_PIN6_Msk (0x1UL << GPIO_DIRSET_PIN6_Pos)
  #define GPIO_DIRSET_PIN6_Min (0x0UL)
  #define GPIO_DIRSET_PIN6_Max (0x1UL)
  #define GPIO_DIRSET_PIN6_Input (0x0UL)
  #define GPIO_DIRSET_PIN6_Output (0x1UL)
  #define GPIO_DIRSET_PIN6_Set (0x1UL)

/* PIN7 @Bit 7 : Set as output pin 7 */
  #define GPIO_DIRSET_PIN7_Pos (7UL)
  #define GPIO_DIRSET_PIN7_Msk (0x1UL << GPIO_DIRSET_PIN7_Pos)
  #define GPIO_DIRSET_PIN7_Min (0x0UL)
  #define GPIO_DIRSET_PIN7_Max (0x1UL)
  #define GPIO_DIRSET_PIN7_Input (0x0UL)
  #define GPIO_DIRSET_PIN7_Output (0x1UL)
  #define GPIO_DIRSET_PIN7_Set (0x1UL)

/* PIN8 @Bit 8 : Set as output pin 8 */
  #define GPIO_DIRSET_PIN8_Pos (8UL)
  #define GPIO_DIRSET_PIN8_Msk (0x1UL << GPIO_DIRSET_PIN8_Pos)
  #define GPIO_DIRSET_PIN8_Min (0x0UL)
  #define GPIO_DIRSET_PIN8_Max (0x1UL)
  #define GPIO_DIRSET_PIN8_Input (0x0UL)
  #define GPIO_DIRSET_PIN8_Output (0x1UL)
  #define GPIO_DIRSET_PIN8_Set (0x1UL)

/* PIN9 @Bit 9 : Set as output pin 9 */
  #define GPIO_DIRSET_PIN9_Pos (9UL)
  #define GPIO_DIRSET_PIN9_Msk (0x1UL << GPIO_DIRSET_PIN9_Pos)
  #define GPIO_DIRSET_PIN9_Min (0x0UL)
  #define GPIO_DIRSET_PIN9_Max (0x1UL)
  #define GPIO_DIRSET_PIN9_Input (0x0UL)
  #define GPIO_DIRSET_PIN9_Output (0x1UL)
  #define GPIO_DIRSET_PIN9_Set (0x1UL)

/* PIN10 @Bit 10 : Set as output pin 10 */
  #define GPIO_DIRSET_PIN10_Pos (10UL)
  #define GPIO_DIRSET_PIN10_Msk (0x1UL << GPIO_DIRSET_PIN10_Pos)
  #define GPIO_DIRSET_PIN10_Min (0x0UL)
  #define GPIO_DIRSET_PIN10_Max (0x1UL)
  #define GPIO_DIRSET_PIN10_Input (0x0UL)
  #define GPIO_DIRSET_PIN10_Output (0x1UL)
  #define GPIO_DIRSET_PIN10_Set (0x1UL)

/* PIN11 @Bit 11 : Set as output pin 11 */
  #define GPIO_DIRSET_PIN11_Pos (11UL)
  #define GPIO_DIRSET_PIN11_Msk (0x1UL << GPIO_DIRSET_PIN11_Pos)
  #define GPIO_DIRSET_PIN11_Min (0x0UL)
  #define GPIO_DIRSET_PIN11_Max (0x1UL)
  #define GPIO_DIRSET_PIN11_Input (0x0UL)
  #define GPIO_DIRSET_PIN11_Output (0x1UL)
  #define GPIO_DIRSET_PIN11_Set (0x1UL)

/* PIN12 @Bit 12 : Set as output pin 12 */
  #define GPIO_DIRSET_PIN12_Pos (12UL)
  #define GPIO_DIRSET_PIN12_Msk (0x1UL << GPIO_DIRSET_PIN12_Pos)
  #define GPIO_DIRSET_PIN12_Min (0x0UL)
  #define GPIO_DIRSET_PIN12_Max (0x1UL)
  #define GPIO_DIRSET_PIN12_Input (0x0UL)
  #define GPIO_DIRSET_PIN12_Output (0x1UL)
  #define GPIO_DIRSET_PIN12_Set (0x1UL)

/* PIN13 @Bit 13 : Set as output pin 13 */
  #define GPIO_DIRSET_PIN13_Pos (13UL)
  #define GPIO_DIRSET_PIN13_Msk (0x1UL << GPIO_DIRSET_PIN13_Pos)
  #define GPIO_DIRSET_PIN13_Min (0x0UL)
  #define GPIO_DIRSET_PIN13_Max (0x1UL)
  #define GPIO_DIRSET_PIN13_Input (0x0UL)
  #define GPIO_DIRSET_PIN13_Output (0x1UL)
  #define GPIO_DIRSET_PIN13_Set (0x1UL)

/* PIN14 @Bit 14 : Set as output pin 14 */
  #define GPIO_DIRSET_PIN14_Pos (14UL)
  #define GPIO_DIRSET_PIN14_Msk (0x1UL << GPIO_DIRSET_PIN14_Pos)
  #define GPIO_DIRSET_PIN14_Min (0x0UL)
  #define GPIO_DIRSET_PIN14_Max (0x1UL)
  #define GPIO_DIRSET_PIN14_Input (0x0UL)
  #define GPIO_DIRSET_PIN14_Output (0x1UL)
  #define GPIO_DIRSET_PIN14_Set (0x1UL)

/* PIN15 @Bit 15 : Set as output pin 15 */
  #define GPIO_DIRSET_PIN15_Pos (15UL)
  #define GPIO_DIRSET_PIN15_Msk (0x1UL << GPIO_DIRSET_PIN15_Pos)
  #define GPIO_DIRSET_PIN15_Min (0x0UL)
  #define GPIO_DIRSET_PIN15_Max (0x1UL)
  #define GPIO_DIRSET_PIN15_Input (0x0UL)
  #define GPIO_DIRSET_PIN15_Output (0x1UL)
  #define GPIO_DIRSET_PIN15_Set (0x1UL)

/* PIN16 @Bit 16 : Set as output pin 16 */
  #define GPIO_DIRSET_PIN16_Pos (16UL)
  #define GPIO_DIRSET_PIN16_Msk (0x1UL << GPIO_DIRSET_PIN16_Pos)
  #define GPIO_DIRSET_PIN16_Min (0x0UL)
  #define GPIO_DIRSET_PIN16_Max (0x1UL)
  #define GPIO_DIRSET_PIN16_Input (0x0UL)
  #define GPIO_DIRSET_PIN16_Output (0x1UL)
  #define GPIO_DIRSET_PIN16_Set (0x1UL)

/* PIN17 @Bit 17 : Set as output pin 17 */
  #define GPIO_DIRSET_PIN17_Pos (17UL)
  #define GPIO_DIRSET_PIN17_Msk (0x1UL << GPIO_DIRSET_PIN17_Pos)
  #define GPIO_DIRSET_PIN17_Min (0x0UL)
  #define GPIO_DIRSET_PIN17_Max (0x1UL)
  #define GPIO_DIRSET_PIN17_Input (0x0UL)
  #define GPIO_DIRSET_PIN17_Output (0x1UL)
  #define GPIO_DIRSET_PIN17_Set (0x1UL)

/* PIN18 @Bit 18 : Set as output pin 18 */
  #define GPIO_DIRSET_PIN18_Pos (18UL)
  #define GPIO_DIRSET_PIN18_Msk (0x1UL << GPIO_DIRSET_PIN18_Pos)
  #define GPIO_DIRSET_PIN18_Min (0x0UL)
  #define GPIO_DIRSET_PIN18_Max (0x1UL)
  #define GPIO_DIRSET_PIN18_Input (0x0UL)
  #define GPIO_DIRSET_PIN18_Output (0x1UL)
  #define GPIO_DIRSET_PIN18_Set (0x1UL)

/* PIN19 @Bit 19 : Set as output pin 19 */
  #define GPIO_DIRSET_PIN19_Pos (19UL)
  #define GPIO_DIRSET_PIN19_Msk (0x1UL << GPIO_DIRSET_PIN19_Pos)
  #define GPIO_DIRSET_PIN19_Min (0x0UL)
  #define GPIO_DIRSET_PIN19_Max (0x1UL)
  #define GPIO_DIRSET_PIN19_Input (0x0UL)
  #define GPIO_DIRSET_PIN19_Output (0x1UL)
  #define GPIO_DIRSET_PIN19_Set (0x1UL)

/* PIN20 @Bit 20 : Set as output pin 20 */
  #define GPIO_DIRSET_PIN20_Pos (20UL)
  #define GPIO_DIRSET_PIN20_Msk (0x1UL << GPIO_DIRSET_PIN20_Pos)
  #define GPIO_DIRSET_PIN20_Min (0x0UL)
  #define GPIO_DIRSET_PIN20_Max (0x1UL)
  #define GPIO_DIRSET_PIN20_Input (0x0UL)
  #define GPIO_DIRSET_PIN20_Output (0x1UL)
  #define GPIO_DIRSET_PIN20_Set (0x1UL)

/* PIN21 @Bit 21 : Set as output pin 21 */
  #define GPIO_DIRSET_PIN21_Pos (21UL)
  #define GPIO_DIRSET_PIN21_Msk (0x1UL << GPIO_DIRSET_PIN21_Pos)
  #define GPIO_DIRSET_PIN21_Min (0x0UL)
  #define GPIO_DIRSET_PIN21_Max (0x1UL)
  #define GPIO_DIRSET_PIN21_Input (0x0UL)
  #define GPIO_DIRSET_PIN21_Output (0x1UL)
  #define GPIO_DIRSET_PIN21_Set (0x1UL)

/* PIN22 @Bit 22 : Set as output pin 22 */
  #define GPIO_DIRSET_PIN22_Pos (22UL)
  #define GPIO_DIRSET_PIN22_Msk (0x1UL << GPIO_DIRSET_PIN22_Pos)
  #define GPIO_DIRSET_PIN22_Min (0x0UL)
  #define GPIO_DIRSET_PIN22_Max (0x1UL)
  #define GPIO_DIRSET_PIN22_Input (0x0UL)
  #define GPIO_DIRSET_PIN22_Output (0x1UL)
  #define GPIO_DIRSET_PIN22_Set (0x1UL)

/* PIN23 @Bit 23 : Set as output pin 23 */
  #define GPIO_DIRSET_PIN23_Pos (23UL)
  #define GPIO_DIRSET_PIN23_Msk (0x1UL << GPIO_DIRSET_PIN23_Pos)
  #define GPIO_DIRSET_PIN23_Min (0x0UL)
  #define GPIO_DIRSET_PIN23_Max (0x1UL)
  #define GPIO_DIRSET_PIN23_Input (0x0UL)
  #define GPIO_DIRSET_PIN23_Output (0x1UL)
  #define GPIO_DIRSET_PIN23_Set (0x1UL)

/* PIN24 @Bit 24 : Set as output pin 24 */
  #define GPIO_DIRSET_PIN24_Pos (24UL)
  #define GPIO_DIRSET_PIN24_Msk (0x1UL << GPIO_DIRSET_PIN24_Pos)
  #define GPIO_DIRSET_PIN24_Min (0x0UL)
  #define GPIO_DIRSET_PIN24_Max (0x1UL)
  #define GPIO_DIRSET_PIN24_Input (0x0UL)
  #define GPIO_DIRSET_PIN24_Output (0x1UL)
  #define GPIO_DIRSET_PIN24_Set (0x1UL)

/* PIN25 @Bit 25 : Set as output pin 25 */
  #define GPIO_DIRSET_PIN25_Pos (25UL)
  #define GPIO_DIRSET_PIN25_Msk (0x1UL << GPIO_DIRSET_PIN25_Pos)
  #define GPIO_DIRSET_PIN25_Min (0x0UL)
  #define GPIO_DIRSET_PIN25_Max (0x1UL)
  #define GPIO_DIRSET_PIN25_Input (0x0UL)
  #define GPIO_DIRSET_PIN25_Output (0x1UL)
  #define GPIO_DIRSET_PIN25_Set (0x1UL)

/* PIN26 @Bit 26 : Set as output pin 26 */
  #define GPIO_DIRSET_PIN26_Pos (26UL)
  #define GPIO_DIRSET_PIN26_Msk (0x1UL << GPIO_DIRSET_PIN26_Pos)
  #define GPIO_DIRSET_PIN26_Min (0x0UL)
  #define GPIO_DIRSET_PIN26_Max (0x1UL)
  #define GPIO_DIRSET_PIN26_Input (0x0UL)
  #define GPIO_DIRSET_PIN26_Output (0x1UL)
  #define GPIO_DIRSET_PIN26_Set (0x1UL)

/* PIN27 @Bit 27 : Set as output pin 27 */
  #define GPIO_DIRSET_PIN27_Pos (27UL)
  #define GPIO_DIRSET_PIN27_Msk (0x1UL << GPIO_DIRSET_PIN27_Pos)
  #define GPIO_DIRSET_PIN27_Min (0x0UL)
  #define GPIO_DIRSET_PIN27_Max (0x1UL)
  #define GPIO_DIRSET_PIN27_Input (0x0UL)
  #define GPIO_DIRSET_PIN27_Output (0x1UL)
  #define GPIO_DIRSET_PIN27_Set (0x1UL)

/* PIN28 @Bit 28 : Set as output pin 28 */
  #define GPIO_DIRSET_PIN28_Pos (28UL)
  #define GPIO_DIRSET_PIN28_Msk (0x1UL << GPIO_DIRSET_PIN28_Pos)
  #define GPIO_DIRSET_PIN28_Min (0x0UL)
  #define GPIO_DIRSET_PIN28_Max (0x1UL)
  #define GPIO_DIRSET_PIN28_Input (0x0UL)
  #define GPIO_DIRSET_PIN28_Output (0x1UL)
  #define GPIO_DIRSET_PIN28_Set (0x1UL)

/* PIN29 @Bit 29 : Set as output pin 29 */
  #define GPIO_DIRSET_PIN29_Pos (29UL)
  #define GPIO_DIRSET_PIN29_Msk (0x1UL << GPIO_DIRSET_PIN29_Pos)
  #define GPIO_DIRSET_PIN29_Min (0x0UL)
  #define GPIO_DIRSET_PIN29_Max (0x1UL)
  #define GPIO_DIRSET_PIN29_Input (0x0UL)
  #define GPIO_DIRSET_PIN29_Output (0x1UL)
  #define GPIO_DIRSET_PIN29_Set (0x1UL)

/* PIN30 @Bit 30 : Set as output pin 30 */
  #define GPIO_DIRSET_PIN30_Pos (30UL)
  #define GPIO_DIRSET_PIN30_Msk (0x1UL << GPIO_DIRSET_PIN30_Pos)
  #define GPIO_DIRSET_PIN30_Min (0x0UL)
  #define GPIO_DIRSET_PIN30_Max (0x1UL)
  #define GPIO_DIRSET_PIN30_Input (0x0UL)
  #define GPIO_DIRSET_PIN30_Output (0x1UL)
  #define GPIO_DIRSET_PIN30_Set (0x1UL)

/* PIN31 @Bit 31 : Set as output pin 31 */
  #define GPIO_DIRSET_PIN31_Pos (31UL)
  #define GPIO_DIRSET_PIN31_Msk (0x1UL << GPIO_DIRSET_PIN31_Pos)
  #define GPIO_DIRSET_PIN31_Min (0x0UL)
  #define GPIO_DIRSET_PIN31_Max (0x1UL)
  #define GPIO_DIRSET_PIN31_Input (0x0UL)
  #define GPIO_DIRSET_PIN31_Output (0x1UL)
  #define GPIO_DIRSET_PIN31_Set (0x1UL)


/* GPIO_DIRCLR: DIR clear register */
  #define GPIO_DIRCLR_ResetValue (0x00000000UL)

