pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN0 @Bit 0 : Set as input pin 0 */
  #define GPIO_DIRCLR_PIN0_Pos (0UL)
  #define GPIO_DIRCLR_PIN0_Msk (0x1UL << GPIO_DIRCLR_PIN0_Pos)
  #define GPIO_DIRCLR_PIN0_Min (0x0UL)
  #define GPIO_DIRCLR_PIN0_Max (0x1UL)
  #define GPIO_DIRCLR_PIN0_Input (0x0UL)
  #define GPIO_DIRCLR_PIN0_Output (0x1UL)
  #define GPIO_DIRCLR_PIN0_Clear (0x1UL)

/* PIN1 @Bit 1 : Set as input pin 1 */
  #define GPIO_DIRCLR_PIN1_Pos (1UL)
  #define GPIO_DIRCLR_PIN1_Msk (0x1UL << GPIO_DIRCLR_PIN1_Pos)
  #define GPIO_DIRCLR_PIN1_Min (0x0UL)
  #define GPIO_DIRCLR_PIN1_Max (0x1UL)
  #define GPIO_DIRCLR_PIN1_Input (0x0UL)
  #define GPIO_DIRCLR_PIN1_Output (0x1UL)
  #define GPIO_DIRCLR_PIN1_Clear (0x1UL)

/* PIN2 @Bit 2 : Set as input pin 2 */
  #define GPIO_DIRCLR_PIN2_Pos (2UL)
  #define GPIO_DIRCLR_PIN2_Msk (0x1UL << GPIO_DIRCLR_PIN2_Pos)
  #define GPIO_DIRCLR_PIN2_Min (0x0UL)
  #define GPIO_DIRCLR_PIN2_Max (0x1UL)
  #define GPIO_DIRCLR_PIN2_Input (0x0UL)
  #define GPIO_DIRCLR_PIN2_Output (0x1UL)
  #define GPIO_DIRCLR_PIN2_Clear (0x1UL)

/* PIN3 @Bit 3 : Set as input pin 3 */
  #define GPIO_DIRCLR_PIN3_Pos (3UL)
  #define GPIO_DIRCLR_PIN3_Msk (0x1UL << GPIO_DIRCLR_PIN3_Pos)
  #define GPIO_DIRCLR_PIN3_Min (0x0UL)
  #define GPIO_DIRCLR_PIN3_Max (0x1UL)
  #define GPIO_DIRCLR_PIN3_Input (0x0UL)
  #define GPIO_DIRCLR_PIN3_Output (0x1UL)
  #define GPIO_DIRCLR_PIN3_Clear (0x1UL)

/* PIN4 @Bit 4 : Set as input pin 4 */
  #define GPIO_DIRCLR_PIN4_Pos (4UL)
  #define GPIO_DIRCLR_PIN4_Msk (0x1UL << GPIO_DIRCLR_PIN4_Pos)
  #define GPIO_DIRCLR_PIN4_Min (0x0UL)
  #define GPIO_DIRCLR_PIN4_Max (0x1UL)
  #define GPIO_DIRCLR_PIN4_Input (0x0UL)
  #define GPIO_DIRCLR_PIN4_Output (0x1UL)
  #define GPIO_DIRCLR_PIN4_Clear (0x1UL)

/* PIN5 @Bit 5 : Set as input pin 5 */
  #define GPIO_DIRCLR_PIN5_Pos (5UL)
  #define GPIO_DIRCLR_PIN5_Msk (0x1UL << GPIO_DIRCLR_PIN5_Pos)
  #define GPIO_DIRCLR_PIN5_Min (0x0UL)
  #define GPIO_DIRCLR_PIN5_Max (0x1UL)
  #define GPIO_DIRCLR_PIN5_Input (0x0UL)
  #define GPIO_DIRCLR_PIN5_Output (0x1UL)
  #define GPIO_DIRCLR_PIN5_Clear (0x1UL)

/* PIN6 @Bit 6 : Set as input pin 6 */
  #define GPIO_DIRCLR_PIN6_Pos (6UL)
  #define GPIO_DIRCLR_PIN6_Msk (0x1UL << GPIO_DIRCLR_PIN6_Pos)
  #define GPIO_DIRCLR_PIN6_Min (0x0UL)
  #define GPIO_DIRCLR_PIN6_Max (0x1UL)
  #define GPIO_DIRCLR_PIN6_Input (0x0UL)
  #define GPIO_DIRCLR_PIN6_Output (0x1UL)
  #define GPIO_DIRCLR_PIN6_Clear (0x1UL)

/* PIN7 @Bit 7 : Set as input pin 7 */
  #define GPIO_DIRCLR_PIN7_Pos (7UL)
  #define GPIO_DIRCLR_PIN7_Msk (0x1UL << GPIO_DIRCLR_PIN7_Pos)
  #define GPIO_DIRCLR_PIN7_Min (0x0UL)
  #define GPIO_DIRCLR_PIN7_Max (0x1UL)
  #define GPIO_DIRCLR_PIN7_Input (0x0UL)
  #define GPIO_DIRCLR_PIN7_Output (0x1UL)
  #define GPIO_DIRCLR_PIN7_Clear (0x1UL)

/* PIN8 @Bit 8 : Set as input pin 8 */
  #define GPIO_DIRCLR_PIN8_Pos (8UL)
  #define GPIO_DIRCLR_PIN8_Msk (0x1UL << GPIO_DIRCLR_PIN8_Pos)
  #define GPIO_DIRCLR_PIN8_Min (0x0UL)
  #define GPIO_DIRCLR_PIN8_Max (0x1UL)
  #define GPIO_DIRCLR_PIN8_Input (0x0UL)
  #define GPIO_DIRCLR_PIN8_Output (0x1UL)
  #define GPIO_DIRCLR_PIN8_Clear (0x1UL)

/* PIN9 @Bit 9 : Set as input pin 9 */
  #define GPIO_DIRCLR_PIN9_Pos (9UL)
  #define GPIO_DIRCLR_PIN9_Msk (0x1UL << GPIO_DIRCLR_PIN9_Pos)
  #define GPIO_DIRCLR_PIN9_Min (0x0UL)
  #define GPIO_DIRCLR_PIN9_Max (0x1UL)
  #define GPIO_DIRCLR_PIN9_Input (0x0UL)
  #define GPIO_DIRCLR_PIN9_Output (0x1UL)
  #define GPIO_DIRCLR_PIN9_Clear (0x1UL)

/* PIN10 @Bit 10 : Set as input pin 10 */
  #define GPIO_DIRCLR_PIN10_Pos (10UL)
  #define GPIO_DIRCLR_PIN10_Msk (0x1UL << GPIO_DIRCLR_PIN10_Pos)
  #define GPIO_DIRCLR_PIN10_Min (0x0UL)
  #define GPIO_DIRCLR_PIN10_Max (0x1UL)
  #define GPIO_DIRCLR_PIN10_Input (0x0UL)
  #define GPIO_DIRCLR_PIN10_Output (0x1UL)
  #define GPIO_DIRCLR_PIN10_Clear (0x1UL)

/* PIN11 @Bit 11 : Set as input pin 11 */
  #define GPIO_DIRCLR_PIN11_Pos (11UL)
  #define GPIO_DIRCLR_PIN11_Msk (0x1UL << GPIO_DIRCLR_PIN11_Pos)
  #define GPIO_DIRCLR_PIN11_Min (0x0UL)
  #define GPIO_DIRCLR_PIN11_Max (0x1UL)
  #define GPIO_DIRCLR_PIN11_Input (0x0UL)
  #define GPIO_DIRCLR_PIN11_Output (0x1UL)
  #define GPIO_DIRCLR_PIN11_Clear (0x1UL)

/* PIN12 @Bit 12 : Set as input pin 12 */
  #define GPIO_DIRCLR_PIN12_Pos (12UL)
  #define GPIO_DIRCLR_PIN12_Msk (0x1UL << GPIO_DIRCLR_PIN12_Pos)
  #define GPIO_DIRCLR_PIN12_Min (0x0UL)
  #define GPIO_DIRCLR_PIN12_Max (0x1UL)
  #define GPIO_DIRCLR_PIN12_Input (0x0UL)
  #define GPIO_DIRCLR_PIN12_Output (0x1UL)
  #define GPIO_DIRCLR_PIN12_Clear (0x1UL)

/* PIN13 @Bit 13 : Set as input pin 13 */
  #define GPIO_DIRCLR_PIN13_Pos (13UL)
  #define GPIO_DIRCLR_PIN13_Msk (0x1UL << GPIO_DIRCLR_PIN13_Pos)
  #define GPIO_DIRCLR_PIN13_Min (0x0UL)
  #define GPIO_DIRCLR_PIN13_Max (0x1UL)
  #define GPIO_DIRCLR_PIN13_Input (0x0UL)
  #define GPIO_DIRCLR_PIN13_Output (0x1UL)
  #define GPIO_DIRCLR_PIN13_Clear (0x1UL)

/* PIN14 @Bit 14 : Set as input pin 14 */
  #define GPIO_DIRCLR_PIN14_Pos (14UL)
  #define GPIO_DIRCLR_PIN14_Msk (0x1UL << GPIO_DIRCLR_PIN14_Pos)
  #define GPIO_DIRCLR_PIN14_Min (0x0UL)
  #define GPIO_DIRCLR_PIN14_Max (0x1UL)
  #define GPIO_DIRCLR_PIN14_Input (0x0UL)
  #define GPIO_DIRCLR_PIN14_Output (0x1UL)
  #define GPIO_DIRCLR_PIN14_Clear (0x1UL)

/* PIN15 @Bit 15 : Set as input pin 15 */
  #define GPIO_DIRCLR_PIN15_Pos (15UL)
  #define GPIO_DIRCLR_PIN15_Msk (0x1UL << GPIO_DIRCLR_PIN15_Pos)
  #define GPIO_DIRCLR_PIN15_Min (0x0UL)
  #define GPIO_DIRCLR_PIN15_Max (0x1UL)
  #define GPIO_DIRCLR_PIN15_Input (0x0UL)
  #define GPIO_DIRCLR_PIN15_Output (0x1UL)
  #define GPIO_DIRCLR_PIN15_Clear (0x1UL)

/* PIN16 @Bit 16 : Set as input pin 16 */
  #define GPIO_DIRCLR_PIN16_Pos (16UL)
  #define GPIO_DIRCLR_PIN16_Msk (0x1UL << GPIO_DIRCLR_PIN16_Pos)
  #define GPIO_DIRCLR_PIN16_Min (0x0UL)
  #define GPIO_DIRCLR_PIN16_Max (0x1UL)
  #define GPIO_DIRCLR_PIN16_Input (0x0UL)
  #define GPIO_DIRCLR_PIN16_Output (0x1UL)
  #define GPIO_DIRCLR_PIN16_Clear (0x1UL)

/* PIN17 @Bit 17 : Set as input pin 17 */
  #define GPIO_DIRCLR_PIN17_Pos (17UL)
  #define GPIO_DIRCLR_PIN17_Msk (0x1UL << GPIO_DIRCLR_PIN17_Pos)
  #define GPIO_DIRCLR_PIN17_Min (0x0UL)
  #define GPIO_DIRCLR_PIN17_Max (0x1UL)
  #define GPIO_DIRCLR_PIN17_Input (0x0UL)
  #define GPIO_DIRCLR_PIN17_Output (0x1UL)
  #define GPIO_DIRCLR_PIN17_Clear (0x1UL)

/* PIN18 @Bit 18 : Set as input pin 18 */
  #define GPIO_DIRCLR_PIN18_Pos (18UL)
  #define GPIO_DIRCLR_PIN18_Msk (0x1UL << GPIO_DIRCLR_PIN18_Pos)
  #define GPIO_DIRCLR_PIN18_Min (0x0UL)
  #define GPIO_DIRCLR_PIN18_Max (0x1UL)
  #define GPIO_DIRCLR_PIN18_Input (0x0UL)
  #define GPIO_DIRCLR_PIN18_Output (0x1UL)
  #define GPIO_DIRCLR_PIN18_Clear (0x1UL)

/* PIN19 @Bit 19 : Set as input pin 19 */
  #define GPIO_DIRCLR_PIN19_Pos (19UL)
  #define GPIO_DIRCLR_PIN19_Msk (0x1UL << GPIO_DIRCLR_PIN19_Pos)
  #define GPIO_DIRCLR_PIN19_Min (0x0UL)
  #define GPIO_DIRCLR_PIN19_Max (0x1UL)
  #define GPIO_DIRCLR_PIN19_Input (0x0UL)
  #define GPIO_DIRCLR_PIN19_Output (0x1UL)
  #define GPIO_DIRCLR_PIN19_Clear (0x1UL)

/* PIN20 @Bit 20 : Set as input pin 20 */
  #define GPIO_DIRCLR_PIN20_Pos (20UL)
  #define GPIO_DIRCLR_PIN20_Msk (0x1UL << GPIO_DIRCLR_PIN20_Pos)
  #define GPIO_DIRCLR_PIN20_Min (0x0UL)
  #define GPIO_DIRCLR_PIN20_Max (0x1UL)
  #define GPIO_DIRCLR_PIN20_Input (0x0UL)
  #define GPIO_DIRCLR_PIN20_Output (0x1UL)
  #define GPIO_DIRCLR_PIN20_Clear (0x1UL)

/* PIN21 @Bit 21 : Set as input pin 21 */
  #define GPIO_DIRCLR_PIN21_Pos (21UL)
  #define GPIO_DIRCLR_PIN21_Msk (0x1UL << GPIO_DIRCLR_PIN21_Pos)
  #define GPIO_DIRCLR_PIN21_Min (0x0UL)
  #define GPIO_DIRCLR_PIN21_Max (0x1UL)
  #define GPIO_DIRCLR_PIN21_Input (0x0UL)
  #define GPIO_DIRCLR_PIN21_Output (0x1UL)
  #define GPIO_DIRCLR_PIN21_Clear (0x1UL)

/* PIN22 @Bit 22 : Set as input pin 22 */
  #define GPIO_DIRCLR_PIN22_Pos (22UL)
  #define GPIO_DIRCLR_PIN22_Msk (0x1UL << GPIO_DIRCLR_PIN22_Pos)
  #define GPIO_DIRCLR_PIN22_Min (0x0UL)
  #define GPIO_DIRCLR_PIN22_Max (0x1UL)
  #define GPIO_DIRCLR_PIN22_Input (0x0UL)
  #define GPIO_DIRCLR_PIN22_Output (0x1UL)
  #define GPIO_DIRCLR_PIN22_Clear (0x1UL)

/* PIN23 @Bit 23 : Set as input pin 23 */
  #define GPIO_DIRCLR_PIN23_Pos (23UL)
  #define GPIO_DIRCLR_PIN23_Msk (0x1UL << GPIO_DIRCLR_PIN23_Pos)
  #define GPIO_DIRCLR_PIN23_Min (0x0UL)
  #define GPIO_DIRCLR_PIN23_Max (0x1UL)
  #define GPIO_DIRCLR_PIN23_Input (0x0UL)
  #define GPIO_DIRCLR_PIN23_Output (0x1UL)
  #define GPIO_DIRCLR_PIN23_Clear (0x1UL)

/* PIN24 @Bit 24 : Set as input pin 24 */
  #define GPIO_DIRCLR_PIN24_Pos (24UL)
  #define GPIO_DIRCLR_PIN24_Msk (0x1UL << GPIO_DIRCLR_PIN24_Pos)
  #define GPIO_DIRCLR_PIN24_Min (0x0UL)
  #define GPIO_DIRCLR_PIN24_Max (0x1UL)
  #define GPIO_DIRCLR_PIN24_Input (0x0UL)
  #define GPIO_DIRCLR_PIN24_Output (0x1UL)
  #define GPIO_DIRCLR_PIN24_Clear (0x1UL)

/* PIN25 @Bit 25 : Set as input pin 25 */
  #define GPIO_DIRCLR_PIN25_Pos (25UL)
  #define GPIO_DIRCLR_PIN25_Msk (0x1UL << GPIO_DIRCLR_PIN25_Pos)
  #define GPIO_DIRCLR_PIN25_Min (0x0UL)
  #define GPIO_DIRCLR_PIN25_Max (0x1UL)
  #define GPIO_DIRCLR_PIN25_Input (0x0UL)
  #define GPIO_DIRCLR_PIN25_Output (0x1UL)
  #define GPIO_DIRCLR_PIN25_Clear (0x1UL)

/* PIN26 @Bit 26 : Set as input pin 26 */
  #define GPIO_DIRCLR_PIN26_Pos (26UL)
  #define GPIO_DIRCLR_PIN26_Msk (0x1UL << GPIO_DIRCLR_PIN26_Pos)
  #define GPIO_DIRCLR_PIN26_Min (0x0UL)
  #define GPIO_DIRCLR_PIN26_Max (0x1UL)
  #define GPIO_DIRCLR_PIN26_Input (0x0UL)
  #define GPIO_DIRCLR_PIN26_Output (0x1UL)
  #define GPIO_DIRCLR_PIN26_Clear (0x1UL)

/* PIN27 @Bit 27 : Set as input pin 27 */
  #define GPIO_DIRCLR_PIN27_Pos (27UL)
  #define GPIO_DIRCLR_PIN27_Msk (0x1UL << GPIO_DIRCLR_PIN27_Pos)
  #define GPIO_DIRCLR_PIN27_Min (0x0UL)
  #define GPIO_DIRCLR_PIN27_Max (0x1UL)
  #define GPIO_DIRCLR_PIN27_Input (0x0UL)
  #define GPIO_DIRCLR_PIN27_Output (0x1UL)
  #define GPIO_DIRCLR_PIN27_Clear (0x1UL)

