pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN28 @Bit 28 : Set as input pin 28 */
  #define GPIO_DIRCLR_PIN28_Pos (28UL)
  #define GPIO_DIRCLR_PIN28_Msk (0x1UL << GPIO_DIRCLR_PIN28_Pos)
  #define GPIO_DIRCLR_PIN28_Min (0x0UL)
  #define GPIO_DIRCLR_PIN28_Max (0x1UL)
  #define GPIO_DIRCLR_PIN28_Input (0x0UL)
  #define GPIO_DIRCLR_PIN28_Output (0x1UL)
  #define GPIO_DIRCLR_PIN28_Clear (0x1UL)

/* PIN29 @Bit 29 : Set as input pin 29 */
  #define GPIO_DIRCLR_PIN29_Pos (29UL)
  #define GPIO_DIRCLR_PIN29_Msk (0x1UL << GPIO_DIRCLR_PIN29_Pos)
  #define GPIO_DIRCLR_PIN29_Min (0x0UL)
  #define GPIO_DIRCLR_PIN29_Max (0x1UL)
  #define GPIO_DIRCLR_PIN29_Input (0x0UL)
  #define GPIO_DIRCLR_PIN29_Output (0x1UL)
  #define GPIO_DIRCLR_PIN29_Clear (0x1UL)

/* PIN30 @Bit 30 : Set as input pin 30 */
  #define GPIO_DIRCLR_PIN30_Pos (30UL)
  #define GPIO_DIRCLR_PIN30_Msk (0x1UL << GPIO_DIRCLR_PIN30_Pos)
  #define GPIO_DIRCLR_PIN30_Min (0x0UL)
  #define GPIO_DIRCLR_PIN30_Max (0x1UL)
  #define GPIO_DIRCLR_PIN30_Input (0x0UL)
  #define GPIO_DIRCLR_PIN30_Output (0x1UL)
  #define GPIO_DIRCLR_PIN30_Clear (0x1UL)

/* PIN31 @Bit 31 : Set as input pin 31 */
  #define GPIO_DIRCLR_PIN31_Pos (31UL)
  #define GPIO_DIRCLR_PIN31_Msk (0x1UL << GPIO_DIRCLR_PIN31_Pos)
  #define GPIO_DIRCLR_PIN31_Min (0x0UL)
  #define GPIO_DIRCLR_PIN31_Max (0x1UL)
  #define GPIO_DIRCLR_PIN31_Input (0x0UL)
  #define GPIO_DIRCLR_PIN31_Output (0x1UL)
  #define GPIO_DIRCLR_PIN31_Clear (0x1UL)


/* GPIO_LATCH: Latch register indicating what GPIO pins that have met the criteria set in the PIN_CNF[n].SENSE registers */
  #define GPIO_LATCH_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : Status on whether PIN0 has met criteria set in PIN_CNF[0].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN0_Pos (0UL)
  #define GPIO_LATCH_PIN0_Msk (0x1UL << GPIO_LATCH_PIN0_Pos)
  #define GPIO_LATCH_PIN0_Min (0x0UL)
  #define GPIO_LATCH_PIN0_Max (0x1UL)
  #define GPIO_LATCH_PIN0_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN0_Latched (0x1UL)

/* PIN1 @Bit 1 : Status on whether PIN1 has met criteria set in PIN_CNF[1].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN1_Pos (1UL)
  #define GPIO_LATCH_PIN1_Msk (0x1UL << GPIO_LATCH_PIN1_Pos)
  #define GPIO_LATCH_PIN1_Min (0x0UL)
  #define GPIO_LATCH_PIN1_Max (0x1UL)
  #define GPIO_LATCH_PIN1_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN1_Latched (0x1UL)

/* PIN2 @Bit 2 : Status on whether PIN2 has met criteria set in PIN_CNF[2].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN2_Pos (2UL)
  #define GPIO_LATCH_PIN2_Msk (0x1UL << GPIO_LATCH_PIN2_Pos)
  #define GPIO_LATCH_PIN2_Min (0x0UL)
  #define GPIO_LATCH_PIN2_Max (0x1UL)
  #define GPIO_LATCH_PIN2_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN2_Latched (0x1UL)

/* PIN3 @Bit 3 : Status on whether PIN3 has met criteria set in PIN_CNF[3].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN3_Pos (3UL)
  #define GPIO_LATCH_PIN3_Msk (0x1UL << GPIO_LATCH_PIN3_Pos)
  #define GPIO_LATCH_PIN3_Min (0x0UL)
  #define GPIO_LATCH_PIN3_Max (0x1UL)
  #define GPIO_LATCH_PIN3_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN3_Latched (0x1UL)

/* PIN4 @Bit 4 : Status on whether PIN4 has met criteria set in PIN_CNF[4].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN4_Pos (4UL)
  #define GPIO_LATCH_PIN4_Msk (0x1UL << GPIO_LATCH_PIN4_Pos)
  #define GPIO_LATCH_PIN4_Min (0x0UL)
  #define GPIO_LATCH_PIN4_Max (0x1UL)
  #define GPIO_LATCH_PIN4_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN4_Latched (0x1UL)

/* PIN5 @Bit 5 : Status on whether PIN5 has met criteria set in PIN_CNF[5].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN5_Pos (5UL)
  #define GPIO_LATCH_PIN5_Msk (0x1UL << GPIO_LATCH_PIN5_Pos)
  #define GPIO_LATCH_PIN5_Min (0x0UL)
  #define GPIO_LATCH_PIN5_Max (0x1UL)
  #define GPIO_LATCH_PIN5_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN5_Latched (0x1UL)

/* PIN6 @Bit 6 : Status on whether PIN6 has met criteria set in PIN_CNF[6].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN6_Pos (6UL)
  #define GPIO_LATCH_PIN6_Msk (0x1UL << GPIO_LATCH_PIN6_Pos)
  #define GPIO_LATCH_PIN6_Min (0x0UL)
  #define GPIO_LATCH_PIN6_Max (0x1UL)
  #define GPIO_LATCH_PIN6_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN6_Latched (0x1UL)

/* PIN7 @Bit 7 : Status on whether PIN7 has met criteria set in PIN_CNF[7].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN7_Pos (7UL)
  #define GPIO_LATCH_PIN7_Msk (0x1UL << GPIO_LATCH_PIN7_Pos)
  #define GPIO_LATCH_PIN7_Min (0x0UL)
  #define GPIO_LATCH_PIN7_Max (0x1UL)
  #define GPIO_LATCH_PIN7_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN7_Latched (0x1UL)

/* PIN8 @Bit 8 : Status on whether PIN8 has met criteria set in PIN_CNF[8].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN8_Pos (8UL)
  #define GPIO_LATCH_PIN8_Msk (0x1UL << GPIO_LATCH_PIN8_Pos)
  #define GPIO_LATCH_PIN8_Min (0x0UL)
  #define GPIO_LATCH_PIN8_Max (0x1UL)
  #define GPIO_LATCH_PIN8_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN8_Latched (0x1UL)

/* PIN9 @Bit 9 : Status on whether PIN9 has met criteria set in PIN_CNF[9].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN9_Pos (9UL)
  #define GPIO_LATCH_PIN9_Msk (0x1UL << GPIO_LATCH_PIN9_Pos)
  #define GPIO_LATCH_PIN9_Min (0x0UL)
  #define GPIO_LATCH_PIN9_Max (0x1UL)
  #define GPIO_LATCH_PIN9_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN9_Latched (0x1UL)

/* PIN10 @Bit 10 : Status on whether PIN10 has met criteria set in PIN_CNF[10].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN10_Pos (10UL)
  #define GPIO_LATCH_PIN10_Msk (0x1UL << GPIO_LATCH_PIN10_Pos)
  #define GPIO_LATCH_PIN10_Min (0x0UL)
  #define GPIO_LATCH_PIN10_Max (0x1UL)
  #define GPIO_LATCH_PIN10_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN10_Latched (0x1UL)

/* PIN11 @Bit 11 : Status on whether PIN11 has met criteria set in PIN_CNF[11].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN11_Pos (11UL)
  #define GPIO_LATCH_PIN11_Msk (0x1UL << GPIO_LATCH_PIN11_Pos)
  #define GPIO_LATCH_PIN11_Min (0x0UL)
  #define GPIO_LATCH_PIN11_Max (0x1UL)
  #define GPIO_LATCH_PIN11_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN11_Latched (0x1UL)

/* PIN12 @Bit 12 : Status on whether PIN12 has met criteria set in PIN_CNF[12].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN12_Pos (12UL)
  #define GPIO_LATCH_PIN12_Msk (0x1UL << GPIO_LATCH_PIN12_Pos)
  #define GPIO_LATCH_PIN12_Min (0x0UL)
  #define GPIO_LATCH_PIN12_Max (0x1UL)
  #define GPIO_LATCH_PIN12_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN12_Latched (0x1UL)

/* PIN13 @Bit 13 : Status on whether PIN13 has met criteria set in PIN_CNF[13].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN13_Pos (13UL)
  #define GPIO_LATCH_PIN13_Msk (0x1UL << GPIO_LATCH_PIN13_Pos)
  #define GPIO_LATCH_PIN13_Min (0x0UL)
  #define GPIO_LATCH_PIN13_Max (0x1UL)
  #define GPIO_LATCH_PIN13_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN13_Latched (0x1UL)

/* PIN14 @Bit 14 : Status on whether PIN14 has met criteria set in PIN_CNF[14].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN14_Pos (14UL)
  #define GPIO_LATCH_PIN14_Msk (0x1UL << GPIO_LATCH_PIN14_Pos)
  #define GPIO_LATCH_PIN14_Min (0x0UL)
  #define GPIO_LATCH_PIN14_Max (0x1UL)
  #define GPIO_LATCH_PIN14_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN14_Latched (0x1UL)

/* PIN15 @Bit 15 : Status on whether PIN15 has met criteria set in PIN_CNF[15].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN15_Pos (15UL)
  #define GPIO_LATCH_PIN15_Msk (0x1UL << GPIO_LATCH_PIN15_Pos)
  #define GPIO_LATCH_PIN15_Min (0x0UL)
  #define GPIO_LATCH_PIN15_Max (0x1UL)
  #define GPIO_LATCH_PIN15_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN15_Latched (0x1UL)

/* PIN16 @Bit 16 : Status on whether PIN16 has met criteria set in PIN_CNF[16].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN16_Pos (16UL)
  #define GPIO_LATCH_PIN16_Msk (0x1UL << GPIO_LATCH_PIN16_Pos)
  #define GPIO_LATCH_PIN16_Min (0x0UL)
  #define GPIO_LATCH_PIN16_Max (0x1UL)
  #define GPIO_LATCH_PIN16_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN16_Latched (0x1UL)

/* PIN17 @Bit 17 : Status on whether PIN17 has met criteria set in PIN_CNF[17].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN17_Pos (17UL)
  #define GPIO_LATCH_PIN17_Msk (0x1UL << GPIO_LATCH_PIN17_Pos)
  #define GPIO_LATCH_PIN17_Min (0x0UL)
  #define GPIO_LATCH_PIN17_Max (0x1UL)
  #define GPIO_LATCH_PIN17_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN17_Latched (0x1UL)

/* PIN18 @Bit 18 : Status on whether PIN18 has met criteria set in PIN_CNF[18].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN18_Pos (18UL)
  #define GPIO_LATCH_PIN18_Msk (0x1UL << GPIO_LATCH_PIN18_Pos)
  #define GPIO_LATCH_PIN18_Min (0x0UL)
  #define GPIO_LATCH_PIN18_Max (0x1UL)
  #define GPIO_LATCH_PIN18_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN18_Latched (0x1UL)

/* PIN19 @Bit 19 : Status on whether PIN19 has met criteria set in PIN_CNF[19].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN19_Pos (19UL)
  #define GPIO_LATCH_PIN19_Msk (0x1UL << GPIO_LATCH_PIN19_Pos)
  #define GPIO_LATCH_PIN19_Min (0x0UL)
  #define GPIO_LATCH_PIN19_Max (0x1UL)
  #define GPIO_LATCH_PIN19_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN19_Latched (0x1UL)

/* PIN20 @Bit 20 : Status on whether PIN20 has met criteria set in PIN_CNF[20].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN20_Pos (20UL)
  #define GPIO_LATCH_PIN20_Msk (0x1UL << GPIO_LATCH_PIN20_Pos)
  #define GPIO_LATCH_PIN20_Min (0x0UL)
  #define GPIO_LATCH_PIN20_Max (0x1UL)
  #define GPIO_LATCH_PIN20_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN20_Latched (0x1UL)

/* PIN21 @Bit 21 : Status on whether PIN21 has met criteria set in PIN_CNF[21].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN21_Pos (21UL)
  #define GPIO_LATCH_PIN21_Msk (0x1UL << GPIO_LATCH_PIN21_Pos)
  #define GPIO_LATCH_PIN21_Min (0x0UL)
  #define GPIO_LATCH_PIN21_Max (0x1UL)
  #define GPIO_LATCH_PIN21_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN21_Latched (0x1UL)

/* PIN22 @Bit 22 : Status on whether PIN22 has met criteria set in PIN_CNF[22].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN22_Pos (22UL)
  #define GPIO_LATCH_PIN22_Msk (0x1UL << GPIO_LATCH_PIN22_Pos)
  #define GPIO_LATCH_PIN22_Min (0x0UL)
  #define GPIO_LATCH_PIN22_Max (0x1UL)
  #define GPIO_LATCH_PIN22_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN22_Latched (0x1UL)

/* PIN23 @Bit 23 : Status on whether PIN23 has met criteria set in PIN_CNF[23].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN23_Pos (23UL)
  #define GPIO_LATCH_PIN23_Msk (0x1UL << GPIO_LATCH_PIN23_Pos)
  #define GPIO_LATCH_PIN23_Min (0x0UL)
  #define GPIO_LATCH_PIN23_Max (0x1UL)
  #define GPIO_LATCH_PIN23_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN23_Latched (0x1UL)

