pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN24 @Bit 24 : Status on whether PIN24 has met criteria set in PIN_CNF[24].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN24_Pos (24UL)
  #define GPIO_LATCH_PIN24_Msk (0x1UL << GPIO_LATCH_PIN24_Pos)
  #define GPIO_LATCH_PIN24_Min (0x0UL)
  #define GPIO_LATCH_PIN24_Max (0x1UL)
  #define GPIO_LATCH_PIN24_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN24_Latched (0x1UL)

/* PIN25 @Bit 25 : Status on whether PIN25 has met criteria set in PIN_CNF[25].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN25_Pos (25UL)
  #define GPIO_LATCH_PIN25_Msk (0x1UL << GPIO_LATCH_PIN25_Pos)
  #define GPIO_LATCH_PIN25_Min (0x0UL)
  #define GPIO_LATCH_PIN25_Max (0x1UL)
  #define GPIO_LATCH_PIN25_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN25_Latched (0x1UL)

/* PIN26 @Bit 26 : Status on whether PIN26 has met criteria set in PIN_CNF[26].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN26_Pos (26UL)
  #define GPIO_LATCH_PIN26_Msk (0x1UL << GPIO_LATCH_PIN26_Pos)
  #define GPIO_LATCH_PIN26_Min (0x0UL)
  #define GPIO_LATCH_PIN26_Max (0x1UL)
  #define GPIO_LATCH_PIN26_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN26_Latched (0x1UL)

/* PIN27 @Bit 27 : Status on whether PIN27 has met criteria set in PIN_CNF[27].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN27_Pos (27UL)
  #define GPIO_LATCH_PIN27_Msk (0x1UL << GPIO_LATCH_PIN27_Pos)
  #define GPIO_LATCH_PIN27_Min (0x0UL)
  #define GPIO_LATCH_PIN27_Max (0x1UL)
  #define GPIO_LATCH_PIN27_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN27_Latched (0x1UL)

/* PIN28 @Bit 28 : Status on whether PIN28 has met criteria set in PIN_CNF[28].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN28_Pos (28UL)
  #define GPIO_LATCH_PIN28_Msk (0x1UL << GPIO_LATCH_PIN28_Pos)
  #define GPIO_LATCH_PIN28_Min (0x0UL)
  #define GPIO_LATCH_PIN28_Max (0x1UL)
  #define GPIO_LATCH_PIN28_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN28_Latched (0x1UL)

/* PIN29 @Bit 29 : Status on whether PIN29 has met criteria set in PIN_CNF[29].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN29_Pos (29UL)
  #define GPIO_LATCH_PIN29_Msk (0x1UL << GPIO_LATCH_PIN29_Pos)
  #define GPIO_LATCH_PIN29_Min (0x0UL)
  #define GPIO_LATCH_PIN29_Max (0x1UL)
  #define GPIO_LATCH_PIN29_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN29_Latched (0x1UL)

/* PIN30 @Bit 30 : Status on whether PIN30 has met criteria set in PIN_CNF[30].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN30_Pos (30UL)
  #define GPIO_LATCH_PIN30_Msk (0x1UL << GPIO_LATCH_PIN30_Pos)
  #define GPIO_LATCH_PIN30_Min (0x0UL)
  #define GPIO_LATCH_PIN30_Max (0x1UL)
  #define GPIO_LATCH_PIN30_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN30_Latched (0x1UL)

/* PIN31 @Bit 31 : Status on whether PIN31 has met criteria set in PIN_CNF[31].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN31_Pos (31UL)
  #define GPIO_LATCH_PIN31_Msk (0x1UL << GPIO_LATCH_PIN31_Pos)
  #define GPIO_LATCH_PIN31_Min (0x0UL)
  #define GPIO_LATCH_PIN31_Max (0x1UL)
  #define GPIO_LATCH_PIN31_NotLatched (0x0UL)
  #define GPIO_LATCH_PIN31_Latched (0x1UL)


/* GPIO_DETECTMODE: Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_ResetValue (0x00000000UL)

/* DETECTMODE @Bit 0 : Select between default DETECT signal behavior and LDETECT mode */
  #define GPIO_DETECTMODE_DETECTMODE_Pos (0UL)
  #define GPIO_DETECTMODE_DETECTMODE_Msk (0x1UL << GPIO_DETECTMODE_DETECTMODE_Pos)
  #define GPIO_DETECTMODE_DETECTMODE_Min (0x0UL)
  #define GPIO_DETECTMODE_DETECTMODE_Max (0x1UL)
  #define GPIO_DETECTMODE_DETECTMODE_Default (0x0UL)
  #define GPIO_DETECTMODE_DETECTMODE_LDETECT (0x1UL)


/* GPIO_RETAIN: Enable retention for those GPIO registers marked as retained */
  #define GPIO_RETAIN_ResetValue (0x0000000CUL)

/* APPLICAION @Bit 2 : Enable retention for GPIO registers for Application domain */
  #define GPIO_RETAIN_APPLICAION_Pos (2UL)
  #define GPIO_RETAIN_APPLICAION_Msk (0x1UL << GPIO_RETAIN_APPLICAION_Pos)
  #define GPIO_RETAIN_APPLICAION_Min (0x0UL)
  #define GPIO_RETAIN_APPLICAION_Max (0x1UL)
  #define GPIO_RETAIN_APPLICAION_Disabled (0x0UL)
  #define GPIO_RETAIN_APPLICAION_Enabled (0x1UL)

/* RADIOCORE @Bit 3 : Enable retention for GPIO registers for Radio core */
  #define GPIO_RETAIN_RADIOCORE_Pos (3UL)
  #define GPIO_RETAIN_RADIOCORE_Msk (0x1UL << GPIO_RETAIN_RADIOCORE_Pos)
  #define GPIO_RETAIN_RADIOCORE_Min (0x0UL)
  #define GPIO_RETAIN_RADIOCORE_Max (0x1UL)
  #define GPIO_RETAIN_RADIOCORE_Disabled (0x0UL)
  #define GPIO_RETAIN_RADIOCORE_Enabled (0x1UL)


/* GPIO_PIN_CNF: Pin n configuration of GPIO pin */
  #define GPIO_PIN_CNF_MaxCount (32UL)
  #define GPIO_PIN_CNF_MaxIndex (31UL)
  #define GPIO_PIN_CNF_MinIndex (0UL)
  #define GPIO_PIN_CNF_ResetValue (0x00000002UL)

/* DIR @Bit 0 : Pin direction. Same physical register as DIR register */
  #define GPIO_PIN_CNF_DIR_Pos (0UL)
  #define GPIO_PIN_CNF_DIR_Msk (0x1UL << GPIO_PIN_CNF_DIR_Pos)
  #define GPIO_PIN_CNF_DIR_Min (0x0UL)
  #define GPIO_PIN_CNF_DIR_Max (0x1UL)
  #define GPIO_PIN_CNF_DIR_Input (0x0UL)
  #define GPIO_PIN_CNF_DIR_Output (0x1UL)

/* INPUT @Bit 1 : Connect or disconnect input buffer */
  #define GPIO_PIN_CNF_INPUT_Pos (1UL)
  #define GPIO_PIN_CNF_INPUT_Msk (0x1UL << GPIO_PIN_CNF_INPUT_Pos)
  #define GPIO_PIN_CNF_INPUT_Min (0x0UL)
  #define GPIO_PIN_CNF_INPUT_Max (0x1UL)
  #define GPIO_PIN_CNF_INPUT_Connect (0x0UL)
  #define GPIO_PIN_CNF_INPUT_Disconnect (0x1UL)

/* PULL @Bits 2..3 : Pull configuration */
  #define GPIO_PIN_CNF_PULL_Pos (2UL)
  #define GPIO_PIN_CNF_PULL_Msk (0x3UL << GPIO_PIN_CNF_PULL_Pos)
  #define GPIO_PIN_CNF_PULL_Min (0x0UL)
  #define GPIO_PIN_CNF_PULL_Max (0x3UL)
  #define GPIO_PIN_CNF_PULL_Disabled (0x0UL)
  #define GPIO_PIN_CNF_PULL_Pulldown (0x1UL)
  #define GPIO_PIN_CNF_PULL_Pullup (0x3UL)

/* DRIVE0 @Bits 8..9 : Drive configuration for '0' */
  #define GPIO_PIN_CNF_DRIVE0_Pos (8UL)
  #define GPIO_PIN_CNF_DRIVE0_Msk (0x3UL << GPIO_PIN_CNF_DRIVE0_Pos)
  #define GPIO_PIN_CNF_DRIVE0_Min (0x0UL)
  #define GPIO_PIN_CNF_DRIVE0_Max (0x3UL)
  #define GPIO_PIN_CNF_DRIVE0_S0 (0x0UL)
  #define GPIO_PIN_CNF_DRIVE0_H0 (0x1UL)
  #define GPIO_PIN_CNF_DRIVE0_D0 (0x2UL)
  #define GPIO_PIN_CNF_DRIVE0_E0 (0x3UL)

/* DRIVE1 @Bits 10..11 : Drive configuration for '1' */
  #define GPIO_PIN_CNF_DRIVE1_Pos (10UL)
  #define GPIO_PIN_CNF_DRIVE1_Msk (0x3UL << GPIO_PIN_CNF_DRIVE1_Pos)
  #define GPIO_PIN_CNF_DRIVE1_Min (0x0UL)
  #define GPIO_PIN_CNF_DRIVE1_Max (0x3UL)
  #define GPIO_PIN_CNF_DRIVE1_S1 (0x0UL)
  #define GPIO_PIN_CNF_DRIVE1_H1 (0x1UL)
  #define GPIO_PIN_CNF_DRIVE1_D1 (0x2UL)
  #define GPIO_PIN_CNF_DRIVE1_E1 (0x3UL)

/* SENSE @Bits 16..17 : Pin sensing mechanism */
  #define GPIO_PIN_CNF_SENSE_Pos (16UL)
  #define GPIO_PIN_CNF_SENSE_Msk (0x3UL << GPIO_PIN_CNF_SENSE_Pos)
  #define GPIO_PIN_CNF_SENSE_Min (0x0UL)
  #define GPIO_PIN_CNF_SENSE_Max (0x3UL)
  #define GPIO_PIN_CNF_SENSE_Disabled (0x0UL)
  #define GPIO_PIN_CNF_SENSE_High (0x2UL)
  #define GPIO_PIN_CNF_SENSE_Low (0x3UL)

/* CLOCKPIN @Bit 31 : Enable clock on the pin. */
  #define GPIO_PIN_CNF_CLOCKPIN_Pos (31UL)
  #define GPIO_PIN_CNF_CLOCKPIN_Msk (0x1UL << GPIO_PIN_CNF_CLOCKPIN_Pos)
  #define GPIO_PIN_CNF_CLOCKPIN_Min (0x0UL)
  #define GPIO_PIN_CNF_CLOCKPIN_Max (0x1UL)
  #define GPIO_PIN_CNF_CLOCKPIN_Disabled (0x0UL)
  #define GPIO_PIN_CNF_CLOCKPIN_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          GPIOTE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct GPIOTE_EVENTS_PORT ================================================ */
/**
  * @brief EVENTS_PORT [GPIOTE_EVENTS_PORT] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  NONSECURE;
  __IOM uint32_t  SECURE;
} NRF_GPIOTE_EVENTS_PORT_Type;
  #define GPIOTE_EVENTS_PORT_MaxCount (4UL)
  #define GPIOTE_EVENTS_PORT_MaxIndex (3UL)
  #define GPIOTE_EVENTS_PORT_MinIndex (0UL)

/* GPIOTE_EVENTS_PORT_NONSECURE: Non-secure port event from owner n */
  #define GPIOTE_EVENTS_PORT_NONSECURE_ResetValue (0x00000000UL)

/* NONSECURE @Bit 0 : Non-secure port event from owner n */
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Pos (0UL)
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Msk (0x1UL << GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Pos) /*!< Bit mask of
                                                                            NONSECURE field.*/
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Min (0x0UL)
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Max (0x1UL)
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_NotGenerated (0x0UL)
  #define GPIOTE_EVENTS_PORT_NONSECURE_NONSECURE_Generated (0x1UL)


/* GPIOTE_EVENTS_PORT_SECURE: Secure port event from owner n */
  #define GPIOTE_EVENTS_PORT_SECURE_ResetValue (0x00000000UL)

/* SECURE @Bit 0 : Secure port event from owner n */
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Pos (0UL)
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Msk (0x1UL << GPIOTE_EVENTS_PORT_SECURE_SECURE_Pos)
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Min (0x0UL)
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Max (0x1UL)
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_NotGenerated (0x0UL)
  #define GPIOTE_EVENTS_PORT_SECURE_SECURE_Generated (0x1UL)



/* =============================================== Struct GPIOTE_PUBLISH_PORT ================================================ */
/**
  * @brief PUBLISH_PORT [GPIOTE_PUBLISH_PORT] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  NONSECURE;
  __IOM uint32_t  SECURE;
} NRF_GPIOTE_PUBLISH_PORT_Type;
  #define GPIOTE_PUBLISH_PORT_MaxCount (4UL)
  #define GPIOTE_PUBLISH_PORT_MaxIndex (3UL)
  #define GPIOTE_PUBLISH_PORT_MinIndex (0UL)

/* GPIOTE_PUBLISH_PORT_NONSECURE: Publish configuration for event PORT[n].NONSECURE */
  #define GPIOTE_PUBLISH_PORT_NONSECURE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event PORT[n].NONSECURE will publish to */
  #define GPIOTE_PUBLISH_PORT_NONSECURE_CHIDX_Pos (0UL)
  #define GPIOTE_PUBLISH_PORT_NONSECURE_CHIDX_Msk (0xFFUL << GPIOTE_PUBLISH_PORT_NONSECURE_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define GPIOTE_PUBLISH_PORT_NONSECURE_CHIDX_Min (0x00UL)
  #define GPIOTE_PUBLISH_PORT_NONSECURE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_PUBLISH_PORT_NONSECURE_EN_Pos (31UL)
  #define GPIOTE_PUBLISH_PORT_NONSECURE_EN_Msk (0x1UL << GPIOTE_PUBLISH_PORT_NONSECURE_EN_Pos)
  #define GPIOTE_PUBLISH_PORT_NONSECURE_EN_Min (0x0UL)
  #define GPIOTE_PUBLISH_PORT_NONSECURE_EN_Max (0x1UL)
  #define GPIOTE_PUBLISH_PORT_NONSECURE_EN_Disabled (0x0UL)
  #define GPIOTE_PUBLISH_PORT_NONSECURE_EN_Enabled (0x1UL)


/* GPIOTE_PUBLISH_PORT_SECURE: Publish configuration for event PORT[n].SECURE */
  #define GPIOTE_PUBLISH_PORT_SECURE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event PORT[n].SECURE will publish to */
  #define GPIOTE_PUBLISH_PORT_SECURE_CHIDX_Pos (0UL)
  #define GPIOTE_PUBLISH_PORT_SECURE_CHIDX_Msk (0xFFUL << GPIOTE_PUBLISH_PORT_SECURE_CHIDX_Pos)
  #define GPIOTE_PUBLISH_PORT_SECURE_CHIDX_Min (0x00UL)
  #define GPIOTE_PUBLISH_PORT_SECURE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_PUBLISH_PORT_SECURE_EN_Pos (31UL)
  #define GPIOTE_PUBLISH_PORT_SECURE_EN_Msk (0x1UL << GPIOTE_PUBLISH_PORT_SECURE_EN_Pos)
  #define GPIOTE_PUBLISH_PORT_SECURE_EN_Min (0x0UL)
  #define GPIOTE_PUBLISH_PORT_SECURE_EN_Max (0x1UL)
  #define GPIOTE_PUBLISH_PORT_SECURE_EN_Disabled (0x0UL)
  #define GPIOTE_PUBLISH_PORT_SECURE_EN_Enabled (0x1UL)


/* ====================================================== Struct GPIOTE ====================================================== */
/**
  * @brief GPIO Tasks and Events
  */
  typedef struct {
    __OM uint32_t TASKS_OUT[8];                      /*!< (@ 0x00000000) Task for writing to pin specified in CONFIG[n].PSEL.
                                                                         Action on pin is configured in CONFIG[n].POLARITY.*/
    __IM uint32_t RESERVED[4];
    __OM uint32_t TASKS_SET[8];                      /*!< (@ 0x00000030) Task for writing to pin specified in CONFIG[n].PSEL.
                                                                         Action on pin is to set it high.*/
    __IM uint32_t RESERVED1[4];
    __OM uint32_t TASKS_CLR[8];                      /*!< (@ 0x00000060) Task for writing to pin specified in CONFIG[n].PSEL.
                                                                         Action on pin is to set it low.*/
    __IOM uint32_t SUBSCRIBE_OUT[8];
    __IM uint32_t RESERVED2[4];
    __IOM uint32_t SUBSCRIBE_SET[8];
    __IM uint32_t RESERVED3[4];
    __IOM uint32_t SUBSCRIBE_CLR[8];
    __IOM uint32_t EVENTS_IN[8];
    __IM uint32_t RESERVED4[8];
    __IOM NRF_GPIOTE_EVENTS_PORT_Type EVENTS_PORT[4];
    __IM uint32_t RESERVED5[8];
    __IOM uint32_t PUBLISH_IN[8];
    __IM uint32_t RESERVED6[8];
    __IOM NRF_GPIOTE_PUBLISH_PORT_Type PUBLISH_PORT[4];
    __IM uint32_t RESERVED7[73];
    __IOM uint32_t INTENSET0;
    __IOM uint32_t INTENCLR0;
    __IM uint32_t RESERVED8[2];
    __IOM uint32_t INTENSET1;
    __IOM uint32_t INTENCLR1;
    __IM uint32_t RESERVED9[2];
    __IOM uint32_t INTENSET2;
    __IOM uint32_t INTENCLR2;
    __IM uint32_t RESERVED10[2];
    __IOM uint32_t INTENSET3;
    __IOM uint32_t INTENCLR3;
    __IM uint32_t RESERVED11[2];
    __IOM uint32_t INTENSET4;
    __IOM uint32_t INTENCLR4;
    __IM uint32_t RESERVED12[2];
    __IOM uint32_t INTENSET5;
    __IOM uint32_t INTENCLR5;
    __IM uint32_t RESERVED13[2];
    __IOM uint32_t INTENSET6;
    __IOM uint32_t INTENCLR6;
    __IM uint32_t RESERVED14[102];
    __IOM uint32_t LATENCY;                          /*!< (@ 0x00000504) Latency selection for Event mode (MODE=Event) with
                                                                         rising or falling edge detection on the pin.*/
    __IM uint32_t RESERVED15[2];
    __IOM uint32_t CONFIG[8];                        /*!< (@ 0x00000510) Configuration for OUT[n], SET[n], and CLR[n] tasks and
                                                                         IN[n] event*/
  } NRF_GPIOTE_Type;

/* GPIOTE_TASKS_OUT: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */
  #define GPIOTE_TASKS_OUT_MaxCount (8UL)
  #define GPIOTE_TASKS_OUT_MaxIndex (7UL)
  #define GPIOTE_TASKS_OUT_MinIndex (0UL)
  #define GPIOTE_TASKS_OUT_ResetValue (0x00000000UL)

/* TASKS_OUT @Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Pos (0UL)
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Msk (0x1UL << GPIOTE_TASKS_OUT_TASKS_OUT_Pos)
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Min (0x1UL)
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Max (0x1UL)
  #define GPIOTE_TASKS_OUT_TASKS_OUT_Trigger (0x1UL)


/* GPIOTE_TASKS_SET: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */
  #define GPIOTE_TASKS_SET_MaxCount (8UL)
  #define GPIOTE_TASKS_SET_MaxIndex (7UL)
  #define GPIOTE_TASKS_SET_MinIndex (0UL)
  #define GPIOTE_TASKS_SET_ResetValue (0x00000000UL)

/* TASKS_SET @Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */
  #define GPIOTE_TASKS_SET_TASKS_SET_Pos (0UL)
  #define GPIOTE_TASKS_SET_TASKS_SET_Msk (0x1UL << GPIOTE_TASKS_SET_TASKS_SET_Pos)
  #define GPIOTE_TASKS_SET_TASKS_SET_Min (0x1UL)
  #define GPIOTE_TASKS_SET_TASKS_SET_Max (0x1UL)
  #define GPIOTE_TASKS_SET_TASKS_SET_Trigger (0x1UL)


/* GPIOTE_TASKS_CLR: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */
  #define GPIOTE_TASKS_CLR_MaxCount (8UL)
  #define GPIOTE_TASKS_CLR_MaxIndex (7UL)
  #define GPIOTE_TASKS_CLR_MinIndex (0UL)
  #define GPIOTE_TASKS_CLR_ResetValue (0x00000000UL)

/* TASKS_CLR @Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Pos (0UL)
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Msk (0x1UL << GPIOTE_TASKS_CLR_TASKS_CLR_Pos)
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Min (0x1UL)
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Max (0x1UL)
  #define GPIOTE_TASKS_CLR_TASKS_CLR_Trigger (0x1UL)


/* GPIOTE_SUBSCRIBE_OUT: Subscribe configuration for task OUT[n] */
  #define GPIOTE_SUBSCRIBE_OUT_MaxCount (8UL)
  #define GPIOTE_SUBSCRIBE_OUT_MaxIndex (7UL)
  #define GPIOTE_SUBSCRIBE_OUT_MinIndex (0UL)
  #define GPIOTE_SUBSCRIBE_OUT_ResetValue (0x00000000UL)

