pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task OUT[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos (0UL)
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos)
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Min (0x00UL)
  #define GPIOTE_SUBSCRIBE_OUT_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_OUT_EN_Pos (31UL)
  #define GPIOTE_SUBSCRIBE_OUT_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_OUT_EN_Pos)
  #define GPIOTE_SUBSCRIBE_OUT_EN_Min (0x0UL)
  #define GPIOTE_SUBSCRIBE_OUT_EN_Max (0x1UL)
  #define GPIOTE_SUBSCRIBE_OUT_EN_Disabled (0x0UL)
  #define GPIOTE_SUBSCRIBE_OUT_EN_Enabled (0x1UL)


/* GPIOTE_SUBSCRIBE_SET: Subscribe configuration for task SET[n] */
  #define GPIOTE_SUBSCRIBE_SET_MaxCount (8UL)
  #define GPIOTE_SUBSCRIBE_SET_MaxIndex (7UL)
  #define GPIOTE_SUBSCRIBE_SET_MinIndex (0UL)
  #define GPIOTE_SUBSCRIBE_SET_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SET[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Pos (0UL)
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_SET_CHIDX_Pos)
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Min (0x00UL)
  #define GPIOTE_SUBSCRIBE_SET_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_SET_EN_Pos (31UL)
  #define GPIOTE_SUBSCRIBE_SET_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_SET_EN_Pos)
  #define GPIOTE_SUBSCRIBE_SET_EN_Min (0x0UL)
  #define GPIOTE_SUBSCRIBE_SET_EN_Max (0x1UL)
  #define GPIOTE_SUBSCRIBE_SET_EN_Disabled (0x0UL)
  #define GPIOTE_SUBSCRIBE_SET_EN_Enabled (0x1UL)


/* GPIOTE_SUBSCRIBE_CLR: Subscribe configuration for task CLR[n] */
  #define GPIOTE_SUBSCRIBE_CLR_MaxCount (8UL)
  #define GPIOTE_SUBSCRIBE_CLR_MaxIndex (7UL)
  #define GPIOTE_SUBSCRIBE_CLR_MinIndex (0UL)
  #define GPIOTE_SUBSCRIBE_CLR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CLR[n] will subscribe to */
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos (0UL)
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos)
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Min (0x00UL)
  #define GPIOTE_SUBSCRIBE_CLR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_SUBSCRIBE_CLR_EN_Pos (31UL)
  #define GPIOTE_SUBSCRIBE_CLR_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_CLR_EN_Pos)
  #define GPIOTE_SUBSCRIBE_CLR_EN_Min (0x0UL)
  #define GPIOTE_SUBSCRIBE_CLR_EN_Max (0x1UL)
  #define GPIOTE_SUBSCRIBE_CLR_EN_Disabled (0x0UL)
  #define GPIOTE_SUBSCRIBE_CLR_EN_Enabled (0x1UL)


/* GPIOTE_EVENTS_IN: Event from pin specified in CONFIG[n].PSEL */
  #define GPIOTE_EVENTS_IN_MaxCount (8UL)
  #define GPIOTE_EVENTS_IN_MaxIndex (7UL)
  #define GPIOTE_EVENTS_IN_MinIndex (0UL)
  #define GPIOTE_EVENTS_IN_ResetValue (0x00000000UL)

/* EVENTS_IN @Bit 0 : Event from pin specified in CONFIG[n].PSEL */
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Pos (0UL)
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Msk (0x1UL << GPIOTE_EVENTS_IN_EVENTS_IN_Pos)
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Min (0x0UL)
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Max (0x1UL)
  #define GPIOTE_EVENTS_IN_EVENTS_IN_NotGenerated (0x0UL)
  #define GPIOTE_EVENTS_IN_EVENTS_IN_Generated (0x1UL)


/* GPIOTE_PUBLISH_IN: Publish configuration for event IN[n] */
  #define GPIOTE_PUBLISH_IN_MaxCount (8UL)
  #define GPIOTE_PUBLISH_IN_MaxIndex (7UL)
  #define GPIOTE_PUBLISH_IN_MinIndex (0UL)
  #define GPIOTE_PUBLISH_IN_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event IN[n] will publish to */
  #define GPIOTE_PUBLISH_IN_CHIDX_Pos (0UL)
  #define GPIOTE_PUBLISH_IN_CHIDX_Msk (0xFFUL << GPIOTE_PUBLISH_IN_CHIDX_Pos)
  #define GPIOTE_PUBLISH_IN_CHIDX_Min (0x00UL)
  #define GPIOTE_PUBLISH_IN_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define GPIOTE_PUBLISH_IN_EN_Pos (31UL)
  #define GPIOTE_PUBLISH_IN_EN_Msk (0x1UL << GPIOTE_PUBLISH_IN_EN_Pos)
  #define GPIOTE_PUBLISH_IN_EN_Min (0x0UL)
  #define GPIOTE_PUBLISH_IN_EN_Max (0x1UL)
  #define GPIOTE_PUBLISH_IN_EN_Disabled (0x0UL)
  #define GPIOTE_PUBLISH_IN_EN_Enabled (0x1UL)


/* GPIOTE_INTENSET0: Enable interrupt */
  #define GPIOTE_INTENSET0_ResetValue (0x00000000UL)

/* IN0 @Bit 0 : Write '1' to enable interrupt for event IN[0] */
  #define GPIOTE_INTENSET0_IN0_Pos (0UL)
  #define GPIOTE_INTENSET0_IN0_Msk (0x1UL << GPIOTE_INTENSET0_IN0_Pos)
  #define GPIOTE_INTENSET0_IN0_Min (0x0UL)
  #define GPIOTE_INTENSET0_IN0_Max (0x1UL)
  #define GPIOTE_INTENSET0_IN0_Set (0x1UL)
  #define GPIOTE_INTENSET0_IN0_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_IN0_Enabled (0x1UL)

/* IN1 @Bit 1 : Write '1' to enable interrupt for event IN[1] */
  #define GPIOTE_INTENSET0_IN1_Pos (1UL)
  #define GPIOTE_INTENSET0_IN1_Msk (0x1UL << GPIOTE_INTENSET0_IN1_Pos)
  #define GPIOTE_INTENSET0_IN1_Min (0x0UL)
  #define GPIOTE_INTENSET0_IN1_Max (0x1UL)
  #define GPIOTE_INTENSET0_IN1_Set (0x1UL)
  #define GPIOTE_INTENSET0_IN1_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_IN1_Enabled (0x1UL)

/* IN2 @Bit 2 : Write '1' to enable interrupt for event IN[2] */
  #define GPIOTE_INTENSET0_IN2_Pos (2UL)
  #define GPIOTE_INTENSET0_IN2_Msk (0x1UL << GPIOTE_INTENSET0_IN2_Pos)
  #define GPIOTE_INTENSET0_IN2_Min (0x0UL)
  #define GPIOTE_INTENSET0_IN2_Max (0x1UL)
  #define GPIOTE_INTENSET0_IN2_Set (0x1UL)
  #define GPIOTE_INTENSET0_IN2_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_IN2_Enabled (0x1UL)

/* IN3 @Bit 3 : Write '1' to enable interrupt for event IN[3] */
  #define GPIOTE_INTENSET0_IN3_Pos (3UL)
  #define GPIOTE_INTENSET0_IN3_Msk (0x1UL << GPIOTE_INTENSET0_IN3_Pos)
  #define GPIOTE_INTENSET0_IN3_Min (0x0UL)
  #define GPIOTE_INTENSET0_IN3_Max (0x1UL)
  #define GPIOTE_INTENSET0_IN3_Set (0x1UL)
  #define GPIOTE_INTENSET0_IN3_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_IN3_Enabled (0x1UL)

/* IN4 @Bit 4 : Write '1' to enable interrupt for event IN[4] */
  #define GPIOTE_INTENSET0_IN4_Pos (4UL)
  #define GPIOTE_INTENSET0_IN4_Msk (0x1UL << GPIOTE_INTENSET0_IN4_Pos)
  #define GPIOTE_INTENSET0_IN4_Min (0x0UL)
  #define GPIOTE_INTENSET0_IN4_Max (0x1UL)
  #define GPIOTE_INTENSET0_IN4_Set (0x1UL)
  #define GPIOTE_INTENSET0_IN4_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_IN4_Enabled (0x1UL)

/* IN5 @Bit 5 : Write '1' to enable interrupt for event IN[5] */
  #define GPIOTE_INTENSET0_IN5_Pos (5UL)
  #define GPIOTE_INTENSET0_IN5_Msk (0x1UL << GPIOTE_INTENSET0_IN5_Pos)
  #define GPIOTE_INTENSET0_IN5_Min (0x0UL)
  #define GPIOTE_INTENSET0_IN5_Max (0x1UL)
  #define GPIOTE_INTENSET0_IN5_Set (0x1UL)
  #define GPIOTE_INTENSET0_IN5_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_IN5_Enabled (0x1UL)

/* IN6 @Bit 6 : Write '1' to enable interrupt for event IN[6] */
  #define GPIOTE_INTENSET0_IN6_Pos (6UL)
  #define GPIOTE_INTENSET0_IN6_Msk (0x1UL << GPIOTE_INTENSET0_IN6_Pos)
  #define GPIOTE_INTENSET0_IN6_Min (0x0UL)
  #define GPIOTE_INTENSET0_IN6_Max (0x1UL)
  #define GPIOTE_INTENSET0_IN6_Set (0x1UL)
  #define GPIOTE_INTENSET0_IN6_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_IN6_Enabled (0x1UL)

/* IN7 @Bit 7 : Write '1' to enable interrupt for event IN[7] */
  #define GPIOTE_INTENSET0_IN7_Pos (7UL)
  #define GPIOTE_INTENSET0_IN7_Msk (0x1UL << GPIOTE_INTENSET0_IN7_Pos)
  #define GPIOTE_INTENSET0_IN7_Min (0x0UL)
  #define GPIOTE_INTENSET0_IN7_Max (0x1UL)
  #define GPIOTE_INTENSET0_IN7_Set (0x1UL)
  #define GPIOTE_INTENSET0_IN7_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_IN7_Enabled (0x1UL)

/* PORT0NONSECURE @Bit 16 : Write '1' to enable interrupt for event PORT0NONSECURE */
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Pos (16UL)
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Msk (0x1UL << GPIOTE_INTENSET0_PORT0NONSECURE_Pos) /*!< Bit mask of PORT0NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Min (0x0UL)
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Max (0x1UL)
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Set (0x1UL)
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_PORT0NONSECURE_Enabled (0x1UL)

/* PORT0SECURE @Bit 17 : Write '1' to enable interrupt for event PORT0SECURE */
  #define GPIOTE_INTENSET0_PORT0SECURE_Pos (17UL)
  #define GPIOTE_INTENSET0_PORT0SECURE_Msk (0x1UL << GPIOTE_INTENSET0_PORT0SECURE_Pos)
  #define GPIOTE_INTENSET0_PORT0SECURE_Min (0x0UL)
  #define GPIOTE_INTENSET0_PORT0SECURE_Max (0x1UL)
  #define GPIOTE_INTENSET0_PORT0SECURE_Set (0x1UL)
  #define GPIOTE_INTENSET0_PORT0SECURE_Disabled (0x0UL)
  #define GPIOTE_INTENSET0_PORT0SECURE_Enabled (0x1UL)

