pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PORT2NONSECURE @Bit 20 : Write '1' to disable interrupt for event PORT2NONSECURE */
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Pos (20UL)
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR5_PORT2NONSECURE_Pos) /*!< Bit mask of PORT2NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Min (0x0UL)
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Max (0x1UL)
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Clear (0x1UL)
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Disabled (0x0UL)
  #define GPIOTE_INTENCLR5_PORT2NONSECURE_Enabled (0x1UL)

/* PORT2SECURE @Bit 21 : Write '1' to disable interrupt for event PORT2SECURE */
  #define GPIOTE_INTENCLR5_PORT2SECURE_Pos (21UL)
  #define GPIOTE_INTENCLR5_PORT2SECURE_Msk (0x1UL << GPIOTE_INTENCLR5_PORT2SECURE_Pos)
  #define GPIOTE_INTENCLR5_PORT2SECURE_Min (0x0UL)
  #define GPIOTE_INTENCLR5_PORT2SECURE_Max (0x1UL)
  #define GPIOTE_INTENCLR5_PORT2SECURE_Clear (0x1UL)
  #define GPIOTE_INTENCLR5_PORT2SECURE_Disabled (0x0UL)
  #define GPIOTE_INTENCLR5_PORT2SECURE_Enabled (0x1UL)

/* PORT3NONSECURE @Bit 22 : Write '1' to disable interrupt for event PORT3NONSECURE */
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Pos (22UL)
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR5_PORT3NONSECURE_Pos) /*!< Bit mask of PORT3NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Min (0x0UL)
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Max (0x1UL)
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Clear (0x1UL)
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Disabled (0x0UL)
  #define GPIOTE_INTENCLR5_PORT3NONSECURE_Enabled (0x1UL)

/* PORT3SECURE @Bit 23 : Write '1' to disable interrupt for event PORT3SECURE */
  #define GPIOTE_INTENCLR5_PORT3SECURE_Pos (23UL)
  #define GPIOTE_INTENCLR5_PORT3SECURE_Msk (0x1UL << GPIOTE_INTENCLR5_PORT3SECURE_Pos)
  #define GPIOTE_INTENCLR5_PORT3SECURE_Min (0x0UL)
  #define GPIOTE_INTENCLR5_PORT3SECURE_Max (0x1UL)
  #define GPIOTE_INTENCLR5_PORT3SECURE_Clear (0x1UL)
  #define GPIOTE_INTENCLR5_PORT3SECURE_Disabled (0x0UL)
  #define GPIOTE_INTENCLR5_PORT3SECURE_Enabled (0x1UL)


/* GPIOTE_INTENSET6: Enable interrupt */
  #define GPIOTE_INTENSET6_ResetValue (0x00000000UL)

/* IN0 @Bit 0 : Write '1' to enable interrupt for event IN[0] */
  #define GPIOTE_INTENSET6_IN0_Pos (0UL)
  #define GPIOTE_INTENSET6_IN0_Msk (0x1UL << GPIOTE_INTENSET6_IN0_Pos)
  #define GPIOTE_INTENSET6_IN0_Min (0x0UL)
  #define GPIOTE_INTENSET6_IN0_Max (0x1UL)
  #define GPIOTE_INTENSET6_IN0_Set (0x1UL)
  #define GPIOTE_INTENSET6_IN0_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_IN0_Enabled (0x1UL)

/* IN1 @Bit 1 : Write '1' to enable interrupt for event IN[1] */
  #define GPIOTE_INTENSET6_IN1_Pos (1UL)
  #define GPIOTE_INTENSET6_IN1_Msk (0x1UL << GPIOTE_INTENSET6_IN1_Pos)
  #define GPIOTE_INTENSET6_IN1_Min (0x0UL)
  #define GPIOTE_INTENSET6_IN1_Max (0x1UL)
  #define GPIOTE_INTENSET6_IN1_Set (0x1UL)
  #define GPIOTE_INTENSET6_IN1_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_IN1_Enabled (0x1UL)

/* IN2 @Bit 2 : Write '1' to enable interrupt for event IN[2] */
  #define GPIOTE_INTENSET6_IN2_Pos (2UL)
  #define GPIOTE_INTENSET6_IN2_Msk (0x1UL << GPIOTE_INTENSET6_IN2_Pos)
  #define GPIOTE_INTENSET6_IN2_Min (0x0UL)
  #define GPIOTE_INTENSET6_IN2_Max (0x1UL)
  #define GPIOTE_INTENSET6_IN2_Set (0x1UL)
  #define GPIOTE_INTENSET6_IN2_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_IN2_Enabled (0x1UL)

/* IN3 @Bit 3 : Write '1' to enable interrupt for event IN[3] */
  #define GPIOTE_INTENSET6_IN3_Pos (3UL)
  #define GPIOTE_INTENSET6_IN3_Msk (0x1UL << GPIOTE_INTENSET6_IN3_Pos)
  #define GPIOTE_INTENSET6_IN3_Min (0x0UL)
  #define GPIOTE_INTENSET6_IN3_Max (0x1UL)
  #define GPIOTE_INTENSET6_IN3_Set (0x1UL)
  #define GPIOTE_INTENSET6_IN3_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_IN3_Enabled (0x1UL)

/* IN4 @Bit 4 : Write '1' to enable interrupt for event IN[4] */
  #define GPIOTE_INTENSET6_IN4_Pos (4UL)
  #define GPIOTE_INTENSET6_IN4_Msk (0x1UL << GPIOTE_INTENSET6_IN4_Pos)
  #define GPIOTE_INTENSET6_IN4_Min (0x0UL)
  #define GPIOTE_INTENSET6_IN4_Max (0x1UL)
  #define GPIOTE_INTENSET6_IN4_Set (0x1UL)
  #define GPIOTE_INTENSET6_IN4_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_IN4_Enabled (0x1UL)

/* IN5 @Bit 5 : Write '1' to enable interrupt for event IN[5] */
  #define GPIOTE_INTENSET6_IN5_Pos (5UL)
  #define GPIOTE_INTENSET6_IN5_Msk (0x1UL << GPIOTE_INTENSET6_IN5_Pos)
  #define GPIOTE_INTENSET6_IN5_Min (0x0UL)
  #define GPIOTE_INTENSET6_IN5_Max (0x1UL)
  #define GPIOTE_INTENSET6_IN5_Set (0x1UL)
  #define GPIOTE_INTENSET6_IN5_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_IN5_Enabled (0x1UL)

/* IN6 @Bit 6 : Write '1' to enable interrupt for event IN[6] */
  #define GPIOTE_INTENSET6_IN6_Pos (6UL)
  #define GPIOTE_INTENSET6_IN6_Msk (0x1UL << GPIOTE_INTENSET6_IN6_Pos)
  #define GPIOTE_INTENSET6_IN6_Min (0x0UL)
  #define GPIOTE_INTENSET6_IN6_Max (0x1UL)
  #define GPIOTE_INTENSET6_IN6_Set (0x1UL)
  #define GPIOTE_INTENSET6_IN6_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_IN6_Enabled (0x1UL)

/* IN7 @Bit 7 : Write '1' to enable interrupt for event IN[7] */
  #define GPIOTE_INTENSET6_IN7_Pos (7UL)
  #define GPIOTE_INTENSET6_IN7_Msk (0x1UL << GPIOTE_INTENSET6_IN7_Pos)
  #define GPIOTE_INTENSET6_IN7_Min (0x0UL)
  #define GPIOTE_INTENSET6_IN7_Max (0x1UL)
  #define GPIOTE_INTENSET6_IN7_Set (0x1UL)
  #define GPIOTE_INTENSET6_IN7_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_IN7_Enabled (0x1UL)

/* PORT0NONSECURE @Bit 16 : Write '1' to enable interrupt for event PORT0NONSECURE */
  #define GPIOTE_INTENSET6_PORT0NONSECURE_Pos (16UL)
  #define GPIOTE_INTENSET6_PORT0NONSECURE_Msk (0x1UL << GPIOTE_INTENSET6_PORT0NONSECURE_Pos) /*!< Bit mask of PORT0NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENSET6_PORT0NONSECURE_Min (0x0UL)
  #define GPIOTE_INTENSET6_PORT0NONSECURE_Max (0x1UL)
  #define GPIOTE_INTENSET6_PORT0NONSECURE_Set (0x1UL)
  #define GPIOTE_INTENSET6_PORT0NONSECURE_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_PORT0NONSECURE_Enabled (0x1UL)

/* PORT0SECURE @Bit 17 : Write '1' to enable interrupt for event PORT0SECURE */
  #define GPIOTE_INTENSET6_PORT0SECURE_Pos (17UL)
  #define GPIOTE_INTENSET6_PORT0SECURE_Msk (0x1UL << GPIOTE_INTENSET6_PORT0SECURE_Pos)
  #define GPIOTE_INTENSET6_PORT0SECURE_Min (0x0UL)
  #define GPIOTE_INTENSET6_PORT0SECURE_Max (0x1UL)
  #define GPIOTE_INTENSET6_PORT0SECURE_Set (0x1UL)
  #define GPIOTE_INTENSET6_PORT0SECURE_Disabled (0x0UL)
  #define GPIOTE_INTENSET6_PORT0SECURE_Enabled (0x1UL)

