pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PORT2NONSECURE @Bit 20 : Write '1' to disable interrupt for event PORT2NONSECURE */
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Pos (20UL)
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR6_PORT2NONSECURE_Pos) /*!< Bit mask of PORT2NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Min (0x0UL)
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Max (0x1UL)
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Clear (0x1UL)
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Disabled (0x0UL)
  #define GPIOTE_INTENCLR6_PORT2NONSECURE_Enabled (0x1UL)

/* PORT2SECURE @Bit 21 : Write '1' to disable interrupt for event PORT2SECURE */
  #define GPIOTE_INTENCLR6_PORT2SECURE_Pos (21UL)
  #define GPIOTE_INTENCLR6_PORT2SECURE_Msk (0x1UL << GPIOTE_INTENCLR6_PORT2SECURE_Pos)
  #define GPIOTE_INTENCLR6_PORT2SECURE_Min (0x0UL)
  #define GPIOTE_INTENCLR6_PORT2SECURE_Max (0x1UL)
  #define GPIOTE_INTENCLR6_PORT2SECURE_Clear (0x1UL)
  #define GPIOTE_INTENCLR6_PORT2SECURE_Disabled (0x0UL)
  #define GPIOTE_INTENCLR6_PORT2SECURE_Enabled (0x1UL)

/* PORT3NONSECURE @Bit 22 : Write '1' to disable interrupt for event PORT3NONSECURE */
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Pos (22UL)
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Msk (0x1UL << GPIOTE_INTENCLR6_PORT3NONSECURE_Pos) /*!< Bit mask of PORT3NONSECURE
                                                                            field.*/
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Min (0x0UL)
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Max (0x1UL)
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Clear (0x1UL)
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Disabled (0x0UL)
  #define GPIOTE_INTENCLR6_PORT3NONSECURE_Enabled (0x1UL)

/* PORT3SECURE @Bit 23 : Write '1' to disable interrupt for event PORT3SECURE */
  #define GPIOTE_INTENCLR6_PORT3SECURE_Pos (23UL)
  #define GPIOTE_INTENCLR6_PORT3SECURE_Msk (0x1UL << GPIOTE_INTENCLR6_PORT3SECURE_Pos)
  #define GPIOTE_INTENCLR6_PORT3SECURE_Min (0x0UL)
  #define GPIOTE_INTENCLR6_PORT3SECURE_Max (0x1UL)
  #define GPIOTE_INTENCLR6_PORT3SECURE_Clear (0x1UL)
  #define GPIOTE_INTENCLR6_PORT3SECURE_Disabled (0x0UL)
  #define GPIOTE_INTENCLR6_PORT3SECURE_Enabled (0x1UL)


/* GPIOTE_LATENCY: Latency selection for Event mode (MODE=Event) with rising or falling edge detection on the pin. */
  #define GPIOTE_LATENCY_ResetValue (0x00000001UL)

/* LATENCY @Bit 0 : Latency setting */
  #define GPIOTE_LATENCY_LATENCY_Pos (0UL)
  #define GPIOTE_LATENCY_LATENCY_Msk (0x1UL << GPIOTE_LATENCY_LATENCY_Pos)
  #define GPIOTE_LATENCY_LATENCY_Min (0x0UL)
  #define GPIOTE_LATENCY_LATENCY_Max (0x1UL)
  #define GPIOTE_LATENCY_LATENCY_LowPower (0x0UL)
  #define GPIOTE_LATENCY_LATENCY_LowLatency (0x1UL)


/* GPIOTE_CONFIG: Configuration for OUT[n], SET[n], and CLR[n] tasks and IN[n] event */
  #define GPIOTE_CONFIG_MaxCount (8UL)
  #define GPIOTE_CONFIG_MaxIndex (7UL)
  #define GPIOTE_CONFIG_MinIndex (0UL)
  #define GPIOTE_CONFIG_ResetValue (0x00000000UL)

/* MODE @Bits 0..1 : Mode */
  #define GPIOTE_CONFIG_MODE_Pos (0UL)
  #define GPIOTE_CONFIG_MODE_Msk (0x3UL << GPIOTE_CONFIG_MODE_Pos)
  #define GPIOTE_CONFIG_MODE_Min (0x0UL)
  #define GPIOTE_CONFIG_MODE_Max (0x3UL)
  #define GPIOTE_CONFIG_MODE_Disabled (0x0UL)        /*!< Disabled. Pin specified by PSEL will not be acquired by the GPIOTE
                                                          module.*/
  #define GPIOTE_CONFIG_MODE_Event (0x1UL)
  #define GPIOTE_CONFIG_MODE_Task (0x3UL)

/* PSEL @Bits 4..8 : GPIO number associated with SET[n], CLR[n], and OUT[n] tasks and IN[n] event */
  #define GPIOTE_CONFIG_PSEL_Pos (4UL)
  #define GPIOTE_CONFIG_PSEL_Msk (0x1FUL << GPIOTE_CONFIG_PSEL_Pos)
  #define GPIOTE_CONFIG_PSEL_Min (0x00UL)
  #define GPIOTE_CONFIG_PSEL_Max (0x1FUL)

/* PORT @Bits 9..12 : Port number */
  #define GPIOTE_CONFIG_PORT_Pos (9UL)
  #define GPIOTE_CONFIG_PORT_Msk (0xFUL << GPIOTE_CONFIG_PORT_Pos)
  #define GPIOTE_CONFIG_PORT_Min (0x0UL)
  #define GPIOTE_CONFIG_PORT_Max (0xFUL)

/* POLARITY @Bits 16..17 : When In task mode: Operation to be performed on output when OUT[n] task is triggered. When In event
                           mode: Operation on input that shall trigger IN[n] event. */

  #define GPIOTE_CONFIG_POLARITY_Pos (16UL)
  #define GPIOTE_CONFIG_POLARITY_Msk (0x3UL << GPIOTE_CONFIG_POLARITY_Pos)
  #define GPIOTE_CONFIG_POLARITY_Min (0x0UL)
  #define GPIOTE_CONFIG_POLARITY_Max (0x3UL)
  #define GPIOTE_CONFIG_POLARITY_None (0x0UL)        /*!< Task mode: No effect on pin from OUT[n] task. Event mode: no IN[n]
                                                          event generated on pin activity.*/
  #define GPIOTE_CONFIG_POLARITY_LoToHi (0x1UL)      /*!< Task mode: Set pin from OUT[n] task. Event mode: Generate IN[n] event
                                                          when rising edge on pin.*/
  #define GPIOTE_CONFIG_POLARITY_HiToLo (0x2UL)      /*!< Task mode: Clear pin from OUT[n] task. Event mode: Generate IN[n]
                                                          event when falling edge on pin.*/
  #define GPIOTE_CONFIG_POLARITY_Toggle (0x3UL)      /*!< Task mode: Toggle pin from OUT[n]. Event mode: Generate IN[n] when any
                                                          change on pin.*/

/* OUTINIT @Bit 20 : When in task mode: Initial value of the output when the GPIOTE channel is configured. When in event mode:
                     No effect. */

  #define GPIOTE_CONFIG_OUTINIT_Pos (20UL)
  #define GPIOTE_CONFIG_OUTINIT_Msk (0x1UL << GPIOTE_CONFIG_OUTINIT_Pos)
  #define GPIOTE_CONFIG_OUTINIT_Min (0x0UL)
  #define GPIOTE_CONFIG_OUTINIT_Max (0x1UL)
  #define GPIOTE_CONFIG_OUTINIT_Low (0x0UL)
  #define GPIOTE_CONFIG_OUTINIT_High (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            GPR                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct GPR ======================================================== */
/**
  * @brief Granular Power Requester
  */
  typedef struct {
    __IOM uint32_t CPWRUPREQ;
    __IM uint32_t CPWRUPACK;
    __IM uint32_t RESERVED[958];
    __IM uint32_t ITCTRL;
    __IM uint32_t RESERVED1[39];
    __IOM uint32_t CLAIMSET;
    __IM uint32_t CLAIMCLR;
    __IM uint32_t RESERVED2[2];
    __OM uint32_t LOCKACCESS;
    __IM uint32_t LOCKSTATUS;
    __IM uint32_t AUTHSTATUS;
    __IM uint32_t DEVARCH;
    __IM uint32_t RESERVED3[2];
    __IM uint32_t DEVID;
    __IM uint32_t DEVTYPE;
    __IM uint32_t PERIPHID4;
    __IM uint32_t RESERVED4[3];
    __IM uint32_t PERIPHID0;
    __IM uint32_t PERIPHID1;
    __IM uint32_t PERIPHID2;
    __IM uint32_t PERIPHID3;
    __IM uint32_t COMPID0;
    __IM uint32_t COMPID1;
    __IM uint32_t COMPID2;
    __IM uint32_t COMPID3;
  } NRF_GPR_Type;

/* GPR_CPWRUPREQ: Debug Power Request Register */
  #define GPR_CPWRUPREQ_ResetValue (0x00000000UL)

/* CPWRUPREQ_BIT0 @Bit 0 : Bit 0 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT0_Pos (0UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT0_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT0_Pos)

