pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CPWRUPREQ_BIT1 @Bit 1 : Bit 1 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT1_Pos (1UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT1_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT1_Pos)

/* CPWRUPREQ_BIT2 @Bit 2 : Bit 2 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT2_Pos (2UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT2_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT2_Pos)

/* CPWRUPREQ_BIT3 @Bit 3 : Bit 3 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT3_Pos (3UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT3_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT3_Pos)

/* CPWRUPREQ_BIT4 @Bit 4 : Bit 4 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT4_Pos (4UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT4_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT4_Pos)

/* CPWRUPREQ_BIT5 @Bit 5 : Bit 5 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT5_Pos (5UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT5_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT5_Pos)

/* CPWRUPREQ_BIT6 @Bit 6 : Bit 6 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT6_Pos (6UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT6_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT6_Pos)

/* CPWRUPREQ_BIT7 @Bit 7 : Bit 7 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT7_Pos (7UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT7_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT7_Pos)

/* CPWRUPREQ_BIT8 @Bit 8 : Bit 8 of the cpwrupreq output port. */
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT8_Pos (8UL)
  #define GPR_CPWRUPREQ_CPWRUPREQ_BIT8_Msk (0x1UL << GPR_CPWRUPREQ_CPWRUPREQ_BIT8_Pos)


/* GPR_CPWRUPACK: Debug Power Acknowledge Register */
  #define GPR_CPWRUPACK_ResetValue (0x00000000UL)

/* CPWRUPACK_BIT0 @Bit 0 : Bit 0 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT0_Pos (0UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT0_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT0_Pos)

/* CPWRUPACK_BIT1 @Bit 1 : Bit 1 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT1_Pos (1UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT1_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT1_Pos)

/* CPWRUPACK_BIT2 @Bit 2 : Bit 2 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT2_Pos (2UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT2_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT2_Pos)

/* CPWRUPACK_BIT3 @Bit 3 : Bit 3 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT3_Pos (3UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT3_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT3_Pos)

/* CPWRUPACK_BIT4 @Bit 4 : Bit 4 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT4_Pos (4UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT4_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT4_Pos)

/* CPWRUPACK_BIT5 @Bit 5 : Bit 5 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT5_Pos (5UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT5_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT5_Pos)

/* CPWRUPACK_BIT6 @Bit 6 : Bit 6 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT6_Pos (6UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT6_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT6_Pos)

/* CPWRUPACK_BIT7 @Bit 7 : Bit 7 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT7_Pos (7UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT7_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT7_Pos)

/* CPWRUPACK_BIT8 @Bit 8 : Bit 8 of the cpwrupack input port. */
  #define GPR_CPWRUPACK_CPWRUPACK_BIT8_Pos (8UL)
  #define GPR_CPWRUPACK_CPWRUPACK_BIT8_Msk (0x1UL << GPR_CPWRUPACK_CPWRUPACK_BIT8_Pos)


/* GPR_ITCTRL: Integration Mode Control Register */
  #define GPR_ITCTRL_ResetValue (0x00000000UL)

/* INTEGRATION_MODE @Bit 0 : When you read this register, CXGPR returns a zero because no integration functionality is
                             implemented. */

  #define GPR_ITCTRL_INTEGRATION_MODE_Pos (0UL)
  #define GPR_ITCTRL_INTEGRATION_MODE_Msk (0x1UL << GPR_ITCTRL_INTEGRATION_MODE_Pos)


/* GPR_CLAIMSET: Claim Tag Set Register */
  #define GPR_CLAIMSET_ResetValue (0x0000000FUL)

/* CLAIMSET @Bits 0..3 : On Read for each bit 1 means claim tag bit implemented. On Write for each bit 0 has no effect, 1 sets
                         the relevant bit of the claim tag */

  #define GPR_CLAIMSET_CLAIMSET_Pos (0UL)
  #define GPR_CLAIMSET_CLAIMSET_Msk (0xFUL << GPR_CLAIMSET_CLAIMSET_Pos)


/* GPR_CLAIMCLR: Claim Tag Clear Register */
  #define GPR_CLAIMCLR_ResetValue (0x00000000UL)

/* CLAIMCLR @Bits 0..3 : The value present reflects the present value of the Claim Tag. */
  #define GPR_CLAIMCLR_CLAIMCLR_Pos (0UL)
  #define GPR_CLAIMCLR_CLAIMCLR_Msk (0xFUL << GPR_CLAIMCLR_CLAIMCLR_Pos)


/* GPR_LOCKACCESS: Lock Access Register */
  #define GPR_LOCKACCESS_ResetValue (0x00000000UL)

/* LOCKACCESS @Bits 0..31 : When you write 0xC5ACCE55, subsequent write operations to this device are enabled. Any other value
                            disables subsequent write operations. */

  #define GPR_LOCKACCESS_LOCKACCESS_Pos (0UL)
  #define GPR_LOCKACCESS_LOCKACCESS_Msk (0xFFFFFFFFUL << GPR_LOCKACCESS_LOCKACCESS_Pos)


/* GPR_LOCKSTATUS: Lock Status Register */
  #define GPR_LOCKSTATUS_ResetValue (0x00000003UL)

/* LOCKEXIST @Bit 0 : Indicates that a lock control mechanism is present in this device. */
  #define GPR_LOCKSTATUS_LOCKEXIST_Pos (0UL)
  #define GPR_LOCKSTATUS_LOCKEXIST_Msk (0x1UL << GPR_LOCKSTATUS_LOCKEXIST_Pos)

/* LOCKGRANT @Bit 1 : Returns the present lock status of the device. */
  #define GPR_LOCKSTATUS_LOCKGRANT_Pos (1UL)
  #define GPR_LOCKSTATUS_LOCKGRANT_Msk (0x1UL << GPR_LOCKSTATUS_LOCKGRANT_Pos)

/* LOCKTYPE @Bit 2 : Indicates that the Lock Access Register is implemented as 32-bit. */
  #define GPR_LOCKSTATUS_LOCKTYPE_Pos (2UL)
  #define GPR_LOCKSTATUS_LOCKTYPE_Msk (0x1UL << GPR_LOCKSTATUS_LOCKTYPE_Pos)


/* GPR_AUTHSTATUS: Authentication Status Register */
  #define GPR_AUTHSTATUS_ResetValue (0x00000000UL)

/* NSID @Bits 0..1 : Indicates the security level for Non-Secure Invasive Debug. */
  #define GPR_AUTHSTATUS_NSID_Pos (0UL)
  #define GPR_AUTHSTATUS_NSID_Msk (0x3UL << GPR_AUTHSTATUS_NSID_Pos)

/* NSNID @Bits 2..3 : Indicates the security level for Non-Secure Non-Invasive Debug. */
  #define GPR_AUTHSTATUS_NSNID_Pos (2UL)
  #define GPR_AUTHSTATUS_NSNID_Msk (0x3UL << GPR_AUTHSTATUS_NSNID_Pos)

/* SID @Bits 4..5 : Indicates the security level for Secure Invasive Debug. */
  #define GPR_AUTHSTATUS_SID_Pos (4UL)
  #define GPR_AUTHSTATUS_SID_Msk (0x3UL << GPR_AUTHSTATUS_SID_Pos)

/* SNID @Bits 6..7 : Indicates the security level for Secure Non-Invasive Debug. */
  #define GPR_AUTHSTATUS_SNID_Pos (6UL)
  #define GPR_AUTHSTATUS_SNID_Msk (0x3UL << GPR_AUTHSTATUS_SNID_Pos)


/* GPR_DEVARCH: Device Architecture Register */
  #define GPR_DEVARCH_ResetValue (0x47700A34UL)

