pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ARCHID @Bits 0..15 : Indicates the architecture of the component. */
  #define GPR_DEVARCH_ARCHID_Pos (0UL)
  #define GPR_DEVARCH_ARCHID_Msk (0xFFFFUL << GPR_DEVARCH_ARCHID_Pos)

/* REVISION @Bits 16..19 : Indicates the revision of the architecture. */
  #define GPR_DEVARCH_REVISION_Pos (16UL)
  #define GPR_DEVARCH_REVISION_Msk (0xFUL << GPR_DEVARCH_REVISION_Pos)

/* PRESENT @Bit 20 : Indicates whether the DEVARCH register is present. */
  #define GPR_DEVARCH_PRESENT_Pos (20UL)
  #define GPR_DEVARCH_PRESENT_Msk (0x1UL << GPR_DEVARCH_PRESENT_Pos)

/* ARCHITECT @Bits 21..31 : Indicates the JEP106 code pf the architect who specifies the architecture of the component. Bits
                            [31:28] are the JEP106 continuation code. Bits [27:21] are the JEP106 identity code. */

  #define GPR_DEVARCH_ARCHITECT_Pos (21UL)
  #define GPR_DEVARCH_ARCHITECT_Msk (0x7FFUL << GPR_DEVARCH_ARCHITECT_Pos)


/* GPR_DEVID: Device Configuration Register */
  #define GPR_DEVID_ResetValue (0x00000001UL)

/* CPWRUPM_COUNT @Bits 0..5 : The value present in this field indicates the number of CPWRUP master interfaces available in
                              CXGPR. Permitted range of values: 0x1 to 0x20. */

  #define GPR_DEVID_CPWRUPM_COUNT_Pos (0UL)
  #define GPR_DEVID_CPWRUPM_COUNT_Msk (0x3FUL << GPR_DEVID_CPWRUPM_COUNT_Pos)


/* GPR_DEVTYPE: Device Type Identifier Register */
  #define GPR_DEVTYPE_ResetValue (0x00000034UL)

/* MAJOR_TYPE @Bits 0..3 : Major classification of the type of the debug component as specified in the CoreSight Architecture
                           Specification for this debug and trace component. */

  #define GPR_DEVTYPE_MAJOR_TYPE_Pos (0UL)
  #define GPR_DEVTYPE_MAJOR_TYPE_Msk (0xFUL << GPR_DEVTYPE_MAJOR_TYPE_Pos)

/* SUB_TYPE @Bits 4..7 : Sub-classification of the type of the debug component as specified in the CoreSight Architecture
                         Specification within the major classification as specified in the Major_Type field. */

  #define GPR_DEVTYPE_SUB_TYPE_Pos (4UL)
  #define GPR_DEVTYPE_SUB_TYPE_Msk (0xFUL << GPR_DEVTYPE_SUB_TYPE_Pos)


/* GPR_PERIPHID4: Peripheral ID4 Register */
  #define GPR_PERIPHID4_ResetValue (0x00000004UL)

/* DES_2 @Bits 0..3 : This is the JEDEC JEP106 continuation code. This code along with, bits[6:4] of the identity code defined
                      in PERIPHID0 register. and with bits[3:0] of the identity code defined in PERIPHID1 register, gives the
                      designer of the component. */

  #define GPR_PERIPHID4_DES_2_Pos (0UL)
  #define GPR_PERIPHID4_DES_2_Msk (0xFUL << GPR_PERIPHID4_DES_2_Pos)

/* SIZE @Bits 4..7 : This is a 4-bit value that indicates the total contiguous size in powers of two of the memory window that
                     this component uses from the standard 4KB. If a component only requires the standard 4KB size then this
                     reads as 0x0, for 8KB: 0x1, 16KB:0x2, 32KB: 0x3, until 128MB. */

  #define GPR_PERIPHID4_SIZE_Pos (4UL)
  #define GPR_PERIPHID4_SIZE_Msk (0xFUL << GPR_PERIPHID4_SIZE_Pos)


/* GPR_PERIPHID0: Peripheral ID0 Register */
  #define GPR_PERIPHID0_ResetValue (0x000000A4UL)

/* PART_0 @Bits 0..7 : Bits [7:0] of the components 12 bit part number. The designer of the component assigns this part number.
                       */

  #define GPR_PERIPHID0_PART_0_Pos (0UL)
  #define GPR_PERIPHID0_PART_0_Msk (0xFFUL << GPR_PERIPHID0_PART_0_Pos)


/* GPR_PERIPHID1: Peripheral ID1 Register */
  #define GPR_PERIPHID1_ResetValue (0x000000B9UL)

/* PART_1 @Bits 0..3 : Bits[11:8] of the components 12 bit part number. The designer of the component assigns this part number.
                       */

  #define GPR_PERIPHID1_PART_1_Pos (0UL)
  #define GPR_PERIPHID1_PART_1_Msk (0xFUL << GPR_PERIPHID1_PART_1_Pos)

/* DES_0 @Bits 4..7 : Bits[3:0] of the JEDEC JEP106 identity code. This code, along with bits[6:4] of the identity code defined
                      in PERIPHID2 register and the continuation code defined in PERIPHID4 register, gives the designer of the
                      component. */

  #define GPR_PERIPHID1_DES_0_Pos (4UL)
  #define GPR_PERIPHID1_DES_0_Msk (0xFUL << GPR_PERIPHID1_DES_0_Pos)


/* GPR_PERIPHID2: Peripheral ID2 Register */
  #define GPR_PERIPHID2_ResetValue (0x0000000BUL)

/* DES_1 @Bits 0..2 : Bits[6:4] of the JEDEC JEP106 identity code. This code, along with bits[3:0] of the identity code defined
                      in PERIPHID1 register and the continuation code defined in PERIPHID4 register, gives the designer of the
                      component. */

  #define GPR_PERIPHID2_DES_1_Pos (0UL)
  #define GPR_PERIPHID2_DES_1_Msk (0x7UL << GPR_PERIPHID2_DES_1_Pos)

/* JEDEC @Bit 3 : Always set. Indicates if the JEDEC assigned designer ID is used. */
  #define GPR_PERIPHID2_JEDEC_Pos (3UL)
  #define GPR_PERIPHID2_JEDEC_Msk (0x1UL << GPR_PERIPHID2_JEDEC_Pos)

/* REVISION @Bits 4..7 : An incremental value starting from 0x0 for the first revision of this component. This increases by 1
                         for both major and minor revisions and is used to identify the major or minor revisions. */

  #define GPR_PERIPHID2_REVISION_Pos (4UL)
  #define GPR_PERIPHID2_REVISION_Msk (0xFUL << GPR_PERIPHID2_REVISION_Pos)


/* GPR_PERIPHID3: Peripheral ID3 Register */
  #define GPR_PERIPHID3_ResetValue (0x00000000UL)

/* CMOD @Bits 0..3 : Indicates if the customer modified the behavior of the component. In most cases, this field might be zero.
                     The customer changes this value on modifications to this component. */

  #define GPR_PERIPHID3_CMOD_Pos (0UL)
  #define GPR_PERIPHID3_CMOD_Msk (0xFUL << GPR_PERIPHID3_CMOD_Pos)

/* REVAND @Bits 4..7 : Indicates minor errata fixes specific to the revision of the component being used, for example metal
                       fixes after implementation. In most cases, this field might be zero. ARM recommends that the component
                       designers ensure that a metal fix can change this field if required, for example, by driving it from
                       registers that reset to zero. */

  #define GPR_PERIPHID3_REVAND_Pos (4UL)
  #define GPR_PERIPHID3_REVAND_Msk (0xFUL << GPR_PERIPHID3_REVAND_Pos)


/* GPR_COMPID0: Component ID0 Register */
  #define GPR_COMPID0_ResetValue (0x0000000DUL)

/* PRMBL_0 @Bits 0..7 : Contains bits[7:0] of the component identification code. */
  #define GPR_COMPID0_PRMBL_0_Pos (0UL)
  #define GPR_COMPID0_PRMBL_0_Msk (0xFFUL << GPR_COMPID0_PRMBL_0_Pos)


/* GPR_COMPID1: Component ID1 Register */
  #define GPR_COMPID1_ResetValue (0x00000090UL)

/* PRMBL_1 @Bits 0..3 : Contains bits [11:8] of the component identification */
  #define GPR_COMPID1_PRMBL_1_Pos (0UL)
  #define GPR_COMPID1_PRMBL_1_Msk (0xFUL << GPR_COMPID1_PRMBL_1_Pos)

/* CLASS @Bits 4..7 : Class of the component, for example, if the component is a ROM table or a generic CoreSight component.
                      Contains bits[15:12] of the component identification code. */

  #define GPR_COMPID1_CLASS_Pos (4UL)
  #define GPR_COMPID1_CLASS_Msk (0xFUL << GPR_COMPID1_CLASS_Pos)


