pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ======================================================= Struct GRTC ======================================================= */
/**
  * @brief Global Real-time counter
  */
  typedef struct {
    __OM uint32_t TASKS_CAPTURE[16];
    __IM uint32_t RESERVED[11];
    __OM uint32_t TASKS_PWMSTART;
    __OM uint32_t TASKS_PWMSTOP;
    __IM uint32_t RESERVED1[3];
    __IOM uint32_t SUBSCRIBE_CAPTURE[16];
    __IM uint32_t RESERVED2[16];
    __IOM uint32_t EVENTS_COMPARE[16];
    __IM uint32_t RESERVED3[9];
    __IOM uint32_t EVENTS_RTCOMPARESYNC;
    __IOM uint32_t EVENTS_SYSCOUNTERVALID;
    __IOM uint32_t EVENTS_PWMPERIODEND;
    __IM uint32_t RESERVED4[4];
    __IOM uint32_t PUBLISH_COMPARE[16];
    __IM uint32_t RESERVED5[16];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t INTEN0;
    __IOM uint32_t INTENSET0;
    __IOM uint32_t INTENCLR0;
    __IM uint32_t INTPEND0;
    __IOM uint32_t INTEN1;
    __IOM uint32_t INTENSET1;
    __IOM uint32_t INTENCLR1;
    __IM uint32_t INTPEND1;
    __IOM uint32_t INTEN2;
    __IOM uint32_t INTENSET2;
    __IOM uint32_t INTENCLR2;
    __IM uint32_t INTPEND2;
    __IOM uint32_t INTEN3;
    __IOM uint32_t INTENSET3;
    __IOM uint32_t INTENCLR3;
    __IM uint32_t INTPEND3;
    __IOM uint32_t INTEN4;
    __IOM uint32_t INTENSET4;
    __IOM uint32_t INTENCLR4;
    __IM uint32_t INTPEND4;
    __IOM uint32_t INTEN5;
    __IOM uint32_t INTENSET5;
    __IOM uint32_t INTENCLR5;
    __IM uint32_t INTPEND5;
    __IOM uint32_t INTEN6;
    __IOM uint32_t INTENSET6;
    __IOM uint32_t INTENCLR6;
    __IM uint32_t INTPEND6;
    __IOM uint32_t INTEN7;
    __IOM uint32_t INTENSET7;
    __IOM uint32_t INTENCLR7;
    __IM uint32_t INTPEND7;
    __IOM uint32_t INTEN8;
    __IOM uint32_t INTENSET8;
    __IOM uint32_t INTENCLR8;
    __IM uint32_t INTPEND8;
    __IOM uint32_t INTEN9;
    __IOM uint32_t INTENSET9;
    __IOM uint32_t INTENCLR9;
    __IM uint32_t INTPEND9;
    __IOM uint32_t INTEN10;
    __IOM uint32_t INTENSET10;
    __IOM uint32_t INTENCLR10;
    __IM uint32_t INTPEND10;
    __IOM uint32_t INTEN11;
    __IOM uint32_t INTENSET11;
    __IOM uint32_t INTENCLR11;
    __IM uint32_t INTPEND11;
    __IOM uint32_t INTEN12;
    __IOM uint32_t INTENSET12;
    __IOM uint32_t INTENCLR12;
    __IM uint32_t INTPEND12;
    __IOM uint32_t INTEN13;
    __IOM uint32_t INTENSET13;
    __IOM uint32_t INTENCLR13;
    __IM uint32_t INTPEND13;
    __IOM uint32_t INTEN14;
    __IOM uint32_t INTENSET14;
    __IOM uint32_t INTENCLR14;
    __IM uint32_t INTPEND14;
    __IOM uint32_t INTEN15;
    __IOM uint32_t INTENSET15;
    __IOM uint32_t INTENCLR15;
    __IM uint32_t INTPEND15;
    __IOM uint32_t EVTEN;
    __IOM uint32_t EVTENSET;
    __IOM uint32_t EVTENCLR;
    __IM uint32_t RESERVED7[65];
    __IOM uint32_t MODE;
    __IM uint32_t RESERVED8[3];
    __IOM NRF_GRTC_CC_Type CC[16];
    __IM uint32_t RESERVED9[32];
    __IOM uint32_t KEEPRUNNING;                      /*!< (@ 0x000006A0) Request to keep the SYSCOUNTER in the active state and
                                                                         prevent going to sleep*/
    __IOM uint32_t TIMEOUT;                          /*!< (@ 0x000006A4) Timeout after all CPUs gone into sleep state to stop
                                                                         the SYSCOUNTER*/
    __IOM uint32_t INTERVAL;                         /*!< (@ 0x000006A8) Count to add to CC[0] when the event EVENTS_COMPARE[0]
                                                                         triggers.*/
    __IM uint32_t RESERVED10[25];
    __IOM uint32_t PWMCONFIG;
    __IOM uint32_t CLKOUT;
    __IOM uint32_t CLKCFG;
    __IM uint32_t RESERVED11;
    __IOM NRF_GRTC_SYSCOUNTER_Type SYSCOUNTER[16];
  } NRF_GRTC_Type;

/* GRTC_TASKS_CAPTURE: Capture the counter value to CC[n] register */
  #define GRTC_TASKS_CAPTURE_MaxCount (16UL)
  #define GRTC_TASKS_CAPTURE_MaxIndex (15UL)
  #define GRTC_TASKS_CAPTURE_MinIndex (0UL)
  #define GRTC_TASKS_CAPTURE_ResetValue (0x00000000UL)

/* TASKS_CAPTURE @Bit 0 : Capture the counter value to CC[n] register */
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos (0UL)
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Msk (0x1UL << GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos) /*!< Bit mask of TASKS_CAPTURE
                                                                            field.*/
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Min (0x1UL)
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Max (0x1UL)
  #define GRTC_TASKS_CAPTURE_TASKS_CAPTURE_Trigger (0x1UL)


/* GRTC_TASKS_PWMSTART: Start the PWM */
  #define GRTC_TASKS_PWMSTART_ResetValue (0x00000000UL)

/* TASKS_PWMSTART @Bit 0 : Start the PWM */
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Pos (0UL)
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Msk (0x1UL << GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Pos) /*!< Bit mask of
                                                                            TASKS_PWMSTART field.*/
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Min (0x1UL)
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Max (0x1UL)
  #define GRTC_TASKS_PWMSTART_TASKS_PWMSTART_Trigger (0x1UL)


/* GRTC_TASKS_PWMSTOP: Stop the PWM */
  #define GRTC_TASKS_PWMSTOP_ResetValue (0x00000000UL)

/* TASKS_PWMSTOP @Bit 0 : Stop the PWM */
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Pos (0UL)
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Msk (0x1UL << GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Pos) /*!< Bit mask of TASKS_PWMSTOP
                                                                            field.*/
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Min (0x1UL)
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Max (0x1UL)
  #define GRTC_TASKS_PWMSTOP_TASKS_PWMSTOP_Trigger (0x1UL)


/* GRTC_SUBSCRIBE_CAPTURE: Subscribe configuration for task CAPTURE[n] */
  #define GRTC_SUBSCRIBE_CAPTURE_MaxCount (16UL)
  #define GRTC_SUBSCRIBE_CAPTURE_MaxIndex (15UL)
  #define GRTC_SUBSCRIBE_CAPTURE_MinIndex (0UL)
  #define GRTC_SUBSCRIBE_CAPTURE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CAPTURE[n] will subscribe to */
  #define GRTC_SUBSCRIBE_CAPTURE_CHIDX_Pos (0UL)
  #define GRTC_SUBSCRIBE_CAPTURE_CHIDX_Msk (0xFFUL << GRTC_SUBSCRIBE_CAPTURE_CHIDX_Pos)
  #define GRTC_SUBSCRIBE_CAPTURE_CHIDX_Min (0x00UL)
  #define GRTC_SUBSCRIBE_CAPTURE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Pos (31UL)
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Msk (0x1UL << GRTC_SUBSCRIBE_CAPTURE_EN_Pos)
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Min (0x0UL)
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Max (0x1UL)
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Disabled (0x0UL)
  #define GRTC_SUBSCRIBE_CAPTURE_EN_Enabled (0x1UL)


/* GRTC_EVENTS_COMPARE: Compare event on CC[n] match */
  #define GRTC_EVENTS_COMPARE_MaxCount (16UL)
  #define GRTC_EVENTS_COMPARE_MaxIndex (15UL)
  #define GRTC_EVENTS_COMPARE_MinIndex (0UL)
  #define GRTC_EVENTS_COMPARE_ResetValue (0x00000000UL)

