pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EVENTS_COMPARE @Bit 0 : Compare event on CC[n] match */
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL)
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of
                                                                            EVENTS_COMPARE field.*/
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Min (0x0UL)
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Max (0x1UL)
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0x0UL)
  #define GRTC_EVENTS_COMPARE_EVENTS_COMPARE_Generated (0x1UL)


/* GRTC_EVENTS_RTCOMPARESYNC: Synchronize always-on LFCLK clock domain */
  #define GRTC_EVENTS_RTCOMPARESYNC_ResetValue (0x00000000UL)

/* EVENTS_RTCOMPARESYNC @Bit 0 : Synchronize always-on LFCLK clock domain */
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Pos (0UL)
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Msk (0x1UL << GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Pos) /*!<
                                                                            Bit mask of EVENTS_RTCOMPARESYNC field.*/
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Min (0x0UL)
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Max (0x1UL)
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_NotGenerated (0x0UL)
  #define GRTC_EVENTS_RTCOMPARESYNC_EVENTS_RTCOMPARESYNC_Generated (0x1UL)


/* GRTC_EVENTS_SYSCOUNTERVALID: The SYSCOUNTER is in active state and value is valid */
  #define GRTC_EVENTS_SYSCOUNTERVALID_ResetValue (0x00000000UL)

/* EVENTS_SYSCOUNTERVALID @Bit 0 : The SYSCOUNTER is in active state and value is valid */
  #define GRTC_EVENTS_SYSCOUNTERVALID_EVENTS_SYSCOUNTERVALID_Pos (0UL)
  #define GRTC_EVENTS_SYSCOUNTERVALID_EVENTS_SYSCOUNTERVALID_Msk (0x1UL << GRTC_EVENTS_SYSCOUNTERVALID_EVENTS_SYSCOUNTERVALID_Pos)
                                                                            /*!< Bit mask of EVENTS_SYSCOUNTERVALID field.*/
  #define GRTC_EVENTS_SYSCOUNTERVALID_EVENTS_SYSCOUNTERVALID_Min (0x0UL) /*!< Min enumerator value of EVENTS_SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_EVENTS_SYSCOUNTERVALID_EVENTS_SYSCOUNTERVALID_Max (0x1UL) /*!< Max enumerator value of EVENTS_SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_EVENTS_SYSCOUNTERVALID_EVENTS_SYSCOUNTERVALID_NotGenerated (0x0UL)
  #define GRTC_EVENTS_SYSCOUNTERVALID_EVENTS_SYSCOUNTERVALID_Generated (0x1UL)


/* GRTC_EVENTS_PWMPERIODEND: Event on end of each PWM period */
  #define GRTC_EVENTS_PWMPERIODEND_ResetValue (0x00000000UL)

/* EVENTS_PWMPERIODEND @Bit 0 : Event on end of each PWM period */
  #define GRTC_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Pos (0UL)
  #define GRTC_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Msk (0x1UL << GRTC_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Pos) /*!< Bit
                                                                            mask of EVENTS_PWMPERIODEND field.*/
  #define GRTC_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Min (0x0UL)
  #define GRTC_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Max (0x1UL)
  #define GRTC_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_NotGenerated (0x0UL)
  #define GRTC_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Generated (0x1UL)


/* GRTC_PUBLISH_COMPARE: Publish configuration for event COMPARE[n] */
  #define GRTC_PUBLISH_COMPARE_MaxCount (16UL)
  #define GRTC_PUBLISH_COMPARE_MaxIndex (15UL)
  #define GRTC_PUBLISH_COMPARE_MinIndex (0UL)
  #define GRTC_PUBLISH_COMPARE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event COMPARE[n] will publish to */
  #define GRTC_PUBLISH_COMPARE_CHIDX_Pos (0UL)
  #define GRTC_PUBLISH_COMPARE_CHIDX_Msk (0xFFUL << GRTC_PUBLISH_COMPARE_CHIDX_Pos)
  #define GRTC_PUBLISH_COMPARE_CHIDX_Min (0x00UL)
  #define GRTC_PUBLISH_COMPARE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define GRTC_PUBLISH_COMPARE_EN_Pos (31UL)
  #define GRTC_PUBLISH_COMPARE_EN_Msk (0x1UL << GRTC_PUBLISH_COMPARE_EN_Pos)
  #define GRTC_PUBLISH_COMPARE_EN_Min (0x0UL)
  #define GRTC_PUBLISH_COMPARE_EN_Max (0x1UL)
  #define GRTC_PUBLISH_COMPARE_EN_Disabled (0x0UL)
  #define GRTC_PUBLISH_COMPARE_EN_Enabled (0x1UL)


/* GRTC_INTEN0: Enable or disable interrupt */
  #define GRTC_INTEN0_ResetValue (0x00000000UL)

/* COMPARE0 @Bit 0 : Enable or disable interrupt for event COMPARE[0] */
  #define GRTC_INTEN0_COMPARE0_Pos (0UL)
  #define GRTC_INTEN0_COMPARE0_Msk (0x1UL << GRTC_INTEN0_COMPARE0_Pos)
  #define GRTC_INTEN0_COMPARE0_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE0_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE0_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE0_Enabled (0x1UL)

/* COMPARE1 @Bit 1 : Enable or disable interrupt for event COMPARE[1] */
  #define GRTC_INTEN0_COMPARE1_Pos (1UL)
  #define GRTC_INTEN0_COMPARE1_Msk (0x1UL << GRTC_INTEN0_COMPARE1_Pos)
  #define GRTC_INTEN0_COMPARE1_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE1_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE1_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE1_Enabled (0x1UL)

/* COMPARE2 @Bit 2 : Enable or disable interrupt for event COMPARE[2] */
  #define GRTC_INTEN0_COMPARE2_Pos (2UL)
  #define GRTC_INTEN0_COMPARE2_Msk (0x1UL << GRTC_INTEN0_COMPARE2_Pos)
  #define GRTC_INTEN0_COMPARE2_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE2_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE2_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE2_Enabled (0x1UL)

/* COMPARE3 @Bit 3 : Enable or disable interrupt for event COMPARE[3] */
  #define GRTC_INTEN0_COMPARE3_Pos (3UL)
  #define GRTC_INTEN0_COMPARE3_Msk (0x1UL << GRTC_INTEN0_COMPARE3_Pos)
  #define GRTC_INTEN0_COMPARE3_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE3_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE3_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE3_Enabled (0x1UL)

/* COMPARE4 @Bit 4 : Enable or disable interrupt for event COMPARE[4] */
  #define GRTC_INTEN0_COMPARE4_Pos (4UL)
  #define GRTC_INTEN0_COMPARE4_Msk (0x1UL << GRTC_INTEN0_COMPARE4_Pos)
  #define GRTC_INTEN0_COMPARE4_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE4_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE4_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE4_Enabled (0x1UL)

/* COMPARE5 @Bit 5 : Enable or disable interrupt for event COMPARE[5] */
  #define GRTC_INTEN0_COMPARE5_Pos (5UL)
  #define GRTC_INTEN0_COMPARE5_Msk (0x1UL << GRTC_INTEN0_COMPARE5_Pos)
  #define GRTC_INTEN0_COMPARE5_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE5_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE5_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE5_Enabled (0x1UL)

/* COMPARE6 @Bit 6 : Enable or disable interrupt for event COMPARE[6] */
  #define GRTC_INTEN0_COMPARE6_Pos (6UL)
  #define GRTC_INTEN0_COMPARE6_Msk (0x1UL << GRTC_INTEN0_COMPARE6_Pos)
  #define GRTC_INTEN0_COMPARE6_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE6_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE6_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE6_Enabled (0x1UL)

/* COMPARE7 @Bit 7 : Enable or disable interrupt for event COMPARE[7] */
  #define GRTC_INTEN0_COMPARE7_Pos (7UL)
  #define GRTC_INTEN0_COMPARE7_Msk (0x1UL << GRTC_INTEN0_COMPARE7_Pos)
  #define GRTC_INTEN0_COMPARE7_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE7_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE7_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE7_Enabled (0x1UL)

/* COMPARE8 @Bit 8 : Enable or disable interrupt for event COMPARE[8] */
  #define GRTC_INTEN0_COMPARE8_Pos (8UL)
  #define GRTC_INTEN0_COMPARE8_Msk (0x1UL << GRTC_INTEN0_COMPARE8_Pos)
  #define GRTC_INTEN0_COMPARE8_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE8_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE8_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE8_Enabled (0x1UL)

/* COMPARE9 @Bit 9 : Enable or disable interrupt for event COMPARE[9] */
  #define GRTC_INTEN0_COMPARE9_Pos (9UL)
  #define GRTC_INTEN0_COMPARE9_Msk (0x1UL << GRTC_INTEN0_COMPARE9_Pos)
  #define GRTC_INTEN0_COMPARE9_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE9_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE9_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE9_Enabled (0x1UL)

/* COMPARE10 @Bit 10 : Enable or disable interrupt for event COMPARE[10] */
  #define GRTC_INTEN0_COMPARE10_Pos (10UL)
  #define GRTC_INTEN0_COMPARE10_Msk (0x1UL << GRTC_INTEN0_COMPARE10_Pos)
  #define GRTC_INTEN0_COMPARE10_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE10_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE10_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE10_Enabled (0x1UL)

/* COMPARE11 @Bit 11 : Enable or disable interrupt for event COMPARE[11] */
  #define GRTC_INTEN0_COMPARE11_Pos (11UL)
  #define GRTC_INTEN0_COMPARE11_Msk (0x1UL << GRTC_INTEN0_COMPARE11_Pos)
  #define GRTC_INTEN0_COMPARE11_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE11_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE11_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE11_Enabled (0x1UL)

/* COMPARE12 @Bit 12 : Enable or disable interrupt for event COMPARE[12] */
  #define GRTC_INTEN0_COMPARE12_Pos (12UL)
  #define GRTC_INTEN0_COMPARE12_Msk (0x1UL << GRTC_INTEN0_COMPARE12_Pos)
  #define GRTC_INTEN0_COMPARE12_Min (0x0UL)
  #define GRTC_INTEN0_COMPARE12_Max (0x1UL)
  #define GRTC_INTEN0_COMPARE12_Disabled (0x0UL)
  #define GRTC_INTEN0_COMPARE12_Enabled (0x1UL)

