pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPARE5 @Bit 5 : Write '1' to disable interrupt for event COMPARE[5] */
  #define GRTC_INTENCLR0_COMPARE5_Pos (5UL)
  #define GRTC_INTENCLR0_COMPARE5_Msk (0x1UL << GRTC_INTENCLR0_COMPARE5_Pos)
  #define GRTC_INTENCLR0_COMPARE5_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE5_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE5_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE5_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE5_Enabled (0x1UL)

/* COMPARE6 @Bit 6 : Write '1' to disable interrupt for event COMPARE[6] */
  #define GRTC_INTENCLR0_COMPARE6_Pos (6UL)
  #define GRTC_INTENCLR0_COMPARE6_Msk (0x1UL << GRTC_INTENCLR0_COMPARE6_Pos)
  #define GRTC_INTENCLR0_COMPARE6_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE6_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE6_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE6_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE6_Enabled (0x1UL)

/* COMPARE7 @Bit 7 : Write '1' to disable interrupt for event COMPARE[7] */
  #define GRTC_INTENCLR0_COMPARE7_Pos (7UL)
  #define GRTC_INTENCLR0_COMPARE7_Msk (0x1UL << GRTC_INTENCLR0_COMPARE7_Pos)
  #define GRTC_INTENCLR0_COMPARE7_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE7_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE7_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE7_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE7_Enabled (0x1UL)

/* COMPARE8 @Bit 8 : Write '1' to disable interrupt for event COMPARE[8] */
  #define GRTC_INTENCLR0_COMPARE8_Pos (8UL)
  #define GRTC_INTENCLR0_COMPARE8_Msk (0x1UL << GRTC_INTENCLR0_COMPARE8_Pos)
  #define GRTC_INTENCLR0_COMPARE8_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE8_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE8_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE8_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE8_Enabled (0x1UL)

/* COMPARE9 @Bit 9 : Write '1' to disable interrupt for event COMPARE[9] */
  #define GRTC_INTENCLR0_COMPARE9_Pos (9UL)
  #define GRTC_INTENCLR0_COMPARE9_Msk (0x1UL << GRTC_INTENCLR0_COMPARE9_Pos)
  #define GRTC_INTENCLR0_COMPARE9_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE9_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE9_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE9_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE9_Enabled (0x1UL)

/* COMPARE10 @Bit 10 : Write '1' to disable interrupt for event COMPARE[10] */
  #define GRTC_INTENCLR0_COMPARE10_Pos (10UL)
  #define GRTC_INTENCLR0_COMPARE10_Msk (0x1UL << GRTC_INTENCLR0_COMPARE10_Pos)
  #define GRTC_INTENCLR0_COMPARE10_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE10_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE10_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE10_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE10_Enabled (0x1UL)

/* COMPARE11 @Bit 11 : Write '1' to disable interrupt for event COMPARE[11] */
  #define GRTC_INTENCLR0_COMPARE11_Pos (11UL)
  #define GRTC_INTENCLR0_COMPARE11_Msk (0x1UL << GRTC_INTENCLR0_COMPARE11_Pos)
  #define GRTC_INTENCLR0_COMPARE11_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE11_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE11_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE11_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE11_Enabled (0x1UL)

/* COMPARE12 @Bit 12 : Write '1' to disable interrupt for event COMPARE[12] */
  #define GRTC_INTENCLR0_COMPARE12_Pos (12UL)
  #define GRTC_INTENCLR0_COMPARE12_Msk (0x1UL << GRTC_INTENCLR0_COMPARE12_Pos)
  #define GRTC_INTENCLR0_COMPARE12_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE12_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE12_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE12_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE12_Enabled (0x1UL)

/* COMPARE13 @Bit 13 : Write '1' to disable interrupt for event COMPARE[13] */
  #define GRTC_INTENCLR0_COMPARE13_Pos (13UL)
  #define GRTC_INTENCLR0_COMPARE13_Msk (0x1UL << GRTC_INTENCLR0_COMPARE13_Pos)
  #define GRTC_INTENCLR0_COMPARE13_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE13_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE13_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE13_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE13_Enabled (0x1UL)

/* COMPARE14 @Bit 14 : Write '1' to disable interrupt for event COMPARE[14] */
  #define GRTC_INTENCLR0_COMPARE14_Pos (14UL)
  #define GRTC_INTENCLR0_COMPARE14_Msk (0x1UL << GRTC_INTENCLR0_COMPARE14_Pos)
  #define GRTC_INTENCLR0_COMPARE14_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE14_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE14_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE14_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE14_Enabled (0x1UL)

/* COMPARE15 @Bit 15 : Write '1' to disable interrupt for event COMPARE[15] */
  #define GRTC_INTENCLR0_COMPARE15_Pos (15UL)
  #define GRTC_INTENCLR0_COMPARE15_Msk (0x1UL << GRTC_INTENCLR0_COMPARE15_Pos)
  #define GRTC_INTENCLR0_COMPARE15_Min (0x0UL)
  #define GRTC_INTENCLR0_COMPARE15_Max (0x1UL)
  #define GRTC_INTENCLR0_COMPARE15_Clear (0x1UL)
  #define GRTC_INTENCLR0_COMPARE15_Disabled (0x0UL)
  #define GRTC_INTENCLR0_COMPARE15_Enabled (0x1UL)

/* RTCOMPARESYNC @Bit 25 : Write '1' to disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENCLR0_RTCOMPARESYNC_Pos (25UL)
  #define GRTC_INTENCLR0_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENCLR0_RTCOMPARESYNC_Pos)
  #define GRTC_INTENCLR0_RTCOMPARESYNC_Min (0x0UL)
  #define GRTC_INTENCLR0_RTCOMPARESYNC_Max (0x1UL)
  #define GRTC_INTENCLR0_RTCOMPARESYNC_Clear (0x1UL)
  #define GRTC_INTENCLR0_RTCOMPARESYNC_Disabled (0x0UL)
  #define GRTC_INTENCLR0_RTCOMPARESYNC_Enabled (0x1UL)

/* SYSCOUNTERVALID @Bit 26 : Write '1' to disable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTENCLR0_SYSCOUNTERVALID_Pos (26UL)
  #define GRTC_INTENCLR0_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTENCLR0_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_INTENCLR0_SYSCOUNTERVALID_Min (0x0UL)
  #define GRTC_INTENCLR0_SYSCOUNTERVALID_Max (0x1UL)
  #define GRTC_INTENCLR0_SYSCOUNTERVALID_Clear (0x1UL)
  #define GRTC_INTENCLR0_SYSCOUNTERVALID_Disabled (0x0UL)
  #define GRTC_INTENCLR0_SYSCOUNTERVALID_Enabled (0x1UL)

