pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPARE13 @Bit 13 : Write '1' to enable interrupt for event COMPARE[13] */
  #define GRTC_INTENSET11_COMPARE13_Pos (13UL)
  #define GRTC_INTENSET11_COMPARE13_Msk (0x1UL << GRTC_INTENSET11_COMPARE13_Pos)
  #define GRTC_INTENSET11_COMPARE13_Min (0x0UL)
  #define GRTC_INTENSET11_COMPARE13_Max (0x1UL)
  #define GRTC_INTENSET11_COMPARE13_Set (0x1UL)
  #define GRTC_INTENSET11_COMPARE13_Disabled (0x0UL)
  #define GRTC_INTENSET11_COMPARE13_Enabled (0x1UL)

/* COMPARE14 @Bit 14 : Write '1' to enable interrupt for event COMPARE[14] */
  #define GRTC_INTENSET11_COMPARE14_Pos (14UL)
  #define GRTC_INTENSET11_COMPARE14_Msk (0x1UL << GRTC_INTENSET11_COMPARE14_Pos)
  #define GRTC_INTENSET11_COMPARE14_Min (0x0UL)
  #define GRTC_INTENSET11_COMPARE14_Max (0x1UL)
  #define GRTC_INTENSET11_COMPARE14_Set (0x1UL)
  #define GRTC_INTENSET11_COMPARE14_Disabled (0x0UL)
  #define GRTC_INTENSET11_COMPARE14_Enabled (0x1UL)

/* COMPARE15 @Bit 15 : Write '1' to enable interrupt for event COMPARE[15] */
  #define GRTC_INTENSET11_COMPARE15_Pos (15UL)
  #define GRTC_INTENSET11_COMPARE15_Msk (0x1UL << GRTC_INTENSET11_COMPARE15_Pos)
  #define GRTC_INTENSET11_COMPARE15_Min (0x0UL)
  #define GRTC_INTENSET11_COMPARE15_Max (0x1UL)
  #define GRTC_INTENSET11_COMPARE15_Set (0x1UL)
  #define GRTC_INTENSET11_COMPARE15_Disabled (0x0UL)
  #define GRTC_INTENSET11_COMPARE15_Enabled (0x1UL)

/* RTCOMPARESYNC @Bit 25 : Write '1' to enable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENSET11_RTCOMPARESYNC_Pos (25UL)
  #define GRTC_INTENSET11_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENSET11_RTCOMPARESYNC_Pos)
  #define GRTC_INTENSET11_RTCOMPARESYNC_Min (0x0UL)
  #define GRTC_INTENSET11_RTCOMPARESYNC_Max (0x1UL)
  #define GRTC_INTENSET11_RTCOMPARESYNC_Set (0x1UL)
  #define GRTC_INTENSET11_RTCOMPARESYNC_Disabled (0x0UL)
  #define GRTC_INTENSET11_RTCOMPARESYNC_Enabled (0x1UL)

/* SYSCOUNTERVALID @Bit 26 : Write '1' to enable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTENSET11_SYSCOUNTERVALID_Pos (26UL)
  #define GRTC_INTENSET11_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTENSET11_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_INTENSET11_SYSCOUNTERVALID_Min (0x0UL)
  #define GRTC_INTENSET11_SYSCOUNTERVALID_Max (0x1UL)
  #define GRTC_INTENSET11_SYSCOUNTERVALID_Set (0x1UL)
  #define GRTC_INTENSET11_SYSCOUNTERVALID_Disabled (0x0UL)
  #define GRTC_INTENSET11_SYSCOUNTERVALID_Enabled (0x1UL)

/* PWMPERIODEND @Bit 27 : Write '1' to enable interrupt for event PWMPERIODEND */
  #define GRTC_INTENSET11_PWMPERIODEND_Pos (27UL)
  #define GRTC_INTENSET11_PWMPERIODEND_Msk (0x1UL << GRTC_INTENSET11_PWMPERIODEND_Pos)
  #define GRTC_INTENSET11_PWMPERIODEND_Min (0x0UL)
  #define GRTC_INTENSET11_PWMPERIODEND_Max (0x1UL)
  #define GRTC_INTENSET11_PWMPERIODEND_Set (0x1UL)
  #define GRTC_INTENSET11_PWMPERIODEND_Disabled (0x0UL)
  #define GRTC_INTENSET11_PWMPERIODEND_Enabled (0x1UL)


/* GRTC_INTENCLR11: Disable interrupt */
  #define GRTC_INTENCLR11_ResetValue (0x00000000UL)

/* COMPARE0 @Bit 0 : Write '1' to disable interrupt for event COMPARE[0] */
  #define GRTC_INTENCLR11_COMPARE0_Pos (0UL)
  #define GRTC_INTENCLR11_COMPARE0_Msk (0x1UL << GRTC_INTENCLR11_COMPARE0_Pos)
  #define GRTC_INTENCLR11_COMPARE0_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE0_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE0_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE0_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE0_Enabled (0x1UL)

/* COMPARE1 @Bit 1 : Write '1' to disable interrupt for event COMPARE[1] */
  #define GRTC_INTENCLR11_COMPARE1_Pos (1UL)
  #define GRTC_INTENCLR11_COMPARE1_Msk (0x1UL << GRTC_INTENCLR11_COMPARE1_Pos)
  #define GRTC_INTENCLR11_COMPARE1_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE1_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE1_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE1_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE1_Enabled (0x1UL)

/* COMPARE2 @Bit 2 : Write '1' to disable interrupt for event COMPARE[2] */
  #define GRTC_INTENCLR11_COMPARE2_Pos (2UL)
  #define GRTC_INTENCLR11_COMPARE2_Msk (0x1UL << GRTC_INTENCLR11_COMPARE2_Pos)
  #define GRTC_INTENCLR11_COMPARE2_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE2_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE2_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE2_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE2_Enabled (0x1UL)

/* COMPARE3 @Bit 3 : Write '1' to disable interrupt for event COMPARE[3] */
  #define GRTC_INTENCLR11_COMPARE3_Pos (3UL)
  #define GRTC_INTENCLR11_COMPARE3_Msk (0x1UL << GRTC_INTENCLR11_COMPARE3_Pos)
  #define GRTC_INTENCLR11_COMPARE3_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE3_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE3_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE3_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE3_Enabled (0x1UL)

/* COMPARE4 @Bit 4 : Write '1' to disable interrupt for event COMPARE[4] */
  #define GRTC_INTENCLR11_COMPARE4_Pos (4UL)
  #define GRTC_INTENCLR11_COMPARE4_Msk (0x1UL << GRTC_INTENCLR11_COMPARE4_Pos)
  #define GRTC_INTENCLR11_COMPARE4_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE4_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE4_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE4_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE4_Enabled (0x1UL)

/* COMPARE5 @Bit 5 : Write '1' to disable interrupt for event COMPARE[5] */
  #define GRTC_INTENCLR11_COMPARE5_Pos (5UL)
  #define GRTC_INTENCLR11_COMPARE5_Msk (0x1UL << GRTC_INTENCLR11_COMPARE5_Pos)
  #define GRTC_INTENCLR11_COMPARE5_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE5_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE5_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE5_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE5_Enabled (0x1UL)

/* COMPARE6 @Bit 6 : Write '1' to disable interrupt for event COMPARE[6] */
  #define GRTC_INTENCLR11_COMPARE6_Pos (6UL)
  #define GRTC_INTENCLR11_COMPARE6_Msk (0x1UL << GRTC_INTENCLR11_COMPARE6_Pos)
  #define GRTC_INTENCLR11_COMPARE6_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE6_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE6_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE6_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE6_Enabled (0x1UL)

/* COMPARE7 @Bit 7 : Write '1' to disable interrupt for event COMPARE[7] */
  #define GRTC_INTENCLR11_COMPARE7_Pos (7UL)
  #define GRTC_INTENCLR11_COMPARE7_Msk (0x1UL << GRTC_INTENCLR11_COMPARE7_Pos)
  #define GRTC_INTENCLR11_COMPARE7_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE7_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE7_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE7_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE7_Enabled (0x1UL)

/* COMPARE8 @Bit 8 : Write '1' to disable interrupt for event COMPARE[8] */
  #define GRTC_INTENCLR11_COMPARE8_Pos (8UL)
  #define GRTC_INTENCLR11_COMPARE8_Msk (0x1UL << GRTC_INTENCLR11_COMPARE8_Pos)
  #define GRTC_INTENCLR11_COMPARE8_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE8_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE8_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE8_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE8_Enabled (0x1UL)

/* COMPARE9 @Bit 9 : Write '1' to disable interrupt for event COMPARE[9] */
  #define GRTC_INTENCLR11_COMPARE9_Pos (9UL)
  #define GRTC_INTENCLR11_COMPARE9_Msk (0x1UL << GRTC_INTENCLR11_COMPARE9_Pos)
  #define GRTC_INTENCLR11_COMPARE9_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE9_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE9_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE9_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE9_Enabled (0x1UL)

/* COMPARE10 @Bit 10 : Write '1' to disable interrupt for event COMPARE[10] */
  #define GRTC_INTENCLR11_COMPARE10_Pos (10UL)
  #define GRTC_INTENCLR11_COMPARE10_Msk (0x1UL << GRTC_INTENCLR11_COMPARE10_Pos)
  #define GRTC_INTENCLR11_COMPARE10_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE10_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE10_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE10_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE10_Enabled (0x1UL)

/* COMPARE11 @Bit 11 : Write '1' to disable interrupt for event COMPARE[11] */
  #define GRTC_INTENCLR11_COMPARE11_Pos (11UL)
  #define GRTC_INTENCLR11_COMPARE11_Msk (0x1UL << GRTC_INTENCLR11_COMPARE11_Pos)
  #define GRTC_INTENCLR11_COMPARE11_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE11_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE11_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE11_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE11_Enabled (0x1UL)

