pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPARE12 @Bit 12 : Write '1' to disable interrupt for event COMPARE[12] */
  #define GRTC_INTENCLR11_COMPARE12_Pos (12UL)
  #define GRTC_INTENCLR11_COMPARE12_Msk (0x1UL << GRTC_INTENCLR11_COMPARE12_Pos)
  #define GRTC_INTENCLR11_COMPARE12_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE12_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE12_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE12_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE12_Enabled (0x1UL)

/* COMPARE13 @Bit 13 : Write '1' to disable interrupt for event COMPARE[13] */
  #define GRTC_INTENCLR11_COMPARE13_Pos (13UL)
  #define GRTC_INTENCLR11_COMPARE13_Msk (0x1UL << GRTC_INTENCLR11_COMPARE13_Pos)
  #define GRTC_INTENCLR11_COMPARE13_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE13_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE13_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE13_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE13_Enabled (0x1UL)

/* COMPARE14 @Bit 14 : Write '1' to disable interrupt for event COMPARE[14] */
  #define GRTC_INTENCLR11_COMPARE14_Pos (14UL)
  #define GRTC_INTENCLR11_COMPARE14_Msk (0x1UL << GRTC_INTENCLR11_COMPARE14_Pos)
  #define GRTC_INTENCLR11_COMPARE14_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE14_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE14_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE14_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE14_Enabled (0x1UL)

/* COMPARE15 @Bit 15 : Write '1' to disable interrupt for event COMPARE[15] */
  #define GRTC_INTENCLR11_COMPARE15_Pos (15UL)
  #define GRTC_INTENCLR11_COMPARE15_Msk (0x1UL << GRTC_INTENCLR11_COMPARE15_Pos)
  #define GRTC_INTENCLR11_COMPARE15_Min (0x0UL)
  #define GRTC_INTENCLR11_COMPARE15_Max (0x1UL)
  #define GRTC_INTENCLR11_COMPARE15_Clear (0x1UL)
  #define GRTC_INTENCLR11_COMPARE15_Disabled (0x0UL)
  #define GRTC_INTENCLR11_COMPARE15_Enabled (0x1UL)

/* RTCOMPARESYNC @Bit 25 : Write '1' to disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENCLR11_RTCOMPARESYNC_Pos (25UL)
  #define GRTC_INTENCLR11_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENCLR11_RTCOMPARESYNC_Pos)
  #define GRTC_INTENCLR11_RTCOMPARESYNC_Min (0x0UL)
  #define GRTC_INTENCLR11_RTCOMPARESYNC_Max (0x1UL)
  #define GRTC_INTENCLR11_RTCOMPARESYNC_Clear (0x1UL)
  #define GRTC_INTENCLR11_RTCOMPARESYNC_Disabled (0x0UL)
  #define GRTC_INTENCLR11_RTCOMPARESYNC_Enabled (0x1UL)

/* SYSCOUNTERVALID @Bit 26 : Write '1' to disable interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTENCLR11_SYSCOUNTERVALID_Pos (26UL)
  #define GRTC_INTENCLR11_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTENCLR11_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_INTENCLR11_SYSCOUNTERVALID_Min (0x0UL)
  #define GRTC_INTENCLR11_SYSCOUNTERVALID_Max (0x1UL)
  #define GRTC_INTENCLR11_SYSCOUNTERVALID_Clear (0x1UL)
  #define GRTC_INTENCLR11_SYSCOUNTERVALID_Disabled (0x0UL)
  #define GRTC_INTENCLR11_SYSCOUNTERVALID_Enabled (0x1UL)

/* PWMPERIODEND @Bit 27 : Write '1' to disable interrupt for event PWMPERIODEND */
  #define GRTC_INTENCLR11_PWMPERIODEND_Pos (27UL)
  #define GRTC_INTENCLR11_PWMPERIODEND_Msk (0x1UL << GRTC_INTENCLR11_PWMPERIODEND_Pos)
  #define GRTC_INTENCLR11_PWMPERIODEND_Min (0x0UL)
  #define GRTC_INTENCLR11_PWMPERIODEND_Max (0x1UL)
  #define GRTC_INTENCLR11_PWMPERIODEND_Clear (0x1UL)
  #define GRTC_INTENCLR11_PWMPERIODEND_Disabled (0x0UL)
  #define GRTC_INTENCLR11_PWMPERIODEND_Enabled (0x1UL)


/* GRTC_INTPEND11: Pending interrupts */
  #define GRTC_INTPEND11_ResetValue (0x00000000UL)

/* COMPARE0 @Bit 0 : Read pending status of interrupt for event COMPARE[0] */
  #define GRTC_INTPEND11_COMPARE0_Pos (0UL)
  #define GRTC_INTPEND11_COMPARE0_Msk (0x1UL << GRTC_INTPEND11_COMPARE0_Pos)
  #define GRTC_INTPEND11_COMPARE0_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE0_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE0_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE0_Pending (0x1UL)

/* COMPARE1 @Bit 1 : Read pending status of interrupt for event COMPARE[1] */
  #define GRTC_INTPEND11_COMPARE1_Pos (1UL)
  #define GRTC_INTPEND11_COMPARE1_Msk (0x1UL << GRTC_INTPEND11_COMPARE1_Pos)
  #define GRTC_INTPEND11_COMPARE1_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE1_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE1_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE1_Pending (0x1UL)

/* COMPARE2 @Bit 2 : Read pending status of interrupt for event COMPARE[2] */
  #define GRTC_INTPEND11_COMPARE2_Pos (2UL)
  #define GRTC_INTPEND11_COMPARE2_Msk (0x1UL << GRTC_INTPEND11_COMPARE2_Pos)
  #define GRTC_INTPEND11_COMPARE2_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE2_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE2_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE2_Pending (0x1UL)

/* COMPARE3 @Bit 3 : Read pending status of interrupt for event COMPARE[3] */
  #define GRTC_INTPEND11_COMPARE3_Pos (3UL)
  #define GRTC_INTPEND11_COMPARE3_Msk (0x1UL << GRTC_INTPEND11_COMPARE3_Pos)
  #define GRTC_INTPEND11_COMPARE3_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE3_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE3_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE3_Pending (0x1UL)

/* COMPARE4 @Bit 4 : Read pending status of interrupt for event COMPARE[4] */
  #define GRTC_INTPEND11_COMPARE4_Pos (4UL)
  #define GRTC_INTPEND11_COMPARE4_Msk (0x1UL << GRTC_INTPEND11_COMPARE4_Pos)
  #define GRTC_INTPEND11_COMPARE4_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE4_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE4_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE4_Pending (0x1UL)

/* COMPARE5 @Bit 5 : Read pending status of interrupt for event COMPARE[5] */
  #define GRTC_INTPEND11_COMPARE5_Pos (5UL)
  #define GRTC_INTPEND11_COMPARE5_Msk (0x1UL << GRTC_INTPEND11_COMPARE5_Pos)
  #define GRTC_INTPEND11_COMPARE5_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE5_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE5_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE5_Pending (0x1UL)

/* COMPARE6 @Bit 6 : Read pending status of interrupt for event COMPARE[6] */
  #define GRTC_INTPEND11_COMPARE6_Pos (6UL)
  #define GRTC_INTPEND11_COMPARE6_Msk (0x1UL << GRTC_INTPEND11_COMPARE6_Pos)
  #define GRTC_INTPEND11_COMPARE6_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE6_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE6_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE6_Pending (0x1UL)

/* COMPARE7 @Bit 7 : Read pending status of interrupt for event COMPARE[7] */
  #define GRTC_INTPEND11_COMPARE7_Pos (7UL)
  #define GRTC_INTPEND11_COMPARE7_Msk (0x1UL << GRTC_INTPEND11_COMPARE7_Pos)
  #define GRTC_INTPEND11_COMPARE7_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE7_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE7_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE7_Pending (0x1UL)

/* COMPARE8 @Bit 8 : Read pending status of interrupt for event COMPARE[8] */
  #define GRTC_INTPEND11_COMPARE8_Pos (8UL)
  #define GRTC_INTPEND11_COMPARE8_Msk (0x1UL << GRTC_INTPEND11_COMPARE8_Pos)
  #define GRTC_INTPEND11_COMPARE8_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE8_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE8_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE8_Pending (0x1UL)

/* COMPARE9 @Bit 9 : Read pending status of interrupt for event COMPARE[9] */
  #define GRTC_INTPEND11_COMPARE9_Pos (9UL)
  #define GRTC_INTPEND11_COMPARE9_Msk (0x1UL << GRTC_INTPEND11_COMPARE9_Pos)
  #define GRTC_INTPEND11_COMPARE9_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE9_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE9_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE9_Pending (0x1UL)

/* COMPARE10 @Bit 10 : Read pending status of interrupt for event COMPARE[10] */
  #define GRTC_INTPEND11_COMPARE10_Pos (10UL)
  #define GRTC_INTPEND11_COMPARE10_Msk (0x1UL << GRTC_INTPEND11_COMPARE10_Pos)
  #define GRTC_INTPEND11_COMPARE10_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE10_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE10_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE10_Pending (0x1UL)

/* COMPARE11 @Bit 11 : Read pending status of interrupt for event COMPARE[11] */
  #define GRTC_INTPEND11_COMPARE11_Pos (11UL)
  #define GRTC_INTPEND11_COMPARE11_Msk (0x1UL << GRTC_INTPEND11_COMPARE11_Pos)
  #define GRTC_INTPEND11_COMPARE11_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE11_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE11_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE11_Pending (0x1UL)

/* COMPARE12 @Bit 12 : Read pending status of interrupt for event COMPARE[12] */
  #define GRTC_INTPEND11_COMPARE12_Pos (12UL)
  #define GRTC_INTPEND11_COMPARE12_Msk (0x1UL << GRTC_INTPEND11_COMPARE12_Pos)
  #define GRTC_INTPEND11_COMPARE12_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE12_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE12_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE12_Pending (0x1UL)

/* COMPARE13 @Bit 13 : Read pending status of interrupt for event COMPARE[13] */
  #define GRTC_INTPEND11_COMPARE13_Pos (13UL)
  #define GRTC_INTPEND11_COMPARE13_Msk (0x1UL << GRTC_INTPEND11_COMPARE13_Pos)
  #define GRTC_INTPEND11_COMPARE13_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE13_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE13_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE13_Pending (0x1UL)

/* COMPARE14 @Bit 14 : Read pending status of interrupt for event COMPARE[14] */
  #define GRTC_INTPEND11_COMPARE14_Pos (14UL)
  #define GRTC_INTPEND11_COMPARE14_Msk (0x1UL << GRTC_INTPEND11_COMPARE14_Pos)
  #define GRTC_INTPEND11_COMPARE14_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE14_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE14_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE14_Pending (0x1UL)

/* COMPARE15 @Bit 15 : Read pending status of interrupt for event COMPARE[15] */
  #define GRTC_INTPEND11_COMPARE15_Pos (15UL)
  #define GRTC_INTPEND11_COMPARE15_Msk (0x1UL << GRTC_INTPEND11_COMPARE15_Pos)
  #define GRTC_INTPEND11_COMPARE15_Min (0x0UL)
  #define GRTC_INTPEND11_COMPARE15_Max (0x1UL)
  #define GRTC_INTPEND11_COMPARE15_NotPending (0x0UL)
  #define GRTC_INTPEND11_COMPARE15_Pending (0x1UL)

/* RTCOMPARESYNC @Bit 25 : Read pending status of interrupt for event RTCOMPARESYNC */
  #define GRTC_INTPEND11_RTCOMPARESYNC_Pos (25UL)
  #define GRTC_INTPEND11_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTPEND11_RTCOMPARESYNC_Pos)
  #define GRTC_INTPEND11_RTCOMPARESYNC_Min (0x0UL)
  #define GRTC_INTPEND11_RTCOMPARESYNC_Max (0x1UL)
  #define GRTC_INTPEND11_RTCOMPARESYNC_NotPending (0x0UL)
  #define GRTC_INTPEND11_RTCOMPARESYNC_Pending (0x1UL)

/* SYSCOUNTERVALID @Bit 26 : Read pending status of interrupt for event SYSCOUNTERVALID */
  #define GRTC_INTPEND11_SYSCOUNTERVALID_Pos (26UL)
  #define GRTC_INTPEND11_SYSCOUNTERVALID_Msk (0x1UL << GRTC_INTPEND11_SYSCOUNTERVALID_Pos) /*!< Bit mask of SYSCOUNTERVALID
                                                                            field.*/
  #define GRTC_INTPEND11_SYSCOUNTERVALID_Min (0x0UL)
  #define GRTC_INTPEND11_SYSCOUNTERVALID_Max (0x1UL)
  #define GRTC_INTPEND11_SYSCOUNTERVALID_NotPending (0x0UL)
  #define GRTC_INTPEND11_SYSCOUNTERVALID_Pending (0x1UL)

/* PWMPERIODEND @Bit 27 : Read pending status of interrupt for event PWMPERIODEND */
  #define GRTC_INTPEND11_PWMPERIODEND_Pos (27UL)
  #define GRTC_INTPEND11_PWMPERIODEND_Msk (0x1UL << GRTC_INTPEND11_PWMPERIODEND_Pos)
  #define GRTC_INTPEND11_PWMPERIODEND_Min (0x0UL)
  #define GRTC_INTPEND11_PWMPERIODEND_Max (0x1UL)
  #define GRTC_INTPEND11_PWMPERIODEND_NotPending (0x0UL)
  #define GRTC_INTPEND11_PWMPERIODEND_Pending (0x1UL)


