pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* GRTC_EVTENSET: Enable event routing */
  #define GRTC_EVTENSET_ResetValue (0x00000000UL)

/* PWMPERIODEND @Bit 27 : Write '1' to enable event routing for event PWMPERIODEND */
  #define GRTC_EVTENSET_PWMPERIODEND_Pos (27UL)
  #define GRTC_EVTENSET_PWMPERIODEND_Msk (0x1UL << GRTC_EVTENSET_PWMPERIODEND_Pos)
  #define GRTC_EVTENSET_PWMPERIODEND_Min (0x0UL)
  #define GRTC_EVTENSET_PWMPERIODEND_Max (0x1UL)
  #define GRTC_EVTENSET_PWMPERIODEND_Disabled (0x0UL)
  #define GRTC_EVTENSET_PWMPERIODEND_Enabled (0x1UL)
  #define GRTC_EVTENSET_PWMPERIODEND_Set (0x1UL)


/* GRTC_EVTENCLR: Disable event routing */
  #define GRTC_EVTENCLR_ResetValue (0x00000000UL)

/* PWMPERIODEND @Bit 27 : Write '1' to disable event routing for event PWMPERIODEND */
  #define GRTC_EVTENCLR_PWMPERIODEND_Pos (27UL)
  #define GRTC_EVTENCLR_PWMPERIODEND_Msk (0x1UL << GRTC_EVTENCLR_PWMPERIODEND_Pos)
  #define GRTC_EVTENCLR_PWMPERIODEND_Min (0x0UL)
  #define GRTC_EVTENCLR_PWMPERIODEND_Max (0x1UL)
  #define GRTC_EVTENCLR_PWMPERIODEND_Disabled (0x0UL)
  #define GRTC_EVTENCLR_PWMPERIODEND_Enabled (0x1UL)
  #define GRTC_EVTENCLR_PWMPERIODEND_Clear (0x1UL)


/* GRTC_MODE: Counter mode selection */
  #define GRTC_MODE_ResetValue (0x00000000UL)

/* AUTOEN @Bit 0 : Automatic enable to keep the SYSCOUNTER active. */
  #define GRTC_MODE_AUTOEN_Pos (0UL)
  #define GRTC_MODE_AUTOEN_Msk (0x1UL << GRTC_MODE_AUTOEN_Pos)
  #define GRTC_MODE_AUTOEN_Min (0x0UL)
  #define GRTC_MODE_AUTOEN_Max (0x1UL)
  #define GRTC_MODE_AUTOEN_Default (0x0UL)
  #define GRTC_MODE_AUTOEN_CpuActive (0x1UL)         /*!< In addition to the above mode, any local CPU that is not sleeping keep
                                                          the SYSCOUNTER active.*/

/* SYSCOUNTEREN @Bit 1 : Enable the SYSCOUNTER */
  #define GRTC_MODE_SYSCOUNTEREN_Pos (1UL)
  #define GRTC_MODE_SYSCOUNTEREN_Msk (0x1UL << GRTC_MODE_SYSCOUNTEREN_Pos)
  #define GRTC_MODE_SYSCOUNTEREN_Min (0x0UL)
  #define GRTC_MODE_SYSCOUNTEREN_Max (0x1UL)
  #define GRTC_MODE_SYSCOUNTEREN_Disabled (0x0UL)
  #define GRTC_MODE_SYSCOUNTEREN_Enabled (0x1UL)


/* GRTC_KEEPRUNNING: Request to keep the SYSCOUNTER in the active state and prevent going to sleep */
  #define GRTC_KEEPRUNNING_ResetValue (0x00000000UL)

/* REQUEST0 @Bit 0 : Request from index [0] */
  #define GRTC_KEEPRUNNING_REQUEST0_Pos (0UL)
  #define GRTC_KEEPRUNNING_REQUEST0_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST0_Pos)
  #define GRTC_KEEPRUNNING_REQUEST0_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST0_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST0_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST0_Active (0x1UL)

/* REQUEST1 @Bit 1 : Request from index [1] */
  #define GRTC_KEEPRUNNING_REQUEST1_Pos (1UL)
  #define GRTC_KEEPRUNNING_REQUEST1_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST1_Pos)
  #define GRTC_KEEPRUNNING_REQUEST1_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST1_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST1_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST1_Active (0x1UL)

/* REQUEST2 @Bit 2 : Request from index [2] */
  #define GRTC_KEEPRUNNING_REQUEST2_Pos (2UL)
  #define GRTC_KEEPRUNNING_REQUEST2_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST2_Pos)
  #define GRTC_KEEPRUNNING_REQUEST2_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST2_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST2_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST2_Active (0x1UL)

/* REQUEST3 @Bit 3 : Request from index [3] */
  #define GRTC_KEEPRUNNING_REQUEST3_Pos (3UL)
  #define GRTC_KEEPRUNNING_REQUEST3_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST3_Pos)
  #define GRTC_KEEPRUNNING_REQUEST3_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST3_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST3_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST3_Active (0x1UL)

/* REQUEST4 @Bit 4 : Request from index [4] */
  #define GRTC_KEEPRUNNING_REQUEST4_Pos (4UL)
  #define GRTC_KEEPRUNNING_REQUEST4_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST4_Pos)
  #define GRTC_KEEPRUNNING_REQUEST4_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST4_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST4_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST4_Active (0x1UL)

/* REQUEST5 @Bit 5 : Request from index [5] */
  #define GRTC_KEEPRUNNING_REQUEST5_Pos (5UL)
  #define GRTC_KEEPRUNNING_REQUEST5_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST5_Pos)
  #define GRTC_KEEPRUNNING_REQUEST5_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST5_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST5_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST5_Active (0x1UL)

/* REQUEST6 @Bit 6 : Request from index [6] */
  #define GRTC_KEEPRUNNING_REQUEST6_Pos (6UL)
  #define GRTC_KEEPRUNNING_REQUEST6_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST6_Pos)
  #define GRTC_KEEPRUNNING_REQUEST6_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST6_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST6_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST6_Active (0x1UL)

/* REQUEST7 @Bit 7 : Request from index [7] */
  #define GRTC_KEEPRUNNING_REQUEST7_Pos (7UL)
  #define GRTC_KEEPRUNNING_REQUEST7_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST7_Pos)
  #define GRTC_KEEPRUNNING_REQUEST7_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST7_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST7_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST7_Active (0x1UL)

/* REQUEST8 @Bit 8 : Request from index [8] */
  #define GRTC_KEEPRUNNING_REQUEST8_Pos (8UL)
  #define GRTC_KEEPRUNNING_REQUEST8_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST8_Pos)
  #define GRTC_KEEPRUNNING_REQUEST8_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST8_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST8_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST8_Active (0x1UL)

/* REQUEST9 @Bit 9 : Request from index [9] */
  #define GRTC_KEEPRUNNING_REQUEST9_Pos (9UL)
  #define GRTC_KEEPRUNNING_REQUEST9_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST9_Pos)
  #define GRTC_KEEPRUNNING_REQUEST9_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST9_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST9_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST9_Active (0x1UL)

/* REQUEST10 @Bit 10 : Request from index [10] */
  #define GRTC_KEEPRUNNING_REQUEST10_Pos (10UL)
  #define GRTC_KEEPRUNNING_REQUEST10_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST10_Pos)
  #define GRTC_KEEPRUNNING_REQUEST10_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST10_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST10_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST10_Active (0x1UL)

/* REQUEST11 @Bit 11 : Request from index [11] */
  #define GRTC_KEEPRUNNING_REQUEST11_Pos (11UL)
  #define GRTC_KEEPRUNNING_REQUEST11_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST11_Pos)
  #define GRTC_KEEPRUNNING_REQUEST11_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST11_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST11_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST11_Active (0x1UL)

/* REQUEST12 @Bit 12 : Request from index [12] */
  #define GRTC_KEEPRUNNING_REQUEST12_Pos (12UL)
  #define GRTC_KEEPRUNNING_REQUEST12_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST12_Pos)
  #define GRTC_KEEPRUNNING_REQUEST12_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST12_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST12_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST12_Active (0x1UL)

