pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* REQUEST13 @Bit 13 : Request from index [13] */
  #define GRTC_KEEPRUNNING_REQUEST13_Pos (13UL)
  #define GRTC_KEEPRUNNING_REQUEST13_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST13_Pos)
  #define GRTC_KEEPRUNNING_REQUEST13_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST13_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST13_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST13_Active (0x1UL)

/* REQUEST14 @Bit 14 : Request from index [14] */
  #define GRTC_KEEPRUNNING_REQUEST14_Pos (14UL)
  #define GRTC_KEEPRUNNING_REQUEST14_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST14_Pos)
  #define GRTC_KEEPRUNNING_REQUEST14_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST14_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST14_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST14_Active (0x1UL)

/* REQUEST15 @Bit 15 : Request from index [15] */
  #define GRTC_KEEPRUNNING_REQUEST15_Pos (15UL)
  #define GRTC_KEEPRUNNING_REQUEST15_Msk (0x1UL << GRTC_KEEPRUNNING_REQUEST15_Pos)
  #define GRTC_KEEPRUNNING_REQUEST15_Min (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST15_Max (0x1UL)
  #define GRTC_KEEPRUNNING_REQUEST15_NotActive (0x0UL)
  #define GRTC_KEEPRUNNING_REQUEST15_Active (0x1UL)


/* GRTC_TIMEOUT: Timeout after all CPUs gone into sleep state to stop the SYSCOUNTER */
  #define GRTC_TIMEOUT_ResetValue (0x00000000UL)

/* VALUE @Bits 0..15 : Number of 32Ki cycles */
  #define GRTC_TIMEOUT_VALUE_Pos (0UL)
  #define GRTC_TIMEOUT_VALUE_Msk (0xFFFFUL << GRTC_TIMEOUT_VALUE_Pos)


/* GRTC_INTERVAL: Count to add to CC[0] when the event EVENTS_COMPARE[0] triggers. */
  #define GRTC_INTERVAL_ResetValue (0x00000000UL)

/* VALUE @Bits 0..15 : Count to add to CC[0] */
  #define GRTC_INTERVAL_VALUE_Pos (0UL)
  #define GRTC_INTERVAL_VALUE_Msk (0xFFFFUL << GRTC_INTERVAL_VALUE_Pos)


/* GRTC_PWMCONFIG: PWM configuration. */
  #define GRTC_PWMCONFIG_ResetValue (0x00000000UL)

/* COMPAREVALUE @Bits 0..7 : The PWM compare value */
  #define GRTC_PWMCONFIG_COMPAREVALUE_Pos (0UL)
  #define GRTC_PWMCONFIG_COMPAREVALUE_Msk (0xFFUL << GRTC_PWMCONFIG_COMPAREVALUE_Pos)


/* GRTC_CLKOUT: Configuration of clock output */
  #define GRTC_CLKOUT_ResetValue (0x00000000UL)

/* CLKOUT32K @Bit 0 : Enable 32Ki clock output on pin */
  #define GRTC_CLKOUT_CLKOUT32K_Pos (0UL)
  #define GRTC_CLKOUT_CLKOUT32K_Msk (0x1UL << GRTC_CLKOUT_CLKOUT32K_Pos)
  #define GRTC_CLKOUT_CLKOUT32K_Min (0x0UL)
  #define GRTC_CLKOUT_CLKOUT32K_Max (0x1UL)
  #define GRTC_CLKOUT_CLKOUT32K_Disabled (0x0UL)
  #define GRTC_CLKOUT_CLKOUT32K_Enabled (0x1UL)

/* CLKOUTFAST @Bit 1 : Enable fast clock output on pin */
  #define GRTC_CLKOUT_CLKOUTFAST_Pos (1UL)
  #define GRTC_CLKOUT_CLKOUTFAST_Msk (0x1UL << GRTC_CLKOUT_CLKOUTFAST_Pos)
  #define GRTC_CLKOUT_CLKOUTFAST_Min (0x0UL)
  #define GRTC_CLKOUT_CLKOUTFAST_Max (0x1UL)
  #define GRTC_CLKOUT_CLKOUTFAST_Disabled (0x0UL)
  #define GRTC_CLKOUT_CLKOUTFAST_Enabled (0x1UL)


/* GRTC_CLKCFG: Clock Configuration */
  #define GRTC_CLKCFG_ResetValue (0x00010001UL)

/* CLKFASTDIV @Bits 0..7 : Fast clock divisor value of clock output */
  #define GRTC_CLKCFG_CLKFASTDIV_Pos (0UL)
  #define GRTC_CLKCFG_CLKFASTDIV_Msk (0xFFUL << GRTC_CLKCFG_CLKFASTDIV_Pos)
  #define GRTC_CLKCFG_CLKFASTDIV_Min (0x01UL)
  #define GRTC_CLKCFG_CLKFASTDIV_Max (0xFFUL)

/* CLKSEL @Bits 16..17 : GRTC LFCLK clock source selection */
  #define GRTC_CLKCFG_CLKSEL_Pos (16UL)
  #define GRTC_CLKCFG_CLKSEL_Msk (0x3UL << GRTC_CLKCFG_CLKSEL_Pos)
  #define GRTC_CLKCFG_CLKSEL_Min (0x0UL)
  #define GRTC_CLKCFG_CLKSEL_Max (0x1UL)
  #define GRTC_CLKCFG_CLKSEL_LFXO (0x0UL)
  #define GRTC_CLKCFG_CLKSEL_SystemLFCLK (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           HSFLL                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct HSFLL_FREQM ==================================================== */
/**
  * @brief FREQM [HSFLL_FREQM] (unspecified)
  */
typedef struct {
  __IM  uint32_t  DONE;
  __IM  uint32_t  ERROR;
  __IM  uint32_t  MEAS;
} NRF_HSFLL_FREQM_Type;

/* HSFLL_FREQM_DONE: Frequency measurement done status */
  #define HSFLL_FREQM_DONE_ResetValue (0x00000000UL)

/* DONE @Bit 0 : Measurement done. */
  #define HSFLL_FREQM_DONE_DONE_Pos (0UL)
  #define HSFLL_FREQM_DONE_DONE_Msk (0x1UL << HSFLL_FREQM_DONE_DONE_Pos)
  #define HSFLL_FREQM_DONE_DONE_Min (0x0UL)
  #define HSFLL_FREQM_DONE_DONE_Max (0x1UL)
  #define HSFLL_FREQM_DONE_DONE_InProgress (0x0UL)
  #define HSFLL_FREQM_DONE_DONE_Completed (0x1UL)


/* HSFLL_FREQM_ERROR: Frequency measurement error status */
  #define HSFLL_FREQM_ERROR_ResetValue (0x00000000UL)

/* ERROR @Bit 0 : Trim error status. */
  #define HSFLL_FREQM_ERROR_ERROR_Pos (0UL)
  #define HSFLL_FREQM_ERROR_ERROR_Msk (0x1UL << HSFLL_FREQM_ERROR_ERROR_Pos)
  #define HSFLL_FREQM_ERROR_ERROR_Min (0x0UL)
  #define HSFLL_FREQM_ERROR_ERROR_Max (0x1UL)
  #define HSFLL_FREQM_ERROR_ERROR_OutsideLimit (0x1UL)
  #define HSFLL_FREQM_ERROR_ERROR_WithinLimit (0x0UL)

/* TRIMUNDERFLOW @Bit 1 : Underflow error status. */
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Pos (1UL)
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Msk (0x1UL << HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Pos) /*!< Bit mask of TRIMUNDERFLOW
                                                                            field.*/
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Min (0x0UL)
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_Max (0x1UL)
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_OutsideLimit (0x1UL)
  #define HSFLL_FREQM_ERROR_TRIMUNDERFLOW_WithinLimit (0x0UL)

/* TRIMOVERFLOW @Bit 2 : Overflow error status. */
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Pos (2UL)
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Msk (0x1UL << HSFLL_FREQM_ERROR_TRIMOVERFLOW_Pos)
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Min (0x0UL)
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_Max (0x1UL)
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_OutsideLimit (0x1UL)
  #define HSFLL_FREQM_ERROR_TRIMOVERFLOW_WithinLimit (0x0UL)


/* HSFLL_FREQM_MEAS: Frequency measurement */
  #define HSFLL_FREQM_MEAS_ResetValue (0x00000000UL)

/* VALUE @Bits 0..7 : Last frequency measurement value. */
  #define HSFLL_FREQM_MEAS_VALUE_Pos (0UL)
  #define HSFLL_FREQM_MEAS_VALUE_Msk (0xFFUL << HSFLL_FREQM_MEAS_VALUE_Pos)



