pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ==================================================== Struct HSFLL_TRIM ==================================================== */
/**
  * @brief TRIM [HSFLL_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  VSUP;
  __IOM uint32_t  COARSE;
  __IOM uint32_t  FINE;
  __IM  uint32_t  RESERVED[2];
} NRF_HSFLL_TRIM_Type;

/* HSFLL_TRIM_VSUP: Internal regulator voltage supply level trimming */
  #define HSFLL_TRIM_VSUP_ResetValue (0x00000010UL)

/* VALUE @Bits 0..4 : Trim value */
  #define HSFLL_TRIM_VSUP_VALUE_Pos (0UL)
  #define HSFLL_TRIM_VSUP_VALUE_Msk (0x1FUL << HSFLL_TRIM_VSUP_VALUE_Pos)


/* HSFLL_TRIM_COARSE: Coarse frequency trimming */
  #define HSFLL_TRIM_COARSE_ResetValue (0x00000004UL)

/* VALUE @Bits 0..9 : Coarse frequency trimming value. */
  #define HSFLL_TRIM_COARSE_VALUE_Pos (0UL)
  #define HSFLL_TRIM_COARSE_VALUE_Msk (0x3FFUL << HSFLL_TRIM_COARSE_VALUE_Pos)


/* HSFLL_TRIM_FINE: Fine frequency trimming */
  #define HSFLL_TRIM_FINE_ResetValue (0x0000001EUL)

/* VALUE @Bits 0..10 : Fine frequency trimming value */
  #define HSFLL_TRIM_FINE_VALUE_Pos (0UL)
  #define HSFLL_TRIM_FINE_VALUE_Msk (0x7FFUL << HSFLL_TRIM_FINE_VALUE_Pos)



/* ================================================= Struct HSFLL_CLOCKCTRL ================================================== */
/**
  * @brief CLOCKCTRL [HSFLL_CLOCKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;
  __IOM uint32_t  DITHERING;
  __IOM uint32_t  MULT;
  __IOM uint32_t  SLEEP;
  __IOM uint32_t  RETAINFINETRIM;
  __IOM uint32_t  OVERRIDELOCKED;
  __IOM uint32_t  DITHERINIT;
} NRF_HSFLL_CLOCKCTRL_Type;

/* HSFLL_CLOCKCTRL_MODE: Clock control */
  #define HSFLL_CLOCKCTRL_MODE_ResetValue (0x00000000UL)

/* MODE @Bits 0..1 : The HSFLL operating mode. */
  #define HSFLL_CLOCKCTRL_MODE_MODE_Pos (0UL)
  #define HSFLL_CLOCKCTRL_MODE_MODE_Msk (0x3UL << HSFLL_CLOCKCTRL_MODE_MODE_Pos)
  #define HSFLL_CLOCKCTRL_MODE_MODE_Min (0x0UL)
  #define HSFLL_CLOCKCTRL_MODE_MODE_Max (0x3UL)
  #define HSFLL_CLOCKCTRL_MODE_MODE_Auto (0x0UL)
  #define HSFLL_CLOCKCTRL_MODE_MODE_OpenLoop (0x1UL)
  #define HSFLL_CLOCKCTRL_MODE_MODE_ClosedLoop (0x2UL)
  #define HSFLL_CLOCKCTRL_MODE_MODE_Bypass (0x3UL)

/* OVERRIDE @Bit 4 : HSFLL override mode. */
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Pos (4UL)
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKCTRL_MODE_OVERRIDE_Pos)
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Min (0x0UL)
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Max (0x1UL)
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Disabled (0x0UL)
  #define HSFLL_CLOCKCTRL_MODE_OVERRIDE_Enabled (0x1UL)


/* HSFLL_CLOCKCTRL_DITHERING: Clock dithering configuration */
  #define HSFLL_CLOCKCTRL_DITHERING_ResetValue (0x00000033UL)

/* CYCLECOUNT @Bits 0..2 : Cycle count configuration for clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos (0UL)
  #define HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Msk (0x7UL << HSFLL_CLOCKCTRL_DITHERING_CYCLECOUNT_Pos) /*!< Bit mask of
                                                                            CYCLECOUNT field.*/

/* MAXOFFSET @Bits 4..6 : Maximum offset configuration for clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Pos (4UL)
  #define HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Msk (0x7UL << HSFLL_CLOCKCTRL_DITHERING_MAXOFFSET_Pos) /*!< Bit mask of MAXOFFSET
                                                                            field.*/

/* EN @Bit 31 : Enable the clock dithering */
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Pos (31UL)
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Msk (0x1UL << HSFLL_CLOCKCTRL_DITHERING_EN_Pos)
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Min (0x0UL)
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Max (0x1UL)
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Disabled (0x0UL)
  #define HSFLL_CLOCKCTRL_DITHERING_EN_Enabled (0x1UL)


/* HSFLL_CLOCKCTRL_MULT: Multiplication factor */
  #define HSFLL_CLOCKCTRL_MULT_ResetValue (0x00000006UL)

/* VAL @Bits 0..4 : Multiplication factor value. Valid range: 4 to 25. Output frequency is a multiplication of 16 MHz reference
                    and the multiplication factor. */

  #define HSFLL_CLOCKCTRL_MULT_VAL_Pos (0UL)
  #define HSFLL_CLOCKCTRL_MULT_VAL_Msk (0x1FUL << HSFLL_CLOCKCTRL_MULT_VAL_Pos)


/* HSFLL_CLOCKCTRL_SLEEP: Sleep configuration */
  #define HSFLL_CLOCKCTRL_SLEEP_ResetValue (0x00000001UL)

/* MODE @Bit 0 : HSFLL sleep mode. */
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Pos (0UL)
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Msk (0x1UL << HSFLL_CLOCKCTRL_SLEEP_MODE_Pos)
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Min (0x0UL)
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Max (0x1UL)
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Normal (0x0UL)
  #define HSFLL_CLOCKCTRL_SLEEP_MODE_Sleep (0x1UL)

/* RETAIN @Bit 1 : Retain. */
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Pos (1UL)
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Msk (0x1UL << HSFLL_CLOCKCTRL_SLEEP_RETAIN_Pos)
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Min (0x0UL)
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Max (0x1UL)
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Disabled (0x0UL)
  #define HSFLL_CLOCKCTRL_SLEEP_RETAIN_Enabled (0x1UL)


/* HSFLL_CLOCKCTRL_RETAINFINETRIM: Fine trim retain control */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_ResetValue (0x00000000UL)

/* RETAIN @Bit 0 : Retain control */
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos (0UL)
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Msk (0x1UL << HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Pos) /*!< Bit mask of RETAIN
                                                                            field.*/
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Min (0x0UL)
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Max (0x1UL)
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_NoRetain (0x0UL)
  #define HSFLL_CLOCKCTRL_RETAINFINETRIM_RETAIN_Retain (0x1UL)


/* HSFLL_CLOCKCTRL_OVERRIDELOCKED: Override the LOCKED signal */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_ResetValue (0x00000000UL)

/* OVERRIDE @Bit 0 : Override */
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos (0UL)
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Pos) /*!< Bit mask of
                                                                            OVERRIDE field.*/
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Min (0x0UL)
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Max (0x1UL)
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_NoOperation (0x0UL)
  #define HSFLL_CLOCKCTRL_OVERRIDELOCKED_OVERRIDE_Override (0x1UL)


/* HSFLL_CLOCKCTRL_DITHERINIT: Clock dithering, configurable seed */
  #define HSFLL_CLOCKCTRL_DITHERINIT_ResetValue (0x00000000UL)

/* SEED @Bits 0..31 : Initial value for the PRBS */
  #define HSFLL_CLOCKCTRL_DITHERINIT_SEED_Pos (0UL)
  #define HSFLL_CLOCKCTRL_DITHERINIT_SEED_Msk (0xFFFFFFFFUL << HSFLL_CLOCKCTRL_DITHERINIT_SEED_Pos) /*!< Bit mask of SEED
                                                                            field.*/


/* ====================================================== Struct HSFLL ======================================================= */
/**
  * @brief HSFLL
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED[2];
    __OM uint32_t TASKS_FREQMEAS;                    /*!< (@ 0x00000010) Start frequency measurement in software-controlled
                                                                         mode*/
    __OM uint32_t TASKS_FREQCHANGE;
    __IM uint32_t RESERVED1[58];
    __IOM uint32_t EVENTS_STARTED;
    __IOM uint32_t EVENTS_STOPPED;
    __IM uint32_t RESERVED2;
    __IOM uint32_t EVENTS_FREQMDONE;
    __IOM uint32_t EVENTS_FREQCHANGED;
    __IM uint32_t RESERVED3[187];
    __IM uint32_t CLOCKSTATUS;
    __IM uint32_t RESERVED4[7];
    __IOM NRF_HSFLL_FREQM_Type FREQM;
    __IM uint32_t RESERVED5[5];
    __IOM NRF_HSFLL_TRIM_Type TRIM;
    __IM uint32_t RESERVED6[3];
    __IOM NRF_HSFLL_CLOCKCTRL_Type CLOCKCTRL;
    __IM uint32_t RESERVED7;
    __IOM uint32_t MIRROR;
  } NRF_HSFLL_Type;

/* HSFLL_TASKS_START: Start the HSFLL */
  #define HSFLL_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start the HSFLL */
  #define HSFLL_TASKS_START_TASKS_START_Pos (0UL)
  #define HSFLL_TASKS_START_TASKS_START_Msk (0x1UL << HSFLL_TASKS_START_TASKS_START_Pos)
  #define HSFLL_TASKS_START_TASKS_START_Min (0x1UL)
  #define HSFLL_TASKS_START_TASKS_START_Max (0x1UL)
  #define HSFLL_TASKS_START_TASKS_START_Trigger (0x1UL)


/* HSFLL_TASKS_STOP: Stop the HSFLL */
  #define HSFLL_TASKS_STOP_ResetValue (0x00000000UL)

