pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS_STOP @Bit 0 : Stop the HSFLL */
  #define HSFLL_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define HSFLL_TASKS_STOP_TASKS_STOP_Msk (0x1UL << HSFLL_TASKS_STOP_TASKS_STOP_Pos)
  #define HSFLL_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define HSFLL_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define HSFLL_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* HSFLL_TASKS_FREQMEAS: Start frequency measurement in software-controlled mode */
  #define HSFLL_TASKS_FREQMEAS_ResetValue (0x00000000UL)

/* TASKS_FREQMEAS @Bit 0 : Start frequency measurement in software-controlled mode */
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Pos (0UL)
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Msk (0x1UL << HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Pos) /*!< Bit mask of
                                                                            TASKS_FREQMEAS field.*/
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Min (0x1UL)
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Max (0x1UL)
  #define HSFLL_TASKS_FREQMEAS_TASKS_FREQMEAS_Trigger (0x1UL)


/* HSFLL_TASKS_FREQCHANGE: Trigger frequency change */
  #define HSFLL_TASKS_FREQCHANGE_ResetValue (0x00000000UL)

/* TASKS_FREQCHANGE @Bit 0 : Trigger frequency change */
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos (0UL)
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Msk (0x1UL << HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Pos) /*!< Bit mask of
                                                                            TASKS_FREQCHANGE field.*/
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Min (0x1UL)
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Max (0x1UL)
  #define HSFLL_TASKS_FREQCHANGE_TASKS_FREQCHANGE_Trigger (0x1UL)


/* HSFLL_EVENTS_STARTED: HSFLL started */
  #define HSFLL_EVENTS_STARTED_ResetValue (0x00000000UL)

/* EVENTS_STARTED @Bit 0 : HSFLL started */
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL)
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << HSFLL_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL)
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL)
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL)
  #define HSFLL_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL)


/* HSFLL_EVENTS_STOPPED: HSFLL stopped */
  #define HSFLL_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : HSFLL stopped */
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define HSFLL_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* HSFLL_EVENTS_FREQMDONE: Frequency measurement done */
  #define HSFLL_EVENTS_FREQMDONE_ResetValue (0x00000000UL)

/* EVENTS_FREQMDONE @Bit 0 : Frequency measurement done */
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Pos (0UL)
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Msk (0x1UL << HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_FREQMDONE field.*/
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Min (0x0UL)
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Max (0x1UL)
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_NotGenerated (0x0UL)
  #define HSFLL_EVENTS_FREQMDONE_EVENTS_FREQMDONE_Generated (0x1UL)


/* HSFLL_EVENTS_FREQCHANGED: Frequency change done */
  #define HSFLL_EVENTS_FREQCHANGED_ResetValue (0x00000000UL)

/* EVENTS_FREQCHANGED @Bit 0 : Frequency change done */
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos (0UL)
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Msk (0x1UL << HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Pos) /*!< Bit
                                                                            mask of EVENTS_FREQCHANGED field.*/
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Min (0x0UL)
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Max (0x1UL)
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_NotGenerated (0x0UL)
  #define HSFLL_EVENTS_FREQCHANGED_EVENTS_FREQCHANGED_Generated (0x1UL)


/* HSFLL_CLOCKSTATUS: Clock status */
  #define HSFLL_CLOCKSTATUS_ResetValue (0x00000000UL)

/* MODE @Bits 0..1 : The HSFLL operating mode. */
  #define HSFLL_CLOCKSTATUS_MODE_Pos (0UL)
  #define HSFLL_CLOCKSTATUS_MODE_Msk (0x3UL << HSFLL_CLOCKSTATUS_MODE_Pos)
  #define HSFLL_CLOCKSTATUS_MODE_Min (0x0UL)
  #define HSFLL_CLOCKSTATUS_MODE_Max (0x2UL)
  #define HSFLL_CLOCKSTATUS_MODE_OpenLoop (0x0UL)
  #define HSFLL_CLOCKSTATUS_MODE_ClosedLoop (0x1UL)
  #define HSFLL_CLOCKSTATUS_MODE_Bypass (0x2UL)

/* OVERRIDE @Bit 4 : HSFLL Override mode. */
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Pos (4UL)
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Msk (0x1UL << HSFLL_CLOCKSTATUS_OVERRIDE_Pos)
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Min (0x0UL)
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Max (0x1UL)
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Disabled (0x0UL)
  #define HSFLL_CLOCKSTATUS_OVERRIDE_Enabled (0x1UL)

/* ACCURACY @Bit 9 : Clock accuracy. */
  #define HSFLL_CLOCKSTATUS_ACCURACY_Pos (9UL)
  #define HSFLL_CLOCKSTATUS_ACCURACY_Msk (0x1UL << HSFLL_CLOCKSTATUS_ACCURACY_Pos)
  #define HSFLL_CLOCKSTATUS_ACCURACY_Min (0x0UL)
  #define HSFLL_CLOCKSTATUS_ACCURACY_Max (0x1UL)
  #define HSFLL_CLOCKSTATUS_ACCURACY_OutsideLimit (0x0UL)
  #define HSFLL_CLOCKSTATUS_ACCURACY_WithinLimit (0x1UL)

/* LOCKED @Bit 10 : The HSFLL lock status. */
  #define HSFLL_CLOCKSTATUS_LOCKED_Pos (10UL)
  #define HSFLL_CLOCKSTATUS_LOCKED_Msk (0x1UL << HSFLL_CLOCKSTATUS_LOCKED_Pos)
  #define HSFLL_CLOCKSTATUS_LOCKED_Min (0x0UL)
  #define HSFLL_CLOCKSTATUS_LOCKED_Max (0x1UL)
  #define HSFLL_CLOCKSTATUS_LOCKED_NotLocked (0x0UL)
  #define HSFLL_CLOCKSTATUS_LOCKED_Locked (0x1UL)


/* HSFLL_MIRROR: Enable LOCK for mirrored registers */
  #define HSFLL_MIRROR_ResetValue (0x00000001UL)

/* LOCK @Bit 0 : Lock for mirrored registers */
  #define HSFLL_MIRROR_LOCK_Pos (0UL)
  #define HSFLL_MIRROR_LOCK_Msk (0x1UL << HSFLL_MIRROR_LOCK_Pos)
  #define HSFLL_MIRROR_LOCK_Min (0x0UL)
  #define HSFLL_MIRROR_LOCK_Max (0x1UL)
  #define HSFLL_MIRROR_LOCK_Disabled (0x0UL)
  #define HSFLL_MIRROR_LOCK_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            I2S                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct I2S_CONFIG ==================================================== */
/**
  * @brief CONFIG [I2S_CONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MODE;
  __IOM uint32_t  RXEN;
  __IOM uint32_t  TXEN;
  __IOM uint32_t  MCKEN;
  __IOM uint32_t  MCKFREQ;
  __IOM uint32_t  RATIO;
  __IOM uint32_t  SWIDTH;
  __IOM uint32_t  ALIGN;
  __IOM uint32_t  FORMAT;
  __IOM uint32_t  CHANNELS;
  __IOM uint32_t  CLKCONFIG;
} NRF_I2S_CONFIG_Type;

/* I2S_CONFIG_MODE: I2S mode */
  #define I2S_CONFIG_MODE_ResetValue (0x00000000UL)

