pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MODE @Bit 0 : I2S mode */
  #define I2S_CONFIG_MODE_MODE_Pos (0UL)
  #define I2S_CONFIG_MODE_MODE_Msk (0x1UL << I2S_CONFIG_MODE_MODE_Pos)
  #define I2S_CONFIG_MODE_MODE_Min (0x0UL)
  #define I2S_CONFIG_MODE_MODE_Max (0x1UL)
  #define I2S_CONFIG_MODE_MODE_Master (0x0UL)        /*!< Master mode. SCK and LRCK generated from internal master clcok (MCK)
                                                          and output on pins defined by PSEL.xxx.*/
  #define I2S_CONFIG_MODE_MODE_Slave (0x1UL)         /*!< Slave mode. SCK and LRCK generated by external master and received on
                                                          pins defined by PSEL.xxx*/


/* I2S_CONFIG_RXEN: Reception (RX) enable */
  #define I2S_CONFIG_RXEN_ResetValue (0x00000000UL)

/* RXEN @Bit 0 : Reception (RX) enable */
  #define I2S_CONFIG_RXEN_RXEN_Pos (0UL)
  #define I2S_CONFIG_RXEN_RXEN_Msk (0x1UL << I2S_CONFIG_RXEN_RXEN_Pos)
  #define I2S_CONFIG_RXEN_RXEN_Min (0x0UL)
  #define I2S_CONFIG_RXEN_RXEN_Max (0x1UL)
  #define I2S_CONFIG_RXEN_RXEN_Disabled (0x0UL)      /*!< Reception disabled and now data will be written to the RXD.PTR
                                                          address.*/
  #define I2S_CONFIG_RXEN_RXEN_Enabled (0x1UL)


/* I2S_CONFIG_TXEN: Transmission (TX) enable */
  #define I2S_CONFIG_TXEN_ResetValue (0x00000001UL)

/* TXEN @Bit 0 : Transmission (TX) enable */
  #define I2S_CONFIG_TXEN_TXEN_Pos (0UL)
  #define I2S_CONFIG_TXEN_TXEN_Msk (0x1UL << I2S_CONFIG_TXEN_TXEN_Pos)
  #define I2S_CONFIG_TXEN_TXEN_Min (0x0UL)
  #define I2S_CONFIG_TXEN_TXEN_Max (0x1UL)
  #define I2S_CONFIG_TXEN_TXEN_Disabled (0x0UL)      /*!< Transmission disabled and now data will be read from the RXD.TXD
                                                          address.*/
  #define I2S_CONFIG_TXEN_TXEN_Enabled (0x1UL)


/* I2S_CONFIG_MCKEN: Master clock generator enable */
  #define I2S_CONFIG_MCKEN_ResetValue (0x00000001UL)

/* MCKEN @Bit 0 : Master clock generator enable */
  #define I2S_CONFIG_MCKEN_MCKEN_Pos (0UL)
  #define I2S_CONFIG_MCKEN_MCKEN_Msk (0x1UL << I2S_CONFIG_MCKEN_MCKEN_Pos)
  #define I2S_CONFIG_MCKEN_MCKEN_Min (0x0UL)
  #define I2S_CONFIG_MCKEN_MCKEN_Max (0x1UL)
  #define I2S_CONFIG_MCKEN_MCKEN_Disabled (0x0UL)    /*!< Master clock generator disabled and PSEL.MCK not connected(available
                                                          as GPIO).*/
  #define I2S_CONFIG_MCKEN_MCKEN_Enabled (0x1UL)


/* I2S_CONFIG_MCKFREQ: I2S clock generator control */
  #define I2S_CONFIG_MCKFREQ_ResetValue (0x20000000UL)

/* MCKFREQ @Bits 0..31 : I2S MCK frequency configuration NOTE: Enumerations are deprecated, use MCKFREQ equation. NOTE: The 12
                         least significant bits of the register are ignored and shall be set to zero. */

  #define I2S_CONFIG_MCKFREQ_MCKFREQ_Pos (0UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_Msk (0xFFFFFFFFUL << I2S_CONFIG_MCKFREQ_MCKFREQ_Pos)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_Min (0x20C0000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_Max (0x80000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV2 (0x80000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV3 (0x50000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV4 (0x40000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV5 (0x30000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV6 (0x28000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV8 (0x20000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV10 (0x18000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV11 (0x16000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV15 (0x11000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV16 (0x10000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV21 (0x0C000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV23 (0x0B000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV30 (0x08800000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV31 (0x08400000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV32 (0x08000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV42 (0x06000000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV63 (0x04100000UL)
  #define I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV125 (0x020C0000UL)


/* I2S_CONFIG_RATIO: MCK / LRCK ratio */
  #define I2S_CONFIG_RATIO_ResetValue (0x00000006UL)

/* RATIO @Bits 0..3 : MCK / LRCK ratio */
  #define I2S_CONFIG_RATIO_RATIO_Pos (0UL)
  #define I2S_CONFIG_RATIO_RATIO_Msk (0xFUL << I2S_CONFIG_RATIO_RATIO_Pos)
  #define I2S_CONFIG_RATIO_RATIO_Min (0x0UL)
  #define I2S_CONFIG_RATIO_RATIO_Max (0x8UL)
  #define I2S_CONFIG_RATIO_RATIO_32X (0x0UL)
  #define I2S_CONFIG_RATIO_RATIO_48X (0x1UL)
  #define I2S_CONFIG_RATIO_RATIO_64X (0x2UL)
  #define I2S_CONFIG_RATIO_RATIO_96X (0x3UL)
  #define I2S_CONFIG_RATIO_RATIO_128X (0x4UL)
  #define I2S_CONFIG_RATIO_RATIO_192X (0x5UL)
  #define I2S_CONFIG_RATIO_RATIO_256X (0x6UL)
  #define I2S_CONFIG_RATIO_RATIO_384X (0x7UL)
  #define I2S_CONFIG_RATIO_RATIO_512X (0x8UL)


/* I2S_CONFIG_SWIDTH: Sample width */
  #define I2S_CONFIG_SWIDTH_ResetValue (0x00000001UL)

/* SWIDTH @Bits 0..2 : Sample and half-frame width */
  #define I2S_CONFIG_SWIDTH_SWIDTH_Pos (0UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_Msk (0x7UL << I2S_CONFIG_SWIDTH_SWIDTH_Pos)
  #define I2S_CONFIG_SWIDTH_SWIDTH_Min (0x0UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_Max (0x7UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_8Bit (0x0UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_16Bit (0x1UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_24Bit (0x2UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_32Bit (0x3UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_8BitIn16 (0x4UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_8BitIn32 (0x5UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_16BitIn32 (0x6UL)
  #define I2S_CONFIG_SWIDTH_SWIDTH_24BitIn32 (0x7UL)


/* I2S_CONFIG_ALIGN: Alignment of sample within a frame */
  #define I2S_CONFIG_ALIGN_ResetValue (0x00000000UL)

/* ALIGN @Bit 0 : Alignment of sample within a frame */
  #define I2S_CONFIG_ALIGN_ALIGN_Pos (0UL)
  #define I2S_CONFIG_ALIGN_ALIGN_Msk (0x1UL << I2S_CONFIG_ALIGN_ALIGN_Pos)
  #define I2S_CONFIG_ALIGN_ALIGN_Min (0x0UL)
  #define I2S_CONFIG_ALIGN_ALIGN_Max (0x1UL)
  #define I2S_CONFIG_ALIGN_ALIGN_Left (0x0UL)
  #define I2S_CONFIG_ALIGN_ALIGN_Right (0x1UL)


/* I2S_CONFIG_FORMAT: Frame format */
  #define I2S_CONFIG_FORMAT_ResetValue (0x00000000UL)

/* FORMAT @Bit 0 : Frame format */
  #define I2S_CONFIG_FORMAT_FORMAT_Pos (0UL)
  #define I2S_CONFIG_FORMAT_FORMAT_Msk (0x1UL << I2S_CONFIG_FORMAT_FORMAT_Pos)
  #define I2S_CONFIG_FORMAT_FORMAT_Min (0x0UL)
  #define I2S_CONFIG_FORMAT_FORMAT_Max (0x1UL)
  #define I2S_CONFIG_FORMAT_FORMAT_I2S (0x0UL)
  #define I2S_CONFIG_FORMAT_FORMAT_Aligned (0x1UL)


/* I2S_CONFIG_CHANNELS: Enable channels */
  #define I2S_CONFIG_CHANNELS_ResetValue (0x00000000UL)

/* CHANNELS @Bits 0..1 : Enable channels */
  #define I2S_CONFIG_CHANNELS_CHANNELS_Pos (0UL)
  #define I2S_CONFIG_CHANNELS_CHANNELS_Msk (0x3UL << I2S_CONFIG_CHANNELS_CHANNELS_Pos)
  #define I2S_CONFIG_CHANNELS_CHANNELS_Min (0x0UL)
  #define I2S_CONFIG_CHANNELS_CHANNELS_Max (0x2UL)
  #define I2S_CONFIG_CHANNELS_CHANNELS_Stereo (0x0UL)
  #define I2S_CONFIG_CHANNELS_CHANNELS_Left (0x1UL)
  #define I2S_CONFIG_CHANNELS_CHANNELS_Right (0x2UL)


