pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I2S_CONFIG_CLKCONFIG: Clock source selection for the I2S module */
  #define I2S_CONFIG_CLKCONFIG_ResetValue (0x00000000UL)

/* CLKSRC @Bit 0 : Clock source selection */
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Pos (0UL)
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Msk (0x1UL << I2S_CONFIG_CLKCONFIG_CLKSRC_Pos)
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Min (0x0UL)
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_Max (0x1UL)
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_PCLK32M (0x0UL)
  #define I2S_CONFIG_CLKCONFIG_CLKSRC_ACLK (0x1UL)

/* BYPASS @Bit 8 : Bypass clock generator. MCK will be equal to source input. If bypass is enabled the MCKFREQ setting has no
                   effect. */

  #define I2S_CONFIG_CLKCONFIG_BYPASS_Pos (8UL)
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Msk (0x1UL << I2S_CONFIG_CLKCONFIG_BYPASS_Pos)
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Min (0x0UL)
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Max (0x1UL)
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Disable (0x0UL)
  #define I2S_CONFIG_CLKCONFIG_BYPASS_Enable (0x1UL)



/* ===================================================== Struct I2S_RXD ====================================================== */
/**
  * @brief RXD [I2S_RXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;
} NRF_I2S_RXD_Type;

/* I2S_RXD_PTR: Receive buffer RAM start address. */
  #define I2S_RXD_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : Receive buffer Data RAM start address. When receiving, words containing samples will be written to this
                     address. This address is a word aligned Data RAM address. */

  #define I2S_RXD_PTR_PTR_Pos (0UL)
  #define I2S_RXD_PTR_PTR_Msk (0xFFFFFFFFUL << I2S_RXD_PTR_PTR_Pos)



/* ===================================================== Struct I2S_TXD ====================================================== */
/**
  * @brief TXD [I2S_TXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;
} NRF_I2S_TXD_Type;

/* I2S_TXD_PTR: Transmit buffer RAM start address */
  #define I2S_TXD_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : Transmit buffer Data RAM start address. When transmitting, words containing samples will be fetched from
                     this address. This address is a word aligned Data RAM address. */

  #define I2S_TXD_PTR_PTR_Pos (0UL)
  #define I2S_TXD_PTR_PTR_Msk (0xFFFFFFFFUL << I2S_TXD_PTR_PTR_Pos)



/* ==================================================== Struct I2S_RXTXD ===================================================== */
/**
  * @brief RXTXD [I2S_RXTXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  RESERVED;
} NRF_I2S_RXTXD_Type;

/* I2S_RXTXD_MAXCNT: Size of RXD and TXD buffers */
  #define I2S_RXTXD_MAXCNT_ResetValue (0x00000000UL)

/* MAXCNT @Bits 0..13 : Size of RXD and TXD buffers in number of 32 bit words */
  #define I2S_RXTXD_MAXCNT_MAXCNT_Pos (0UL)
  #define I2S_RXTXD_MAXCNT_MAXCNT_Msk (0x3FFFUL << I2S_RXTXD_MAXCNT_MAXCNT_Pos)



/* ===================================================== Struct I2S_PSEL ===================================================== */
/**
  * @brief PSEL [I2S_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  MCK;
  __IOM uint32_t  SCK;
  __IOM uint32_t  LRCK;
  __IOM uint32_t  SDIN;
  __IOM uint32_t  SDOUT;
} NRF_I2S_PSEL_Type;

/* I2S_PSEL_MCK: Pin select for MCK signal */
  #define I2S_PSEL_MCK_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_MCK_PIN_Pos (0UL)
  #define I2S_PSEL_MCK_PIN_Msk (0x1FUL << I2S_PSEL_MCK_PIN_Pos)
  #define I2S_PSEL_MCK_PIN_Min (0x00UL)
  #define I2S_PSEL_MCK_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_MCK_PORT_Pos (5UL)
  #define I2S_PSEL_MCK_PORT_Msk (0xFUL << I2S_PSEL_MCK_PORT_Pos)
  #define I2S_PSEL_MCK_PORT_Min (0x0UL)
  #define I2S_PSEL_MCK_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_MCK_CONNECT_Pos (31UL)
  #define I2S_PSEL_MCK_CONNECT_Msk (0x1UL << I2S_PSEL_MCK_CONNECT_Pos)
  #define I2S_PSEL_MCK_CONNECT_Min (0x0UL)
  #define I2S_PSEL_MCK_CONNECT_Max (0x1UL)
  #define I2S_PSEL_MCK_CONNECT_Disconnected (0x1UL)
  #define I2S_PSEL_MCK_CONNECT_Connected (0x0UL)


/* I2S_PSEL_SCK: Pin select for SCK signal */
  #define I2S_PSEL_SCK_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SCK_PIN_Pos (0UL)
  #define I2S_PSEL_SCK_PIN_Msk (0x1FUL << I2S_PSEL_SCK_PIN_Pos)
  #define I2S_PSEL_SCK_PIN_Min (0x00UL)
  #define I2S_PSEL_SCK_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SCK_PORT_Pos (5UL)
  #define I2S_PSEL_SCK_PORT_Msk (0xFUL << I2S_PSEL_SCK_PORT_Pos)
  #define I2S_PSEL_SCK_PORT_Min (0x0UL)
  #define I2S_PSEL_SCK_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SCK_CONNECT_Pos (31UL)
  #define I2S_PSEL_SCK_CONNECT_Msk (0x1UL << I2S_PSEL_SCK_CONNECT_Pos)
  #define I2S_PSEL_SCK_CONNECT_Min (0x0UL)
  #define I2S_PSEL_SCK_CONNECT_Max (0x1UL)
  #define I2S_PSEL_SCK_CONNECT_Disconnected (0x1UL)
  #define I2S_PSEL_SCK_CONNECT_Connected (0x0UL)


/* I2S_PSEL_LRCK: Pin select for LRCK signal */
  #define I2S_PSEL_LRCK_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_LRCK_PIN_Pos (0UL)
  #define I2S_PSEL_LRCK_PIN_Msk (0x1FUL << I2S_PSEL_LRCK_PIN_Pos)
  #define I2S_PSEL_LRCK_PIN_Min (0x00UL)
  #define I2S_PSEL_LRCK_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_LRCK_PORT_Pos (5UL)
  #define I2S_PSEL_LRCK_PORT_Msk (0xFUL << I2S_PSEL_LRCK_PORT_Pos)
  #define I2S_PSEL_LRCK_PORT_Min (0x0UL)
  #define I2S_PSEL_LRCK_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_LRCK_CONNECT_Pos (31UL)
  #define I2S_PSEL_LRCK_CONNECT_Msk (0x1UL << I2S_PSEL_LRCK_CONNECT_Pos)
  #define I2S_PSEL_LRCK_CONNECT_Min (0x0UL)
  #define I2S_PSEL_LRCK_CONNECT_Max (0x1UL)
  #define I2S_PSEL_LRCK_CONNECT_Disconnected (0x1UL)
  #define I2S_PSEL_LRCK_CONNECT_Connected (0x0UL)


/* I2S_PSEL_SDIN: Pin select for SDIN signal */
  #define I2S_PSEL_SDIN_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SDIN_PIN_Pos (0UL)
  #define I2S_PSEL_SDIN_PIN_Msk (0x1FUL << I2S_PSEL_SDIN_PIN_Pos)
  #define I2S_PSEL_SDIN_PIN_Min (0x00UL)
  #define I2S_PSEL_SDIN_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SDIN_PORT_Pos (5UL)
  #define I2S_PSEL_SDIN_PORT_Msk (0xFUL << I2S_PSEL_SDIN_PORT_Pos)
  #define I2S_PSEL_SDIN_PORT_Min (0x0UL)
  #define I2S_PSEL_SDIN_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SDIN_CONNECT_Pos (31UL)
  #define I2S_PSEL_SDIN_CONNECT_Msk (0x1UL << I2S_PSEL_SDIN_CONNECT_Pos)
  #define I2S_PSEL_SDIN_CONNECT_Min (0x0UL)
  #define I2S_PSEL_SDIN_CONNECT_Max (0x1UL)
  #define I2S_PSEL_SDIN_CONNECT_Disconnected (0x1UL)
  #define I2S_PSEL_SDIN_CONNECT_Connected (0x0UL)


/* I2S_PSEL_SDOUT: Pin select for SDOUT signal */
  #define I2S_PSEL_SDOUT_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define I2S_PSEL_SDOUT_PIN_Pos (0UL)
  #define I2S_PSEL_SDOUT_PIN_Msk (0x1FUL << I2S_PSEL_SDOUT_PIN_Pos)
  #define I2S_PSEL_SDOUT_PIN_Min (0x00UL)
  #define I2S_PSEL_SDOUT_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define I2S_PSEL_SDOUT_PORT_Pos (5UL)
  #define I2S_PSEL_SDOUT_PORT_Msk (0xFUL << I2S_PSEL_SDOUT_PORT_Pos)
  #define I2S_PSEL_SDOUT_PORT_Min (0x0UL)
  #define I2S_PSEL_SDOUT_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define I2S_PSEL_SDOUT_CONNECT_Pos (31UL)
  #define I2S_PSEL_SDOUT_CONNECT_Msk (0x1UL << I2S_PSEL_SDOUT_CONNECT_Pos)
  #define I2S_PSEL_SDOUT_CONNECT_Min (0x0UL)
  #define I2S_PSEL_SDOUT_CONNECT_Max (0x1UL)
  #define I2S_PSEL_SDOUT_CONNECT_Disconnected (0x1UL)
  #define I2S_PSEL_SDOUT_CONNECT_Connected (0x0UL)


/* ======================================================= Struct I2S ======================================================== */
/**
  * @brief Inter-IC Sound
  */
  typedef struct {
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Starts continuous I2S transfer. Also starts MCK
                                                                         generator when this is enabled*/
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stops I2S transfer and MCK generator. Triggering this
                                                                         task will cause the event STOPPED to be generated.*/
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED1[31];
    __IOM uint32_t EVENTS_RXPTRUPD;                  /*!< (@ 0x00000104) The RXD.PTR register has been copied to internal
                                                                         double-buffers. When the I2S module is started and RX
                                                                         is enabled, this event will be generated for every
                                                                         RXTXD.MAXCNT words received on the SDIN pin.*/
    __IOM uint32_t EVENTS_STOPPED;
    __IM uint32_t RESERVED2[2];
    __IOM uint32_t EVENTS_TXPTRUPD;                  /*!< (@ 0x00000114) The TDX.PTR register has been copied to internal
                                                                         double-buffers. When the I2S module is started and TX
                                                                         is enabled, this event will be generated for every
                                                                         RXTXD.MAXCNT words that are sent on the SDOUT pin.*/
    __IM uint32_t RESERVED3;
    __IOM uint32_t EVENTS_FRAMESTART;                /*!< (@ 0x0000011C) Frame start event, generated on the active edge of
                                                                         LRCK*/
    __IM uint32_t RESERVED4[25];
    __IOM uint32_t PUBLISH_RXPTRUPD;
    __IOM uint32_t PUBLISH_STOPPED;
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t PUBLISH_TXPTRUPD;
    __IM uint32_t RESERVED6;
    __IOM uint32_t PUBLISH_FRAMESTART;
    __IM uint32_t RESERVED7[88];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED8[125];
    __IOM uint32_t ENABLE;
    __IOM NRF_I2S_CONFIG_Type CONFIG;
    __IM uint32_t RESERVED9[2];
    __IOM NRF_I2S_RXD_Type RXD;
    __IM uint32_t RESERVED10;
    __IOM NRF_I2S_TXD_Type TXD;
    __IM uint32_t RESERVED11[3];
    __IOM NRF_I2S_RXTXD_Type RXTXD;
    __IM uint32_t RESERVED12[2];
    __IOM NRF_I2S_PSEL_Type PSEL;
  } NRF_I2S_Type;

/* I2S_TASKS_START: Starts continuous I2S transfer. Also starts MCK generator when this is enabled */
  #define I2S_TASKS_START_ResetValue (0x00000000UL)

