pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS_START @Bit 0 : Starts continuous I2S transfer. Also starts MCK generator when this is enabled */
  #define I2S_TASKS_START_TASKS_START_Pos (0UL)
  #define I2S_TASKS_START_TASKS_START_Msk (0x1UL << I2S_TASKS_START_TASKS_START_Pos)
  #define I2S_TASKS_START_TASKS_START_Min (0x1UL)
  #define I2S_TASKS_START_TASKS_START_Max (0x1UL)
  #define I2S_TASKS_START_TASKS_START_Trigger (0x1UL)


/* I2S_TASKS_STOP: Stops I2S transfer and MCK generator. Triggering this task will cause the event STOPPED to be generated. */
  #define I2S_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stops I2S transfer and MCK generator. Triggering this task will cause the event STOPPED to be generated.
                       */

  #define I2S_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define I2S_TASKS_STOP_TASKS_STOP_Msk (0x1UL << I2S_TASKS_STOP_TASKS_STOP_Pos)
  #define I2S_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define I2S_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define I2S_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* I2S_SUBSCRIBE_START: Subscribe configuration for task START */
  #define I2S_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define I2S_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define I2S_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << I2S_SUBSCRIBE_START_CHIDX_Pos)
  #define I2S_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define I2S_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define I2S_SUBSCRIBE_START_EN_Pos (31UL)
  #define I2S_SUBSCRIBE_START_EN_Msk (0x1UL << I2S_SUBSCRIBE_START_EN_Pos)
  #define I2S_SUBSCRIBE_START_EN_Min (0x0UL)
  #define I2S_SUBSCRIBE_START_EN_Max (0x1UL)
  #define I2S_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define I2S_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* I2S_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define I2S_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define I2S_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define I2S_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << I2S_SUBSCRIBE_STOP_CHIDX_Pos)
  #define I2S_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define I2S_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define I2S_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define I2S_SUBSCRIBE_STOP_EN_Msk (0x1UL << I2S_SUBSCRIBE_STOP_EN_Pos)
  #define I2S_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define I2S_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define I2S_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define I2S_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* I2S_EVENTS_RXPTRUPD: The RXD.PTR register has been copied to internal double-buffers. When the I2S module is started and RX
                         is enabled, this event will be generated for every RXTXD.MAXCNT words received on the SDIN pin. */

  #define I2S_EVENTS_RXPTRUPD_ResetValue (0x00000000UL)

/* EVENTS_RXPTRUPD @Bit 0 : The RXD.PTR register has been copied to internal double-buffers. When the I2S module is started and
                            RX is enabled, this event will be generated for every RXTXD.MAXCNT words received on the SDIN pin. */

  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos (0UL)
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Msk (0x1UL << I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Pos) /*!< Bit mask of
                                                                            EVENTS_RXPTRUPD field.*/
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Min (0x0UL)
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Max (0x1UL)
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_NotGenerated (0x0UL)
  #define I2S_EVENTS_RXPTRUPD_EVENTS_RXPTRUPD_Generated (0x1UL)


/* I2S_EVENTS_STOPPED: I2S transfer stopped. */
  #define I2S_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : I2S transfer stopped. */
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << I2S_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define I2S_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* I2S_EVENTS_TXPTRUPD: The TDX.PTR register has been copied to internal double-buffers. When the I2S module is started and TX
                         is enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin. */

  #define I2S_EVENTS_TXPTRUPD_ResetValue (0x00000000UL)

/* EVENTS_TXPTRUPD @Bit 0 : The TDX.PTR register has been copied to internal double-buffers. When the I2S module is started and
                            TX is enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT
                            pin. */

  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos (0UL)
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Msk (0x1UL << I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos) /*!< Bit mask of
                                                                            EVENTS_TXPTRUPD field.*/
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Min (0x0UL)
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Max (0x1UL)
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_NotGenerated (0x0UL)
  #define I2S_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Generated (0x1UL)


/* I2S_EVENTS_FRAMESTART: Frame start event, generated on the active edge of LRCK */
  #define I2S_EVENTS_FRAMESTART_ResetValue (0x00000000UL)

/* EVENTS_FRAMESTART @Bit 0 : Frame start event, generated on the active edge of LRCK */
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Pos (0UL)
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Msk (0x1UL << I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Pos) /*!< Bit mask of
                                                                            EVENTS_FRAMESTART field.*/
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Min (0x0UL)
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Max (0x1UL)
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_NotGenerated (0x0UL)
  #define I2S_EVENTS_FRAMESTART_EVENTS_FRAMESTART_Generated (0x1UL)


/* I2S_PUBLISH_RXPTRUPD: Publish configuration for event RXPTRUPD */
  #define I2S_PUBLISH_RXPTRUPD_ResetValue (0x00000000UL)

