pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RXPTRUPD will publish to */
  #define I2S_PUBLISH_RXPTRUPD_CHIDX_Pos (0UL)
  #define I2S_PUBLISH_RXPTRUPD_CHIDX_Msk (0xFFUL << I2S_PUBLISH_RXPTRUPD_CHIDX_Pos)
  #define I2S_PUBLISH_RXPTRUPD_CHIDX_Min (0x00UL)
  #define I2S_PUBLISH_RXPTRUPD_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_RXPTRUPD_EN_Pos (31UL)
  #define I2S_PUBLISH_RXPTRUPD_EN_Msk (0x1UL << I2S_PUBLISH_RXPTRUPD_EN_Pos)
  #define I2S_PUBLISH_RXPTRUPD_EN_Min (0x0UL)
  #define I2S_PUBLISH_RXPTRUPD_EN_Max (0x1UL)
  #define I2S_PUBLISH_RXPTRUPD_EN_Disabled (0x0UL)
  #define I2S_PUBLISH_RXPTRUPD_EN_Enabled (0x1UL)


/* I2S_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define I2S_PUBLISH_STOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define I2S_PUBLISH_STOPPED_CHIDX_Pos (0UL)
  #define I2S_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << I2S_PUBLISH_STOPPED_CHIDX_Pos)
  #define I2S_PUBLISH_STOPPED_CHIDX_Min (0x00UL)
  #define I2S_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_STOPPED_EN_Pos (31UL)
  #define I2S_PUBLISH_STOPPED_EN_Msk (0x1UL << I2S_PUBLISH_STOPPED_EN_Pos)
  #define I2S_PUBLISH_STOPPED_EN_Min (0x0UL)
  #define I2S_PUBLISH_STOPPED_EN_Max (0x1UL)
  #define I2S_PUBLISH_STOPPED_EN_Disabled (0x0UL)
  #define I2S_PUBLISH_STOPPED_EN_Enabled (0x1UL)


/* I2S_PUBLISH_TXPTRUPD: Publish configuration for event TXPTRUPD */
  #define I2S_PUBLISH_TXPTRUPD_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event TXPTRUPD will publish to */
  #define I2S_PUBLISH_TXPTRUPD_CHIDX_Pos (0UL)
  #define I2S_PUBLISH_TXPTRUPD_CHIDX_Msk (0xFFUL << I2S_PUBLISH_TXPTRUPD_CHIDX_Pos)
  #define I2S_PUBLISH_TXPTRUPD_CHIDX_Min (0x00UL)
  #define I2S_PUBLISH_TXPTRUPD_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_TXPTRUPD_EN_Pos (31UL)
  #define I2S_PUBLISH_TXPTRUPD_EN_Msk (0x1UL << I2S_PUBLISH_TXPTRUPD_EN_Pos)
  #define I2S_PUBLISH_TXPTRUPD_EN_Min (0x0UL)
  #define I2S_PUBLISH_TXPTRUPD_EN_Max (0x1UL)
  #define I2S_PUBLISH_TXPTRUPD_EN_Disabled (0x0UL)
  #define I2S_PUBLISH_TXPTRUPD_EN_Enabled (0x1UL)


/* I2S_PUBLISH_FRAMESTART: Publish configuration for event FRAMESTART */
  #define I2S_PUBLISH_FRAMESTART_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event FRAMESTART will publish to */
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Pos (0UL)
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Msk (0xFFUL << I2S_PUBLISH_FRAMESTART_CHIDX_Pos)
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Min (0x00UL)
  #define I2S_PUBLISH_FRAMESTART_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define I2S_PUBLISH_FRAMESTART_EN_Pos (31UL)
  #define I2S_PUBLISH_FRAMESTART_EN_Msk (0x1UL << I2S_PUBLISH_FRAMESTART_EN_Pos)
  #define I2S_PUBLISH_FRAMESTART_EN_Min (0x0UL)
  #define I2S_PUBLISH_FRAMESTART_EN_Max (0x1UL)
  #define I2S_PUBLISH_FRAMESTART_EN_Disabled (0x0UL)
  #define I2S_PUBLISH_FRAMESTART_EN_Enabled (0x1UL)


/* I2S_INTEN: Enable or disable interrupt */
  #define I2S_INTEN_ResetValue (0x00000000UL)

/* RXPTRUPD @Bit 1 : Enable or disable interrupt for event RXPTRUPD */
  #define I2S_INTEN_RXPTRUPD_Pos (1UL)
  #define I2S_INTEN_RXPTRUPD_Msk (0x1UL << I2S_INTEN_RXPTRUPD_Pos)
  #define I2S_INTEN_RXPTRUPD_Min (0x0UL)
  #define I2S_INTEN_RXPTRUPD_Max (0x1UL)
  #define I2S_INTEN_RXPTRUPD_Disabled (0x0UL)
  #define I2S_INTEN_RXPTRUPD_Enabled (0x1UL)

/* STOPPED @Bit 2 : Enable or disable interrupt for event STOPPED */
  #define I2S_INTEN_STOPPED_Pos (2UL)
  #define I2S_INTEN_STOPPED_Msk (0x1UL << I2S_INTEN_STOPPED_Pos)
  #define I2S_INTEN_STOPPED_Min (0x0UL)
  #define I2S_INTEN_STOPPED_Max (0x1UL)
  #define I2S_INTEN_STOPPED_Disabled (0x0UL)
  #define I2S_INTEN_STOPPED_Enabled (0x1UL)

/* TXPTRUPD @Bit 5 : Enable or disable interrupt for event TXPTRUPD */
  #define I2S_INTEN_TXPTRUPD_Pos (5UL)
  #define I2S_INTEN_TXPTRUPD_Msk (0x1UL << I2S_INTEN_TXPTRUPD_Pos)
  #define I2S_INTEN_TXPTRUPD_Min (0x0UL)
  #define I2S_INTEN_TXPTRUPD_Max (0x1UL)
  #define I2S_INTEN_TXPTRUPD_Disabled (0x0UL)
  #define I2S_INTEN_TXPTRUPD_Enabled (0x1UL)

/* FRAMESTART @Bit 7 : Enable or disable interrupt for event FRAMESTART */
  #define I2S_INTEN_FRAMESTART_Pos (7UL)
  #define I2S_INTEN_FRAMESTART_Msk (0x1UL << I2S_INTEN_FRAMESTART_Pos)
  #define I2S_INTEN_FRAMESTART_Min (0x0UL)
  #define I2S_INTEN_FRAMESTART_Max (0x1UL)
  #define I2S_INTEN_FRAMESTART_Disabled (0x0UL)
  #define I2S_INTEN_FRAMESTART_Enabled (0x1UL)


/* I2S_INTENSET: Enable interrupt */
  #define I2S_INTENSET_ResetValue (0x00000000UL)

/* RXPTRUPD @Bit 1 : Write '1' to enable interrupt for event RXPTRUPD */
  #define I2S_INTENSET_RXPTRUPD_Pos (1UL)
  #define I2S_INTENSET_RXPTRUPD_Msk (0x1UL << I2S_INTENSET_RXPTRUPD_Pos)
  #define I2S_INTENSET_RXPTRUPD_Min (0x0UL)
  #define I2S_INTENSET_RXPTRUPD_Max (0x1UL)
  #define I2S_INTENSET_RXPTRUPD_Set (0x1UL)
  #define I2S_INTENSET_RXPTRUPD_Disabled (0x0UL)
  #define I2S_INTENSET_RXPTRUPD_Enabled (0x1UL)

/* STOPPED @Bit 2 : Write '1' to enable interrupt for event STOPPED */
  #define I2S_INTENSET_STOPPED_Pos (2UL)
  #define I2S_INTENSET_STOPPED_Msk (0x1UL << I2S_INTENSET_STOPPED_Pos)
  #define I2S_INTENSET_STOPPED_Min (0x0UL)
  #define I2S_INTENSET_STOPPED_Max (0x1UL)
  #define I2S_INTENSET_STOPPED_Set (0x1UL)
  #define I2S_INTENSET_STOPPED_Disabled (0x0UL)
  #define I2S_INTENSET_STOPPED_Enabled (0x1UL)

/* TXPTRUPD @Bit 5 : Write '1' to enable interrupt for event TXPTRUPD */
  #define I2S_INTENSET_TXPTRUPD_Pos (5UL)
  #define I2S_INTENSET_TXPTRUPD_Msk (0x1UL << I2S_INTENSET_TXPTRUPD_Pos)
  #define I2S_INTENSET_TXPTRUPD_Min (0x0UL)
  #define I2S_INTENSET_TXPTRUPD_Max (0x1UL)
  #define I2S_INTENSET_TXPTRUPD_Set (0x1UL)
  #define I2S_INTENSET_TXPTRUPD_Disabled (0x0UL)
  #define I2S_INTENSET_TXPTRUPD_Enabled (0x1UL)

/* FRAMESTART @Bit 7 : Write '1' to enable interrupt for event FRAMESTART */
  #define I2S_INTENSET_FRAMESTART_Pos (7UL)
  #define I2S_INTENSET_FRAMESTART_Msk (0x1UL << I2S_INTENSET_FRAMESTART_Pos)
  #define I2S_INTENSET_FRAMESTART_Min (0x0UL)
  #define I2S_INTENSET_FRAMESTART_Max (0x1UL)
  #define I2S_INTENSET_FRAMESTART_Set (0x1UL)
  #define I2S_INTENSET_FRAMESTART_Disabled (0x0UL)
  #define I2S_INTENSET_FRAMESTART_Enabled (0x1UL)


/* I2S_INTENCLR: Disable interrupt */
  #define I2S_INTENCLR_ResetValue (0x00000000UL)

