pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RXPTRUPD @Bit 1 : Write '1' to disable interrupt for event RXPTRUPD */
  #define I2S_INTENCLR_RXPTRUPD_Pos (1UL)
  #define I2S_INTENCLR_RXPTRUPD_Msk (0x1UL << I2S_INTENCLR_RXPTRUPD_Pos)
  #define I2S_INTENCLR_RXPTRUPD_Min (0x0UL)
  #define I2S_INTENCLR_RXPTRUPD_Max (0x1UL)
  #define I2S_INTENCLR_RXPTRUPD_Clear (0x1UL)
  #define I2S_INTENCLR_RXPTRUPD_Disabled (0x0UL)
  #define I2S_INTENCLR_RXPTRUPD_Enabled (0x1UL)

/* STOPPED @Bit 2 : Write '1' to disable interrupt for event STOPPED */
  #define I2S_INTENCLR_STOPPED_Pos (2UL)
  #define I2S_INTENCLR_STOPPED_Msk (0x1UL << I2S_INTENCLR_STOPPED_Pos)
  #define I2S_INTENCLR_STOPPED_Min (0x0UL)
  #define I2S_INTENCLR_STOPPED_Max (0x1UL)
  #define I2S_INTENCLR_STOPPED_Clear (0x1UL)
  #define I2S_INTENCLR_STOPPED_Disabled (0x0UL)
  #define I2S_INTENCLR_STOPPED_Enabled (0x1UL)

/* TXPTRUPD @Bit 5 : Write '1' to disable interrupt for event TXPTRUPD */
  #define I2S_INTENCLR_TXPTRUPD_Pos (5UL)
  #define I2S_INTENCLR_TXPTRUPD_Msk (0x1UL << I2S_INTENCLR_TXPTRUPD_Pos)
  #define I2S_INTENCLR_TXPTRUPD_Min (0x0UL)
  #define I2S_INTENCLR_TXPTRUPD_Max (0x1UL)
  #define I2S_INTENCLR_TXPTRUPD_Clear (0x1UL)
  #define I2S_INTENCLR_TXPTRUPD_Disabled (0x0UL)
  #define I2S_INTENCLR_TXPTRUPD_Enabled (0x1UL)

/* FRAMESTART @Bit 7 : Write '1' to disable interrupt for event FRAMESTART */
  #define I2S_INTENCLR_FRAMESTART_Pos (7UL)
  #define I2S_INTENCLR_FRAMESTART_Msk (0x1UL << I2S_INTENCLR_FRAMESTART_Pos)
  #define I2S_INTENCLR_FRAMESTART_Min (0x0UL)
  #define I2S_INTENCLR_FRAMESTART_Max (0x1UL)
  #define I2S_INTENCLR_FRAMESTART_Clear (0x1UL)
  #define I2S_INTENCLR_FRAMESTART_Disabled (0x0UL)
  #define I2S_INTENCLR_FRAMESTART_Enabled (0x1UL)


/* I2S_ENABLE: Enable I2S module */
  #define I2S_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable I2S module */
  #define I2S_ENABLE_ENABLE_Pos (0UL)
  #define I2S_ENABLE_ENABLE_Msk (0x1UL << I2S_ENABLE_ENABLE_Pos)
  #define I2S_ENABLE_ENABLE_Min (0x0UL)
  #define I2S_ENABLE_ENABLE_Max (0x1UL)
  #define I2S_ENABLE_ENABLE_Disabled (0x0UL)
  #define I2S_ENABLE_ENABLE_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            I3C                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct I3C_CDR ====================================================== */
/**
  * @brief CDR [I3C_CDR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STARTOFFSET;
  __IOM uint32_t  MAXCYCLERATIO;                     /*!< (@ 0x00000004) Maximum cycle ratio between SDA/SCL and CDR (clock and
                                                                         data recovery) clock*/
  __IOM uint32_t  MAXSKEW;
} NRF_I3C_CDR_Type;

/* I3C_CDR_STARTOFFSET: Start offset of recovered clock */
  #define I3C_CDR_STARTOFFSET_ResetValue (0x00000004UL)

/* VAL @Bits 0..15 : Value */
  #define I3C_CDR_STARTOFFSET_VAL_Pos (0UL)
  #define I3C_CDR_STARTOFFSET_VAL_Msk (0xFFFFUL << I3C_CDR_STARTOFFSET_VAL_Pos)


/* I3C_CDR_MAXCYCLERATIO: Maximum cycle ratio between SDA/SCL and CDR (clock and data recovery) clock */
  #define I3C_CDR_MAXCYCLERATIO_ResetValue (0x0000001CUL)

/* VAL @Bits 0..15 : Value */
  #define I3C_CDR_MAXCYCLERATIO_VAL_Pos (0UL)
  #define I3C_CDR_MAXCYCLERATIO_VAL_Msk (0xFFFFUL << I3C_CDR_MAXCYCLERATIO_VAL_Pos)


/* I3C_CDR_MAXSKEW: Maximum skew between SCL and SCL in CDR clock cycles */
  #define I3C_CDR_MAXSKEW_ResetValue (0x00000005UL)

/* VAL @Bits 0..7 : Value */
  #define I3C_CDR_MAXSKEW_VAL_Pos (0UL)
  #define I3C_CDR_MAXSKEW_VAL_Msk (0xFFUL << I3C_CDR_MAXSKEW_VAL_Pos)


/* ======================================================= Struct I3C ======================================================== */
/**
  * @brief I3C
  */
  typedef struct {
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_CORE;
    __IOM uint32_t EVENTS_DMA;
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;
    __IOM NRF_I3C_CDR_Type CDR;
    __IOM uint32_t SLAVEIF0;
    __IOM uint32_t SLAVEIF1;
    __IOM uint32_t SLAVEPID0;
    __IOM uint32_t SLAVEPID1;
    __IOM uint32_t KEEPSDA;                          /*!< (@ 0x00000420) Enable or disable the SDA high-keeper used for
                                                                         Master-to-Slave and Slave-to-Master bus hand-off.*/
    __IOM uint32_t KEEPSCL;                          /*!< (@ 0x00000424) Enable or disable the SCL high-keeper used for
                                                                         Master-to-Slave and Slave-to-Master bus hand-off.*/
  } NRF_I3C_Type;

/* I3C_EVENTS_CORE: Event indicating that interrupt triggered at I3C core */
  #define I3C_EVENTS_CORE_ResetValue (0x00000000UL)

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at I3C core */
  #define I3C_EVENTS_CORE_EVENTS_CORE_Pos (0UL)
  #define I3C_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << I3C_EVENTS_CORE_EVENTS_CORE_Pos)
  #define I3C_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)
  #define I3C_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)
  #define I3C_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL)
  #define I3C_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL)


/* I3C_EVENTS_DMA: Event indicating that interrupt triggered at I3C DMA */
  #define I3C_EVENTS_DMA_ResetValue (0x00000000UL)

/* EVENTS_DMA @Bit 0 : Event indicating that interrupt triggered at I3C DMA */
  #define I3C_EVENTS_DMA_EVENTS_DMA_Pos (0UL)
  #define I3C_EVENTS_DMA_EVENTS_DMA_Msk (0x1UL << I3C_EVENTS_DMA_EVENTS_DMA_Pos)
  #define I3C_EVENTS_DMA_EVENTS_DMA_Min (0x0UL)
  #define I3C_EVENTS_DMA_EVENTS_DMA_Max (0x1UL)
  #define I3C_EVENTS_DMA_EVENTS_DMA_NotGenerated (0x0UL)
  #define I3C_EVENTS_DMA_EVENTS_DMA_Generated (0x1UL)


/* I3C_INTEN: Enable or disable interrupt */
  #define I3C_INTEN_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define I3C_INTEN_CORE_Pos (0UL)
  #define I3C_INTEN_CORE_Msk (0x1UL << I3C_INTEN_CORE_Pos)
  #define I3C_INTEN_CORE_Min (0x0UL)
  #define I3C_INTEN_CORE_Max (0x1UL)
  #define I3C_INTEN_CORE_Disabled (0x0UL)
  #define I3C_INTEN_CORE_Enabled (0x1UL)

/* DMA @Bit 1 : Enable or disable interrupt for event DMA */
  #define I3C_INTEN_DMA_Pos (1UL)
  #define I3C_INTEN_DMA_Msk (0x1UL << I3C_INTEN_DMA_Pos)
  #define I3C_INTEN_DMA_Min (0x0UL)
  #define I3C_INTEN_DMA_Max (0x1UL)
  #define I3C_INTEN_DMA_Disabled (0x0UL)
  #define I3C_INTEN_DMA_Enabled (0x1UL)


/* I3C_INTENSET: Enable interrupt */
  #define I3C_INTENSET_ResetValue (0x00000000UL)

