pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define I3C_INTENSET_CORE_Pos (0UL)
  #define I3C_INTENSET_CORE_Msk (0x1UL << I3C_INTENSET_CORE_Pos)
  #define I3C_INTENSET_CORE_Min (0x0UL)
  #define I3C_INTENSET_CORE_Max (0x1UL)
  #define I3C_INTENSET_CORE_Set (0x1UL)
  #define I3C_INTENSET_CORE_Disabled (0x0UL)
  #define I3C_INTENSET_CORE_Enabled (0x1UL)

/* DMA @Bit 1 : Write '1' to enable interrupt for event DMA */
  #define I3C_INTENSET_DMA_Pos (1UL)
  #define I3C_INTENSET_DMA_Msk (0x1UL << I3C_INTENSET_DMA_Pos)
  #define I3C_INTENSET_DMA_Min (0x0UL)
  #define I3C_INTENSET_DMA_Max (0x1UL)
  #define I3C_INTENSET_DMA_Set (0x1UL)
  #define I3C_INTENSET_DMA_Disabled (0x0UL)
  #define I3C_INTENSET_DMA_Enabled (0x1UL)


/* I3C_INTENCLR: Disable interrupt */
  #define I3C_INTENCLR_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define I3C_INTENCLR_CORE_Pos (0UL)
  #define I3C_INTENCLR_CORE_Msk (0x1UL << I3C_INTENCLR_CORE_Pos)
  #define I3C_INTENCLR_CORE_Min (0x0UL)
  #define I3C_INTENCLR_CORE_Max (0x1UL)
  #define I3C_INTENCLR_CORE_Clear (0x1UL)
  #define I3C_INTENCLR_CORE_Disabled (0x0UL)
  #define I3C_INTENCLR_CORE_Enabled (0x1UL)

/* DMA @Bit 1 : Write '1' to disable interrupt for event DMA */
  #define I3C_INTENCLR_DMA_Pos (1UL)
  #define I3C_INTENCLR_DMA_Msk (0x1UL << I3C_INTENCLR_DMA_Pos)
  #define I3C_INTENCLR_DMA_Min (0x0UL)
  #define I3C_INTENCLR_DMA_Max (0x1UL)
  #define I3C_INTENCLR_DMA_Clear (0x1UL)
  #define I3C_INTENCLR_DMA_Disabled (0x0UL)
  #define I3C_INTENCLR_DMA_Enabled (0x1UL)


/* I3C_INTPEND: Pending interrupts */
  #define I3C_INTPEND_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define I3C_INTPEND_CORE_Pos (0UL)
  #define I3C_INTPEND_CORE_Msk (0x1UL << I3C_INTPEND_CORE_Pos)
  #define I3C_INTPEND_CORE_Min (0x0UL)
  #define I3C_INTPEND_CORE_Max (0x1UL)
  #define I3C_INTPEND_CORE_NotPending (0x0UL)
  #define I3C_INTPEND_CORE_Pending (0x1UL)

/* DMA @Bit 1 : Read pending status of interrupt for event DMA */
  #define I3C_INTPEND_DMA_Pos (1UL)
  #define I3C_INTPEND_DMA_Msk (0x1UL << I3C_INTPEND_DMA_Pos)
  #define I3C_INTPEND_DMA_Min (0x0UL)
  #define I3C_INTPEND_DMA_Max (0x1UL)
  #define I3C_INTPEND_DMA_NotPending (0x0UL)
  #define I3C_INTPEND_DMA_Pending (0x1UL)


/* I3C_ENABLE: Enable I3C peripheral. */
  #define I3C_ENABLE_ResetValue (0x00000000UL)

/* EN @Bit 0 : Enable */
  #define I3C_ENABLE_EN_Pos (0UL)
  #define I3C_ENABLE_EN_Msk (0x1UL << I3C_ENABLE_EN_Pos)
  #define I3C_ENABLE_EN_Min (0x0UL)
  #define I3C_ENABLE_EN_Max (0x1UL)
  #define I3C_ENABLE_EN_Disabled (0x0UL)
  #define I3C_ENABLE_EN_Enabled (0x1UL)


/* I3C_SLAVEIF0: I3C slave interface 0 */
  #define I3C_SLAVEIF0_ResetValue (0x00000000UL)

/* MODEI2C @Bit 0 : I2C or I3C mode select signal */
  #define I3C_SLAVEIF0_MODEI2C_Pos (0UL)
  #define I3C_SLAVEIF0_MODEI2C_Msk (0x1UL << I3C_SLAVEIF0_MODEI2C_Pos)
  #define I3C_SLAVEIF0_MODEI2C_Min (0x0UL)
  #define I3C_SLAVEIF0_MODEI2C_Max (0x1UL)
  #define I3C_SLAVEIF0_MODEI2C_DISABLED (0x0UL)
  #define I3C_SLAVEIF0_MODEI2C_ENABLED (0x1UL)

/* ACTMODE @Bits 1..2 : Slave activity mode for GETSTATUS CCC */
  #define I3C_SLAVEIF0_ACTMODE_Pos (1UL)
  #define I3C_SLAVEIF0_ACTMODE_Msk (0x3UL << I3C_SLAVEIF0_ACTMODE_Pos)

/* PENDINGINT @Bits 3..6 : Pending interrupt information for GETSTATUS CCC */
  #define I3C_SLAVEIF0_PENDINGINT_Pos (3UL)
  #define I3C_SLAVEIF0_PENDINGINT_Msk (0xFUL << I3C_SLAVEIF0_PENDINGINT_Pos)

/* STATICADDREN @Bit 7 : Slave static address valid */
  #define I3C_SLAVEIF0_STATICADDREN_Pos (7UL)
  #define I3C_SLAVEIF0_STATICADDREN_Msk (0x1UL << I3C_SLAVEIF0_STATICADDREN_Pos)
  #define I3C_SLAVEIF0_STATICADDREN_Min (0x0UL)
  #define I3C_SLAVEIF0_STATICADDREN_Max (0x1UL)
  #define I3C_SLAVEIF0_STATICADDREN_DISABLED (0x0UL)
  #define I3C_SLAVEIF0_STATICADDREN_ENABLED (0x1UL)

/* STATICADDR @Bits 8..14 : Slave static address */
  #define I3C_SLAVEIF0_STATICADDR_Pos (8UL)
  #define I3C_SLAVEIF0_STATICADDR_Msk (0x7FUL << I3C_SLAVEIF0_STATICADDR_Pos)

/* SLAVEMAXRDSPEED @Bits 15..17 : Slave maximum read data rate */
  #define I3C_SLAVEIF0_SLAVEMAXRDSPEED_Pos (15UL)
  #define I3C_SLAVEIF0_SLAVEMAXRDSPEED_Msk (0x7UL << I3C_SLAVEIF0_SLAVEMAXRDSPEED_Pos)

/* SLAVEMAXWRSPEED @Bits 18..20 : Slave maximum write write rate */
  #define I3C_SLAVEIF0_SLAVEMAXWRSPEED_Pos (18UL)
  #define I3C_SLAVEIF0_SLAVEMAXWRSPEED_Msk (0x7UL << I3C_SLAVEIF0_SLAVEMAXWRSPEED_Pos)

/* SLAVECLKDATATURNTIME @Bits 21..23 : Slave maximum clock data turnaround time */
  #define I3C_SLAVEIF0_SLAVECLKDATATURNTIME_Pos (21UL)
  #define I3C_SLAVEIF0_SLAVECLKDATATURNTIME_Msk (0x7UL << I3C_SLAVEIF0_SLAVECLKDATATURNTIME_Pos) /*!< Bit mask of
                                                                            SLAVECLKDATATURNTIME field.*/

/* SLAVEDCR @Bits 24..31 : Device Characteristic Register value */
  #define I3C_SLAVEIF0_SLAVEDCR_Pos (24UL)
  #define I3C_SLAVEIF0_SLAVEDCR_Msk (0xFFUL << I3C_SLAVEIF0_SLAVEDCR_Pos)


/* I3C_SLAVEIF1: I3C slave interface 1 */
  #define I3C_SLAVEIF1_ResetValue (0x00000000UL)

/* WAKEUP @Bit 0 : Slave wakeup signal */
  #define I3C_SLAVEIF1_WAKEUP_Pos (0UL)
  #define I3C_SLAVEIF1_WAKEUP_Msk (0x1UL << I3C_SLAVEIF1_WAKEUP_Pos)
  #define I3C_SLAVEIF1_WAKEUP_Min (0x0UL)
  #define I3C_SLAVEIF1_WAKEUP_Max (0x1UL)
  #define I3C_SLAVEIF1_WAKEUP_DISABLED (0x0UL)
  #define I3C_SLAVEIF1_WAKEUP_ENABLED (0x1UL)


/* I3C_SLAVEPID0: Slave Device Provisioned ID 0 */
  #define I3C_SLAVEPID0_ResetValue (0x00000000UL)

/* ADDMEANING @Bits 0..11 : Additional Meaning */
  #define I3C_SLAVEPID0_ADDMEANING_Pos (0UL)
  #define I3C_SLAVEPID0_ADDMEANING_Msk (0xFFFUL << I3C_SLAVEPID0_ADDMEANING_Pos)

/* INSTANCEID @Bits 12..15 : Instance ID */
  #define I3C_SLAVEPID0_INSTANCEID_Pos (12UL)
  #define I3C_SLAVEPID0_INSTANCEID_Msk (0xFUL << I3C_SLAVEPID0_INSTANCEID_Pos)

/* PARTID @Bits 16..31 : Part ID */
  #define I3C_SLAVEPID0_PARTID_Pos (16UL)
  #define I3C_SLAVEPID0_PARTID_Msk (0xFFFFUL << I3C_SLAVEPID0_PARTID_Pos)


