pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3C_SLAVEPID1: Slave Device Provisioned ID 1 */
  #define I3C_SLAVEPID1_ResetValue (0x00000000UL)

/* PROVID @Bit 0 : Provisional ID Type Selector */
  #define I3C_SLAVEPID1_PROVID_Pos (0UL)
  #define I3C_SLAVEPID1_PROVID_Msk (0x1UL << I3C_SLAVEPID1_PROVID_Pos)

/* MIPIMID @Bits 1..15 : MIPI Manufacturer ID */
  #define I3C_SLAVEPID1_MIPIMID_Pos (1UL)
  #define I3C_SLAVEPID1_MIPIMID_Msk (0x7FFFUL << I3C_SLAVEPID1_MIPIMID_Pos)


/* I3C_KEEPSDA: Enable or disable the SDA high-keeper used for Master-to-Slave and Slave-to-Master bus hand-off. */
  #define I3C_KEEPSDA_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable or disable the SDA high-keeper */
  #define I3C_KEEPSDA_ENABLE_Pos (0UL)
  #define I3C_KEEPSDA_ENABLE_Msk (0x1UL << I3C_KEEPSDA_ENABLE_Pos)
  #define I3C_KEEPSDA_ENABLE_Min (0x0UL)
  #define I3C_KEEPSDA_ENABLE_Max (0x1UL)
  #define I3C_KEEPSDA_ENABLE_Disabled (0x0UL)
  #define I3C_KEEPSDA_ENABLE_Enabled (0x1UL)


/* I3C_KEEPSCL: Enable or disable the SCL high-keeper used for Master-to-Slave and Slave-to-Master bus hand-off. */
  #define I3C_KEEPSCL_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable or disable the SCL high-keeper */
  #define I3C_KEEPSCL_ENABLE_Pos (0UL)
  #define I3C_KEEPSCL_ENABLE_Msk (0x1UL << I3C_KEEPSCL_ENABLE_Pos)
  #define I3C_KEEPSCL_ENABLE_Min (0x0UL)
  #define I3C_KEEPSCL_ENABLE_Max (0x1UL)
  #define I3C_KEEPSCL_ENABLE_Disabled (0x0UL)
  #define I3C_KEEPSCL_ENABLE_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          I3CCORE                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================ Struct I3CCORE_CORE_DEVCHARTABLE ============================================= */
/**
  * @brief DEVCHARTABLE [I3CCORE_CORE_DEVCHARTABLE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LOC1;
  __IOM uint32_t  LOC2;
  __IOM uint32_t  LOC3;
  __IOM uint32_t  LOC4;
} NRF_I3CCORE_CORE_DEVCHARTABLE_Type;
  #define I3CCORE_CORE_DEVCHARTABLE_MaxCount (10UL)
  #define I3CCORE_CORE_DEVCHARTABLE_MaxIndex (9UL)
  #define I3CCORE_CORE_DEVCHARTABLE_MinIndex (0UL)

/* I3CCORE_CORE_DEVCHARTABLE_LOC1: Device Characteristic Table Location-1 of Device [n] */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC1_ResetValue (0x00000000UL)

/* LSBPROVISIONALID @Bits 0..31 : The LSB 32-bit value of Provisional-ID */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC1_LSBPROVISIONALID_Pos (0UL)
  #define I3CCORE_CORE_DEVCHARTABLE_LOC1_LSBPROVISIONALID_Msk (0xFFFFFFFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC1_LSBPROVISIONALID_Pos)
                                                                            /*!< Bit mask of LSBPROVISIONALID field.*/


/* I3CCORE_CORE_DEVCHARTABLE_LOC2: Device Characteristic Table Location-2 of Device [n] */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC2_ResetValue (0x00000000UL)

/* MSBPROVISIONALID @Bits 0..15 : The MSB 16-bit value of Provisional-ID */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC2_MSBPROVISIONALID_Pos (0UL)
  #define I3CCORE_CORE_DEVCHARTABLE_LOC2_MSBPROVISIONALID_Msk (0xFFFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC2_MSBPROVISIONALID_Pos)
                                                                            /*!< Bit mask of MSBPROVISIONALID field.*/


/* I3CCORE_CORE_DEVCHARTABLE_LOC3: Device Characteristic Table Location-3 of Device [n] */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_ResetValue (0x00000000UL)

/* DCR @Bits 0..7 : Device Characteristic Value */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_DCR_Pos (0UL)
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_DCR_Msk (0xFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC3_DCR_Pos)

/* BCR @Bits 8..15 : Bus Characteristic Value */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_BCR_Pos (8UL)
  #define I3CCORE_CORE_DEVCHARTABLE_LOC3_BCR_Msk (0xFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC3_BCR_Pos)


/* I3CCORE_CORE_DEVCHARTABLE_LOC4: Device Characteristic Table Location-4 of Device [n] */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC4_ResetValue (0x00000000UL)

/* DEVDYNAMICADDR @Bits 0..7 : Device Dynamic Address assigned. */
  #define I3CCORE_CORE_DEVCHARTABLE_LOC4_DEVDYNAMICADDR_Pos (0UL)
  #define I3CCORE_CORE_DEVCHARTABLE_LOC4_DEVDYNAMICADDR_Msk (0xFFUL << I3CCORE_CORE_DEVCHARTABLE_LOC4_DEVDYNAMICADDR_Pos) /*!<
                                                                            Bit mask of DEVDYNAMICADDR field.*/



/* =================================================== Struct I3CCORE_CORE =================================================== */
/**
  * @brief CORE [I3CCORE_CORE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DEVICECTRL;
  __IOM uint32_t  DEVICEADDR;                        /*!< (@ 0x00000004) In the master mode of operation this Register is used
                                                                         to program the Device Dynamic Addresses and its
                                                                         respective valid bit.*/
  __IOM uint32_t  HWCAPABILITY;
  __IOM uint32_t  COMMANDQUEUEPORT;
  __IOM uint32_t  RESPONSEQUEUEPORT;
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t RXDATAPORT;
    __IOM uint32_t TXDATAPORT;
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t IBIQUEUEDATA;
    __IOM uint32_t IBIQUEUESTATUS;
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IOM uint32_t  QUEUETHLDCTRL;
  __IOM uint32_t  DATABUFFERTHLDCTRL;
  __IOM uint32_t  IBIQUEUECTRL;                      /*!< (@ 0x00000024) This Register is used to control whether or not to
                                                                         intimate the application if an IBI request is rejected
                                                                         (Nacked).*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  IBIMRREQREJECT;
  __IOM uint32_t  IBISIRREQREJECT;
  __IOM uint32_t  RESETCTRL;                         /*!< (@ 0x00000034) This Register is used for general software reset and
                                                                         for individual buffer reset.*/
  __IOM uint32_t  SLVEVENTSTATUS;                    /*!< (@ 0x00000038) This register indicates the status/values of some
                                                                         events/controls that are relavant to slave mode of
                                                                         operation.*/
  __IOM uint32_t  INTRSTATUS;
  __IOM uint32_t  INTRSTATUSEN;
  __IOM uint32_t  INTRSIGNALEN;
  __IOM uint32_t  INTRFORCE;
  __IOM uint32_t  QUEUESTATUSLEVEL;
  __IOM uint32_t  DATABUFFERSTATUSLEVEL;
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM uint32_t PRESENTSTATEM;                    /*!< (@ 0x00000054) The user can get status of the DWC_mipi_i3c Controller
                                                                         from this 32-bit read only register (Master).*/
    __IOM uint32_t PRESENTSTATES;                    /*!< (@ 0x00000054) The user can get status of the DWC_mipi_i3c Controller
                                                                         from this 32-bit read only register (Slave).*/
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IOM uint32_t  CCCDEVICESTATUS;
  __IOM uint32_t  DEVICEADDRTABLEPOINTER;
  __IOM uint32_t  DEVCHARTABLEPOINTER;
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  VENDORSPECIFICREGPOINTER;
  __IOM uint32_t  SLVMIPIIDVALUE;
  __IOM uint32_t  SLVPIDVALUE;
  __IOM uint32_t  SLVCHARCTRL;
  __IOM uint32_t  SLVMAXLEN;
  __IOM uint32_t  MAXREADTURNAROUND;
  __IOM uint32_t  MAXDATASPEED;                      /*!< (@ 0x00000084) The values in this register are returned by the slave
                                                                         as GETACCMST CCC data.*/
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  SLVINTRREQ;
  __IOM uint32_t  SLVTSXSYMBLTIMING;
  __IM  uint32_t  RESERVED3[7];
  __IOM uint32_t  DEVICECTRLEXTENDED;
  __IOM uint32_t  SCLI3CODTIMING;
  __IOM uint32_t  SCLI3CPPTIMING;
  __IOM uint32_t  SCLI2CFMTIMING;
  __IOM uint32_t  SCLI2CFMPTIMING;
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SCLEXTLCNTTIMING;
  __IOM uint32_t  SCLEXTTERMNLCNTTIMING;
  __IOM uint32_t  SDAHOLDSWITCHDLYTIMING;
  __IOM uint32_t  BUSFREEAVAILTIMING;
  __IOM uint32_t  BUSIDLETIMING;
  __IOM uint32_t  SCLLOWMSTEXTTIMEOUT;               /*!< (@ 0x000000DC) The SCL Low Master Extended Timeout register is used to
                                                                         define the duration of the SCL Low Bus Reset Pattern.*/
  __IOM uint32_t  I3CVERID;                          /*!< (@ 0x000000E0) This register reflects the current release number of
                                                                         DWC_mipi_i3c*/
  __IOM uint32_t  I3CVERTYPE;                        /*!< (@ 0x000000E4) This register reflects the current release type of
                                                                         DWC_mipi_i3c.*/
  __IOM uint32_t  QUEUESIZECAPABILITY;               /*!< (@ 0x000000E8) This register reflects the configured size of the Data
                                                                         Buffer and Queues in DWC_mipi_i3c.*/
  __IM  uint32_t  RESERVED5[69];
  #if defined(_GNUC_)
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
  #endif
  union {
    __IOM NRF_I3CCORE_CORE_DEVCHARTABLE_Type DEVCHARTABLE[10];
    __IOM uint32_t SECDEVCHARTABLE[32];              /*!< (@ 0x00000200) Secondary Master Device Characteristic Table Location
                                                                         of Device [n]*/
    __IM uint32_t RESERVED6[40];
  };
  #if defined(_GNUC_)
    #pragma GCC diagnostic pop
  #endif
  __IM  uint32_t  RESERVED7[8];
  __IOM uint32_t  DEVADDRTABLELOC[10];
} NRF_I3CCORE_CORE_Type;

