pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3CCORE_CORE_DEVICECTRL: DWC_mipi_i3c control Register */
  #define I3CCORE_CORE_DEVICECTRL_ResetValue (0x00000000UL)

/* IBAINCLUDE @Bit 0 : I3C Broadcast Address include */
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Pos (0UL)
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Pos) /*!< Bit mask of IBAINCLUDE
                                                                            field.*/
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Min (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_Max (0x1UL)
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_NOT_INCLUDED (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_IBAINCLUDE_INCLUDED (0x1UL)

/* I2CSLAVEPRESENT @Bit 7 : I2C Slave Present */
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Pos (7UL)
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Pos) /*!< Bit mask of
                                                                            I2CSLAVEPRESENT field.*/
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Min (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_Max (0x1UL)
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_DISABLED (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_I2CSLAVEPRESENT_ENABLED (0x1UL)

/* HOTJOINCTRL @Bit 8 : Hot-Join ACK/NACK Control */
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Pos (8UL)
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Pos) /*!< Bit mask of
                                                                            HOTJOINCTRL field.*/
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Min (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_Max (0x1UL)
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_DISABLED (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_HOTJOINCTRL_ENABLED (0x1UL)

/* IDLECNTMULTPLIER @Bits 24..25 : Idle Count Multiplier */
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Pos (24UL)
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Msk (0x3UL << I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Pos) /*!< Bit mask of
                                                                            IDLECNTMULTPLIER field.*/
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Min (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_Max (0x3UL)
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_MultiplyBy1 (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_MultiplyBy2 (0x1UL)
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_MultiplyBy4 (0x2UL)
  #define I3CCORE_CORE_DEVICECTRL_IDLECNTMULTPLIER_MultiplyBy8 (0x3UL)

/* ADAPTIVEI2CI3C @Bit 27 : This field is used in Slave mode of operation. */
  #define I3CCORE_CORE_DEVICECTRL_ADAPTIVEI2CI3C_Pos (27UL)
  #define I3CCORE_CORE_DEVICECTRL_ADAPTIVEI2CI3C_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_ADAPTIVEI2CI3C_Pos) /*!< Bit mask of
                                                                            ADAPTIVEI2CI3C field.*/

/* DMAENABLE @Bit 28 : DMA Handshake Interface Enable */
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_Pos (28UL)
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_DMAENABLE_Pos) /*!< Bit mask of DMAENABLE
                                                                            field.*/
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_Min (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_Max (0x1UL)
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_DISABLE (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_DMAENABLE_ENABLE (0x1UL) /*!< Enables the DMA handshake control to interact with external
                                                                DMA.*/

/* ABORT @Bit 29 : DWC_mipi_i3c Abort */
  #define I3CCORE_CORE_DEVICECTRL_ABORT_Pos (29UL)
  #define I3CCORE_CORE_DEVICECTRL_ABORT_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_ABORT_Pos)

/* RESUME @Bit 30 : DWC_mipi_i3c Resume */
  #define I3CCORE_CORE_DEVICECTRL_RESUME_Pos (30UL)
  #define I3CCORE_CORE_DEVICECTRL_RESUME_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_RESUME_Pos)

/* ENABLE @Bit 31 : Controls whether or not DWC_mipi_i3c is enabled. */
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_Pos (31UL)
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_Msk (0x1UL << I3CCORE_CORE_DEVICECTRL_ENABLE_Pos)
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_Min (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_Max (0x1UL)
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_DISABLE (0x0UL)
  #define I3CCORE_CORE_DEVICECTRL_ENABLE_ENABLE (0x1UL)


/* I3CCORE_CORE_DEVICEADDR: In the master mode of operation this Register is used to program the Device Dynamic Addresses and
                             its respective valid bit. */

  #define I3CCORE_CORE_DEVICEADDR_ResetValue (0x80000000UL)

/* STATICADDR @Bits 0..6 : Device Static Address. */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDR_Pos (0UL)
  #define I3CCORE_CORE_DEVICEADDR_STATICADDR_Msk (0x7FUL << I3CCORE_CORE_DEVICEADDR_STATICADDR_Pos) /*!< Bit mask of STATICADDR
                                                                            field.*/

/* STATICADDRVALID @Bit 15 : Static Address Valid. */
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Pos (15UL)
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Msk (0x1UL << I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Pos) /*!< Bit mask of
                                                                            STATICADDRVALID field.*/
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Min (0x0UL)
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_Max (0x1UL)
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_INVALID (0x0UL)
  #define I3CCORE_CORE_DEVICEADDR_STATICADDRVALID_VALID (0x1UL)

/* DYNAMICADDR @Bits 16..22 : Device Dynamic Address. */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDR_Pos (16UL)
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDR_Msk (0x7FUL << I3CCORE_CORE_DEVICEADDR_DYNAMICADDR_Pos) /*!< Bit mask of
                                                                            DYNAMICADDR field.*/

/* DYNAMICADDRVALID @Bit 31 : Dynamic Address Valid */
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Pos (31UL)
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Msk (0x1UL << I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Pos) /*!< Bit mask of
                                                                            DYNAMICADDRVALID field.*/
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Min (0x0UL)
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_Max (0x1UL)
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_INVALID (0x0UL)
  #define I3CCORE_CORE_DEVICEADDR_DYNAMICADDRVALID_VALID (0x1UL)


