pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3CCORE_CORE_HWCAPABILITY: Hardware Capability register */
  #define I3CCORE_CORE_HWCAPABILITY_ResetValue (0x000E187BUL)

/* DEVICEROLECONFIG @Bits 0..2 : Reflects the IC_DEVICE_ROLE Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Pos (0UL)
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Msk (0x7UL << I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Pos) /*!< Bit mask
                                                                            of DEVICEROLECONFIG field.*/
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Min (0x1UL)
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_Max (0x4UL)
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_MASTER (0x1UL)
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_PMASTERSLAVE (0x2UL)
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_SECONDARYMASTER (0x3UL)
  #define I3CCORE_CORE_HWCAPABILITY_DEVICEROLECONFIG_SLAVE (0x4UL)

/* HDRDDREN @Bit 3 : Reflects the IC_SPEED_HDR_DDR Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Pos (3UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Pos) /*!< Bit mask of HDRDDREN
                                                                            field.*/
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Min (0x0UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_Max (0x1UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_NOTSUPPORTED (0x0UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRDDREN_SUPPORTED (0x1UL)

/* HDRTSEN @Bit 4 : Reflects the IC_SPEED_HDR_TS Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Pos (4UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Pos) /*!< Bit mask of HDRTSEN
                                                                            field.*/
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Min (0x0UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_Max (0x1UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_NOTSUPPORTED (0x0UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRTSEN_SUPPORTED (0x1UL)

/* CLOCKPERIOD @Bits 5..10 : Reflects the IC_CLK_PERIOD Configurable Parameter */
  #define I3CCORE_CORE_HWCAPABILITY_CLOCKPERIOD_Pos (5UL)
  #define I3CCORE_CORE_HWCAPABILITY_CLOCKPERIOD_Msk (0x3FUL << I3CCORE_CORE_HWCAPABILITY_CLOCKPERIOD_Pos) /*!< Bit mask of
                                                                            CLOCKPERIOD field.*/

/* HDRTXCLOCKPERIOD @Bits 11..16 : Reflects the IC_HDR_TX_CLK_PERIOD Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_HDRTXCLOCKPERIOD_Pos (11UL)
  #define I3CCORE_CORE_HWCAPABILITY_HDRTXCLOCKPERIOD_Msk (0x3FUL << I3CCORE_CORE_HWCAPABILITY_HDRTXCLOCKPERIOD_Pos) /*!< Bit
                                                                            mask of HDRTXCLOCKPERIOD field.*/

/* DMAEN @Bit 17 : Reflects the IC_HAS_DMA Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_DMAEN_Pos (17UL)
  #define I3CCORE_CORE_HWCAPABILITY_DMAEN_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_DMAEN_Pos)

/* SLVHJCAP @Bit 18 : Reflects the IC_SLV_HJ Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_SLVHJCAP_Pos (18UL)
  #define I3CCORE_CORE_HWCAPABILITY_SLVHJCAP_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_SLVHJCAP_Pos) /*!< Bit mask of SLVHJCAP
                                                                            field.*/

/* SLVIBICAP @Bit 19 : Reflects the IC_SLV_IBI Configurable Parameter. */
  #define I3CCORE_CORE_HWCAPABILITY_SLVIBICAP_Pos (19UL)
  #define I3CCORE_CORE_HWCAPABILITY_SLVIBICAP_Msk (0x1UL << I3CCORE_CORE_HWCAPABILITY_SLVIBICAP_Pos) /*!< Bit mask of SLVIBICAP
                                                                            field.*/


/* I3CCORE_CORE_COMMANDQUEUEPORT: Command Queue Port. */
  #define I3CCORE_CORE_COMMANDQUEUEPORT_ResetValue (0x00000000UL)

/* COMMAND @Bits 0..31 : 32 bit command */
  #define I3CCORE_CORE_COMMANDQUEUEPORT_COMMAND_Pos (0UL)
  #define I3CCORE_CORE_COMMANDQUEUEPORT_COMMAND_Msk (0xFFFFFFFFUL << I3CCORE_CORE_COMMANDQUEUEPORT_COMMAND_Pos) /*!< Bit mask of
                                                                            COMMAND field.*/


/* I3CCORE_CORE_RESPONSEQUEUEPORT: Response Queue Port */
  #define I3CCORE_CORE_RESPONSEQUEUEPORT_ResetValue (0x00000000UL)

/* RESPONSE @Bits 0..31 : 32 bit Response */
  #define I3CCORE_CORE_RESPONSEQUEUEPORT_RESPONSE_Pos (0UL)
  #define I3CCORE_CORE_RESPONSEQUEUEPORT_RESPONSE_Msk (0xFFFFFFFFUL << I3CCORE_CORE_RESPONSEQUEUEPORT_RESPONSE_Pos) /*!< Bit
                                                                            mask of RESPONSE field.*/


/* I3CCORE_CORE_RXDATAPORT: Receive Data Port Register */
  #define I3CCORE_CORE_RXDATAPORT_ResetValue (0x00000000UL)

/* RXDATAPORT @Bits 0..31 : Receive Data Port. */
  #define I3CCORE_CORE_RXDATAPORT_RXDATAPORT_Pos (0UL)
  #define I3CCORE_CORE_RXDATAPORT_RXDATAPORT_Msk (0xFFFFFFFFUL << I3CCORE_CORE_RXDATAPORT_RXDATAPORT_Pos) /*!< Bit mask of
                                                                            RXDATAPORT field.*/


/* I3CCORE_CORE_TXDATAPORT: Transmit Data Port Register */
  #define I3CCORE_CORE_TXDATAPORT_ResetValue (0x00000000UL)

/* TXDATAPORT @Bits 0..31 : Transmit Data Port */
  #define I3CCORE_CORE_TXDATAPORT_TXDATAPORT_Pos (0UL)
  #define I3CCORE_CORE_TXDATAPORT_TXDATAPORT_Msk (0xFFFFFFFFUL << I3CCORE_CORE_TXDATAPORT_TXDATAPORT_Pos) /*!< Bit mask of
                                                                            TXDATAPORT field.*/


/* I3CCORE_CORE_IBIQUEUEDATA: In-Band Interrupt Queue Data Register */
  #define I3CCORE_CORE_IBIQUEUEDATA_ResetValue (0x00000000UL)

/* IBIDATA @Bits 0..31 : In-Band Interrupt Data */
  #define I3CCORE_CORE_IBIQUEUEDATA_IBIDATA_Pos (0UL)
  #define I3CCORE_CORE_IBIQUEUEDATA_IBIDATA_Msk (0xFFFFFFFFUL << I3CCORE_CORE_IBIQUEUEDATA_IBIDATA_Pos) /*!< Bit mask of IBIDATA
                                                                            field.*/


