pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3CCORE_CORE_IBIQUEUESTATUS: In-Band Interrupt Queue Status Register */
  #define I3CCORE_CORE_IBIQUEUESTATUS_ResetValue (0x00000000UL)

/* DATALENGTH @Bits 0..7 : In-Band Interrupt data length. */
  #define I3CCORE_CORE_IBIQUEUESTATUS_DATALENGTH_Pos (0UL)
  #define I3CCORE_CORE_IBIQUEUESTATUS_DATALENGTH_Msk (0xFFUL << I3CCORE_CORE_IBIQUEUESTATUS_DATALENGTH_Pos) /*!< Bit mask of
                                                                            DATALENGTH field.*/

/* IBIID @Bits 8..15 : IBI Identifier. */
  #define I3CCORE_CORE_IBIQUEUESTATUS_IBIID_Pos (8UL)
  #define I3CCORE_CORE_IBIQUEUESTATUS_IBIID_Msk (0xFFUL << I3CCORE_CORE_IBIQUEUESTATUS_IBIID_Pos)

/* IBIACK @Bit 31 : The acknowledge bit of the IBI Received Status (IBISTS) bitfield. */
  #define I3CCORE_CORE_IBIQUEUESTATUS_IBIACK_Pos (31UL)
  #define I3CCORE_CORE_IBIQUEUESTATUS_IBIACK_Msk (0x1UL << I3CCORE_CORE_IBIQUEUESTATUS_IBIACK_Pos) /*!< Bit mask of IBIACK
                                                                            field.*/
  #define I3CCORE_CORE_IBIQUEUESTATUS_IBIACK_Min (0x0UL)
  #define I3CCORE_CORE_IBIQUEUESTATUS_IBIACK_Max (0x1UL)
  #define I3CCORE_CORE_IBIQUEUESTATUS_IBIACK_ACK (0x0UL)
  #define I3CCORE_CORE_IBIQUEUESTATUS_IBIACK_NACK (0x1UL)


/* I3CCORE_CORE_QUEUETHLDCTRL: Queue Threshold Control Register */
  #define I3CCORE_CORE_QUEUETHLDCTRL_ResetValue (0x01000101UL)

/* CMDEMPTYBUFTHLD @Bits 0..7 : Command Buffer Empty Threshold Value. */
  #define I3CCORE_CORE_QUEUETHLDCTRL_CMDEMPTYBUFTHLD_Pos (0UL)
  #define I3CCORE_CORE_QUEUETHLDCTRL_CMDEMPTYBUFTHLD_Msk (0xFFUL << I3CCORE_CORE_QUEUETHLDCTRL_CMDEMPTYBUFTHLD_Pos) /*!< Bit
                                                                            mask of CMDEMPTYBUFTHLD field.*/

/* RESPBUFTHLD @Bits 8..15 : Response Buffer Threshold Value. */
  #define I3CCORE_CORE_QUEUETHLDCTRL_RESPBUFTHLD_Pos (8UL)
  #define I3CCORE_CORE_QUEUETHLDCTRL_RESPBUFTHLD_Msk (0xFFUL << I3CCORE_CORE_QUEUETHLDCTRL_RESPBUFTHLD_Pos) /*!< Bit mask of
                                                                            RESPBUFTHLD field.*/

/* IBISTATUSTHLD @Bits 24..31 : In-Band Interrupt Status Threshold Value. */
  #define I3CCORE_CORE_QUEUETHLDCTRL_IBISTATUSTHLD_Pos (24UL)
  #define I3CCORE_CORE_QUEUETHLDCTRL_IBISTATUSTHLD_Msk (0xFFUL << I3CCORE_CORE_QUEUETHLDCTRL_IBISTATUSTHLD_Pos) /*!< Bit mask of
                                                                            IBISTATUSTHLD field.*/


/* I3CCORE_CORE_DATABUFFERTHLDCTRL: Data Buffer Threshold Control Register */
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_ResetValue (0x01010101UL)

/* TXEMPTYBUFTHLD @Bits 0..2 : Transmit Buffer Threshold Value */
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_Pos (0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_Msk (0x7UL << I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_Pos) /*!<
                                                                            Bit mask of TXEMPTYBUFTHLD field.*/
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_Min (0x0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_Max (0x5UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_THRESHOLD1 (0x0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_THRESHOLD14 (0x1UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_THRESHOLD18 (0x2UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_THRESHOLD116 (0x3UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_THRESHOLD132 (0x4UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXEMPTYBUFTHLD_THRESHOLD164 (0x5UL)

/* RXBUFTHLD @Bits 8..10 : Receive Buffer Threshold Value */
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_Pos (8UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_Msk (0x7UL << I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_Pos) /*!< Bit mask
                                                                            of RXBUFTHLD field.*/
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_Min (0x0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_Max (0x5UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_THRESHOLD1 (0x0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_THRESHOLD4 (0x1UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_THRESHOLD8 (0x2UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_THRESHOLD16 (0x3UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_THRESHOLD32 (0x4UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXBUFTHLD_THRESHOLD64 (0x5UL)

/* TXSTARTTHLD @Bits 16..18 : Transfer Start Threshold Value */
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_Pos (16UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_Msk (0x7UL << I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_Pos) /*!< Bit
                                                                            mask of TXSTARTTHLD field.*/
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_Min (0x0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_Max (0x5UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_THRESHOLD1 (0x0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_THRESHOLD4 (0x1UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_THRESHOLD8 (0x2UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_THRESHOLD16 (0x3UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_THRESHOLD32 (0x4UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_TXSTARTTHLD_THRESHOLD64 (0x5UL)

/* RXSTARTTHLD @Bits 24..26 : Receive Start Threshold Value */
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_Pos (24UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_Msk (0x7UL << I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_Pos) /*!< Bit
                                                                            mask of RXSTARTTHLD field.*/
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_Min (0x0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_Max (0x5UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_THRESHOLD1 (0x0UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_THRESHOLD4 (0x1UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_THRESHOLD8 (0x2UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_THRESHOLD16 (0x3UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_THRESHOLD32 (0x4UL)
  #define I3CCORE_CORE_DATABUFFERTHLDCTRL_RXSTARTTHLD_THRESHOLD64 (0x5UL)


