pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3CCORE_CORE_IBIQUEUECTRL: This Register is used to control whether or not to intimate the application if an IBI request is
                               rejected (Nacked). */

  #define I3CCORE_CORE_IBIQUEUECTRL_ResetValue (0x00000000UL)

/* NOTIFYHJREJECTED @Bit 0 : Notify Rejected Hot-Join Control. */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Pos (0UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Msk (0x1UL << I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Pos) /*!< Bit mask
                                                                            of NOTIFYHJREJECTED field.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Min (0x0UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_Max (0x1UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_DISABLED (0x0UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYHJREJECTED_ENABLED (0x1UL)

/* NOTIFYMRREJECTED @Bit 1 : Notify Rejected Master Request Control. */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Pos (1UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Msk (0x1UL << I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Pos) /*!< Bit mask
                                                                            of NOTIFYMRREJECTED field.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Min (0x0UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_Max (0x1UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_DISABLED (0x0UL) /*!< Suppress passing the IBI Status to the IBI FIFO
                                                                           (hence not notifying the application) when a MR
                                                                           Request is NACKed and auto-disabled based on the
                                                                           IBI_MR_REQ_REJECT Register.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYMRREJECTED_ENABLED (0x1UL) /*!< Writes IBI Status to the IBI FIFO (hence notifying the
                                                                          application) when a MR Request is NACKed and
                                                                          auto-disabled based on the IBI_MR_REQ_REJECT
                                                                          Register.*/

/* NOTIFYSIRREJECTED @Bit 3 : Notify Rejected Slave Interrupt Request Control. */
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Pos (3UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Msk (0x1UL << I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Pos) /*!< Bit
                                                                            mask of NOTIFYSIRREJECTED field.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Min (0x0UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_Max (0x1UL)
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_DISABLED (0x0UL) /*!< Suppress passing the IBI Status to the IBI FIFO
                                                                            (hence not notifying the application) when a Slave
                                                                            Interrupt Request is NACKed and auto-disabled based
                                                                            on the IBI_SIR_REQ_REJECT Register.*/
  #define I3CCORE_CORE_IBIQUEUECTRL_NOTIFYSIRREJECTED_ENABLED (0x1UL) /*!< Writes IBI Status to the IBI FIFO (hence notifying
                                                                           the application) when a Slave Interrupt Request is
                                                                           NACKed and auto-disabled based on the
                                                                           IBI_SIR_REQ_REJECT Register.*/


/* I3CCORE_CORE_IBIMRREQREJECT: IBI Master Request Rejection Control Register. */
  #define I3CCORE_CORE_IBIMRREQREJECT_ResetValue (0x00000000UL)

/* MRREQREJECT @Bits 0..31 : In-band Master Request Reject. */
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Pos (0UL)
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Msk (0xFFFFFFFFUL << I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Pos) /*!< Bit
                                                                            mask of MRREQREJECT field.*/
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Min (0x0UL)
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_Max (0x1UL)
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_ACK (0x00000000UL)
  #define I3CCORE_CORE_IBIMRREQREJECT_MRREQREJECT_NACK (0x00000001UL) /*!< NACK and send Directed DISEC CCC to disable the
                                                                           interrupting slave.*/


/* I3CCORE_CORE_IBISIRREQREJECT: IBI SIR Request Rejection Control */
  #define I3CCORE_CORE_IBISIRREQREJECT_ResetValue (0x00000000UL)

/* SIRREQREJECT @Bits 0..31 : In-band Slave Interrupt Request Reject */
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Pos (0UL)
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Msk (0xFFFFFFFFUL << I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Pos) /*!< Bit
                                                                            mask of SIRREQREJECT field.*/
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Min (0x0UL)
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_Max (0x1UL)
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_ACK (0x00000000UL)
  #define I3CCORE_CORE_IBISIRREQREJECT_SIRREQREJECT_NACK (0x00000001UL)


/* I3CCORE_CORE_RESETCTRL: This Register is used for general software reset and for individual buffer reset. */
  #define I3CCORE_CORE_RESETCTRL_ResetValue (0x00000000UL)

/* SOFTRST @Bit 0 : Core Software Reset. */
  #define I3CCORE_CORE_RESETCTRL_SOFTRST_Pos (0UL)
  #define I3CCORE_CORE_RESETCTRL_SOFTRST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_SOFTRST_Pos)

/* CMDQUEUERST @Bit 1 : Command Queue Software Reset */
  #define I3CCORE_CORE_RESETCTRL_CMDQUEUERST_Pos (1UL)
  #define I3CCORE_CORE_RESETCTRL_CMDQUEUERST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_CMDQUEUERST_Pos) /*!< Bit mask of CMDQUEUERST
                                                                            field.*/

/* RESPQUEUERST @Bit 2 : Response Queue Software Reset */
  #define I3CCORE_CORE_RESETCTRL_RESPQUEUERST_Pos (2UL)
  #define I3CCORE_CORE_RESETCTRL_RESPQUEUERST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_RESPQUEUERST_Pos) /*!< Bit mask of
                                                                            RESPQUEUERST field.*/

/* TXFIFORST @Bit 3 : Transmit Buffer Software Reset */
  #define I3CCORE_CORE_RESETCTRL_TXFIFORST_Pos (3UL)
  #define I3CCORE_CORE_RESETCTRL_TXFIFORST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_TXFIFORST_Pos) /*!< Bit mask of TXFIFORST
                                                                            field.*/

/* RXFIFORST @Bit 4 : Receive Buffer Software Reset. */
  #define I3CCORE_CORE_RESETCTRL_RXFIFORST_Pos (4UL)
  #define I3CCORE_CORE_RESETCTRL_RXFIFORST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_RXFIFORST_Pos) /*!< Bit mask of RXFIFORST
                                                                            field.*/

