pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* IBIQUEUERST @Bit 5 : IBI Queue Software Reset. */
  #define I3CCORE_CORE_RESETCTRL_IBIQUEUERST_Pos (5UL)
  #define I3CCORE_CORE_RESETCTRL_IBIQUEUERST_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_IBIQUEUERST_Pos) /*!< Bit mask of IBIQUEUERST
                                                                            field.*/

/* BUSRESETTYPE @Bits 29..30 : Bus Reset type */
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Pos (29UL)
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Msk (0x3UL << I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Pos) /*!< Bit mask of
                                                                            BUSRESETTYPE field.*/
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Min (0x0UL)
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_Max (0x3UL)
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_EXIT (0x0UL)
  #define I3CCORE_CORE_RESETCTRL_BUSRESETTYPE_SCL_LOW_RESET (0x3UL)

/* BUSRESET @Bit 31 : Bus Reset. */
  #define I3CCORE_CORE_RESETCTRL_BUSRESET_Pos (31UL)
  #define I3CCORE_CORE_RESETCTRL_BUSRESET_Msk (0x1UL << I3CCORE_CORE_RESETCTRL_BUSRESET_Pos)


/* I3CCORE_CORE_SLVEVENTSTATUS: This register indicates the status/values of some events/controls that are relavant to slave
                                 mode of operation. */

  #define I3CCORE_CORE_SLVEVENTSTATUS_ResetValue (0x0000000BUL)

/* SIREN @Bit 0 : Slave Interrupt Request Enable. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_SIREN_Pos (0UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_SIREN_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_SIREN_Pos)

/* MREN @Bit 1 : Master Request Enable. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MREN_Pos (1UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_MREN_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_MREN_Pos)

/* HJEN @Bit 3 : Hot-Join Interrupt Enable */
  #define I3CCORE_CORE_SLVEVENTSTATUS_HJEN_Pos (3UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_HJEN_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_HJEN_Pos)

/* ACTIVITYSTATE @Bits 4..5 : Activity State Status. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Pos (4UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Msk (0x3UL << I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Pos) /*!< Bit mask
                                                                            of ACTIVITYSTATE field.*/
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Min (0x0UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_Max (0x3UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_ENTAS0 (0x0UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_ENTAS1 (0x1UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_ENTAS2 (0x2UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_ACTIVITYSTATE_ENTAS3 (0x3UL)

/* MRLUPDATED @Bit 6 : MRL Updated Status. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MRLUPDATED_Pos (6UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_MRLUPDATED_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_MRLUPDATED_Pos) /*!< Bit mask of
                                                                            MRLUPDATED field.*/

/* MWLUPDATED @Bit 7 : MWL Updated Status. */
  #define I3CCORE_CORE_SLVEVENTSTATUS_MWLUPDATED_Pos (7UL)
  #define I3CCORE_CORE_SLVEVENTSTATUS_MWLUPDATED_Msk (0x1UL << I3CCORE_CORE_SLVEVENTSTATUS_MWLUPDATED_Pos) /*!< Bit mask of
                                                                            MWLUPDATED field.*/


/* I3CCORE_CORE_INTRSTATUS: Interrupt Status Register */
  #define I3CCORE_CORE_INTRSTATUS_ResetValue (0x00000000UL)

/* TXTHLDSTS @Bit 0 : Transmit Buffer Threshold Status */
  #define I3CCORE_CORE_INTRSTATUS_TXTHLDSTS_Pos (0UL)
  #define I3CCORE_CORE_INTRSTATUS_TXTHLDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_TXTHLDSTS_Pos) /*!< Bit mask of TXTHLDSTS
                                                                            field.*/

/* RXTHLDSTS @Bit 1 : Receive Buffer Threshold Status. */
  #define I3CCORE_CORE_INTRSTATUS_RXTHLDSTS_Pos (1UL)
  #define I3CCORE_CORE_INTRSTATUS_RXTHLDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_RXTHLDSTS_Pos) /*!< Bit mask of RXTHLDSTS
                                                                            field.*/

/* IBITHLDSTS @Bit 2 : IBI Buffer Threshold Status. */
  #define I3CCORE_CORE_INTRSTATUS_IBITHLDSTS_Pos (2UL)
  #define I3CCORE_CORE_INTRSTATUS_IBITHLDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_IBITHLDSTS_Pos) /*!< Bit mask of IBITHLDSTS
                                                                            field.*/

/* CMDQUEUEREADYSTS @Bit 3 : Command Queue Ready. */
  #define I3CCORE_CORE_INTRSTATUS_CMDQUEUEREADYSTS_Pos (3UL)
  #define I3CCORE_CORE_INTRSTATUS_CMDQUEUEREADYSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_CMDQUEUEREADYSTS_Pos) /*!< Bit mask of
                                                                            CMDQUEUEREADYSTS field.*/

/* RESPREADYSTS @Bit 4 : Response Queue Ready Status. */
  #define I3CCORE_CORE_INTRSTATUS_RESPREADYSTS_Pos (4UL)
  #define I3CCORE_CORE_INTRSTATUS_RESPREADYSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_RESPREADYSTS_Pos) /*!< Bit mask of
                                                                            RESPREADYSTS field.*/

/* TRANSFERABORTSTS @Bit 5 : Transfer Abort Status. */
  #define I3CCORE_CORE_INTRSTATUS_TRANSFERABORTSTS_Pos (5UL)
  #define I3CCORE_CORE_INTRSTATUS_TRANSFERABORTSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_TRANSFERABORTSTS_Pos) /*!< Bit mask of
                                                                            TRANSFERABORTSTS field.*/

/* CCCUPDATEDSTS @Bit 6 : CCC Table Updated Status. */
  #define I3CCORE_CORE_INTRSTATUS_CCCUPDATEDSTS_Pos (6UL)
  #define I3CCORE_CORE_INTRSTATUS_CCCUPDATEDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_CCCUPDATEDSTS_Pos) /*!< Bit mask of
                                                                            CCCUPDATEDSTS field.*/

/* DYNADDRASSGNSTS @Bit 8 : Dynamic Address Assigned Status. */
  #define I3CCORE_CORE_INTRSTATUS_DYNADDRASSGNSTS_Pos (8UL)
  #define I3CCORE_CORE_INTRSTATUS_DYNADDRASSGNSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_DYNADDRASSGNSTS_Pos) /*!< Bit mask of
                                                                            DYNADDRASSGNSTS field.*/

/* TRANSFERERRSTS @Bit 9 : Transfer Error Status. */
  #define I3CCORE_CORE_INTRSTATUS_TRANSFERERRSTS_Pos (9UL)
  #define I3CCORE_CORE_INTRSTATUS_TRANSFERERRSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_TRANSFERERRSTS_Pos) /*!< Bit mask of
                                                                            TRANSFERERRSTS field.*/

/* DEFSLVSTS @Bit 10 : Define Slave CCC Received Status. */
  #define I3CCORE_CORE_INTRSTATUS_DEFSLVSTS_Pos (10UL)
  #define I3CCORE_CORE_INTRSTATUS_DEFSLVSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_DEFSLVSTS_Pos) /*!< Bit mask of DEFSLVSTS
                                                                            field.*/

