pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* READREQRECVSTS @Bit 11 : Read Request Received. */
  #define I3CCORE_CORE_INTRSTATUS_READREQRECVSTS_Pos (11UL)
  #define I3CCORE_CORE_INTRSTATUS_READREQRECVSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_READREQRECVSTS_Pos) /*!< Bit mask of
                                                                            READREQRECVSTS field.*/

/* IBIUPDATEDSTS @Bit 12 : IBI status is updated. */
  #define I3CCORE_CORE_INTRSTATUS_IBIUPDATEDSTS_Pos (12UL)
  #define I3CCORE_CORE_INTRSTATUS_IBIUPDATEDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_IBIUPDATEDSTS_Pos) /*!< Bit mask of
                                                                            IBIUPDATEDSTS field.*/

/* BUSOWNERUPDATEDSTS @Bit 13 : This interrupt is set when the role of the controller changes from being a Master to Slave or
                                vice versa. */

  #define I3CCORE_CORE_INTRSTATUS_BUSOWNERUPDATEDSTS_Pos (13UL)
  #define I3CCORE_CORE_INTRSTATUS_BUSOWNERUPDATEDSTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_BUSOWNERUPDATEDSTS_Pos) /*!< Bit mask
                                                                            of BUSOWNERUPDATEDSTS field.*/

/* BUSRESETDONESTS @Bit 15 : Bus Reset Pattern Generation Done Status. */
  #define I3CCORE_CORE_INTRSTATUS_BUSRESETDONESTS_Pos (15UL)
  #define I3CCORE_CORE_INTRSTATUS_BUSRESETDONESTS_Msk (0x1UL << I3CCORE_CORE_INTRSTATUS_BUSRESETDONESTS_Pos) /*!< Bit mask of
                                                                            BUSRESETDONESTS field.*/


/* I3CCORE_CORE_INTRSTATUSEN: Interrupt Status Enable Register. */
  #define I3CCORE_CORE_INTRSTATUSEN_ResetValue (0x00000000UL)

/* TXTHLDSTSEN @Bit 0 : Transmit Buffer Threshold Status Enable. */
  #define I3CCORE_CORE_INTRSTATUSEN_TXTHLDSTSEN_Pos (0UL)
  #define I3CCORE_CORE_INTRSTATUSEN_TXTHLDSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_TXTHLDSTSEN_Pos) /*!< Bit mask of
                                                                            TXTHLDSTSEN field.*/

/* RXTHLDSTSEN @Bit 1 : Receive Buffer Threshold Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_RXTHLDSTSEN_Pos (1UL)
  #define I3CCORE_CORE_INTRSTATUSEN_RXTHLDSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_RXTHLDSTSEN_Pos) /*!< Bit mask of
                                                                            RXTHLDSTSEN field.*/

/* IBITHLDSTSEN @Bit 2 : IBI Buffer Threshold Status Enable. */
  #define I3CCORE_CORE_INTRSTATUSEN_IBITHLDSTSEN_Pos (2UL)
  #define I3CCORE_CORE_INTRSTATUSEN_IBITHLDSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_IBITHLDSTSEN_Pos) /*!< Bit mask of
                                                                            IBITHLDSTSEN field.*/

/* CMDQUEUEREADYSTSEN @Bit 3 : Command Queue Ready Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_CMDQUEUEREADYSTSEN_Pos (3UL)
  #define I3CCORE_CORE_INTRSTATUSEN_CMDQUEUEREADYSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_CMDQUEUEREADYSTSEN_Pos) /*!< Bit
                                                                            mask of CMDQUEUEREADYSTSEN field.*/

/* RESPREADYSTSEN @Bit 4 : Response Queue Ready Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_RESPREADYSTSEN_Pos (4UL)
  #define I3CCORE_CORE_INTRSTATUSEN_RESPREADYSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_RESPREADYSTSEN_Pos) /*!< Bit mask of
                                                                            RESPREADYSTSEN field.*/

/* TRANSFERABORTSTSEN @Bit 5 : Transfer Abort Status Enable. */
  #define I3CCORE_CORE_INTRSTATUSEN_TRANSFERABORTSTSEN_Pos (5UL)
  #define I3CCORE_CORE_INTRSTATUSEN_TRANSFERABORTSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_TRANSFERABORTSTSEN_Pos) /*!< Bit
                                                                            mask of TRANSFERABORTSTSEN field.*/

/* CCCUPDATEDSTSEN @Bit 6 : CCC Table Updated Status Enable. */
  #define I3CCORE_CORE_INTRSTATUSEN_CCCUPDATEDSTSEN_Pos (6UL)
  #define I3CCORE_CORE_INTRSTATUSEN_CCCUPDATEDSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_CCCUPDATEDSTSEN_Pos) /*!< Bit mask
                                                                            of CCCUPDATEDSTSEN field.*/

/* DYNADDRASSGNSTSEN @Bit 8 : Dynamic Address Assigned Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_DYNADDRASSGNSTSEN_Pos (8UL)
  #define I3CCORE_CORE_INTRSTATUSEN_DYNADDRASSGNSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_DYNADDRASSGNSTSEN_Pos) /*!< Bit
                                                                            mask of DYNADDRASSGNSTSEN field.*/

/* TRANSFERERRSTSEN @Bit 9 : Transfer Error Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_TRANSFERERRSTSEN_Pos (9UL)
  #define I3CCORE_CORE_INTRSTATUSEN_TRANSFERERRSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_TRANSFERERRSTSEN_Pos) /*!< Bit mask
                                                                            of TRANSFERERRSTSEN field.*/

/* DEFSLVSTSEN @Bit 10 : Define Slave CCC Received Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_DEFSLVSTSEN_Pos (10UL)
  #define I3CCORE_CORE_INTRSTATUSEN_DEFSLVSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_DEFSLVSTSEN_Pos) /*!< Bit mask of
                                                                            DEFSLVSTSEN field.*/

/* READREQRECVSTSEN @Bit 11 : Read Request Received Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_READREQRECVSTSEN_Pos (11UL)
  #define I3CCORE_CORE_INTRSTATUSEN_READREQRECVSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_READREQRECVSTSEN_Pos) /*!< Bit mask
                                                                            of READREQRECVSTSEN field.*/

/* IBIUPDATEDSTSEN @Bit 12 : IBI Updated Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_IBIUPDATEDSTSEN_Pos (12UL)
  #define I3CCORE_CORE_INTRSTATUSEN_IBIUPDATEDSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_IBIUPDATEDSTSEN_Pos) /*!< Bit mask
                                                                            of IBIUPDATEDSTSEN field.*/

/* BUSOWNERUPDATEDSTSEN @Bit 13 : Bus owner Updated Status Enable */
  #define I3CCORE_CORE_INTRSTATUSEN_BUSOWNERUPDATEDSTSEN_Pos (13UL)
  #define I3CCORE_CORE_INTRSTATUSEN_BUSOWNERUPDATEDSTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_BUSOWNERUPDATEDSTSEN_Pos) /*!<
                                                                            Bit mask of BUSOWNERUPDATEDSTSEN field.*/

/* BUSRESETDONESTSEN @Bit 15 : Bus Reset Pattern Generation Done Status Enable. */
  #define I3CCORE_CORE_INTRSTATUSEN_BUSRESETDONESTSEN_Pos (15UL)
  #define I3CCORE_CORE_INTRSTATUSEN_BUSRESETDONESTSEN_Msk (0x1UL << I3CCORE_CORE_INTRSTATUSEN_BUSRESETDONESTSEN_Pos) /*!< Bit
                                                                            mask of BUSRESETDONESTSEN field.*/


/* I3CCORE_CORE_INTRSIGNALEN: Interrupt Signal Enable Register */
  #define I3CCORE_CORE_INTRSIGNALEN_ResetValue (0x00000000UL)

