pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CMTFRSTSTS @Bits 16..21 : Current Master Transfer State Status. */
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Pos (16UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Msk (0x3FUL << I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Pos) /*!< Bit mask of
                                                                            CMTFRSTSTS field.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Min (0x0UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_Max (0x13UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_IDLE (0x00UL) /*!< Controller is Idle state, waiting for commands from
                                                                   application or Slave initated In-band Interrupt.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_START (0x01UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_RESTART (0x02UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_STOP (0x03UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_STARTH (0x04UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_BWADDRGEN (0x05UL) /*!< Broadcast Write Address Header(7h7E,W) Generation
                                                                        State.*/
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_BRADDRGEN (0x06UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_DAA (0x07UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_ADDRGEN (0x08UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_CCCBYTEGEN (0x0BUL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_HDRCMDGEN (0x0CUL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_WTRANSFER (0x0DUL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_RTRANSFER (0x0EUL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_RIBI (0x0FUL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_IBIAUTODISABLE (0x10UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_DDRCRCGEN (0x11UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_CLKEXTEND (0x12UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMTFRSTSTS_HALT (0x13UL)

/* CMDTID @Bits 24..27 : This field reflects the Transaction-ID of the current executing command. */
  #define I3CCORE_CORE_PRESENTSTATEM_CMDTID_Pos (24UL)
  #define I3CCORE_CORE_PRESENTSTATEM_CMDTID_Msk (0xFUL << I3CCORE_CORE_PRESENTSTATEM_CMDTID_Pos)

/* MASTERIDLE @Bit 28 : This field reflects whether the Master Controller is in Idle state or not. */
  #define I3CCORE_CORE_PRESENTSTATEM_MASTERIDLE_Pos (28UL)
  #define I3CCORE_CORE_PRESENTSTATEM_MASTERIDLE_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATEM_MASTERIDLE_Pos) /*!< Bit mask of
                                                                            MASTERIDLE field.*/
  #define I3CCORE_CORE_PRESENTSTATEM_MASTERIDLE_Min (0x0UL)
  #define I3CCORE_CORE_PRESENTSTATEM_MASTERIDLE_Max (0x1UL)
  #define I3CCORE_CORE_PRESENTSTATEM_MASTERIDLE_MST_NOT_IDLE (0x0UL)
  #define I3CCORE_CORE_PRESENTSTATEM_MASTERIDLE_MST_IDLE (0x1UL)


/* I3CCORE_CORE_PRESENTSTATES: The user can get status of the DWC_mipi_i3c Controller from this 32-bit read only register
                                (Slave). */

  #define I3CCORE_CORE_PRESENTSTATES_ResetValue (0x10000003UL)

/* SCLLINESIGNALLEVEL @Bit 0 : This bit is used to check the SCL line level to recover from errors and for debugging. */
  #define I3CCORE_CORE_PRESENTSTATES_SCLLINESIGNALLEVEL_Pos (0UL)
  #define I3CCORE_CORE_PRESENTSTATES_SCLLINESIGNALLEVEL_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATES_SCLLINESIGNALLEVEL_Pos) /*!<
                                                                            Bit mask of SCLLINESIGNALLEVEL field.*/

/* SDALINESIGNALLEVEL @Bit 1 : This bit is used to check the SDA line level to recover from errors and for debugging. */
  #define I3CCORE_CORE_PRESENTSTATES_SDALINESIGNALLEVEL_Pos (1UL)
  #define I3CCORE_CORE_PRESENTSTATES_SDALINESIGNALLEVEL_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATES_SDALINESIGNALLEVEL_Pos) /*!<
                                                                            Bit mask of SDALINESIGNALLEVEL field.*/

/* CURRENTMASTER @Bit 2 : This Bit is used to check whether the Master is Current Master or not. */
  #define I3CCORE_CORE_PRESENTSTATES_CURRENTMASTER_Pos (2UL)
  #define I3CCORE_CORE_PRESENTSTATES_CURRENTMASTER_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATES_CURRENTMASTER_Pos) /*!< Bit mask of
                                                                            CURRENTMASTER field.*/
  #define I3CCORE_CORE_PRESENTSTATES_CURRENTMASTER_Min (0x0UL)
  #define I3CCORE_CORE_PRESENTSTATES_CURRENTMASTER_Max (0x1UL)
  #define I3CCORE_CORE_PRESENTSTATES_CURRENTMASTER_NOT_BUS_OWNER (0x0UL)
  #define I3CCORE_CORE_PRESENTSTATES_CURRENTMASTER_BUS_OWNER (0x1UL)

/* CMTFRSTS @Bits 8..13 : Transfer Type Status */
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_Pos (8UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_Msk (0x3FUL << I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_Pos) /*!< Bit mask of CMTFRSTS
                                                                            field.*/
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_Min (0x0UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_Max (0x6UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_SLAVEIDLE (0x00UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_SLAVEHOTJOIN (0x01UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_SLAVEIBITRANSFER (0x02UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_SLAVEWTRANSFER (0x03UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_SLAVERPREFETCH (0x04UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_SLAVERTRANSFER (0x05UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTS_SLAVEHALT (0x06UL) /*!< Slave controller in Halt State waiting for resume from
                                                                      application.*/

/* CMTFRSTSTS @Bits 16..21 : Current Master Transfer State Status. */
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTSTS_Pos (16UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMTFRSTSTS_Msk (0x3FUL << I3CCORE_CORE_PRESENTSTATES_CMTFRSTSTS_Pos) /*!< Bit mask of
                                                                            CMTFRSTSTS field.*/

/* CMDTID @Bits 24..27 : This field reflects the Transaction-ID of the current executing command. */
  #define I3CCORE_CORE_PRESENTSTATES_CMDTID_Pos (24UL)
  #define I3CCORE_CORE_PRESENTSTATES_CMDTID_Msk (0xFUL << I3CCORE_CORE_PRESENTSTATES_CMDTID_Pos)

