pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MASTERIDLE @Bit 28 : This field reflects whether the Master Controller is in Idle state or not. */
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Pos (28UL)
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Msk (0x1UL << I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Pos) /*!< Bit mask of
                                                                            MASTERIDLE field.*/
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Min (0x0UL)
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_Max (0x1UL)
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_MST_NOT_IDLE (0x0UL)
  #define I3CCORE_CORE_PRESENTSTATES_MASTERIDLE_MST_IDLE (0x1UL)


/* I3CCORE_CORE_CCCDEVICESTATUS: Device Operating Status Register. */
  #define I3CCORE_CORE_CCCDEVICESTATUS_ResetValue (0x00000000UL)

/* PENDINGINTR @Bits 0..3 : Pending Interrupt */
  #define I3CCORE_CORE_CCCDEVICESTATUS_PENDINGINTR_Pos (0UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_PENDINGINTR_Msk (0xFUL << I3CCORE_CORE_CCCDEVICESTATUS_PENDINGINTR_Pos) /*!< Bit mask of
                                                                            PENDINGINTR field.*/

/* PROTOCOLERR @Bit 5 : Protocol Error */
  #define I3CCORE_CORE_CCCDEVICESTATUS_PROTOCOLERR_Pos (5UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_PROTOCOLERR_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_PROTOCOLERR_Pos) /*!< Bit mask of
                                                                            PROTOCOLERR field.*/

/* ACTIVITYMODE @Bits 6..7 : Activity Mode */
  #define I3CCORE_CORE_CCCDEVICESTATUS_ACTIVITYMODE_Pos (6UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_ACTIVITYMODE_Msk (0x3UL << I3CCORE_CORE_CCCDEVICESTATUS_ACTIVITYMODE_Pos) /*!< Bit mask
                                                                            of ACTIVITYMODE field.*/

/* UNDERFLOWERR @Bit 8 : Underflow error */
  #define I3CCORE_CORE_CCCDEVICESTATUS_UNDERFLOWERR_Pos (8UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_UNDERFLOWERR_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_UNDERFLOWERR_Pos) /*!< Bit mask
                                                                            of UNDERFLOWERR field.*/

/* SLAVEBUSY @Bit 9 : Slave Busy */
  #define I3CCORE_CORE_CCCDEVICESTATUS_SLAVEBUSY_Pos (9UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_SLAVEBUSY_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_SLAVEBUSY_Pos) /*!< Bit mask of
                                                                            SLAVEBUSY field.*/

/* OVERFLOWERR @Bit 10 : Overflow Error */
  #define I3CCORE_CORE_CCCDEVICESTATUS_OVERFLOWERR_Pos (10UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_OVERFLOWERR_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_OVERFLOWERR_Pos) /*!< Bit mask of
                                                                            OVERFLOWERR field.*/

/* DATANOTREADY @Bit 11 : Data not ready */
  #define I3CCORE_CORE_CCCDEVICESTATUS_DATANOTREADY_Pos (11UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_DATANOTREADY_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_DATANOTREADY_Pos) /*!< Bit mask
                                                                            of DATANOTREADY field.*/

/* BUFFERNOTAVAIL @Bit 12 : Buffer not available */
  #define I3CCORE_CORE_CCCDEVICESTATUS_BUFFERNOTAVAIL_Pos (12UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_BUFFERNOTAVAIL_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_BUFFERNOTAVAIL_Pos) /*!< Bit
                                                                            mask of BUFFERNOTAVAIL field.*/

/* FRAMEERROR @Bit 13 : Frame Error */
  #define I3CCORE_CORE_CCCDEVICESTATUS_FRAMEERROR_Pos (13UL)
  #define I3CCORE_CORE_CCCDEVICESTATUS_FRAMEERROR_Msk (0x1UL << I3CCORE_CORE_CCCDEVICESTATUS_FRAMEERROR_Pos) /*!< Bit mask of
                                                                            FRAMEERROR field.*/


/* I3CCORE_CORE_DEVICEADDRTABLEPOINTER: Pointer for Device Address Table */
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_ResetValue (0x000A02C0UL)

/* PDEVADDRTABLESTARTADDR @Bits 0..15 : Start Address of Device Address Table. */
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_PDEVADDRTABLESTARTADDR_Pos (0UL)
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_PDEVADDRTABLESTARTADDR_Msk (0xFFFFUL << I3CCORE_CORE_DEVICEADDRTABLEPOINTER_PDEVADDRTABLESTARTADDR_Pos)
                                                                            /*!< Bit mask of PDEVADDRTABLESTARTADDR field.*/

/* DEVADDRTABLEDEPTH @Bits 16..31 : Depth of Device Address Table */
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_DEVADDRTABLEDEPTH_Pos (16UL)
  #define I3CCORE_CORE_DEVICEADDRTABLEPOINTER_DEVADDRTABLEDEPTH_Msk (0xFFFFUL << I3CCORE_CORE_DEVICEADDRTABLEPOINTER_DEVADDRTABLEDEPTH_Pos)
                                                                            /*!< Bit mask of DEVADDRTABLEDEPTH field.*/


/* I3CCORE_CORE_DEVCHARTABLEPOINTER: Pointer for Device Characteristics Table */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_ResetValue (0x00028200UL)

/* PDEVCHARTABLESTARTADDR @Bits 0..11 : Start Address of Device Characteristics Table. */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_PDEVCHARTABLESTARTADDR_Pos (0UL)
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_PDEVCHARTABLESTARTADDR_Msk (0xFFFUL << I3CCORE_CORE_DEVCHARTABLEPOINTER_PDEVCHARTABLESTARTADDR_Pos)
                                                                            /*!< Bit mask of PDEVCHARTABLESTARTADDR field.*/

/* DEVCHARTABLEDEPTH @Bits 12..18 : Depth of Device Characteristics Table */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_DEVCHARTABLEDEPTH_Pos (12UL)
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_DEVCHARTABLEDEPTH_Msk (0x7FUL << I3CCORE_CORE_DEVCHARTABLEPOINTER_DEVCHARTABLEDEPTH_Pos)
                                                                            /*!< Bit mask of DEVCHARTABLEDEPTH field.*/

/* PRESENTDEVCHARTABLEINDX @Bits 19..22 : Current index of Device Characteristics Table. */
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_PRESENTDEVCHARTABLEINDX_Pos (19UL)
  #define I3CCORE_CORE_DEVCHARTABLEPOINTER_PRESENTDEVCHARTABLEINDX_Msk (0xFUL << I3CCORE_CORE_DEVCHARTABLEPOINTER_PRESENTDEVCHARTABLEINDX_Pos)
                                                                            /*!< Bit mask of PRESENTDEVCHARTABLEINDX field.*/


/* I3CCORE_CORE_VENDORSPECIFICREGPOINTER: Pointer for Vendor Specific Registers. */
  #define I3CCORE_CORE_VENDORSPECIFICREGPOINTER_ResetValue (0x000000B0UL) /*!< Reset value of VENDORSPECIFICREGPOINTER
                                                                            register.*/

