pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PVENDORREGSTARTADDR @Bits 0..15 : Start Address of Vendor specific registers. */
  #define I3CCORE_CORE_VENDORSPECIFICREGPOINTER_PVENDORREGSTARTADDR_Pos (0UL)
  #define I3CCORE_CORE_VENDORSPECIFICREGPOINTER_PVENDORREGSTARTADDR_Msk (0xFFFFUL << I3CCORE_CORE_VENDORSPECIFICREGPOINTER_PVENDORREGSTARTADDR_Pos)
                                                                            /*!< Bit mask of PVENDORREGSTARTADDR field.*/


/* I3CCORE_CORE_SLVMIPIIDVALUE: I3C MIPI Manufacturer ID Register. */
  #define I3CCORE_CORE_SLVMIPIIDVALUE_ResetValue (0x00000000UL)

/* SLVPROVIDSEL @Bit 0 : Specifies the Provisional ID Type Selector (PID[32]). */
  #define I3CCORE_CORE_SLVMIPIIDVALUE_SLVPROVIDSEL_Pos (0UL)
  #define I3CCORE_CORE_SLVMIPIIDVALUE_SLVPROVIDSEL_Msk (0x1UL << I3CCORE_CORE_SLVMIPIIDVALUE_SLVPROVIDSEL_Pos) /*!< Bit mask of
                                                                            SLVPROVIDSEL field.*/

/* SLVMIPIMFGID @Bits 1..15 : Specifies the MIPI Manufacturer ID. */
  #define I3CCORE_CORE_SLVMIPIIDVALUE_SLVMIPIMFGID_Pos (1UL)
  #define I3CCORE_CORE_SLVMIPIIDVALUE_SLVMIPIMFGID_Msk (0x7FFFUL << I3CCORE_CORE_SLVMIPIIDVALUE_SLVMIPIMFGID_Pos) /*!< Bit mask
                                                                            of SLVMIPIMFGID field.*/


/* I3CCORE_CORE_SLVPIDVALUE: I3C Normal Provisional ID Register. */
  #define I3CCORE_CORE_SLVPIDVALUE_ResetValue (0x00000000UL)

/* SLVPIDDCR @Bits 0..11 : Specifies the additional 12-bit ID of DWC_mipi_i3c device (PID[11:0]). */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVPIDDCR_Pos (0UL)
  #define I3CCORE_CORE_SLVPIDVALUE_SLVPIDDCR_Msk (0xFFFUL << I3CCORE_CORE_SLVPIDVALUE_SLVPIDDCR_Pos) /*!< Bit mask of SLVPIDDCR
                                                                            field.*/

/* SLVINSTID @Bits 12..15 : This field is used to program the instance ID of the Slave. */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVINSTID_Pos (12UL)
  #define I3CCORE_CORE_SLVPIDVALUE_SLVINSTID_Msk (0xFUL << I3CCORE_CORE_SLVPIDVALUE_SLVINSTID_Pos) /*!< Bit mask of SLVINSTID
                                                                            field.*/

/* SLVPARTID @Bits 16..31 : Specifies the Part ID of DWC_mipi_i3c device (PID[31:16]) */
  #define I3CCORE_CORE_SLVPIDVALUE_SLVPARTID_Pos (16UL)
  #define I3CCORE_CORE_SLVPIDVALUE_SLVPARTID_Msk (0xFFFFUL << I3CCORE_CORE_SLVPIDVALUE_SLVPARTID_Pos) /*!< Bit mask of SLVPARTID
                                                                            field.*/


/* I3CCORE_CORE_SLVCHARCTRL: I3C Slave Characteristic Register. */
  #define I3CCORE_CORE_SLVCHARCTRL_ResetValue (0x00070062UL)

/* MAXDATASPEEDLIMIT @Bit 0 : Max Data Speed Limitation field in Bus Characteristic Register (BCR[0]). */
  #define I3CCORE_CORE_SLVCHARCTRL_MAXDATASPEEDLIMIT_Pos (0UL)
  #define I3CCORE_CORE_SLVCHARCTRL_MAXDATASPEEDLIMIT_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_MAXDATASPEEDLIMIT_Pos) /*!< Bit mask
                                                                            of MAXDATASPEEDLIMIT field.*/

/* IBIREQUESTCAPABLE @Bit 1 : IBI Request Capable field in Bus Characteristic Register (BCR[1]). */
  #define I3CCORE_CORE_SLVCHARCTRL_IBIREQUESTCAPABLE_Pos (1UL)
  #define I3CCORE_CORE_SLVCHARCTRL_IBIREQUESTCAPABLE_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_IBIREQUESTCAPABLE_Pos) /*!< Bit mask
                                                                            of IBIREQUESTCAPABLE field.*/

/* IBIPAYLOAD @Bit 2 : IBI Payload field in Bus Characteristic Register (BCR[2]). */
  #define I3CCORE_CORE_SLVCHARCTRL_IBIPAYLOAD_Pos (2UL)
  #define I3CCORE_CORE_SLVCHARCTRL_IBIPAYLOAD_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_IBIPAYLOAD_Pos) /*!< Bit mask of IBIPAYLOAD
                                                                            field.*/

/* OFFLINECAPABLE @Bit 3 : Offline Capable field in Bus Characteristic Register (BCR[3]). */
  #define I3CCORE_CORE_SLVCHARCTRL_OFFLINECAPABLE_Pos (3UL)
  #define I3CCORE_CORE_SLVCHARCTRL_OFFLINECAPABLE_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_OFFLINECAPABLE_Pos) /*!< Bit mask of
                                                                            OFFLINECAPABLE field.*/

/* BRIDGEIDENTIFIER @Bit 4 : Bridge Identifier field in Bus Characteristic Register (BCR[4]). */
  #define I3CCORE_CORE_SLVCHARCTRL_BRIDGEIDENTIFIER_Pos (4UL)
  #define I3CCORE_CORE_SLVCHARCTRL_BRIDGEIDENTIFIER_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_BRIDGEIDENTIFIER_Pos) /*!< Bit mask
                                                                            of BRIDGEIDENTIFIER field.*/

/* HDRCAPABLE @Bit 5 : SDR Only or SDR and HDR Capable field in Bus Characteristic Register (BCR[5]). */
  #define I3CCORE_CORE_SLVCHARCTRL_HDRCAPABLE_Pos (5UL)
  #define I3CCORE_CORE_SLVCHARCTRL_HDRCAPABLE_Msk (0x1UL << I3CCORE_CORE_SLVCHARCTRL_HDRCAPABLE_Pos) /*!< Bit mask of HDRCAPABLE
                                                                            field.*/

/* DEVICEROLE @Bits 6..7 : Device Role field in Bus Characteristic Register (BCR[7:6]). */
  #define I3CCORE_CORE_SLVCHARCTRL_DEVICEROLE_Pos (6UL)
  #define I3CCORE_CORE_SLVCHARCTRL_DEVICEROLE_Msk (0x3UL << I3CCORE_CORE_SLVCHARCTRL_DEVICEROLE_Pos) /*!< Bit mask of DEVICEROLE
                                                                            field.*/

/* DCR @Bits 8..15 : I3C Device Characteristic Value. */
  #define I3CCORE_CORE_SLVCHARCTRL_DCR_Pos (8UL)
  #define I3CCORE_CORE_SLVCHARCTRL_DCR_Msk (0xFFUL << I3CCORE_CORE_SLVCHARCTRL_DCR_Pos)

/* HDRCAP @Bits 16..23 : I3C Device HDR Capability Register Value. */
  #define I3CCORE_CORE_SLVCHARCTRL_HDRCAP_Pos (16UL)
  #define I3CCORE_CORE_SLVCHARCTRL_HDRCAP_Msk (0xFFUL << I3CCORE_CORE_SLVCHARCTRL_HDRCAP_Pos)


/* I3CCORE_CORE_SLVMAXLEN: I3C Max Write/Read Length Register. */
  #define I3CCORE_CORE_SLVMAXLEN_ResetValue (0x00FF00FFUL)

/* MWL @Bits 0..15 : I3C Device Max Write Length */
  #define I3CCORE_CORE_SLVMAXLEN_MWL_Pos (0UL)
  #define I3CCORE_CORE_SLVMAXLEN_MWL_Msk (0xFFFFUL << I3CCORE_CORE_SLVMAXLEN_MWL_Pos)

/* MRL @Bits 16..31 : I3C Device Max Read Length. */
  #define I3CCORE_CORE_SLVMAXLEN_MRL_Pos (16UL)
  #define I3CCORE_CORE_SLVMAXLEN_MRL_Msk (0xFFFFUL << I3CCORE_CORE_SLVMAXLEN_MRL_Pos)


/* I3CCORE_CORE_MAXREADTURNAROUND: MXDS Maximum Read Turnaround Time. */
  #define I3CCORE_CORE_MAXREADTURNAROUND_ResetValue (0x00000000UL)

/* MXDSMAXRDTURN @Bits 0..23 : Specifies the maximum read turnaround time (in microseconds (us)) of DWC_mipi_i3c Slave. */
  #define I3CCORE_CORE_MAXREADTURNAROUND_MXDSMAXRDTURN_Pos (0UL)
  #define I3CCORE_CORE_MAXREADTURNAROUND_MXDSMAXRDTURN_Msk (0xFFFFFFUL << I3CCORE_CORE_MAXREADTURNAROUND_MXDSMAXRDTURN_Pos) /*!<
                                                                            Bit mask of MXDSMAXRDTURN field.*/


/* I3CCORE_CORE_MAXDATASPEED: The values in this register are returned by the slave as GETACCMST CCC data. */
  #define I3CCORE_CORE_MAXDATASPEED_ResetValue (0x00000000UL)

/* MXDSMAXWRSPEED @Bits 0..2 : Specifies the Maximum Sustained Data Rate for non-CCC messages sent by Master Device to
                               DWC_mipi_i3c Slave device */

  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Pos (0UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Msk (0x7UL << I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Pos) /*!< Bit mask of
                                                                            MXDSMAXWRSPEED field.*/
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Min (0x0UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_Max (0x4UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_12M5HZ (0x0UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_8MHZ (0x1UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_6MHZ (0x2UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_4MHZ (0x3UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXWRSPEED_2MHZ (0x4UL)

/* MXDSMAXRDSPEED @Bits 8..10 : Specifies the Maximum Sustained Data Rate for non-CCC messages sent by DWC_mipi_i3c Slave Device
                                to Master Device */

  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Pos (8UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Msk (0x7UL << I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Pos) /*!< Bit mask of
                                                                            MXDSMAXRDSPEED field.*/
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Min (0x0UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_Max (0x4UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_12M5HZ (0x0UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_8MHZ (0x1UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_6MHZ (0x2UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_4MHZ (0x3UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSMAXRDSPEED_2MHZ (0x4UL)

/* MXDSCLKDATATURN @Bits 16..18 : Specifies the clock to data turnaround time (Tsco parameter) of DWC_mipi_i3c Slave device */
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Pos (16UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Msk (0x7UL << I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Pos) /*!< Bit mask
                                                                            of MXDSCLKDATATURN field.*/
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Min (0x0UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_Max (0x4UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_8NS (0x0UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_9NS (0x1UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_10NS (0x2UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_11NS (0x3UL)
  #define I3CCORE_CORE_MAXDATASPEED_MXDSCLKDATATURN_12NS (0x4UL)


/* I3CCORE_CORE_SLVINTRREQ: This register is used in slave mode of operation. */
  #define I3CCORE_CORE_SLVINTRREQ_ResetValue (0x00000000UL)

