pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SIR @Bit 0 : Slave Interrupt Request */
  #define I3CCORE_CORE_SLVINTRREQ_SIR_Pos (0UL)
  #define I3CCORE_CORE_SLVINTRREQ_SIR_Msk (0x1UL << I3CCORE_CORE_SLVINTRREQ_SIR_Pos)

/* SIRCTRL @Bits 1..2 : Slave Interrupt Request Control */
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Pos (1UL)
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Msk (0x3UL << I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Pos)
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Min (0x0UL)
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_Max (0x0UL)
  #define I3CCORE_CORE_SLVINTRREQ_SIRCTRL_SEND (0x0UL)

/* MR @Bit 3 : Master Request */
  #define I3CCORE_CORE_SLVINTRREQ_MR_Pos (3UL)
  #define I3CCORE_CORE_SLVINTRREQ_MR_Msk (0x1UL << I3CCORE_CORE_SLVINTRREQ_MR_Pos)

/* IBISTS @Bits 8..9 : IBI Completion Status */
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_Pos (8UL)
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_Msk (0x3UL << I3CCORE_CORE_SLVINTRREQ_IBISTS_Pos)
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_Min (0x1UL)
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_Max (0x3UL)
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_ACCEPTED (0x1UL)
  #define I3CCORE_CORE_SLVINTRREQ_IBISTS_NOATTEMPT (0x3UL)


/* I3CCORE_CORE_SLVTSXSYMBLTIMING: TSP/TSL Symbol Timing Register */
  #define I3CCORE_CORE_SLVTSXSYMBLTIMING_ResetValue (0x0000003FUL)

/* SLVTSXSYMBLCNT @Bits 0..5 : TSP/TSL Symbol Count Value. */
  #define I3CCORE_CORE_SLVTSXSYMBLTIMING_SLVTSXSYMBLCNT_Pos (0UL)
  #define I3CCORE_CORE_SLVTSXSYMBLTIMING_SLVTSXSYMBLCNT_Msk (0x3FUL << I3CCORE_CORE_SLVTSXSYMBLTIMING_SLVTSXSYMBLCNT_Pos) /*!<
                                                                            Bit mask of SLVTSXSYMBLCNT field.*/


/* I3CCORE_CORE_DEVICECTRLEXTENDED: Device Control Extended register. */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_ResetValue (0x00000000UL)

/* DEVOPERATIONMODE @Bits 0..1 : This bit is used to select the Device Operation Mode before the controller is enabled. */
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Pos (0UL)
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Msk (0x3UL << I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Pos)
                                                                            /*!< Bit mask of DEVOPERATIONMODE field.*/
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Min (0x0UL)
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_Max (0x1UL)
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_MASTER (0x0UL)
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_DEVOPERATIONMODE_SLAVE (0x1UL)

/* REQMSTACKCTRL @Bit 3 : In Slave mode of operation, this bit serves as a control to ACK/NACK GETACCMST CCC from current
                          master. */

  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Pos (3UL)
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Msk (0x1UL << I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Pos) /*!<
                                                                            Bit mask of REQMSTACKCTRL field.*/
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Min (0x0UL)
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_Max (0x1UL)
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_ACK (0x0UL)
  #define I3CCORE_CORE_DEVICECTRLEXTENDED_REQMSTACKCTRL_NACK (0x1UL)


/* I3CCORE_CORE_SCLI3CODTIMING: SCL I3C Open Drain Timing Register */
  #define I3CCORE_CORE_SCLI3CODTIMING_ResetValue (0x000A0010UL)

/* I3CODLCNT @Bits 0..7 : I3C Open Drain Low Count. */
  #define I3CCORE_CORE_SCLI3CODTIMING_I3CODLCNT_Pos (0UL)
  #define I3CCORE_CORE_SCLI3CODTIMING_I3CODLCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI3CODTIMING_I3CODLCNT_Pos) /*!< Bit mask of
                                                                            I3CODLCNT field.*/

/* I3CODHCNT @Bits 16..23 : I3C Open Drain High Count. */
  #define I3CCORE_CORE_SCLI3CODTIMING_I3CODHCNT_Pos (16UL)
  #define I3CCORE_CORE_SCLI3CODTIMING_I3CODHCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI3CODTIMING_I3CODHCNT_Pos) /*!< Bit mask of
                                                                            I3CODHCNT field.*/


/* I3CCORE_CORE_SCLI3CPPTIMING: SCL I3C Push Pull Timing Register */
  #define I3CCORE_CORE_SCLI3CPPTIMING_ResetValue (0x000A000AUL)

/* I3CPPLCNT @Bits 0..7 : I3C Push Pull Low Count. */
  #define I3CCORE_CORE_SCLI3CPPTIMING_I3CPPLCNT_Pos (0UL)
  #define I3CCORE_CORE_SCLI3CPPTIMING_I3CPPLCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI3CPPTIMING_I3CPPLCNT_Pos) /*!< Bit mask of
                                                                            I3CPPLCNT field.*/

/* I3CPPHCNT @Bits 16..23 : I3C Push Pull High Count. */
  #define I3CCORE_CORE_SCLI3CPPTIMING_I3CPPHCNT_Pos (16UL)
  #define I3CCORE_CORE_SCLI3CPPTIMING_I3CPPHCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI3CPPTIMING_I3CPPHCNT_Pos) /*!< Bit mask of
                                                                            I3CPPHCNT field.*/


/* I3CCORE_CORE_SCLI2CFMTIMING: SCL I2C Fast Mode Timing Register */
  #define I3CCORE_CORE_SCLI2CFMTIMING_ResetValue (0x00100010UL)

/* I2CFMLCNT @Bits 0..15 : I2C Fast Mode Low Count */
  #define I3CCORE_CORE_SCLI2CFMTIMING_I2CFMLCNT_Pos (0UL)
  #define I3CCORE_CORE_SCLI2CFMTIMING_I2CFMLCNT_Msk (0xFFFFUL << I3CCORE_CORE_SCLI2CFMTIMING_I2CFMLCNT_Pos) /*!< Bit mask of
                                                                            I2CFMLCNT field.*/

/* I2CFMHCNT @Bits 16..31 : I2C Fast Mode High Count */
  #define I3CCORE_CORE_SCLI2CFMTIMING_I2CFMHCNT_Pos (16UL)
  #define I3CCORE_CORE_SCLI2CFMTIMING_I2CFMHCNT_Msk (0xFFFFUL << I3CCORE_CORE_SCLI2CFMTIMING_I2CFMHCNT_Pos) /*!< Bit mask of
                                                                            I2CFMHCNT field.*/


/* I3CCORE_CORE_SCLI2CFMPTIMING: SCL I2C Fast Mode Plus Timing Register */
  #define I3CCORE_CORE_SCLI2CFMPTIMING_ResetValue (0x00100010UL)

/* I2CFMPLCNT @Bits 0..15 : I2C Fast Mode Plus Low Count */
  #define I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPLCNT_Pos (0UL)
  #define I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPLCNT_Msk (0xFFFFUL << I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPLCNT_Pos) /*!< Bit mask of
                                                                            I2CFMPLCNT field.*/

/* I2CFMPHCNT @Bits 16..23 : I2C Fast Mode Plus High Count */
  #define I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPHCNT_Pos (16UL)
  #define I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPHCNT_Msk (0xFFUL << I3CCORE_CORE_SCLI2CFMPTIMING_I2CFMPHCNT_Pos) /*!< Bit mask of
                                                                            I2CFMPHCNT field.*/


