pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3CCORE_CORE_SCLEXTLCNTTIMING: SCL Extended Low Count Timing Register. */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_ResetValue (0x20202020UL)

/* I3CEXTLCNT1 @Bits 0..7 : I3C Extended Low Count Register 1 */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT1_Pos (0UL)
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT1_Msk (0xFFUL << I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT1_Pos) /*!< Bit mask
                                                                            of I3CEXTLCNT1 field.*/

/* I3CEXTLCNT2 @Bits 8..15 : I3C Extended Low Count Register 2 */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT2_Pos (8UL)
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT2_Msk (0xFFUL << I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT2_Pos) /*!< Bit mask
                                                                            of I3CEXTLCNT2 field.*/

/* I3CEXTLCNT3 @Bits 16..23 : I3C Extended Low Count Register 3 */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT3_Pos (16UL)
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT3_Msk (0xFFUL << I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT3_Pos) /*!< Bit mask
                                                                            of I3CEXTLCNT3 field.*/

/* I3CEXTLCNT4 @Bits 24..31 : I3C Extended Low Count Register 4 */
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT4_Pos (24UL)
  #define I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT4_Msk (0xFFUL << I3CCORE_CORE_SCLEXTLCNTTIMING_I3CEXTLCNT4_Pos) /*!< Bit mask
                                                                            of I3CEXTLCNT4 field.*/


/* I3CCORE_CORE_SCLEXTTERMNLCNTTIMING: SCL Termination Bit Low Count Timing Register */
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_ResetValue (0x00030000UL)

/* I3CEXTTERMNLCNT @Bits 0..3 : I3C Read Termination Bit Low count. */
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CEXTTERMNLCNT_Pos (0UL)
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CEXTTERMNLCNT_Msk (0xFUL << I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CEXTTERMNLCNT_Pos)
                                                                            /*!< Bit mask of I3CEXTTERMNLCNT field.*/

/* I3CTSSKEWCNT @Bits 16..19 : I3C HDR Ternary Skew Count. */
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CTSSKEWCNT_Pos (16UL)
  #define I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CTSSKEWCNT_Msk (0xFUL << I3CCORE_CORE_SCLEXTTERMNLCNTTIMING_I3CTSSKEWCNT_Pos)
                                                                            /*!< Bit mask of I3CTSSKEWCNT field.*/


/* I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING: SDA Hold and Mode Switch Delay Timing Register */
  #define I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING_ResetValue (0x00010000UL)

/* SDATXHOLD @Bits 16..18 : This field controls the hold time (in term of the core clock period) of the transmit data (SDA) with
                            */

  #define I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING_SDATXHOLD_Pos (16UL)
  #define I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING_SDATXHOLD_Msk (0x7UL << I3CCORE_CORE_SDAHOLDSWITCHDLYTIMING_SDATXHOLD_Pos) /*!<
                                                                            Bit mask of SDATXHOLD field.*/


/* I3CCORE_CORE_BUSFREEAVAILTIMING: Bus Free and Available Timing Register */
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_ResetValue (0x00200020UL)

/* BUSFREETIME @Bits 0..15 : This register field is used only in Master mode of operation */
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_BUSFREETIME_Pos (0UL)
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_BUSFREETIME_Msk (0xFFFFUL << I3CCORE_CORE_BUSFREEAVAILTIMING_BUSFREETIME_Pos) /*!< Bit
                                                                            mask of BUSFREETIME field.*/

/* BUSAVAILABLETIME @Bits 16..31 : This register field is used only in Slave mode of operation */
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_BUSAVAILABLETIME_Pos (16UL)
  #define I3CCORE_CORE_BUSFREEAVAILTIMING_BUSAVAILABLETIME_Msk (0xFFFFUL << I3CCORE_CORE_BUSFREEAVAILTIMING_BUSAVAILABLETIME_Pos)
                                                                            /*!< Bit mask of BUSAVAILABLETIME field.*/


/* I3CCORE_CORE_BUSIDLETIMING: Bus Idle Timing Register */
  #define I3CCORE_CORE_BUSIDLETIMING_ResetValue (0x00000020UL)

/* BUSIDLETIME @Bits 0..19 : Bus Idle Count Value. */
  #define I3CCORE_CORE_BUSIDLETIMING_BUSIDLETIME_Pos (0UL)
  #define I3CCORE_CORE_BUSIDLETIMING_BUSIDLETIME_Msk (0xFFFFFUL << I3CCORE_CORE_BUSIDLETIMING_BUSIDLETIME_Pos) /*!< Bit mask of
                                                                            BUSIDLETIME field.*/


/* I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT: The SCL Low Master Extended Timeout register is used to define the duration of the SCL Low
                                      Bus Reset Pattern. */

  #define I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT_ResetValue (0x003567E0UL)

/* SCLLOWMSTTIMEOUTCOUNT @Bits 0..25 : This count defines the number of core clock periods to count for generation of the SCL
                                       Low Bus Reset Pattern. */

  #define I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT_SCLLOWMSTTIMEOUTCOUNT_Pos (0UL)
  #define I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT_SCLLOWMSTTIMEOUTCOUNT_Msk (0x3FFFFFFUL << I3CCORE_CORE_SCLLOWMSTEXTTIMEOUT_SCLLOWMSTTIMEOUTCOUNT_Pos)
                                                                            /*!< Bit mask of SCLLOWMSTTIMEOUTCOUNT field.*/


/* I3CCORE_CORE_I3CVERID: This register reflects the current release number of DWC_mipi_i3c */
  #define I3CCORE_CORE_I3CVERID_ResetValue (0x3130302AUL)

/* I3CVERID @Bits 0..31 : Current release number */
  #define I3CCORE_CORE_I3CVERID_I3CVERID_Pos (0UL)
  #define I3CCORE_CORE_I3CVERID_I3CVERID_Msk (0xFFFFFFFFUL << I3CCORE_CORE_I3CVERID_I3CVERID_Pos) /*!< Bit mask of I3CVERID
                                                                            field.*/


/* I3CCORE_CORE_I3CVERTYPE: This register reflects the current release type of DWC_mipi_i3c. */
  #define I3CCORE_CORE_I3CVERTYPE_ResetValue (0x6C633033UL)

/* I3CVERTYPE @Bits 0..31 : Current release type */
  #define I3CCORE_CORE_I3CVERTYPE_I3CVERTYPE_Pos (0UL)
  #define I3CCORE_CORE_I3CVERTYPE_I3CVERTYPE_Msk (0xFFFFFFFFUL << I3CCORE_CORE_I3CVERTYPE_I3CVERTYPE_Pos) /*!< Bit mask of
                                                                            I3CVERTYPE field.*/


/* I3CCORE_CORE_QUEUESIZECAPABILITY: This register reflects the configured size of the Data Buffer and Queues in DWC_mipi_i3c. */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_ResetValue (0x00022355UL)

/* TXBUFSIZE @Bits 0..3 : Transmit Data Buffer Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Pos (0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Pos) /*!< Bit mask
                                                                            of TXBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Min (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_Max (0x5UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_2DWORD (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_4DWORD (0x1UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_8DWORD (0x2UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_16DWORD (0x3UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_32DWORD (0x4UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_TXBUFSIZE_64DWORD (0x5UL)

