pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RXBUFSIZE @Bits 4..7 : Receive Data Buffer Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Pos (4UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Pos) /*!< Bit mask
                                                                            of RXBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Min (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_Max (0x5UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_2DWORD (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_4DWORD (0x1UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_8DWORD (0x2UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_16DWORD (0x3UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_32DWORD (0x4UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RXBUFSIZE_64DWORD (0x5UL)

/* CMDBUFSIZE @Bits 8..11 : Command Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Pos (8UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Pos) /*!< Bit
                                                                            mask of CMDBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Min (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_Max (0x3UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_2DWORD (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_4DWORD (0x1UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_8DWORD (0x2UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_CMDBUFSIZE_16DWORD (0x3UL)

/* RESPBUFSIZE @Bits 12..15 : Response Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Pos (12UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Pos) /*!< Bit
                                                                            mask of RESPBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Min (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_Max (0x3UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_2DWORD (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_4DWORD (0x1UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_8DWORD (0x2UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_RESPBUFSIZE_16DWORD (0x3UL)

/* IBIBUFSIZE @Bits 16..19 : IBI Queue Size */
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Pos (16UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Msk (0xFUL << I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Pos) /*!< Bit
                                                                            mask of IBIBUFSIZE field.*/
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Min (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_Max (0x3UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_2DWORD (0x0UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_4DWORD (0x1UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_8DWORD (0x2UL)
  #define I3CCORE_CORE_QUEUESIZECAPABILITY_IBIBUFSIZE_16DWORD (0x3UL)


/* I3CCORE_CORE_SECDEVCHARTABLE: Secondary Master Device Characteristic Table Location of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_MaxCount (32UL)
  #define I3CCORE_CORE_SECDEVCHARTABLE_MaxIndex (31UL)
  #define I3CCORE_CORE_SECDEVCHARTABLE_MinIndex (0UL)
  #define I3CCORE_CORE_SECDEVCHARTABLE_ResetValue (0x00000000UL)

/* DYNAMICADDR @Bits 0..7 : The Dynamic Addr of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Pos (0UL)
  #define I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_DYNAMICADDR_Pos) /*!< Bit mask of
                                                                            DYNAMICADDR field.*/

/* DCRTYPE @Bits 8..15 : The DCR TYPE of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Pos (8UL)
  #define I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_DCRTYPE_Pos) /*!< Bit mask of DCRTYPE
                                                                            field.*/

/* BCRTYPE @Bits 16..23 : The BCR TYPE of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Pos (16UL)
  #define I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_BCRTYPE_Pos) /*!< Bit mask of BCRTYPE
                                                                            field.*/

/* STATICADDR @Bits 24..31 : The Static Addr of Device [n] */
  #define I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Pos (24UL)
  #define I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Msk (0xFFUL << I3CCORE_CORE_SECDEVCHARTABLE_STATICADDR_Pos) /*!< Bit mask of
                                                                            STATICADDR field.*/


/* I3CCORE_CORE_DEVADDRTABLELOC: Device Address Table of Device [n] */
  #define I3CCORE_CORE_DEVADDRTABLELOC_MaxCount (10UL)
  #define I3CCORE_CORE_DEVADDRTABLELOC_MaxIndex (9UL)
  #define I3CCORE_CORE_DEVADDRTABLELOC_MinIndex (0UL)
  #define I3CCORE_CORE_DEVADDRTABLELOC_ResetValue (0x00000000UL)

/* DEVSTATICADDR @Bits 0..6 : Device Static Address. */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVSTATICADDR_Pos (0UL)
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVSTATICADDR_Msk (0x7FUL << I3CCORE_CORE_DEVADDRTABLELOC_DEVSTATICADDR_Pos) /*!< Bit
                                                                            mask of DEVSTATICADDR field.*/

/* DEVDYNAMICADDR @Bits 16..23 : Device Dynamic Address with parity. */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVDYNAMICADDR_Pos (16UL)
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVDYNAMICADDR_Msk (0xFFUL << I3CCORE_CORE_DEVADDRTABLELOC_DEVDYNAMICADDR_Pos) /*!< Bit
                                                                            mask of DEVDYNAMICADDR field.*/

/* DEVNACKRETRYCNT @Bits 29..30 : This field is used to set the Device NACK Retry count for the particular device. */
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVNACKRETRYCNT_Pos (29UL)
  #define I3CCORE_CORE_DEVADDRTABLELOC_DEVNACKRETRYCNT_Msk (0x3UL << I3CCORE_CORE_DEVADDRTABLELOC_DEVNACKRETRYCNT_Pos) /*!< Bit
                                                                            mask of DEVNACKRETRYCNT field.*/

/* LEGACYI2CDEVICE @Bit 31 : Legacy I2C device or not. */
  #define I3CCORE_CORE_DEVADDRTABLELOC_LEGACYI2CDEVICE_Pos (31UL)
  #define I3CCORE_CORE_DEVADDRTABLELOC_LEGACYI2CDEVICE_Msk (0x1UL << I3CCORE_CORE_DEVADDRTABLELOC_LEGACYI2CDEVICE_Pos) /*!< Bit
                                                                            mask of LEGACYI2CDEVICE field.*/



