pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DSTSCATTEREN @Bit 18 : Destination scatter enable. */
  #define I3CCORE_DMA_CH0_CTL00_DSTSCATTEREN_Pos (18UL)
  #define I3CCORE_DMA_CH0_CTL00_DSTSCATTEREN_Msk (0x1UL << I3CCORE_DMA_CH0_CTL00_DSTSCATTEREN_Pos) /*!< Bit mask of DSTSCATTEREN
                                                                            field.*/
  #define I3CCORE_DMA_CH0_CTL00_DSTSCATTEREN_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CTL00_DSTSCATTEREN_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CTL00_DSTSCATTEREN_DST_SCATTER_DISABLE (0x0UL)
  #define I3CCORE_DMA_CH0_CTL00_DSTSCATTEREN_DST_SCATTER_ENABLE (0x1UL)

/* RSVDCTL @Bit 19 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL00_RSVDCTL_Pos (19UL)
  #define I3CCORE_DMA_CH0_CTL00_RSVDCTL_Msk (0x1UL << I3CCORE_DMA_CH0_CTL00_RSVDCTL_Pos)

/* TTFC @Bits 20..22 : Transfer Type and Flow Control. */
  #define I3CCORE_DMA_CH0_CTL00_TTFC_Pos (20UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_Msk (0x7UL << I3CCORE_DMA_CH0_CTL00_TTFC_Pos)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_Max (0x7UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_TT_FC_0 (0x0UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_TT_FC_1 (0x1UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_TT_FC_2 (0x2UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_TT_FC_3 (0x3UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_TT_FC_4 (0x4UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_TT_FC_5 (0x5UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_TT_FC_6 (0x6UL)
  #define I3CCORE_DMA_CH0_CTL00_TTFC_TT_FC_7 (0x7UL)

/* RSVDDMS @Bits 23..24 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL00_RSVDDMS_Pos (23UL)
  #define I3CCORE_DMA_CH0_CTL00_RSVDDMS_Msk (0x3UL << I3CCORE_DMA_CH0_CTL00_RSVDDMS_Pos)

/* RSVDSMS @Bits 25..26 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL00_RSVDSMS_Pos (25UL)
  #define I3CCORE_DMA_CH0_CTL00_RSVDSMS_Msk (0x3UL << I3CCORE_DMA_CH0_CTL00_RSVDSMS_Pos)

/* RSVDLLPDSTEN @Bit 27 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL00_RSVDLLPDSTEN_Pos (27UL)
  #define I3CCORE_DMA_CH0_CTL00_RSVDLLPDSTEN_Msk (0x1UL << I3CCORE_DMA_CH0_CTL00_RSVDLLPDSTEN_Pos) /*!< Bit mask of RSVDLLPDSTEN
                                                                            field.*/

/* RSVDLLPSRCEN @Bit 28 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL00_RSVDLLPSRCEN_Pos (28UL)
  #define I3CCORE_DMA_CH0_CTL00_RSVDLLPSRCEN_Msk (0x1UL << I3CCORE_DMA_CH0_CTL00_RSVDLLPSRCEN_Pos) /*!< Bit mask of RSVDLLPSRCEN
                                                                            field.*/

/* RSVD1CTL @Bits 29..31 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL00_RSVD1CTL_Pos (29UL)
  #define I3CCORE_DMA_CH0_CTL00_RSVD1CTL_Msk (0x7UL << I3CCORE_DMA_CH0_CTL00_RSVD1CTL_Pos)


/* I3CCORE_DMA_CH0_CTL01: This register contains fields that control the DMA transfer. */
  #define I3CCORE_DMA_CH0_CTL01_ResetValue (0x00000002UL)

/* BLOCKTS @Bits 0..4 : Block Transfer Size. */
  #define I3CCORE_DMA_CH0_CTL01_BLOCKTS_Pos (0UL)
  #define I3CCORE_DMA_CH0_CTL01_BLOCKTS_Msk (0x1FUL << I3CCORE_DMA_CH0_CTL01_BLOCKTS_Pos)

/* RSVD2CTL @Bits 5..11 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CTL01_RSVD2CTL_Pos (5UL)
  #define I3CCORE_DMA_CH0_CTL01_RSVD2CTL_Msk (0x7FUL << I3CCORE_DMA_CH0_CTL01_RSVD2CTL_Pos)

/* DONE @Bit 12 : Done bit. */
  #define I3CCORE_DMA_CH0_CTL01_DONE_Pos (12UL)
  #define I3CCORE_DMA_CH0_CTL01_DONE_Msk (0x1UL << I3CCORE_DMA_CH0_CTL01_DONE_Pos)
  #define I3CCORE_DMA_CH0_CTL01_DONE_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CTL01_DONE_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CTL01_DONE_DISABLED (0x0UL)
  #define I3CCORE_DMA_CH0_CTL01_DONE_ENABLED (0x1UL)


/* I3CCORE_DMA_CH0_CFG0L: This register contains fields that configure the DMA transfer. */
  #define I3CCORE_DMA_CH0_CFG0L_ResetValue (0x00000E00UL)

/* RSVDCFG @Bits 0..4 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDCFG_Pos (0UL)
  #define I3CCORE_DMA_CH0_CFG0L_RSVDCFG_Msk (0x1FUL << I3CCORE_DMA_CH0_CFG0L_RSVDCFG_Pos)

/* CHPRIOR @Bits 5..7 : Channel Priority. */
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_Pos (5UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_Msk (0x7UL << I3CCORE_DMA_CH0_CFG0L_CHPRIOR_Pos)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_Max (0x7UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_CH_PRIOR_0 (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_CH_PRIOR_1 (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_CH_PRIOR_2 (0x2UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_CH_PRIOR_3 (0x3UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_CH_PRIOR_4 (0x4UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_CH_PRIOR_5 (0x5UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_CH_PRIOR_6 (0x6UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHPRIOR_CH_PRIOR_7 (0x7UL)

/* CHSUSP @Bit 8 : Channel Suspend. */
  #define I3CCORE_DMA_CH0_CFG0L_CHSUSP_Pos (8UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHSUSP_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_CHSUSP_Pos)
  #define I3CCORE_DMA_CH0_CFG0L_CHSUSP_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHSUSP_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHSUSP_NOT_SUSPENDED (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_CHSUSP_SUSPENDED (0x1UL)

/* FIFOEMPTY @Bit 9 : Channel FIFO status. */
  #define I3CCORE_DMA_CH0_CFG0L_FIFOEMPTY_Pos (9UL)
  #define I3CCORE_DMA_CH0_CFG0L_FIFOEMPTY_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_FIFOEMPTY_Pos)
  #define I3CCORE_DMA_CH0_CFG0L_FIFOEMPTY_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_FIFOEMPTY_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0L_FIFOEMPTY_NOT_EMPTY (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_FIFOEMPTY_EMPTY (0x1UL)

/* HSSELDST @Bit 10 : Destination Software or Hardware Handshaking Select. */
  #define I3CCORE_DMA_CH0_CFG0L_HSSELDST_Pos (10UL)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELDST_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_HSSELDST_Pos)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELDST_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELDST_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELDST_HARDWARE_HS (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELDST_SOFTWARE_HS (0x1UL)

/* HSSELSRC @Bit 11 : Source Software or Hardware Handshaking Select. */
  #define I3CCORE_DMA_CH0_CFG0L_HSSELSRC_Pos (11UL)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELSRC_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_HSSELSRC_Pos)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELSRC_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELSRC_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELSRC_HARDWARE_HS (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_HSSELSRC_SOFTWARE_HS (0x1UL)

/* RSVDLOCKCHL @Bits 12..13 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDLOCKCHL_Pos (12UL)
  #define I3CCORE_DMA_CH0_CFG0L_RSVDLOCKCHL_Msk (0x3UL << I3CCORE_DMA_CH0_CFG0L_RSVDLOCKCHL_Pos) /*!< Bit mask of RSVDLOCKCHL
                                                                            field.*/

