pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RSVDLOCKBL @Bits 14..15 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDLOCKBL_Pos (14UL)
  #define I3CCORE_DMA_CH0_CFG0L_RSVDLOCKBL_Msk (0x3UL << I3CCORE_DMA_CH0_CFG0L_RSVDLOCKBL_Pos) /*!< Bit mask of RSVDLOCKBL
                                                                            field.*/

/* RSVDLOCKCH @Bit 16 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDLOCKCH_Pos (16UL)
  #define I3CCORE_DMA_CH0_CFG0L_RSVDLOCKCH_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_RSVDLOCKCH_Pos) /*!< Bit mask of RSVDLOCKCH
                                                                            field.*/

/* RSVDLOCKB @Bit 17 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDLOCKB_Pos (17UL)
  #define I3CCORE_DMA_CH0_CFG0L_RSVDLOCKB_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_RSVDLOCKB_Pos)

/* DSTHSPOL @Bit 18 : Destination Handshaking Interface Polarity. */
  #define I3CCORE_DMA_CH0_CFG0L_DSTHSPOL_Pos (18UL)
  #define I3CCORE_DMA_CH0_CFG0L_DSTHSPOL_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_DSTHSPOL_Pos)
  #define I3CCORE_DMA_CH0_CFG0L_DSTHSPOL_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_DSTHSPOL_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0L_DSTHSPOL_ACTIVE_HIGH (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_DSTHSPOL_ACTIVE_LOW (0x1UL)

/* SRCHSPOL @Bit 19 : Source Handshaking Interface Polarity. */
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Pos (19UL)
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Pos)
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_ACTIVE_HIGH (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0L_SRCHSPOL_ACTIVE_LOW (0x1UL)

/* MAXABRST @Bits 20..29 : Maximum AMBA Burst Length. */
  #define I3CCORE_DMA_CH0_CFG0L_MAXABRST_Pos (20UL)
  #define I3CCORE_DMA_CH0_CFG0L_MAXABRST_Msk (0x3FFUL << I3CCORE_DMA_CH0_CFG0L_MAXABRST_Pos)

/* RSVDRELOADSRC @Bit 30 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDRELOADSRC_Pos (30UL)
  #define I3CCORE_DMA_CH0_CFG0L_RSVDRELOADSRC_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_RSVDRELOADSRC_Pos) /*!< Bit mask of
                                                                            RSVDRELOADSRC field.*/

/* RSVDRELOADDST @Bit 31 : Reserved field- read-only */
  #define I3CCORE_DMA_CH0_CFG0L_RSVDRELOADDST_Pos (31UL)
  #define I3CCORE_DMA_CH0_CFG0L_RSVDRELOADDST_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0L_RSVDRELOADDST_Pos) /*!< Bit mask of
                                                                            RSVDRELOADDST field.*/


/* I3CCORE_DMA_CH0_CFG0H: This register contains fields that configure the DMA transfer. */
  #define I3CCORE_DMA_CH0_CFG0H_ResetValue (0x00000004UL)

/* FCMODE @Bit 0 : Flow Control Mode. */
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_Pos (0UL)
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_FCMODE_Pos)
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_FCMODE_0 (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0H_FCMODE_FCMODE_1 (0x1UL)

/* FIFOMODE @Bit 1 : FIFO Mode Select. */
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Pos (1UL)
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Pos)
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Min (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_Max (0x1UL)
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_FIFO_MODE_0 (0x0UL)
  #define I3CCORE_DMA_CH0_CFG0H_FIFOMODE_FIFO_MODE_1 (0x1UL)

/* PROTCTL @Bits 2..4 : Protection Control bits used to drive the AHB HPROT[3:1] bus. */
  #define I3CCORE_DMA_CH0_CFG0H_PROTCTL_Pos (2UL)
  #define I3CCORE_DMA_CH0_CFG0H_PROTCTL_Msk (0x7UL << I3CCORE_DMA_CH0_CFG0H_PROTCTL_Pos)

/* RSVDDSUPDEN @Bit 5 : Reserved field- read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVDDSUPDEN_Pos (5UL)
  #define I3CCORE_DMA_CH0_CFG0H_RSVDDSUPDEN_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_RSVDDSUPDEN_Pos) /*!< Bit mask of RSVDDSUPDEN
                                                                            field.*/

/* RSVDSSUPDEN @Bit 6 : Reserved field- read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVDSSUPDEN_Pos (6UL)
  #define I3CCORE_DMA_CH0_CFG0H_RSVDSSUPDEN_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_RSVDSSUPDEN_Pos) /*!< Bit mask of RSVDSSUPDEN
                                                                            field.*/

/* SRCPER @Bit 7 : Source Hardware Interface. */
  #define I3CCORE_DMA_CH0_CFG0H_SRCPER_Pos (7UL)
  #define I3CCORE_DMA_CH0_CFG0H_SRCPER_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_SRCPER_Pos)

/* RSVD1CFG @Bits 8..10 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD1CFG_Pos (8UL)
  #define I3CCORE_DMA_CH0_CFG0H_RSVD1CFG_Msk (0x7UL << I3CCORE_DMA_CH0_CFG0H_RSVD1CFG_Pos)

/* DESTPER @Bit 11 : Destination hardware interface. */
  #define I3CCORE_DMA_CH0_CFG0H_DESTPER_Pos (11UL)
  #define I3CCORE_DMA_CH0_CFG0H_DESTPER_Msk (0x1UL << I3CCORE_DMA_CH0_CFG0H_DESTPER_Pos)

/* RSVD2CFG @Bits 12..14 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD2CFG_Pos (12UL)
  #define I3CCORE_DMA_CH0_CFG0H_RSVD2CFG_Msk (0x7UL << I3CCORE_DMA_CH0_CFG0H_RSVD2CFG_Pos)

/* RSVD3CFG @Bits 15..31 : Reserved field - read-only */
  #define I3CCORE_DMA_CH0_CFG0H_RSVD3CFG_Pos (15UL)
  #define I3CCORE_DMA_CH0_CFG0H_RSVD3CFG_Msk (0x1FFFFUL << I3CCORE_DMA_CH0_CFG0H_RSVD3CFG_Pos)


/* I3CCORE_DMA_CH0_DSR0: Destination Scatter register. */
  #define I3CCORE_DMA_CH0_DSR0_ResetValue (0x00000000UL)

/* DSI @Bits 0..19 : Destination Scatter Interval. */
  #define I3CCORE_DMA_CH0_DSR0_DSI_Pos (0UL)
  #define I3CCORE_DMA_CH0_DSR0_DSI_Msk (0xFFFFFUL << I3CCORE_DMA_CH0_DSR0_DSI_Pos)

/* DSC @Bits 20..24 : Destination Scatter Count. */
  #define I3CCORE_DMA_CH0_DSR0_DSC_Pos (20UL)
  #define I3CCORE_DMA_CH0_DSR0_DSC_Msk (0x1FUL << I3CCORE_DMA_CH0_DSR0_DSC_Pos)



/* ================================================= Struct I3CCORE_DMA_CH1 ================================================== */
/**
  * @brief CH1 [I3CCORE_DMA_CH1] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SAR1;                              /*!< (@ 0x00000000) This register contains the source address of the DMA
                                                                         transfer.*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DAR1;                              /*!< (@ 0x00000008) This register contains the destination address of the
                                                                         DMA transfer.*/
  __IM  uint32_t  RESERVED1[3];
  __IOM uint32_t  CTL1L;                             /*!< (@ 0x00000018) This register contains fields that control the DMA
                                                                         transfer.*/
  __IOM uint32_t  CTL1H;                             /*!< (@ 0x0000001C) This register contains fields that control the DMA
                                                                         transfer.*/
  __IM  uint32_t  RESERVED2[8];
  __IOM uint32_t  CFG1L;                             /*!< (@ 0x00000040) This register contains fields that configure the DMA
                                                                         transfer.*/
  __IOM uint32_t  CFG1H;                             /*!< (@ 0x00000044) This register contains fields that configure the DMA
                                                                         transfer.*/
  __IOM uint32_t  SGR1;
} NRF_I3CCORE_DMA_CH1_Type;

/* I3CCORE_DMA_CH1_SAR1: This register contains the source address of the DMA transfer. */
  #define I3CCORE_DMA_CH1_SAR1_ResetValue (0x00000000UL)

/* SAR @Bits 0..31 : Current Source Address of DMA transfer. */
  #define I3CCORE_DMA_CH1_SAR1_SAR_Pos (0UL)
  #define I3CCORE_DMA_CH1_SAR1_SAR_Msk (0xFFFFFFFFUL << I3CCORE_DMA_CH1_SAR1_SAR_Pos)


/* I3CCORE_DMA_CH1_DAR1: This register contains the destination address of the DMA transfer. */
  #define I3CCORE_DMA_CH1_DAR1_ResetValue (0x00000000UL)

/* DAR @Bits 0..31 : Current Destination address of DMA transfer. */
  #define I3CCORE_DMA_CH1_DAR1_DAR_Pos (0UL)
  #define I3CCORE_DMA_CH1_DAR1_DAR_Msk (0xFFFFFFFFUL << I3CCORE_DMA_CH1_DAR1_DAR_Pos)


/* I3CCORE_DMA_CH1_CTL1L: This register contains fields that control the DMA transfer. */
  #define I3CCORE_DMA_CH1_CTL1L_ResetValue (0x00F04805UL)

