pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INTEN @Bit 0 : Interrupt Enable Bit. */
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_Pos (0UL)
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_INTEN_Pos)
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_Max (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_INTERRUPT_DISABLE (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_INTEN_INTERRUPT_ENABLE (0x1UL)

/* RSVDDSTTRWIDTH @Bits 1..3 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDSTTRWIDTH_Pos (1UL)
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDSTTRWIDTH_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_RSVDDSTTRWIDTH_Pos) /*!< Bit mask of
                                                                            RSVDDSTTRWIDTH field.*/

/* SRCTRWIDTH @Bits 4..6 : Source Transfer Width. */
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Pos (4UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Pos) /*!< Bit mask of SRCTRWIDTH
                                                                            field.*/
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_Max (0x7UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_0 (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_1 (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_2 (0x2UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_3 (0x3UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_4 (0x4UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_5 (0x5UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_6 (0x6UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCTRWIDTH_SRC_TR_WIDTH_7 (0x7UL)

/* DINC @Bits 7..8 : Destination Address Increment. */
  #define I3CCORE_DMA_CH1_CTL1L_DINC_Pos (7UL)
  #define I3CCORE_DMA_CH1_CTL1L_DINC_Msk (0x3UL << I3CCORE_DMA_CH1_CTL1L_DINC_Pos)
  #define I3CCORE_DMA_CH1_CTL1L_DINC_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_DINC_Max (0x3UL)
  #define I3CCORE_DMA_CH1_CTL1L_DINC_DINC_0 (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_DINC_DINC_1 (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1L_DINC_DINC_2 (0x2UL)
  #define I3CCORE_DMA_CH1_CTL1L_DINC_DINC_3 (0x3UL)

/* SINC @Bits 9..10 : Source Address Increment. */
  #define I3CCORE_DMA_CH1_CTL1L_SINC_Pos (9UL)
  #define I3CCORE_DMA_CH1_CTL1L_SINC_Msk (0x3UL << I3CCORE_DMA_CH1_CTL1L_SINC_Pos)
  #define I3CCORE_DMA_CH1_CTL1L_SINC_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_SINC_Max (0x3UL)
  #define I3CCORE_DMA_CH1_CTL1L_SINC_SINC_0 (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_SINC_SINC_1 (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1L_SINC_SINC_2 (0x2UL)
  #define I3CCORE_DMA_CH1_CTL1L_SINC_SINC_3 (0x3UL)

/* DESTMSIZE @Bits 11..13 : Destination Burst Transaction Length. */
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Pos (11UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Pos)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_Max (0x7UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_0 (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_1 (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_2 (0x2UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_3 (0x3UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_4 (0x4UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_5 (0x5UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_6 (0x6UL)
  #define I3CCORE_DMA_CH1_CTL1L_DESTMSIZE_DEST_MSIZE_7 (0x7UL)

/* SRCMSIZE @Bits 14..16 : Source Burst Transaction Length. */
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Pos (14UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Pos)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_Max (0x7UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_0 (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_1 (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_2 (0x2UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_3 (0x3UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_4 (0x4UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_5 (0x5UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_6 (0x6UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCMSIZE_SRC_MSIZE_7 (0x7UL)

/* SRCGATHEREN @Bit 17 : Source gather enable. */
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Pos (17UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Pos) /*!< Bit mask of SRCGATHEREN
                                                                            field.*/
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_Max (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_SRC_GATHER_DISABLE (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_SRCGATHEREN_SRC_GATHER_ENABLE (0x1UL)

/* RSVDDSTSCATTEREN @Bit 18 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDSTSCATTEREN_Pos (18UL)
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDSTSCATTEREN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_RSVDDSTSCATTEREN_Pos) /*!< Bit mask of
                                                                            RSVDDSTSCATTEREN field.*/

/* RSVDCTL @Bit 19 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDCTL_Pos (19UL)
  #define I3CCORE_DMA_CH1_CTL1L_RSVDCTL_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_RSVDCTL_Pos)

/* TTFC @Bits 20..22 : Transfer Type and Flow Control. */
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_Pos (20UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_TTFC_Pos)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_Max (0x7UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_0 (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_1 (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_2 (0x2UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_3 (0x3UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_4 (0x4UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_5 (0x5UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_6 (0x6UL)
  #define I3CCORE_DMA_CH1_CTL1L_TTFC_TT_FC_7 (0x7UL)

/* RSVDDMS @Bits 23..24 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDMS_Pos (23UL)
  #define I3CCORE_DMA_CH1_CTL1L_RSVDDMS_Msk (0x3UL << I3CCORE_DMA_CH1_CTL1L_RSVDDMS_Pos)

/* RSVDSMS @Bits 25..26 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDSMS_Pos (25UL)
  #define I3CCORE_DMA_CH1_CTL1L_RSVDSMS_Msk (0x3UL << I3CCORE_DMA_CH1_CTL1L_RSVDSMS_Pos)

