pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RSVDLLPDSTEN @Bit 27 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDLLPDSTEN_Pos (27UL)
  #define I3CCORE_DMA_CH1_CTL1L_RSVDLLPDSTEN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_RSVDLLPDSTEN_Pos) /*!< Bit mask of RSVDLLPDSTEN
                                                                            field.*/

/* RSVDLLPSRCEN @Bit 28 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVDLLPSRCEN_Pos (28UL)
  #define I3CCORE_DMA_CH1_CTL1L_RSVDLLPSRCEN_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1L_RSVDLLPSRCEN_Pos) /*!< Bit mask of RSVDLLPSRCEN
                                                                            field.*/

/* RSVD1CTL @Bits 29..31 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1L_RSVD1CTL_Pos (29UL)
  #define I3CCORE_DMA_CH1_CTL1L_RSVD1CTL_Msk (0x7UL << I3CCORE_DMA_CH1_CTL1L_RSVD1CTL_Pos)


/* I3CCORE_DMA_CH1_CTL1H: This register contains fields that control the DMA transfer. */
  #define I3CCORE_DMA_CH1_CTL1H_ResetValue (0x00000002UL)

/* BLOCKTS @Bits 0..4 : Block Transfer Size. */
  #define I3CCORE_DMA_CH1_CTL1H_BLOCKTS_Pos (0UL)
  #define I3CCORE_DMA_CH1_CTL1H_BLOCKTS_Msk (0x1FUL << I3CCORE_DMA_CH1_CTL1H_BLOCKTS_Pos)

/* RSVD2CTL @Bits 5..11 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CTL1H_RSVD2CTL_Pos (5UL)
  #define I3CCORE_DMA_CH1_CTL1H_RSVD2CTL_Msk (0x7FUL << I3CCORE_DMA_CH1_CTL1H_RSVD2CTL_Pos)

/* DONE @Bit 12 : Done bit. */
  #define I3CCORE_DMA_CH1_CTL1H_DONE_Pos (12UL)
  #define I3CCORE_DMA_CH1_CTL1H_DONE_Msk (0x1UL << I3CCORE_DMA_CH1_CTL1H_DONE_Pos)
  #define I3CCORE_DMA_CH1_CTL1H_DONE_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1H_DONE_Max (0x1UL)
  #define I3CCORE_DMA_CH1_CTL1H_DONE_DISABLED (0x0UL)
  #define I3CCORE_DMA_CH1_CTL1H_DONE_ENABLED (0x1UL)


/* I3CCORE_DMA_CH1_CFG1L: This register contains fields that configure the DMA transfer. */
  #define I3CCORE_DMA_CH1_CFG1L_ResetValue (0x00000E20UL)

/* RSVDCFG @Bits 0..4 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDCFG_Pos (0UL)
  #define I3CCORE_DMA_CH1_CFG1L_RSVDCFG_Msk (0x1FUL << I3CCORE_DMA_CH1_CFG1L_RSVDCFG_Pos)

/* CHPRIOR @Bits 5..7 : Channel Priority. */
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Pos (5UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Msk (0x7UL << I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Pos)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_Max (0x7UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_0 (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_1 (0x1UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_2 (0x2UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_3 (0x3UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_4 (0x4UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_5 (0x5UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_6 (0x6UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHPRIOR_CH_PRIOR_7 (0x7UL)

/* CHSUSP @Bit 8 : Channel Suspend. */
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_Pos (8UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_CHSUSP_Pos)
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_Max (0x1UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_NOT_SUSPENDED (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_CHSUSP_SUSPENDED (0x1UL)

/* FIFOEMPTY @Bit 9 : Channel FIFO status. */
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Pos (9UL)
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Pos)
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_Max (0x1UL)
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_NOT_EMPTY (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_FIFOEMPTY_EMPTY (0x1UL)

/* HSSELDST @Bit 10 : Destination Software or Hardware Handshaking Select. */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Pos (10UL)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_HSSELDST_Pos)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_Max (0x1UL)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_HARDWARE_HS (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELDST_SOFTWARE_HS (0x1UL)

/* HSSELSRC @Bit 11 : Source Software or Hardware Handshaking Select. */
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Pos (11UL)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Pos)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_Max (0x1UL)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_HARDWARE_HS (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_HSSELSRC_SOFTWARE_HS (0x1UL)

/* RSVDLOCKCHL @Bits 12..13 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Pos (12UL)
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Msk (0x3UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCHL_Pos) /*!< Bit mask of RSVDLOCKCHL
                                                                            field.*/

/* RSVDLOCKBL @Bits 14..15 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Pos (14UL)
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Msk (0x3UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKBL_Pos) /*!< Bit mask of RSVDLOCKBL
                                                                            field.*/

/* RSVDLOCKCH @Bit 16 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Pos (16UL)
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKCH_Pos) /*!< Bit mask of RSVDLOCKCH
                                                                            field.*/

/* RSVDLOCKB @Bit 17 : Reserved field - read-only */
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Pos (17UL)
  #define I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_RSVDLOCKB_Pos)

/* DSTHSPOL @Bit 18 : Destination Handshaking Interface Polarity. */
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Pos (18UL)
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Msk (0x1UL << I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Pos)
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Min (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_Max (0x1UL)
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_ACTIVE_HIGH (0x0UL)
  #define I3CCORE_DMA_CH1_CFG1L_DSTHSPOL_ACTIVE_LOW (0x1UL)

