pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3CCORE_DMA_INT_RAWDSTTRAN: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_ResetValue (0x00000000UL)

/* RAW @Bits 0..1 : Raw Status for IntDstTran Interrupt */
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Pos (0UL)
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Pos)
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Min (0x0UL)
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_Max (0x1UL)
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_RAWDSTTRAN_RAW_ACTIVE (0x1UL)


/* I3CCORE_DMA_INT_RAWERR: Interrupt events are stored in this Raw Interrupt Status register before masking. */
  #define I3CCORE_DMA_INT_RAWERR_ResetValue (0x00000000UL)

/* RAW @Bits 0..1 : Raw Status for IntErr Interrupt */
  #define I3CCORE_DMA_INT_RAWERR_RAW_Pos (0UL)
  #define I3CCORE_DMA_INT_RAWERR_RAW_Msk (0x3UL << I3CCORE_DMA_INT_RAWERR_RAW_Pos)
  #define I3CCORE_DMA_INT_RAWERR_RAW_Min (0x0UL)
  #define I3CCORE_DMA_INT_RAWERR_RAW_Max (0x1UL)
  #define I3CCORE_DMA_INT_RAWERR_RAW_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_RAWERR_RAW_ACTIVE (0x1UL)


/* I3CCORE_DMA_INT_STATUSTFR: Channel DMA Transfer complete interrupt event from all channels is stored in this Interrupt Status
                               register after masking. */

  #define I3CCORE_DMA_INT_STATUSTFR_ResetValue (0x00000000UL)

/* STATUS @Bits 0..1 : Status for IntTfr Interrupt */
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_Pos (0UL)
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSTFR_STATUS_Pos)
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSTFR_STATUS_ACTIVE (0x1UL)


/* I3CCORE_DMA_INT_STATUSBLOCK: Channel Block complete interrupt event from all channels is stored in this Interrupt Status
                                 register after masking. */

  #define I3CCORE_DMA_INT_STATUSBLOCK_ResetValue (0x00000000UL)

/* STATUS @Bits 0..1 : Status for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Pos (0UL)
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Pos) /*!< Bit mask of STATUS
                                                                            field.*/
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSBLOCK_STATUS_ACTIVE (0x1UL)


/* I3CCORE_DMA_INT_STATUSSRCTRAN: Channel Source Transaction complete interrupt event from all channels is stored in this
                                   Interrupt Status register after masking. */

  #define I3CCORE_DMA_INT_STATUSSRCTRAN_ResetValue (0x00000000UL)

/* STATUS @Bits 0..1 : Status for IntSrcTran Interrupt */
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Pos (0UL)
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Pos) /*!< Bit mask of STATUS
                                                                            field.*/
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSSRCTRAN_STATUS_ACTIVE (0x1UL)


/* I3CCORE_DMA_INT_STATUSDSTTRAN: Channel destination transaction complete interrupt event from all channels is stored in this
                                   Interrupt Status register after masking. */

  #define I3CCORE_DMA_INT_STATUSDSTTRAN_ResetValue (0x00000000UL)

/* STATUS @Bits 0..1 : Status for IntDstTran Interrupt */
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Pos (0UL)
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Pos) /*!< Bit mask of STATUS
                                                                            field.*/
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSDSTTRAN_STATUS_ACTIVE (0x1UL)


/* I3CCORE_DMA_INT_STATUSERR: Channel Error interrupt event from all channels is stored in this Interrupt Status register after
                               masking. */

  #define I3CCORE_DMA_INT_STATUSERR_ResetValue (0x00000000UL)

/* STATUS @Bits 0..1 : Status for IntErr Interrupt */
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_Pos (0UL)
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_Msk (0x3UL << I3CCORE_DMA_INT_STATUSERR_STATUS_Pos)
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSERR_STATUS_ACTIVE (0x1UL)


/* I3CCORE_DMA_INT_MASKTFR: The contents of the Raw Status register RawTfr is masked with the contents of the Mask register
                             MaskTfr. */

  #define I3CCORE_DMA_INT_MASKTFR_ResetValue (0x00000000UL)

/* INTMASK @Bits 0..1 : Mask for IntTfr Interrupt */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_Pos (0UL)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKTFR_INTMASK_Pos)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_MASK (0x0UL)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASK_UNMASK (0x1UL)

/* RSVDMASKTFR @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_INT_MASKTFR_RSVDMASKTFR_Pos (2UL)
  #define I3CCORE_DMA_INT_MASKTFR_RSVDMASKTFR_Msk (0x3FUL << I3CCORE_DMA_INT_MASKTFR_RSVDMASKTFR_Pos) /*!< Bit mask of
                                                                            RSVDMASKTFR field.*/

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Pos (8UL)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Pos) /*!< Bit mask of INTMASKWE
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_DISABLED (0x0UL)
  #define I3CCORE_DMA_INT_MASKTFR_INTMASKWE_ENABLED (0x1UL)


