pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3CCORE_DMA_INT_MASKBLOCK: The contents of the Raw Status register RawBlock is masked with the contents of the Mask register
                               MaskBlock. */

  #define I3CCORE_DMA_INT_MASKBLOCK_ResetValue (0x00000000UL)

/* INTMASK @Bits 0..1 : Mask for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Pos (0UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Pos) /*!< Bit mask of INTMASK
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_MASK (0x0UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASK_UNMASK (0x1UL)

/* RSVDMASKBLOCK @Bits 2..7 : Reserved field- read-only */
  #define I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Pos (2UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Msk (0x3FUL << I3CCORE_DMA_INT_MASKBLOCK_RSVDMASKBLOCK_Pos) /*!< Bit mask of
                                                                            RSVDMASKBLOCK field.*/

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Pos (8UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Pos) /*!< Bit mask of INTMASKWE
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_DISABLED (0x0UL)
  #define I3CCORE_DMA_INT_MASKBLOCK_INTMASKWE_ENABLED (0x1UL)


/* I3CCORE_DMA_INT_MASKSRCTRAN: The contents of the Raw Status register RawSrcTran is masked with the contents of the Mask
                                 register MaskSrcTran. */

  #define I3CCORE_DMA_INT_MASKSRCTRAN_ResetValue (0x00000000UL)

/* INTMASK @Bits 0..1 : Mask for IntSrcTran Interrupt */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Pos (0UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Pos) /*!< Bit mask of INTMASK
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_MASK (0x0UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASK_UNMASK (0x1UL)

/* RSVDMASKSRCTRAN @Bits 2..7 : Reserved field- read-only */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_RSVDMASKSRCTRAN_Pos (2UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_RSVDMASKSRCTRAN_Msk (0x3FUL << I3CCORE_DMA_INT_MASKSRCTRAN_RSVDMASKSRCTRAN_Pos) /*!< Bit
                                                                            mask of RSVDMASKSRCTRAN field.*/

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Pos (8UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Pos) /*!< Bit mask of
                                                                            INTMASKWE field.*/
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_DISABLED (0x0UL)
  #define I3CCORE_DMA_INT_MASKSRCTRAN_INTMASKWE_ENABLED (0x1UL)


/* I3CCORE_DMA_INT_MASKDSTTRAN: The contents of the Raw Status register RawDstTran is masked with the contents of the Mask
                                 register MaskDstTran. */

  #define I3CCORE_DMA_INT_MASKDSTTRAN_ResetValue (0x00000000UL)

/* INTMASK @Bits 0..1 : Mask for IntDstTran Interrupt */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Pos (0UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Pos) /*!< Bit mask of INTMASK
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_MASK (0x0UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASK_UNMASK (0x1UL)

/* RSVDMASKDSTTRAN @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_RSVDMASKDSTTRAN_Pos (2UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_RSVDMASKDSTTRAN_Msk (0x3FUL << I3CCORE_DMA_INT_MASKDSTTRAN_RSVDMASKDSTTRAN_Pos) /*!< Bit
                                                                            mask of RSVDMASKDSTTRAN field.*/

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Pos (8UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Pos) /*!< Bit mask of
                                                                            INTMASKWE field.*/
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_DISABLED (0x0UL)
  #define I3CCORE_DMA_INT_MASKDSTTRAN_INTMASKWE_ENABLED (0x1UL)


/* I3CCORE_DMA_INT_MASKERR: The contents of the Raw Status register RawErr is masked with the contents of the Mask register
                             MaskErr. */

  #define I3CCORE_DMA_INT_MASKERR_ResetValue (0x00000000UL)

/* INTMASK @Bits 0..1 : Mask for IntErr Interrupt */
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_Pos (0UL)
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_Msk (0x3UL << I3CCORE_DMA_INT_MASKERR_INTMASK_Pos)
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_MASK (0x0UL)
  #define I3CCORE_DMA_INT_MASKERR_INTMASK_UNMASK (0x1UL)

/* RSVDMASKERR @Bits 2..7 : Reserved field- read-only */
  #define I3CCORE_DMA_INT_MASKERR_RSVDMASKERR_Pos (2UL)
  #define I3CCORE_DMA_INT_MASKERR_RSVDMASKERR_Msk (0x3FUL << I3CCORE_DMA_INT_MASKERR_RSVDMASKERR_Pos) /*!< Bit mask of
                                                                            RSVDMASKERR field.*/

/* INTMASKWE @Bits 8..9 : Interrupt Mask Write Enable */
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_Pos (8UL)
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_Msk (0x3UL << I3CCORE_DMA_INT_MASKERR_INTMASKWE_Pos) /*!< Bit mask of INTMASKWE
                                                                            field.*/
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_Min (0x0UL)
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_Max (0x1UL)
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_DISABLED (0x0UL)
  #define I3CCORE_DMA_INT_MASKERR_INTMASKWE_ENABLED (0x1UL)


