pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* I3CCORE_DMA_INT_CLEARTFR: Each bit in the RawTfr and StatusTfr is cleared on the same cycle by writing a 1 to the
                              corresponding location in the this registers. */

  #define I3CCORE_DMA_INT_CLEARTFR_ResetValue (0x00000000UL)

/* CLEAR @Bits 0..1 : Clear for IntTfr Interrupt */
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_Pos (0UL)
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_Msk (0x3UL << I3CCORE_DMA_INT_CLEARTFR_CLEAR_Pos)
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_Min (0x0UL)
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_Max (0x1UL)
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_NOT_CLEAR (0x0UL)
  #define I3CCORE_DMA_INT_CLEARTFR_CLEAR_CLEAR (0x1UL)


/* I3CCORE_DMA_INT_CLEARBLOCK: Each bit in the RawBlock and StatusBlock is cleared on the same cycle by writing a 1 to the
                                corresponding location in the this registers. */

  #define I3CCORE_DMA_INT_CLEARBLOCK_ResetValue (0x00000000UL)

/* CLEAR @Bits 0..1 : Clear for IntBlock Interrupt */
  #define I3CCORE_DMA_INT_CLEARBLOCK_CLEAR_Pos (0UL)
  #define I3CCORE_DMA_INT_CLEARBLOCK_CLEAR_Msk (0x3UL << I3CCORE_DMA_INT_CLEARBLOCK_CLEAR_Pos)


/* I3CCORE_DMA_INT_CLEARSRCTRAN: Each bit in the RawSrcTran and StatusSrcTran is cleared on the same cycle by writing a 1 to the
                                  corresponding location in the this registers. */

  #define I3CCORE_DMA_INT_CLEARSRCTRAN_ResetValue (0x00000000UL)

/* CLEAR @Bits 0..1 : Clear for IntSrcTran Interrupt */
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Pos (0UL)
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Msk (0x3UL << I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Pos) /*!< Bit mask of CLEAR
                                                                            field.*/
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Min (0x0UL)
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_Max (0x1UL)
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_NOT_CLEAR (0x0UL)
  #define I3CCORE_DMA_INT_CLEARSRCTRAN_CLEAR_CLEAR (0x1UL)


/* I3CCORE_DMA_INT_CLEARDSTTRAN: Each bit in the RawDstTran and StatusDstTran is cleared on the same cycle by writing a 1 to the
                                  corresponding location in the this registers. */

  #define I3CCORE_DMA_INT_CLEARDSTTRAN_ResetValue (0x00000000UL)

/* CLEAR @Bits 0..1 : Clear for IntDstTran Interrupt */
  #define I3CCORE_DMA_INT_CLEARDSTTRAN_CLEAR_Pos (0UL)
  #define I3CCORE_DMA_INT_CLEARDSTTRAN_CLEAR_Msk (0x3UL << I3CCORE_DMA_INT_CLEARDSTTRAN_CLEAR_Pos) /*!< Bit mask of CLEAR
                                                                            field.*/
  #define I3CCORE_DMA_INT_CLEARDSTTRAN_CLEAR_Min (0x0UL)
  #define I3CCORE_DMA_INT_CLEARDSTTRAN_CLEAR_Max (0x1UL)
  #define I3CCORE_DMA_INT_CLEARDSTTRAN_CLEAR_NOT_CLEAR (0x0UL)
  #define I3CCORE_DMA_INT_CLEARDSTTRAN_CLEAR_CLEAR (0x1UL)


/* I3CCORE_DMA_INT_CLEARERR: Each bit in the RawErr and StatusErr is cleared on the same cycle by writing a 1 to the
                              corresponding location in the this registers. */

  #define I3CCORE_DMA_INT_CLEARERR_ResetValue (0x00000000UL)

/* CLEAR @Bits 0..1 : Clear for IntErr Interrupt */
  #define I3CCORE_DMA_INT_CLEARERR_CLEAR_Pos (0UL)
  #define I3CCORE_DMA_INT_CLEARERR_CLEAR_Msk (0x3UL << I3CCORE_DMA_INT_CLEARERR_CLEAR_Pos)
  #define I3CCORE_DMA_INT_CLEARERR_CLEAR_Min (0x0UL)
  #define I3CCORE_DMA_INT_CLEARERR_CLEAR_Max (0x1UL)
  #define I3CCORE_DMA_INT_CLEARERR_CLEAR_NOT_CLEAR (0x0UL)
  #define I3CCORE_DMA_INT_CLEARERR_CLEAR_CLEAR (0x1UL)


/* I3CCORE_DMA_INT_STATUSINT: The contents of each of the five Status registers StatusTfr, StatusBlock, StatusSrcTran,
                               StatusDstTran, StatusErr is ORed to produce a single bit for each interrupt type in the Combined
                               Status register (StatusInt). */

  #define I3CCORE_DMA_INT_STATUSINT_ResetValue (0x00000000UL)

/* TFR @Bit 0 : OR of the contents of StatusTfr register */
  #define I3CCORE_DMA_INT_STATUSINT_TFR_Pos (0UL)
  #define I3CCORE_DMA_INT_STATUSINT_TFR_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_TFR_Pos)
  #define I3CCORE_DMA_INT_STATUSINT_TFR_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_TFR_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSINT_TFR_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_TFR_ACTIVE (0x1UL)

/* BLOCK @Bit 1 : OR of the contents of StatusBlock register */
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_Pos (1UL)
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_BLOCK_Pos)
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_BLOCK_ACTIVE (0x1UL)

/* SRCT @Bit 2 : OR of the contents of StatusSrcTran */
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_Pos (2UL)
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_SRCT_Pos)
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_SRCT_ACTIVE (0x1UL)

/* DSTT @Bit 3 : OR of the contents of StatusDstTran */
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_Pos (3UL)
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_DSTT_Pos)
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_DSTT_ACTIVE (0x1UL)

/* ERR @Bit 4 : OR of the contents of StatusErr */
  #define I3CCORE_DMA_INT_STATUSINT_ERR_Pos (4UL)
  #define I3CCORE_DMA_INT_STATUSINT_ERR_Msk (0x1UL << I3CCORE_DMA_INT_STATUSINT_ERR_Pos)
  #define I3CCORE_DMA_INT_STATUSINT_ERR_Min (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_ERR_Max (0x1UL)
  #define I3CCORE_DMA_INT_STATUSINT_ERR_INACTIVE (0x0UL)
  #define I3CCORE_DMA_INT_STATUSINT_ERR_ACTIVE (0x1UL)



/* ============================================= Struct I3CCORE_DMA_SWHANDSHAKE ============================================== */
/**
  * @brief SWHANDSHAKE [I3CCORE_DMA_SWHANDSHAKE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  REQSRCREG;
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  REQDSTREG;
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  SGLRQSRCREG;
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  SGLRQDSTREG;
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  LSTSRCREG;
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  LSTDSTREG;
} NRF_I3CCORE_DMA_SWHANDSHAKE_Type;

/* I3CCORE_DMA_SWHANDSHAKE_REQSRCREG: A bit is assigned for each channel in this register. */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_ResetValue (0x00000000UL)

/* SRCREQ @Bits 0..1 : Source Software Transaction Request */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Pos (0UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Pos) /*!< Bit mask of
                                                                            SRCREQ field.*/
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Min (0x0UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_Max (0x1UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_INACTIVE (0x0UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQ_ACTIVE (0x1UL)

/* RSVDREQSRCREG @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_RSVDREQSRCREG_Pos (2UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_RSVDREQSRCREG_Msk (0x3FUL << I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_RSVDREQSRCREG_Pos)
                                                                            /*!< Bit mask of RSVDREQSRCREG field.*/

/* SRCREQWE @Bits 8..9 : Source Software Transaction Request write enable */
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Pos (8UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Msk (0x3UL << I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Pos) /*!< Bit mask
                                                                            of SRCREQWE field.*/
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Min (0x0UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_Max (0x1UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_DISABLED (0x0UL)
  #define I3CCORE_DMA_SWHANDSHAKE_REQSRCREG_SRCREQWE_ENABLED (0x1UL)


