pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define I3CCORE_DMA_MISC_DMACFGREG_ResetValue (0x00000000UL)

/* DMAEN @Bit 0 : DW_ahb_dmac Enable bit. */
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Pos)
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_DISABLED (0x0UL)
  #define I3CCORE_DMA_MISC_DMACFGREG_DMAEN_ENABLED (0x1UL)


/* I3CCORE_DMA_MISC_CHENREG: This is the DW_ahb_dmac Channel Enable Register. */
  #define I3CCORE_DMA_MISC_CHENREG_ResetValue (0x00000000UL)

/* CHEN @Bits 0..1 : Channel Enable. */
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_Pos (0UL)
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_Msk (0x3UL << I3CCORE_DMA_MISC_CHENREG_CHEN_Pos)
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_DISABLED (0x0UL)
  #define I3CCORE_DMA_MISC_CHENREG_CHEN_ENABLED (0x1UL)

/* RSVDCHENREG @Bits 2..7 : Reserved field - read-only */
  #define I3CCORE_DMA_MISC_CHENREG_RSVDCHENREG_Pos (2UL)
  #define I3CCORE_DMA_MISC_CHENREG_RSVDCHENREG_Msk (0x3FUL << I3CCORE_DMA_MISC_CHENREG_RSVDCHENREG_Pos) /*!< Bit mask of
                                                                            RSVDCHENREG field.*/

/* CHENWE @Bits 8..9 : Channel enable register */
  #define I3CCORE_DMA_MISC_CHENREG_CHENWE_Pos (8UL)
  #define I3CCORE_DMA_MISC_CHENREG_CHENWE_Msk (0x3UL << I3CCORE_DMA_MISC_CHENREG_CHENWE_Pos)


/* I3CCORE_DMA_MISC_DMAIDREG: This is the DW_ahb_dmac ID register, which is a read-only register that reads back the
                               coreConsultant-configured hardcoded ID number, DMAH_ID_NUM. */

  #define I3CCORE_DMA_MISC_DMAIDREG_ResetValue (0x00000000UL)

/* DMAID @Bits 0..31 : Hardcoded DW_ahb_dmac peripheral ID. */
  #define I3CCORE_DMA_MISC_DMAIDREG_DMAID_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMAIDREG_DMAID_Msk (0xFFFFFFFFUL << I3CCORE_DMA_MISC_DMAIDREG_DMAID_Pos) /*!< Bit mask of DMAID
                                                                            field.*/


/* I3CCORE_DMA_MISC_DMATESTREG: This register is used to put the AHB slave interface into test mode, during which the readback
                                 value of the writable registers match the value written, assuming the DW_ahb_dmac configuration
                                 has not optimized the same registers. */

  #define I3CCORE_DMA_MISC_DMATESTREG_ResetValue (0x00000000UL)

/* TESTSLVIF @Bit 0 : DMA Test register */
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Msk (0x1UL << I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Pos) /*!< Bit mask of
                                                                            TESTSLVIF field.*/
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_NORMAL_MODE (0x0UL)
  #define I3CCORE_DMA_MISC_DMATESTREG_TESTSLVIF_TEST_MODE (0x1UL)


/* I3CCORE_DMA_MISC_DMALPTIMEOUTREG: This register holds the timeout value of Low Power Counter. */
  #define I3CCORE_DMA_MISC_DMALPTIMEOUTREG_ResetValue (0x00000008UL)

/* DMALPTIMEOUT @Bits 0..3 : This field holds timeout value of low power counter register. */
  #define I3CCORE_DMA_MISC_DMALPTIMEOUTREG_DMALPTIMEOUT_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMALPTIMEOUTREG_DMALPTIMEOUT_Msk (0xFUL << I3CCORE_DMA_MISC_DMALPTIMEOUTREG_DMALPTIMEOUT_Pos) /*!<
                                                                            Bit mask of DMALPTIMEOUT field.*/


/* I3CCORE_DMA_MISC_DMACOMPPARAMS6L: DMA_COMP_PARAMS_6L is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 7. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_ResetValue (0x00000000UL)

/* CH7DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH7_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Pos) /*!< Bit mask of
                                                                            CH7DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_NO_HARDCODE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DTW_DTW_256 (0x6UL)

/* CH7STW @Bits 3..5 : The value of this register is derived from the DMAH_CH7_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Pos) /*!< Bit mask of
                                                                            CH7STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_NO_HARDCODE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STW_STW_256 (0x6UL)

/* CH7STATDST @Bit 6 : The value of this register is derived from the DMAH_CH7_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Pos (6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Pos) /*!< Bit
                                                                            mask of CH7STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATDST_TRUE (0x1UL)

/* CH7STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH7_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Pos (7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Pos) /*!< Bit
                                                                            mask of CH7STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7STATSRC_TRUE (0x1UL)

/* CH7DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH7_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH7DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DSTSCAEN_TRUE (0x1UL)

/* CH7SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH7_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Pos (9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH7SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SRCGATEN_TRUE (0x1UL)

