pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH7LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH7_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Pos (10UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Pos) /*!< Bit mask
                                                                            of CH7LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LOCKEN_TRUE (0x1UL)

/* CH7MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH7_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Pos (11UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH7MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MULTIBLKEN_TRUE (0x1UL)

/* CH7CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH7_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Pos (12UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH7CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7CTLWBEN_TRUE (0x1UL)

/* CH7HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH7_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Pos (13UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Pos) /*!< Bit mask
                                                                            of CH7HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7HCLLP_HARDCODED (0x1UL)

/* CH7FC @Bits 14..15 : The value of this register is derived from the DMAH_CH7_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Pos (14UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Pos) /*!< Bit mask of
                                                                            CH7FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_FC_DMA (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_FC_SRC (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_FC_DST (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FC_FC_ANY (0x3UL)

/* CH7MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH7_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Pos (16UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH7MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL)

/* CH7DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH7_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Pos (19UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Pos) /*!< Bit mask of
                                                                            CH7DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7DMS_PROGRAMMABLE (0x4UL)

/* CH7LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH7_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Pos (22UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Pos) /*!< Bit mask of
                                                                            CH7LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7LMS_PROGRAMMABLE (0x4UL)

