pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH7SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH7_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Pos (25UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Pos) /*!< Bit mask of
                                                                            CH7SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7SMS_PROGRAMMABLE (0x4UL)

/* CH7FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH7_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH7FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_Max (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_8 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_16 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_32 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_64 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_128 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS6L_CH7FIFODEPTH_FIFO_DEPTH_256 (0x5UL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS5L: DMA_COMP_PARAMS_5 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 5 and Channel 6. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_ResetValue (0x00000000UL)

/* CH6DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH6_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Pos) /*!< Bit mask of
                                                                            CH6DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DTW_TRANS_WIDTH_256 (0x6UL)

/* CH6STW @Bits 3..5 : The value of this register is derived from the DMAH_CH6_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Pos) /*!< Bit mask of
                                                                            CH6STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STW_TRANS_WIDTH_256 (0x6UL)

/* CH6STATDST @Bit 6 : The value of this register is derived from the DMAH_CH6_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Pos (6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Pos) /*!< Bit
                                                                            mask of CH6STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATDST_TRUE (0x1UL)

/* CH6STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH6_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Pos (7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Pos) /*!< Bit
                                                                            mask of CH6STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6STATSRC_TRUE (0x1UL)

/* CH6DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH6_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH6DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6DSTSCAEN_TRUE (0x1UL)

/* CH6SRCGATEN @Bit 9 : The value of this register is derived from the CH6_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Pos (9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH6SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5L_CH6SRCGATEN_TRUE (0x1UL)

