pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_ResetValue (0x00000000UL)

/* CH5DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH5_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Pos) /*!< Bit mask of
                                                                            CH5DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DTW_TRANS_WIDTH_256 (0x6UL)

/* CH5STW @Bits 3..5 : The value of this register is derived from the DMAH_CH5_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Pos) /*!< Bit mask of
                                                                            CH5STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STW_TRANS_WIDTH_256 (0x6UL)

/* CH5STATDST @Bit 6 : The value of this register is derived from the DMAH_CH5_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Pos (6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Pos) /*!< Bit
                                                                            mask of CH5STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATDST_TRUE (0x1UL)

/* CH5STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH5_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Pos (7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Pos) /*!< Bit
                                                                            mask of CH5STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5STATSRC_TRUE (0x1UL)

/* CH5DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH5_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH5DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DSTSCAEN_TRUE (0x1UL)

/* CH5SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH5_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Pos (9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH5SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SRCGATEN_TRUE (0x1UL)

/* CH5LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH5_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Pos (10UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Pos) /*!< Bit mask
                                                                            of CH5LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LOCKEN_TRUE (0x1UL)

/* CH5MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH5_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Pos (11UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH5MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MULTIBLKEN_TRUE (0x1UL)

/* CH5CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH5_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Pos (12UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH5CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5CTLWBEN_TRUE (0x1UL)

/* CH5HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH5_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Pos (13UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Pos) /*!< Bit mask
                                                                            of CH5HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5HCLLP_HARDCODED (0x1UL)

/* CH5FC @Bits 14..15 : The value of this register is derived from the DMAH_CH5_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Pos (14UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Pos) /*!< Bit mask of
                                                                            CH5FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_FC_DMA (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_FC_SRC (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_FC_DST (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FC_FC_ANY (0x3UL)

/* CH5MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH5_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Pos (16UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH5MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL)

/* CH5DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH5_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Pos (19UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Pos) /*!< Bit mask of
                                                                            CH5DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5DMS_PROGRAMMABLE (0x4UL)

/* CH5LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH5_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Pos (22UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Pos) /*!< Bit mask of
                                                                            CH5LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5LMS_PROGRAMMABLE (0x4UL)

/* CH5SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH5_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Pos (25UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Pos) /*!< Bit mask of
                                                                            CH5SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5SMS_PROGRAMMABLE (0x4UL)

/* CH5FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH5_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH5FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_Max (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_8 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_16 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_32 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_64 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_128 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS5H_CH5FIFODEPTH_FIFO_DEPTH_256 (0x5UL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS4L: DMA_COMP_PARAMS_4 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 3 and Channel 4. */

