pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_ResetValue (0x00000000UL)

/* CH4DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH4_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Pos) /*!< Bit mask of
                                                                            CH4DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DTW_TRANS_WIDTH_256 (0x6UL)

/* CH4STW @Bits 3..5 : The value of this register is derived from the DMAH_CH4_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Pos) /*!< Bit mask of
                                                                            CH4STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STW_TRANS_WIDTH_256 (0x6UL)

/* CH4STATDST @Bit 6 : The value of this register is derived from the DMAH_CH4_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Pos (6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Pos) /*!< Bit
                                                                            mask of CH4STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATDST_TRUE (0x1UL)

/* CH4STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH4_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Pos (7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Pos) /*!< Bit
                                                                            mask of CH4STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4STATSRC_TRUE (0x1UL)

/* CH4DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH4_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH4DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DSTSCAEN_TRUE (0x1UL)

/* CH4SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH4_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Pos (9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH4SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SRCGATEN_TRUE (0x1UL)

/* CH4LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH4_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Pos (10UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Pos) /*!< Bit mask
                                                                            of CH4LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LOCKEN_TRUE (0x1UL)

/* CH4MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH4_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Pos (11UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH4MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MULTIBLKEN_TRUE (0x1UL)

