pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH4CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH4_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Pos (12UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH4CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4CTLWBEN_TRUE (0x1UL)

/* CH4HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH4_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Pos (13UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Pos) /*!< Bit mask
                                                                            of CH4HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4HCLLP_HARDCODED (0x1UL)

/* CH4FC @Bits 14..15 : The value of this register is derived from the DMAH_CH4_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Pos (14UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Pos) /*!< Bit mask of
                                                                            CH4FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_FC_DMA (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_FC_SRC (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_FC_DST (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FC_FC_ANY (0x3UL)

/* CH4MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH4_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Pos (16UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH4MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL)

/* CH4DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH4_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Pos (19UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Pos) /*!< Bit mask of
                                                                            CH4DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4DMS_PROGRAMMABLE (0x4UL)

/* CH4LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH4_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Pos (22UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Pos) /*!< Bit mask of
                                                                            CH4LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4LMS_PROGRAMMABLE (0x4UL)

/* CH4SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH4_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Pos (25UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Pos) /*!< Bit mask of
                                                                            CH4SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4SMS_PROGRAMMABLE (0x4UL)

/* CH4FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH4_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH4FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_Max (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_8 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_16 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_32 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_64 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_128 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4L_CH4FIFODEPTH_FIFO_DEPTH_256 (0x5UL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS4H: DMA_COMP_PARAMS_4 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 3 and Channel 4. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_ResetValue (0x00000000UL)

/* CH3DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH3_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Pos) /*!< Bit mask of
                                                                            CH3DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DTW_TRANS_WIDTH_256 (0x6UL)

/* CH3STW @Bits 3..5 : The value of this register is derived from the DMAH_CH3_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Pos) /*!< Bit mask of
                                                                            CH3STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STW_TRANS_WIDTH_256 (0x6UL)

/* CH3STATDST @Bit 6 : The value of this register is derived from the DMAH_CH3_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Pos (6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Pos) /*!< Bit
                                                                            mask of CH3STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATDST_TRUE (0x1UL)

/* CH3STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH3_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Pos (7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Pos) /*!< Bit
                                                                            mask of CH3STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3STATSRC_TRUE (0x1UL)

/* CH3DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH3_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH3DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DSTSCAEN_TRUE (0x1UL)

/* CH3SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH3_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Pos (9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH3SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SRCGATEN_TRUE (0x1UL)

