pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH3LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH3_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LOCKEN_Pos (10UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LOCKEN_Pos) /*!< Bit mask
                                                                            of CH3LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LOCKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LOCKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LOCKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LOCKEN_TRUE (0x1UL)

/* CH3MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH3_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MULTIBLKEN_Pos (11UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH3MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MULTIBLKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MULTIBLKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MULTIBLKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MULTIBLKEN_TRUE (0x1UL)

/* CH3CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH3_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3CTLWBEN_Pos (12UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH3CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3CTLWBEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3CTLWBEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3CTLWBEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3CTLWBEN_TRUE (0x1UL)

/* CH3HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH3_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3HCLLP_Pos (13UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3HCLLP_Pos) /*!< Bit mask
                                                                            of CH3HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3HCLLP_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3HCLLP_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3HCLLP_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3HCLLP_HARDCODED (0x1UL)

/* CH3FC @Bits 14..15 : The value of this register is derived from the DMAH_CH3_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_Pos (14UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_Pos) /*!< Bit mask of
                                                                            CH3FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_FC_DMA (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_FC_SRC (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_FC_DST (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FC_FC_ANY (0x3UL)

/* CH3MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH3_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_Pos (16UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH3MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL)

/* CH3DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH3_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_Pos (19UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_Pos) /*!< Bit mask of
                                                                            CH3DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3DMS_PROGRAMMABLE (0x4UL)

/* CH3LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH3_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_Pos (22UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_Pos) /*!< Bit mask of
                                                                            CH3LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3LMS_PROGRAMMABLE (0x4UL)

/* CH3SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH3_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_Pos (25UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_Pos) /*!< Bit mask of
                                                                            CH3SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3SMS_PROGRAMMABLE (0x4UL)

/* CH3FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH3_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH3FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_Max (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_FIFO_DEPTH_8 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_FIFO_DEPTH_16 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_FIFO_DEPTH_32 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_FIFO_DEPTH_64 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_FIFO_DEPTH_128 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS4H_CH3FIFODEPTH_FIFO_DEPTH_256 (0x5UL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS3L: DMA_COMP_PARAMS_3 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 1 and Channel 2. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_ResetValue (0x00000000UL)

/* CH2DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH2_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_Pos) /*!< Bit mask of
                                                                            CH2DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DTW_TRANS_WIDTH_256 (0x6UL)

/* CH2STW @Bits 3..5 : The value of this register is derived from the DMAH_CH2_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_Pos) /*!< Bit mask of
                                                                            CH2STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STW_TRANS_WIDTH_256 (0x6UL)

/* CH2STATDST @Bit 6 : The value of this register is derived from the DMAH_CH2_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATDST_Pos (6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATDST_Pos) /*!< Bit
                                                                            mask of CH2STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATDST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATDST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATDST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATDST_TRUE (0x1UL)

/* CH2STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH2_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATSRC_Pos (7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATSRC_Pos) /*!< Bit
                                                                            mask of CH2STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATSRC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATSRC_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATSRC_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2STATSRC_TRUE (0x1UL)

