pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH2DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH2_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH2DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DSTSCAEN_TRUE (0x1UL)

/* CH2SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH2_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Pos (9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH2SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SRCGATEN_TRUE (0x1UL)

/* CH2LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH2_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Pos (10UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Pos) /*!< Bit mask
                                                                            of CH2LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LOCKEN_TRUE (0x1UL)

/* CH2MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH2_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Pos (11UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH2MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MULTIBLKEN_TRUE (0x1UL)

/* CH2CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH2_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Pos (12UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH2CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2CTLWBEN_TRUE (0x1UL)

/* CH2HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH2_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Pos (13UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Pos) /*!< Bit mask
                                                                            of CH2HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2HCLLP_HARDCODED (0x1UL)

/* CH2FC @Bits 14..15 : The value of this register is derived from the DMAH_CH2_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Pos (14UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Pos) /*!< Bit mask of
                                                                            CH2FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_FC_DMA (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_FC_SRC (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_FC_DST (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FC_FC_ANY (0x3UL)

/* CH2MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH2_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Pos (16UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH2MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL)

/* CH2DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH2_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Pos (19UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Pos) /*!< Bit mask of
                                                                            CH2DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2DMS_PROGRAMMABLE (0x4UL)

