pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH2LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH2_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Pos (22UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Pos) /*!< Bit mask of
                                                                            CH2LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2LMS_PROGRAMMALE (0x4UL)

/* CH2SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH2_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Pos (25UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Pos) /*!< Bit mask of
                                                                            CH2SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2SMS_PROGRAMMALE (0x4UL)

/* CH2FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH2_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH2FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_Max (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_8 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_16 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_32 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_64 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_128 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3L_CH2FIFODEPTH_FIFO_DEPTH_256 (0x5UL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS3H: DMA_COMP_PARAMS_3 is a constant read-only register that contains encoded information about
                                      the component parameter settings for Channel 1 and Channel 2. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_ResetValue (0x1109A203UL)

/* CH1DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH1_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Pos) /*!< Bit mask of
                                                                            CH1DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DTW_TRANS_WIDTH_256 (0x6UL)

/* CH1STW @Bits 3..5 : The value of this register is derived from the DMAH_CH1_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Pos) /*!< Bit mask of
                                                                            CH1STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STW_TRANS_WIDTH_256 (0x6UL)

/* CH1STATDST @Bit 6 : The value of this register is derived from the DMAH_CH1_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Pos (6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Pos) /*!< Bit
                                                                            mask of CH1STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATDST_TRUE (0x1UL)

/* CH1STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH1_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Pos (7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Pos) /*!< Bit
                                                                            mask of CH1STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1STATSRC_TRUE (0x1UL)

/* CH1DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH1_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH1DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DSTSCAEN_TRUE (0x1UL)

/* CH1SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH1_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Pos (9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH1SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SRCGATEN_TRUE (0x1UL)

