pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH1LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH1_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Pos (10UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Pos) /*!< Bit mask
                                                                            of CH1LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LOCKEN_TRUE (0x1UL)

/* CH1MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH1_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Pos (11UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH1MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MULTIBLKEN_TRUE (0x1UL)

/* CH1CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH1_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Pos (12UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH1CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1CTLWBEN_TRUE (0x1UL)

/* CH1HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH1_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Pos (13UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Pos) /*!< Bit mask
                                                                            of CH1HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1HCLLP_HARDCODED (0x1UL)

/* CH1FC @Bits 14..15 : The value of this register is derived from the DMAH_CH1_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Pos (14UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Pos) /*!< Bit mask of
                                                                            CH1FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_FC_DMA (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_FC_SRC (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_FC_DST (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FC_FC_ANY (0x3UL)

/* CH1MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH1_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Pos (16UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH1MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL)

/* CH1DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH1_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Pos (19UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Pos) /*!< Bit mask of
                                                                            CH1DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1DMS_PROGRAMMABLE (0x4UL)

/* CH1LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH1_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Pos (22UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Pos) /*!< Bit mask of
                                                                            CH1LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1LMS_PROGRAMMABLE (0x4UL)

/* CH1SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH1_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Pos (25UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Pos) /*!< Bit mask of
                                                                            CH1SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1SMS_PROGRAMMABLE (0x4UL)

/* CH1FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH1_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH1FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_Max (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_8 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_16 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_32 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_64 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_128 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS3H_CH1FIFODEPTH_FIFO_DEPTH_256 (0x5UL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS2L: DMA_COMP_PARAMS_2 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_ResetValue (0x13016118UL)

