pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH0DTW @Bits 0..2 : The value of this register is derived from the DMAH_CH0_DTW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Pos) /*!< Bit mask of
                                                                            CH0DTW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DTW_TRANS_WIDTH_256 (0x6UL)

/* CH0STW @Bits 3..5 : The value of this register is derived from the DMAH_CH0_STW coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Pos) /*!< Bit mask of
                                                                            CH0STW field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STW_TRANS_WIDTH_256 (0x6UL)

/* CH0STATDST @Bit 6 : The value of this register is derived from the DMAH_CH0_STAT_DST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Pos (6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Pos) /*!< Bit
                                                                            mask of CH0STATDST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATDST_TRUE (0x1UL)

/* CH0STATSRC @Bit 7 : The value of this register is derived from the DMAH_CH0_STAT_SRC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Pos (7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Pos) /*!< Bit
                                                                            mask of CH0STATSRC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0STATSRC_TRUE (0x1UL)

/* CH0DSTSCAEN @Bit 8 : The value of this register is derived from the DMAH_CH0_DST_SCA_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Pos) /*!< Bit
                                                                            mask of CH0DSTSCAEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DSTSCAEN_TRUE (0x1UL)

/* CH0SRCGATEN @Bit 9 : The value of this register is derived from the DMAH_CH0_SRC_GAT_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Pos (9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Pos) /*!< Bit
                                                                            mask of CH0SRCGATEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SRCGATEN_TRUE (0x1UL)

/* CH0LOCKEN @Bit 10 : The value of this register is derived from the DMAH_CH0_LOCK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Pos (10UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Pos) /*!< Bit mask
                                                                            of CH0LOCKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LOCKEN_TRUE (0x1UL)

/* CH0MULTIBLKEN @Bit 11 : The value of this register is derived from the DMAH_CH0_MULTI_BLK_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Pos (11UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Pos) /*!<
                                                                            Bit mask of CH0MULTIBLKEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MULTIBLKEN_TRUE (0x1UL)

