pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH0CTLWBEN @Bit 12 : The value of this register is derived from the DMAH_CH0_CTL_WB_EN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Pos (12UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Pos) /*!< Bit
                                                                            mask of CH0CTLWBEN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0CTLWBEN_TRUE (0x1UL)

/* CH0HCLLP @Bit 13 : The value of this register is derived from the DMAH_CH0_HC_LLP coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Pos (13UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Pos) /*!< Bit mask
                                                                            of CH0HCLLP field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0HCLLP_HARDCODED (0x1UL)

/* CH0FC @Bits 14..15 : The value of this register is derived from the DMAH_CH0_FC coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Pos (14UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Pos) /*!< Bit mask of
                                                                            CH0FC field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_FC_DMA (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_FC_SRC (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_FC_DST (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FC_FC_ANY (0x3UL)

/* CH0MAXMULTSIZE @Bits 16..18 : The value of this register is derived from the DMAH_CH0_MULT_SIZE coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Pos (16UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Pos)
                                                                            /*!< Bit mask of CH0MAXMULTSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_Max (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_4 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_8 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_16 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_32 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_64 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_128 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0MAXMULTSIZE_MAX_MULT_SIZE_256 (0x6UL)

/* CH0DMS @Bits 19..21 : The value of this register is derived from the DMAH_CH0_DMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Pos (19UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Pos) /*!< Bit mask of
                                                                            CH0DMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0DMS_PROGRAMMABLE (0x4UL)

/* CH0LMS @Bits 22..24 : The value of this register is derived from the DMAH_CH0_LMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Pos (22UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Pos) /*!< Bit mask of
                                                                            CH0LMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0LMS_PROGRAMMABLE (0x4UL)

/* CH0SMS @Bits 25..27 : The value of this register is derived from the DMAH_CH0_SMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Pos (25UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Pos) /*!< Bit mask of
                                                                            CH0SMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_Max (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_MASTER_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_MASTER_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_MASTER_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_MASTER_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0SMS_PROGRAMMABLE (0x4UL)

/* CH0FIFODEPTH @Bits 28..30 : The value of this register is derived from the DMAH_CH0_FIFO_DEPTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Pos) /*!<
                                                                            Bit mask of CH0FIFODEPTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_Max (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_8 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_16 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_32 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_64 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_128 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2L_CH0FIFODEPTH_FIFO_DEPTH_256 (0x5UL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS2H: DMA_COMP_PARAMS_2 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_ResetValue (0x00000000UL)

/* CHOMULTIBLKTYPE @Bits 0..3 : The values of these bit fields are derived from the DMAH_CH0_MULTI_BLK_TYPE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CHOMULTIBLKTYPE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_Max (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_CONT_RELOAD (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_RELOAD_CONT (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_RELOAD_RELOAD (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_CONT_LLP (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_RELOAD_LLP (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_CNT_LLP (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_LLP_RELOAD (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CHOMULTIBLKTYPE_LLP_LLP (0x8UL)

/* CH1MULTIBLKTYPE @Bits 4..7 : The values of these bit fields are derived from the DMAH_CH1_MULTI_BLK_TYPE coreConsultant
                                parameter. */

