pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH6MULTIBLKTYPE @Bits 24..27 : The values of these bit fields are derived from the DMAH_CH6_MULTI_BLK_TYPE coreConsultant
                                  parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Pos (24UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH6MULTIBLKTYPE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_Max (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_CONT_RELOAD (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_RELOAD_CONT (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_RELOAD_RELOAD (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_CONT_LLP (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_RELOAD_LLP (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_CNT_LLP (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_LLP_RELOAD (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH6MULTIBLKTYPE_LLP_LLP (0x8UL)

/* CH7MULTIBLKTYPE @Bits 28..31 : The values of these bit fields are derived from the DMAH_CH7_MULTI_BLK_TYPE coreConsultant
                                  parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Pos)
                                                                            /*!< Bit mask of CH7MULTIBLKTYPE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_Max (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_PROGRAMMABLE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_CONT_RELOAD (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_RELOAD_CONT (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_RELOAD_RELOAD (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_CONT_LLP (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_RELOAD_LLP (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_CNT_LLP (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_LLP_RELOAD (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS2H_CH7MULTIBLKTYPE_LLP_LLP (0x8UL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS1L: DMA_COMP_PARAMS_1 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_ResetValue (0x33333333UL)

/* CHOMAXBLKSIZE @Bits 0..3 : The values of these bit fields are derived from the DMAH_CH0_MAX_BLK_SIZE coreConsultant
                              parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CHOMAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_Max (0xAUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CHOMAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL)

/* CH1MAXBLKSIZE @Bits 4..7 : The values of these bit fields are derived from the DMAH_CH1_MAX_BLK_SIZE coreConsultant
                              parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Pos (4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH1MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_Max (0xAUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH1MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL)

/* CH2MAXBLKSIZE @Bits 8..11 : The values of these bit fields are derived from the DMAH_CH2_MAX_BLK_SIZE coreConsultant
                               parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH2MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_Max (0xAUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH2MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL)

/* CH3MAXBLKSIZE @Bits 12..15 : The values of these bit fields are derived from the DMAH_CH3_MAX_BLK_SIZE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Pos (12UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH3MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_Max (0xAUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH3MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL)

/* CH4MAXBLKSIZE @Bits 16..19 : The values of these bit fields are derived from the DMAH_CH4_MAX_BLK_SIZE coreConsultant
                                parameter. */

