pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Pos (16UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH4MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_Max (0xAUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH4MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL)

/* CH5MAXBLKSIZE @Bits 20..23 : The values of these bit fields are derived from the DMAH_CH5_MAX_BLK_SIZE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Pos (20UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH5MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_Max (0xAUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH5MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL)

/* CH6MAXBLKSIZE @Bits 24..27 : The values of these bit fields are derived from the DMAH_CH6_MAX_BLK_SIZE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Pos (24UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH6MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_Max (0xAUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH6MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL)

/* CH7MAXBLKSIZE @Bits 28..31 : The values of these bit fields are derived from the DMAH_CH7_MAX_BLK_SIZE coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Pos) /*!<
                                                                            Bit mask of CH7MAXBLKSIZE field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_Max (0xAUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_3 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_7 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_15 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_31 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_63 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_127 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_255 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_511 (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_1023 (0x8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_2047 (0x9UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1L_CH7MAXBLKSIZE_MAX_BLOCK_SIZE_4095 (0xAUL)


/* I3CCORE_DMA_MISC_DMACOMPPARAMS1H: DMA_COMP_PARAMS_1 is a constant read-only register that contains encoded information about
                                      the component parameter settings. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ResetValue (0x3120090CUL)

/* BIGENDIAN @Bit 0 : The value of this register is derived from the DMAH_BIG_ENDIAN coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Pos) /*!< Bit mask
                                                                            of BIGENDIAN field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_BIGENDIAN_TRUE (0x1UL)

/* INTRIO @Bits 1..2 : The value of this register is derived from the DMAH_INTR_IO coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Pos (1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Pos) /*!< Bit mask of
                                                                            INTRIO field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_Max (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_ALL_INT (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_TYPE_INT (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_INTRIO_COMBINED_INT (0x2UL)

/* MAXABRST @Bit 3 : The value of this register is derived from the DMAH_MABRST coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Pos (3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Pos) /*!< Bit mask
                                                                            of MAXABRST field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_MAXABRST_TRUE (0x1UL)

