pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RSVDDMACOMPPARAMS1 @Bits 4..7 : Reserved field- read-only */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_RSVDDMACOMPPARAMS1_Pos (4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_RSVDDMACOMPPARAMS1_Msk (0xFUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_RSVDDMACOMPPARAMS1_Pos)
                                                                            /*!< Bit mask of RSVDDMACOMPPARAMS1 field.*/

/* NUMCHANNELS @Bits 8..10 : The value of this register is derived from the DMAH_NUM_CHANNELS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Pos (8UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Msk (0x7UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Pos) /*!< Bit
                                                                            mask of NUMCHANNELS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_Max (0x7UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_4 (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_5 (0x4UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_6 (0x5UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_7 (0x6UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMCHANNELS_NUM_CHANNEL_8 (0x7UL)

/* NUMMASTERINT @Bits 11..12 : The value of this register is derived from the DMAH_NUM_MASTER_INT coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Pos (11UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Pos) /*!<
                                                                            Bit mask of NUMMASTERINT field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_NUM_MST_INTERFACE_1 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_NUM_MST_INTERFACE_2 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_NUM_MST_INTERFACE_3 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMMASTERINT_NUM_MST_INTERFACE_4 (0x3UL)

/* SHDATAWIDTH @Bits 13..14 : The value of this register is derived from the DMAH_S_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Pos (13UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Pos) /*!< Bit
                                                                            mask of SHDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_SHDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL)

/* M4HDATAWIDTH @Bits 15..16 : The value of this register is derived from the DMAH_M4_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Pos (15UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Pos) /*!<
                                                                            Bit mask of M4HDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M4HDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL)

/* M3HDATAWIDTH @Bits 17..18 : The value of this register is derived from the DMAH_M3_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Pos (17UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Pos) /*!<
                                                                            Bit mask of M3HDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M3HDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL)

/* M2HDATAWIDTH @Bits 19..20 : The value of this register is derived from the DMAH_M2_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Pos (19UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Pos) /*!<
                                                                            Bit mask of M2HDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M2HDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL)

