pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* M1HDATAWIDTH @Bits 21..22 : The value of this register is derived from the DMAH_M1_HDATA_WIDTH coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Pos (21UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Msk (0x3UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Pos) /*!<
                                                                            Bit mask of M1HDATAWIDTH field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_Max (0x3UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_DATA_BUS_WIDTH_32 (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_DATA_BUS_WIDTH_64 (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_DATA_BUS_WIDTH_128 (0x2UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_M1HDATAWIDTH_DATA_BUS_WIDTH_256 (0x3UL)

/* NUMHSINT @Bits 23..27 : The value of this register is derived from the DMAH_NUM_HS_INT coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Pos (23UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Msk (0x1FUL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Pos) /*!< Bit mask
                                                                            of NUMHSINT field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_Max (0x10UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_0 (0x00UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_1 (0x01UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_2 (0x02UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_3 (0x03UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_4 (0x04UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_5 (0x05UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_6 (0x06UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_7 (0x07UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_8 (0x08UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_9 (0x09UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_a (0x0AUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_b (0x0BUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_c (0x0CUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_d (0x0DUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_e (0x0EUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_f (0x0FUL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_NUMHSINT_HS_INTERFACE_10 (0x10UL)

/* ADDENCODEDPARAMS @Bit 28 : The value of this register is derived from the DMAH_ADD_ENCODED_PARAMS coreConsultant parameter. */
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Pos (28UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Pos)
                                                                            /*!< Bit mask of ADDENCODEDPARAMS field.*/
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Min (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_Max (0x1UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_FALSE (0x0UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_ADDENCODEDPARAMS_TRUE (0x1UL)

/* STATICENDIANSELECT @Bit 29 : The value of this register is derived from the DMAH_STATIC_ENDIAN_SELECT coreConsultant
                                parameter. */

  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_STATICENDIANSELECT_Pos (29UL)
  #define I3CCORE_DMA_MISC_DMACOMPPARAMS1H_STATICENDIANSELECT_Msk (0x1UL << I3CCORE_DMA_MISC_DMACOMPPARAMS1H_STATICENDIANSELECT_Pos)
                                                                            /*!< Bit mask of STATICENDIANSELECT field.*/


/* I3CCORE_DMA_MISC_DMACOMPSID0: This is the DW_ahb_dmac Component Version register, which is a read-only register that
                                  specifies the component type. */

  #define I3CCORE_DMA_MISC_DMACOMPSID0_ResetValue (0x44571110UL)

/* DMACOMPTYPE @Bits 0..31 : DMA Component Type Number = `h44571110. */
  #define I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Msk (0xFFFFFFFFUL << I3CCORE_DMA_MISC_DMACOMPSID0_DMACOMPTYPE_Pos) /*!< Bit
                                                                            mask of DMACOMPTYPE field.*/


/* I3CCORE_DMA_MISC_DMACOMPSID1: This is the DW_ahb_dmac Component Version register, which is a read-only register that
                                  specifies the version of the packaged component. */

  #define I3CCORE_DMA_MISC_DMACOMPSID1_ResetValue (0x3232322AUL)

/* DMACOMPVERSION @Bits 0..31 : DMA Component Version. */
  #define I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Pos (0UL)
  #define I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Msk (0xFFFFFFFFUL << I3CCORE_DMA_MISC_DMACOMPSID1_DMACOMPVERSION_Pos) /*!<
                                                                            Bit mask of DMACOMPVERSION field.*/



/* =================================================== Struct I3CCORE_DMA ==================================================== */
/**
  * @brief DMA [I3CCORE_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_I3CCORE_DMA_CH0_Type CH0;
  __IM  uint32_t  RESERVED;
  __IOM NRF_I3CCORE_DMA_CH1_Type CH1;
  __IM  uint32_t  RESERVED1[135];
  __IOM NRF_I3CCORE_DMA_INT_Type INT;
  __IM  uint32_t  RESERVED2;
  __IOM NRF_I3CCORE_DMA_SWHANDSHAKE_Type SWHANDSHAKE;
  __IM  uint32_t  RESERVED3;
  __IOM NRF_I3CCORE_DMA_MISC_Type MISC;
} NRF_I3CCORE_DMA_Type;

/* ===================================================== Struct I3CCORE ====================================================== */
/**
  * @brief I3CCORE
  */
  typedef struct {
    __IOM NRF_I3CCORE_CORE_Type CORE;
    __IM uint32_t RESERVED[390];
    __IOM NRF_I3CCORE_DMA_Type DMA;
  } NRF_I3CCORE_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        ICACHEDATA                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct ICACHEDATA_SET_WAY_DU =============================================== */
/**
  * @brief DU [ICACHEDATA_SET_WAY_DU] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[2];                           /*!< (@ 0x00000000) Cache data bits for DATA[q] in DU[p] (DataUnit) of
                                                                         SET[n], WAY[o].*/
} NRF_ICACHEDATA_SET_WAY_DU_Type;
  #define ICACHEDATA_SET_WAY_DU_MaxCount (4UL)
  #define ICACHEDATA_SET_WAY_DU_MaxIndex (3UL)
  #define ICACHEDATA_SET_WAY_DU_MinIndex (0UL)

/* ICACHEDATA_SET_WAY_DU_DATA: Cache data bits for DATA[q] in DU[p] (DataUnit) of SET[n], WAY[o]. */
  #define ICACHEDATA_SET_WAY_DU_DATA_MaxCount (2UL)
  #define ICACHEDATA_SET_WAY_DU_DATA_MaxIndex (1UL)
  #define ICACHEDATA_SET_WAY_DU_DATA_MinIndex (0UL)
  #define ICACHEDATA_SET_WAY_DU_DATA_ResetValue (0x00000000UL)

/* Data @Bits 0..31 : Data */
  #define ICACHEDATA_SET_WAY_DU_DATA_Data_Pos (0UL)
  #define ICACHEDATA_SET_WAY_DU_DATA_Data_Msk (0xFFFFFFFFUL << ICACHEDATA_SET_WAY_DU_DATA_Data_Pos) /*!< Bit mask of Data
                                                                            field.*/



/* ================================================ Struct ICACHEDATA_SET_WAY ================================================ */
/**
  * @brief WAY [ICACHEDATA_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM NRF_ICACHEDATA_SET_WAY_DU_Type DU[4];
} NRF_ICACHEDATA_SET_WAY_Type;
  #define ICACHEDATA_SET_WAY_MaxCount (2UL)
  #define ICACHEDATA_SET_WAY_MaxIndex (1UL)
  #define ICACHEDATA_SET_WAY_MinIndex (0UL)


