pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ================================================== Struct ICACHEDATA_SET ================================================== */
/**
  * @brief SET [ICACHEDATA_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_ICACHEDATA_SET_WAY_Type WAY[2];
} NRF_ICACHEDATA_SET_Type;
  #define ICACHEDATA_SET_MaxCount (1024UL)
  #define ICACHEDATA_SET_MaxIndex (1023UL)
  #define ICACHEDATA_SET_MinIndex (0UL)

/* ==================================================== Struct ICACHEDATA ==================================================== */
/**
  * @brief CACHEDATA
  */
  typedef struct {
    __IOM NRF_ICACHEDATA_SET_Type SET[1024];
  } NRF_ICACHEDATA_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        ICACHEINFO                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct ICACHEINFO_SET_WAY ================================================ */
/**
  * @brief WAY [ICACHEINFO_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INFO;
} NRF_ICACHEINFO_SET_WAY_Type;
  #define ICACHEINFO_SET_WAY_MaxCount (2UL)
  #define ICACHEINFO_SET_WAY_MaxIndex (1UL)
  #define ICACHEINFO_SET_WAY_MinIndex (0UL)

/* ICACHEINFO_SET_WAY_INFO: Cache information for SET[n], WAY[o]. */
  #define ICACHEINFO_SET_WAY_INFO_ResetValue (0x00000000UL)

/* TAG @Bits 0..19 : Cache tag. */
  #define ICACHEINFO_SET_WAY_INFO_TAG_Pos (0UL)
  #define ICACHEINFO_SET_WAY_INFO_TAG_Msk (0xFFFFFUL << ICACHEINFO_SET_WAY_INFO_TAG_Pos)

/* DUV0 @Bit 24 : Data unit valid info. */
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Pos (24UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_DUV0_Pos)
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Min (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Max (0x1UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Invalid (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV0_Valid (0x1UL)

/* DUV1 @Bit 25 : Data unit valid info. */
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Pos (25UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_DUV1_Pos)
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Min (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Max (0x1UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Invalid (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV1_Valid (0x1UL)

/* DUV2 @Bit 26 : Data unit valid info. */
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Pos (26UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_DUV2_Pos)
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Min (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Max (0x1UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Invalid (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV2_Valid (0x1UL)

/* DUV3 @Bit 27 : Data unit valid info. */
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Pos (27UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_DUV3_Pos)
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Min (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Max (0x1UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Invalid (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_DUV3_Valid (0x1UL)

/* D0 @Bit 28 : Dirty status of combined data unit 0 and 1. */
  #define ICACHEINFO_SET_WAY_INFO_D0_Pos (28UL)
  #define ICACHEINFO_SET_WAY_INFO_D0_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_D0_Pos)
  #define ICACHEINFO_SET_WAY_INFO_D0_Min (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_D0_Max (0x1UL)
  #define ICACHEINFO_SET_WAY_INFO_D0_Clean (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_D0_Dirty (0x1UL)

/* D1 @Bit 29 : Dirty status of combined data unit 2 and 3. */
  #define ICACHEINFO_SET_WAY_INFO_D1_Pos (29UL)
  #define ICACHEINFO_SET_WAY_INFO_D1_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_D1_Pos)
  #define ICACHEINFO_SET_WAY_INFO_D1_Min (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_D1_Max (0x1UL)
  #define ICACHEINFO_SET_WAY_INFO_D1_Clean (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_D1_Dirty (0x1UL)

/* V @Bit 30 : Line valid bit. */
  #define ICACHEINFO_SET_WAY_INFO_V_Pos (30UL)
  #define ICACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_V_Pos)
  #define ICACHEINFO_SET_WAY_INFO_V_Min (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_V_Max (0x1UL)
  #define ICACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)

/* MRU @Bit 31 : Most recently used way. */
  #define ICACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)
  #define ICACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << ICACHEINFO_SET_WAY_INFO_MRU_Pos)
  #define ICACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)
  #define ICACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)
  #define ICACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)



/* ================================================== Struct ICACHEINFO_SET ================================================== */
/**
  * @brief SET [ICACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_ICACHEINFO_SET_WAY_Type WAY[2];
} NRF_ICACHEINFO_SET_Type;
  #define ICACHEINFO_SET_MaxCount (1024UL)
  #define ICACHEINFO_SET_MaxIndex (1023UL)
  #define ICACHEINFO_SET_MinIndex (0UL)

/* ==================================================== Struct ICACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {
    __IOM NRF_ICACHEINFO_SET_Type SET[1024];
  } NRF_ICACHEINFO_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           IPCT                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct IPCT_OVERFLOW =================================================== */
/**
  * @brief OVERFLOW [IPCT_OVERFLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEND;
} NRF_IPCT_OVERFLOW_Type;

/* IPCT_OVERFLOW_SEND: Overflow status for SEND tasks Write 0 to clear */
  #define IPCT_OVERFLOW_SEND_ResetValue (0x00000000UL)

/* SEND0 @Bit 0 : Overflow status for SEND[0] task */
  #define IPCT_OVERFLOW_SEND_SEND0_Pos (0UL)
  #define IPCT_OVERFLOW_SEND_SEND0_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND0_Pos)
  #define IPCT_OVERFLOW_SEND_SEND0_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND0_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND0_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND0_NoOverflow (0x0UL)

/* SEND1 @Bit 1 : Overflow status for SEND[1] task */
  #define IPCT_OVERFLOW_SEND_SEND1_Pos (1UL)
  #define IPCT_OVERFLOW_SEND_SEND1_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND1_Pos)
  #define IPCT_OVERFLOW_SEND_SEND1_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND1_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND1_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND1_NoOverflow (0x0UL)

/* SEND2 @Bit 2 : Overflow status for SEND[2] task */
  #define IPCT_OVERFLOW_SEND_SEND2_Pos (2UL)
  #define IPCT_OVERFLOW_SEND_SEND2_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND2_Pos)
  #define IPCT_OVERFLOW_SEND_SEND2_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND2_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND2_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND2_NoOverflow (0x0UL)

/* SEND3 @Bit 3 : Overflow status for SEND[3] task */
  #define IPCT_OVERFLOW_SEND_SEND3_Pos (3UL)
  #define IPCT_OVERFLOW_SEND_SEND3_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND3_Pos)
  #define IPCT_OVERFLOW_SEND_SEND3_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND3_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND3_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND3_NoOverflow (0x0UL)

