pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SEND4 @Bit 4 : Overflow status for SEND[4] task */
  #define IPCT_OVERFLOW_SEND_SEND4_Pos (4UL)
  #define IPCT_OVERFLOW_SEND_SEND4_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND4_Pos)
  #define IPCT_OVERFLOW_SEND_SEND4_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND4_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND4_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND4_NoOverflow (0x0UL)

/* SEND5 @Bit 5 : Overflow status for SEND[5] task */
  #define IPCT_OVERFLOW_SEND_SEND5_Pos (5UL)
  #define IPCT_OVERFLOW_SEND_SEND5_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND5_Pos)
  #define IPCT_OVERFLOW_SEND_SEND5_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND5_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND5_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND5_NoOverflow (0x0UL)

/* SEND6 @Bit 6 : Overflow status for SEND[6] task */
  #define IPCT_OVERFLOW_SEND_SEND6_Pos (6UL)
  #define IPCT_OVERFLOW_SEND_SEND6_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND6_Pos)
  #define IPCT_OVERFLOW_SEND_SEND6_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND6_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND6_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND6_NoOverflow (0x0UL)

/* SEND7 @Bit 7 : Overflow status for SEND[7] task */
  #define IPCT_OVERFLOW_SEND_SEND7_Pos (7UL)
  #define IPCT_OVERFLOW_SEND_SEND7_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND7_Pos)
  #define IPCT_OVERFLOW_SEND_SEND7_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND7_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND7_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND7_NoOverflow (0x0UL)

/* SEND8 @Bit 8 : Overflow status for SEND[8] task */
  #define IPCT_OVERFLOW_SEND_SEND8_Pos (8UL)
  #define IPCT_OVERFLOW_SEND_SEND8_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND8_Pos)
  #define IPCT_OVERFLOW_SEND_SEND8_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND8_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND8_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND8_NoOverflow (0x0UL)

/* SEND9 @Bit 9 : Overflow status for SEND[9] task */
  #define IPCT_OVERFLOW_SEND_SEND9_Pos (9UL)
  #define IPCT_OVERFLOW_SEND_SEND9_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND9_Pos)
  #define IPCT_OVERFLOW_SEND_SEND9_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND9_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND9_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND9_NoOverflow (0x0UL)

/* SEND10 @Bit 10 : Overflow status for SEND[10] task */
  #define IPCT_OVERFLOW_SEND_SEND10_Pos (10UL)
  #define IPCT_OVERFLOW_SEND_SEND10_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND10_Pos)
  #define IPCT_OVERFLOW_SEND_SEND10_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND10_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND10_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND10_NoOverflow (0x0UL)

/* SEND11 @Bit 11 : Overflow status for SEND[11] task */
  #define IPCT_OVERFLOW_SEND_SEND11_Pos (11UL)
  #define IPCT_OVERFLOW_SEND_SEND11_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND11_Pos)
  #define IPCT_OVERFLOW_SEND_SEND11_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND11_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND11_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND11_NoOverflow (0x0UL)

/* SEND12 @Bit 12 : Overflow status for SEND[12] task */
  #define IPCT_OVERFLOW_SEND_SEND12_Pos (12UL)
  #define IPCT_OVERFLOW_SEND_SEND12_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND12_Pos)
  #define IPCT_OVERFLOW_SEND_SEND12_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND12_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND12_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND12_NoOverflow (0x0UL)

/* SEND13 @Bit 13 : Overflow status for SEND[13] task */
  #define IPCT_OVERFLOW_SEND_SEND13_Pos (13UL)
  #define IPCT_OVERFLOW_SEND_SEND13_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND13_Pos)
  #define IPCT_OVERFLOW_SEND_SEND13_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND13_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND13_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND13_NoOverflow (0x0UL)

/* SEND14 @Bit 14 : Overflow status for SEND[14] task */
  #define IPCT_OVERFLOW_SEND_SEND14_Pos (14UL)
  #define IPCT_OVERFLOW_SEND_SEND14_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND14_Pos)
  #define IPCT_OVERFLOW_SEND_SEND14_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND14_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND14_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND14_NoOverflow (0x0UL)

/* SEND15 @Bit 15 : Overflow status for SEND[15] task */
  #define IPCT_OVERFLOW_SEND_SEND15_Pos (15UL)
  #define IPCT_OVERFLOW_SEND_SEND15_Msk (0x1UL << IPCT_OVERFLOW_SEND_SEND15_Pos)
  #define IPCT_OVERFLOW_SEND_SEND15_Min (0x0UL)
  #define IPCT_OVERFLOW_SEND_SEND15_Max (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND15_Overflow (0x1UL)
  #define IPCT_OVERFLOW_SEND_SEND15_NoOverflow (0x0UL)


/* ======================================================= Struct IPCT ======================================================= */
/**
  * @brief IPCT APB registers
  */
  typedef struct {
    __OM uint32_t TASKS_SEND[16];                    /*!< (@ 0x00000000) Trigger event on IPCT source channel n if there are no
                                                                         active signals present on that channel*/
    __OM uint32_t TASKS_FLUSH[16];                   /*!< (@ 0x00000040) Flush IPCT sink channel n. Any pending IPCT signal on
                                                                         that channel will re-trigger the RECEIVE[n] event. The
                                                                         flush can happen automatically by configuring the
                                                                         SHORTS register accordingly.*/
    __IOM uint32_t SUBSCRIBE_SEND[16];
    __IOM uint32_t SUBSCRIBE_FLUSH[16];
    __IOM uint32_t EVENTS_RECEIVE[16];
    __IOM uint32_t EVENTS_READY[16];                 /*!< (@ 0x00000140) Event received when hardware handshake of SEND task for
                                                                         IPCT source channel n is complete and a new signal can
                                                                         be triggered on that channel.*/
    __IOM uint32_t PUBLISH_RECEIVE[16];
    __IOM uint32_t PUBLISH_READY[16];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED[63];
    __IOM uint32_t INTEN0;
    __IOM uint32_t INTENSET0;
    __IOM uint32_t INTENCLR0;
    __IM uint32_t INTPEND0;
    __IOM uint32_t INTEN1;
    __IOM uint32_t INTENSET1;
    __IOM uint32_t INTENCLR1;
    __IM uint32_t INTPEND1;
    __IOM uint32_t INTEN2;
    __IOM uint32_t INTENSET2;
    __IOM uint32_t INTENCLR2;
    __IM uint32_t INTPEND2;
    __IOM uint32_t INTEN3;
    __IOM uint32_t INTENSET3;
    __IOM uint32_t INTENCLR3;
    __IM uint32_t INTPEND3;
    __IOM uint32_t INTEN4;
    __IOM uint32_t INTENSET4;
    __IOM uint32_t INTENCLR4;
    __IM uint32_t INTPEND4;
    __IOM uint32_t INTEN5;
    __IOM uint32_t INTENSET5;
    __IOM uint32_t INTENCLR5;
    __IM uint32_t INTPEND5;
    __IOM uint32_t INTEN6;
    __IOM uint32_t INTENSET6;
    __IOM uint32_t INTENCLR6;
    __IM uint32_t INTPEND6;
    __IOM uint32_t INTEN7;
    __IOM uint32_t INTENSET7;
    __IOM uint32_t INTENCLR7;
    __IM uint32_t INTPEND7;
    __IM uint32_t RESERVED1[32];
    __IOM NRF_IPCT_OVERFLOW_Type OVERFLOW;
  } NRF_IPCT_Type;

/* IPCT_TASKS_SEND: Trigger event on IPCT source channel n if there are no active signals present on that channel */
  #define IPCT_TASKS_SEND_MaxCount (16UL)
  #define IPCT_TASKS_SEND_MaxIndex (15UL)
  #define IPCT_TASKS_SEND_MinIndex (0UL)
  #define IPCT_TASKS_SEND_ResetValue (0x00000000UL)

/* TASKS_SEND @Bit 0 : Trigger event on IPCT source channel n if there are no active signals present on that channel */
  #define IPCT_TASKS_SEND_TASKS_SEND_Pos (0UL)
  #define IPCT_TASKS_SEND_TASKS_SEND_Msk (0x1UL << IPCT_TASKS_SEND_TASKS_SEND_Pos)
  #define IPCT_TASKS_SEND_TASKS_SEND_Min (0x1UL)
  #define IPCT_TASKS_SEND_TASKS_SEND_Max (0x1UL)
  #define IPCT_TASKS_SEND_TASKS_SEND_Trigger (0x1UL)


/* IPCT_TASKS_FLUSH: Flush IPCT sink channel n. Any pending IPCT signal on that channel will re-trigger the RECEIVE[n] event.
                      The flush can happen automatically by configuring the SHORTS register accordingly. */

