pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define IPCT_TASKS_FLUSH_MaxCount (16UL)
  #define IPCT_TASKS_FLUSH_MaxIndex (15UL)
  #define IPCT_TASKS_FLUSH_MinIndex (0UL)
  #define IPCT_TASKS_FLUSH_ResetValue (0x00000000UL)

/* TASKS_FLUSH @Bit 0 : Flush IPCT sink channel n. Any pending IPCT signal on that channel will re-trigger the RECEIVE[n] event.
                        The flush can happen automatically by configuring the SHORTS register accordingly. */

  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Pos (0UL)
  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Msk (0x1UL << IPCT_TASKS_FLUSH_TASKS_FLUSH_Pos)
  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Min (0x1UL)
  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Max (0x1UL)
  #define IPCT_TASKS_FLUSH_TASKS_FLUSH_Trigger (0x1UL)


/* IPCT_SUBSCRIBE_SEND: Subscribe configuration for task SEND[n] */
  #define IPCT_SUBSCRIBE_SEND_MaxCount (16UL)
  #define IPCT_SUBSCRIBE_SEND_MaxIndex (15UL)
  #define IPCT_SUBSCRIBE_SEND_MinIndex (0UL)
  #define IPCT_SUBSCRIBE_SEND_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SEND[n] will subscribe to */
  #define IPCT_SUBSCRIBE_SEND_CHIDX_Pos (0UL)
  #define IPCT_SUBSCRIBE_SEND_CHIDX_Msk (0xFFUL << IPCT_SUBSCRIBE_SEND_CHIDX_Pos)
  #define IPCT_SUBSCRIBE_SEND_CHIDX_Min (0x00UL)
  #define IPCT_SUBSCRIBE_SEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define IPCT_SUBSCRIBE_SEND_EN_Pos (31UL)
  #define IPCT_SUBSCRIBE_SEND_EN_Msk (0x1UL << IPCT_SUBSCRIBE_SEND_EN_Pos)
  #define IPCT_SUBSCRIBE_SEND_EN_Min (0x0UL)
  #define IPCT_SUBSCRIBE_SEND_EN_Max (0x1UL)
  #define IPCT_SUBSCRIBE_SEND_EN_Disabled (0x0UL)
  #define IPCT_SUBSCRIBE_SEND_EN_Enabled (0x1UL)


/* IPCT_SUBSCRIBE_FLUSH: Subscribe configuration for task FLUSH[n] */
  #define IPCT_SUBSCRIBE_FLUSH_MaxCount (16UL)
  #define IPCT_SUBSCRIBE_FLUSH_MaxIndex (15UL)
  #define IPCT_SUBSCRIBE_FLUSH_MinIndex (0UL)
  #define IPCT_SUBSCRIBE_FLUSH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task FLUSH[n] will subscribe to */
  #define IPCT_SUBSCRIBE_FLUSH_CHIDX_Pos (0UL)
  #define IPCT_SUBSCRIBE_FLUSH_CHIDX_Msk (0xFFUL << IPCT_SUBSCRIBE_FLUSH_CHIDX_Pos)
  #define IPCT_SUBSCRIBE_FLUSH_CHIDX_Min (0x00UL)
  #define IPCT_SUBSCRIBE_FLUSH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define IPCT_SUBSCRIBE_FLUSH_EN_Pos (31UL)
  #define IPCT_SUBSCRIBE_FLUSH_EN_Msk (0x1UL << IPCT_SUBSCRIBE_FLUSH_EN_Pos)
  #define IPCT_SUBSCRIBE_FLUSH_EN_Min (0x0UL)
  #define IPCT_SUBSCRIBE_FLUSH_EN_Max (0x1UL)
  #define IPCT_SUBSCRIBE_FLUSH_EN_Disabled (0x0UL)
  #define IPCT_SUBSCRIBE_FLUSH_EN_Enabled (0x1UL)


/* IPCT_EVENTS_RECEIVE: Event received on IPCT sink channel n */
  #define IPCT_EVENTS_RECEIVE_MaxCount (16UL)
  #define IPCT_EVENTS_RECEIVE_MaxIndex (15UL)
  #define IPCT_EVENTS_RECEIVE_MinIndex (0UL)
  #define IPCT_EVENTS_RECEIVE_ResetValue (0x00000000UL)

/* EVENTS_RECEIVE @Bit 0 : Event received on IPCT sink channel n */
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos (0UL)
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Msk (0x1UL << IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos) /*!< Bit mask of
                                                                            EVENTS_RECEIVE field.*/
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Min (0x0UL)
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Max (0x1UL)
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_NotGenerated (0x0UL)
  #define IPCT_EVENTS_RECEIVE_EVENTS_RECEIVE_Generated (0x1UL)


/* IPCT_EVENTS_READY: Event received when hardware handshake of SEND task for IPCT source channel n is complete and a new signal
                       can be triggered on that channel. */

  #define IPCT_EVENTS_READY_MaxCount (16UL)
  #define IPCT_EVENTS_READY_MaxIndex (15UL)
  #define IPCT_EVENTS_READY_MinIndex (0UL)
  #define IPCT_EVENTS_READY_ResetValue (0x00000000UL)

/* EVENTS_READY @Bit 0 : Event received when hardware handshake of SEND task for IPCT source channel n is complete and a new
                         signal can be triggered on that channel. */

  #define IPCT_EVENTS_READY_EVENTS_READY_Pos (0UL)
  #define IPCT_EVENTS_READY_EVENTS_READY_Msk (0x1UL << IPCT_EVENTS_READY_EVENTS_READY_Pos)
  #define IPCT_EVENTS_READY_EVENTS_READY_Min (0x0UL)
  #define IPCT_EVENTS_READY_EVENTS_READY_Max (0x1UL)
  #define IPCT_EVENTS_READY_EVENTS_READY_NotGenerated (0x0UL)
  #define IPCT_EVENTS_READY_EVENTS_READY_Generated (0x1UL)


/* IPCT_PUBLISH_RECEIVE: Publish configuration for event RECEIVE[n] */
  #define IPCT_PUBLISH_RECEIVE_MaxCount (16UL)
  #define IPCT_PUBLISH_RECEIVE_MaxIndex (15UL)
  #define IPCT_PUBLISH_RECEIVE_MinIndex (0UL)
  #define IPCT_PUBLISH_RECEIVE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Pos (0UL)
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_RECEIVE_CHIDX_Pos)
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)
  #define IPCT_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_RECEIVE_EN_Pos (31UL)
  #define IPCT_PUBLISH_RECEIVE_EN_Msk (0x1UL << IPCT_PUBLISH_RECEIVE_EN_Pos)
  #define IPCT_PUBLISH_RECEIVE_EN_Min (0x0UL)
  #define IPCT_PUBLISH_RECEIVE_EN_Max (0x1UL)
  #define IPCT_PUBLISH_RECEIVE_EN_Disabled (0x0UL)
  #define IPCT_PUBLISH_RECEIVE_EN_Enabled (0x1UL)


/* IPCT_PUBLISH_READY: Publish configuration for event READY[n] */
  #define IPCT_PUBLISH_READY_MaxCount (16UL)
  #define IPCT_PUBLISH_READY_MaxIndex (15UL)
  #define IPCT_PUBLISH_READY_MinIndex (0UL)
  #define IPCT_PUBLISH_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY[n] will publish to */
  #define IPCT_PUBLISH_READY_CHIDX_Pos (0UL)
  #define IPCT_PUBLISH_READY_CHIDX_Msk (0xFFUL << IPCT_PUBLISH_READY_CHIDX_Pos)
  #define IPCT_PUBLISH_READY_CHIDX_Min (0x00UL)
  #define IPCT_PUBLISH_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define IPCT_PUBLISH_READY_EN_Pos (31UL)
  #define IPCT_PUBLISH_READY_EN_Msk (0x1UL << IPCT_PUBLISH_READY_EN_Pos)
  #define IPCT_PUBLISH_READY_EN_Min (0x0UL)
  #define IPCT_PUBLISH_READY_EN_Max (0x1UL)
  #define IPCT_PUBLISH_READY_EN_Disabled (0x0UL)
  #define IPCT_PUBLISH_READY_EN_Enabled (0x1UL)


/* IPCT_SHORTS: Shortcuts between local events and tasks */
  #define IPCT_SHORTS_ResetValue (0x00000000UL)

/* RECEIVE0_FLUSH0 @Bit 0 : Shortcut between event RECEIVE[0] and task FLUSH[0] */
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Pos (0UL)
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Msk (0x1UL << IPCT_SHORTS_RECEIVE0_FLUSH0_Pos)
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE0_FLUSH0_Enabled (0x1UL)

