pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RECEIVE1_FLUSH1 @Bit 1 : Shortcut between event RECEIVE[1] and task FLUSH[1] */
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Pos (1UL)
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Msk (0x1UL << IPCT_SHORTS_RECEIVE1_FLUSH1_Pos)
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE1_FLUSH1_Enabled (0x1UL)

/* RECEIVE2_FLUSH2 @Bit 2 : Shortcut between event RECEIVE[2] and task FLUSH[2] */
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Pos (2UL)
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Msk (0x1UL << IPCT_SHORTS_RECEIVE2_FLUSH2_Pos)
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE2_FLUSH2_Enabled (0x1UL)

/* RECEIVE3_FLUSH3 @Bit 3 : Shortcut between event RECEIVE[3] and task FLUSH[3] */
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Pos (3UL)
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Msk (0x1UL << IPCT_SHORTS_RECEIVE3_FLUSH3_Pos)
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE3_FLUSH3_Enabled (0x1UL)

/* RECEIVE4_FLUSH4 @Bit 4 : Shortcut between event RECEIVE[4] and task FLUSH[4] */
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Pos (4UL)
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Msk (0x1UL << IPCT_SHORTS_RECEIVE4_FLUSH4_Pos)
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE4_FLUSH4_Enabled (0x1UL)

/* RECEIVE5_FLUSH5 @Bit 5 : Shortcut between event RECEIVE[5] and task FLUSH[5] */
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Pos (5UL)
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Msk (0x1UL << IPCT_SHORTS_RECEIVE5_FLUSH5_Pos)
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE5_FLUSH5_Enabled (0x1UL)

/* RECEIVE6_FLUSH6 @Bit 6 : Shortcut between event RECEIVE[6] and task FLUSH[6] */
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Pos (6UL)
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Msk (0x1UL << IPCT_SHORTS_RECEIVE6_FLUSH6_Pos)
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE6_FLUSH6_Enabled (0x1UL)

/* RECEIVE7_FLUSH7 @Bit 7 : Shortcut between event RECEIVE[7] and task FLUSH[7] */
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Pos (7UL)
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Msk (0x1UL << IPCT_SHORTS_RECEIVE7_FLUSH7_Pos)
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE7_FLUSH7_Enabled (0x1UL)

/* RECEIVE8_FLUSH8 @Bit 8 : Shortcut between event RECEIVE[8] and task FLUSH[8] */
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Pos (8UL)
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Msk (0x1UL << IPCT_SHORTS_RECEIVE8_FLUSH8_Pos)
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE8_FLUSH8_Enabled (0x1UL)

/* RECEIVE9_FLUSH9 @Bit 9 : Shortcut between event RECEIVE[9] and task FLUSH[9] */
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Pos (9UL)
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Msk (0x1UL << IPCT_SHORTS_RECEIVE9_FLUSH9_Pos)
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE9_FLUSH9_Enabled (0x1UL)

/* RECEIVE10_FLUSH10 @Bit 10 : Shortcut between event RECEIVE[10] and task FLUSH[10] */
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Pos (10UL)
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Msk (0x1UL << IPCT_SHORTS_RECEIVE10_FLUSH10_Pos) /*!< Bit mask of RECEIVE10_FLUSH10
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE10_FLUSH10_Enabled (0x1UL)

/* RECEIVE11_FLUSH11 @Bit 11 : Shortcut between event RECEIVE[11] and task FLUSH[11] */
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Pos (11UL)
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Msk (0x1UL << IPCT_SHORTS_RECEIVE11_FLUSH11_Pos) /*!< Bit mask of RECEIVE11_FLUSH11
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE11_FLUSH11_Enabled (0x1UL)

/* RECEIVE12_FLUSH12 @Bit 12 : Shortcut between event RECEIVE[12] and task FLUSH[12] */
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Pos (12UL)
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Msk (0x1UL << IPCT_SHORTS_RECEIVE12_FLUSH12_Pos) /*!< Bit mask of RECEIVE12_FLUSH12
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE12_FLUSH12_Enabled (0x1UL)

/* RECEIVE13_FLUSH13 @Bit 13 : Shortcut between event RECEIVE[13] and task FLUSH[13] */
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Pos (13UL)
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Msk (0x1UL << IPCT_SHORTS_RECEIVE13_FLUSH13_Pos) /*!< Bit mask of RECEIVE13_FLUSH13
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE13_FLUSH13_Enabled (0x1UL)

