pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RECEIVE14_FLUSH14 @Bit 14 : Shortcut between event RECEIVE[14] and task FLUSH[14] */
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Pos (14UL)
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Msk (0x1UL << IPCT_SHORTS_RECEIVE14_FLUSH14_Pos) /*!< Bit mask of RECEIVE14_FLUSH14
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE14_FLUSH14_Enabled (0x1UL)

/* RECEIVE15_FLUSH15 @Bit 15 : Shortcut between event RECEIVE[15] and task FLUSH[15] */
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Pos (15UL)
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Msk (0x1UL << IPCT_SHORTS_RECEIVE15_FLUSH15_Pos) /*!< Bit mask of RECEIVE15_FLUSH15
                                                                            field.*/
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Min (0x0UL)
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Max (0x1UL)
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Disabled (0x0UL)
  #define IPCT_SHORTS_RECEIVE15_FLUSH15_Enabled (0x1UL)


/* IPCT_INTEN0: Enable or disable interrupt */
  #define IPCT_INTEN0_ResetValue (0x00000000UL)

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN0_RECEIVE0_Pos (0UL)
  #define IPCT_INTEN0_RECEIVE0_Msk (0x1UL << IPCT_INTEN0_RECEIVE0_Pos)
  #define IPCT_INTEN0_RECEIVE0_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE0_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE0_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE0_Enabled (0x1UL)

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN0_RECEIVE1_Pos (1UL)
  #define IPCT_INTEN0_RECEIVE1_Msk (0x1UL << IPCT_INTEN0_RECEIVE1_Pos)
  #define IPCT_INTEN0_RECEIVE1_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE1_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE1_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE1_Enabled (0x1UL)

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN0_RECEIVE2_Pos (2UL)
  #define IPCT_INTEN0_RECEIVE2_Msk (0x1UL << IPCT_INTEN0_RECEIVE2_Pos)
  #define IPCT_INTEN0_RECEIVE2_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE2_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE2_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE2_Enabled (0x1UL)

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN0_RECEIVE3_Pos (3UL)
  #define IPCT_INTEN0_RECEIVE3_Msk (0x1UL << IPCT_INTEN0_RECEIVE3_Pos)
  #define IPCT_INTEN0_RECEIVE3_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE3_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE3_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE3_Enabled (0x1UL)

/* RECEIVE4 @Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
  #define IPCT_INTEN0_RECEIVE4_Pos (4UL)
  #define IPCT_INTEN0_RECEIVE4_Msk (0x1UL << IPCT_INTEN0_RECEIVE4_Pos)
  #define IPCT_INTEN0_RECEIVE4_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE4_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE4_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE4_Enabled (0x1UL)

/* RECEIVE5 @Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
  #define IPCT_INTEN0_RECEIVE5_Pos (5UL)
  #define IPCT_INTEN0_RECEIVE5_Msk (0x1UL << IPCT_INTEN0_RECEIVE5_Pos)
  #define IPCT_INTEN0_RECEIVE5_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE5_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE5_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE5_Enabled (0x1UL)

/* RECEIVE6 @Bit 6 : Enable or disable interrupt for event RECEIVE[6] */
  #define IPCT_INTEN0_RECEIVE6_Pos (6UL)
  #define IPCT_INTEN0_RECEIVE6_Msk (0x1UL << IPCT_INTEN0_RECEIVE6_Pos)
  #define IPCT_INTEN0_RECEIVE6_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE6_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE6_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE6_Enabled (0x1UL)

/* RECEIVE7 @Bit 7 : Enable or disable interrupt for event RECEIVE[7] */
  #define IPCT_INTEN0_RECEIVE7_Pos (7UL)
  #define IPCT_INTEN0_RECEIVE7_Msk (0x1UL << IPCT_INTEN0_RECEIVE7_Pos)
  #define IPCT_INTEN0_RECEIVE7_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE7_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE7_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE7_Enabled (0x1UL)

/* RECEIVE8 @Bit 8 : Enable or disable interrupt for event RECEIVE[8] */
  #define IPCT_INTEN0_RECEIVE8_Pos (8UL)
  #define IPCT_INTEN0_RECEIVE8_Msk (0x1UL << IPCT_INTEN0_RECEIVE8_Pos)
  #define IPCT_INTEN0_RECEIVE8_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE8_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE8_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE8_Enabled (0x1UL)

/* RECEIVE9 @Bit 9 : Enable or disable interrupt for event RECEIVE[9] */
  #define IPCT_INTEN0_RECEIVE9_Pos (9UL)
  #define IPCT_INTEN0_RECEIVE9_Msk (0x1UL << IPCT_INTEN0_RECEIVE9_Pos)
  #define IPCT_INTEN0_RECEIVE9_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE9_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE9_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE9_Enabled (0x1UL)

/* RECEIVE10 @Bit 10 : Enable or disable interrupt for event RECEIVE[10] */
  #define IPCT_INTEN0_RECEIVE10_Pos (10UL)
  #define IPCT_INTEN0_RECEIVE10_Msk (0x1UL << IPCT_INTEN0_RECEIVE10_Pos)
  #define IPCT_INTEN0_RECEIVE10_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE10_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE10_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE10_Enabled (0x1UL)

/* RECEIVE11 @Bit 11 : Enable or disable interrupt for event RECEIVE[11] */
  #define IPCT_INTEN0_RECEIVE11_Pos (11UL)
  #define IPCT_INTEN0_RECEIVE11_Msk (0x1UL << IPCT_INTEN0_RECEIVE11_Pos)
  #define IPCT_INTEN0_RECEIVE11_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE11_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE11_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE11_Enabled (0x1UL)

/* RECEIVE12 @Bit 12 : Enable or disable interrupt for event RECEIVE[12] */
  #define IPCT_INTEN0_RECEIVE12_Pos (12UL)
  #define IPCT_INTEN0_RECEIVE12_Msk (0x1UL << IPCT_INTEN0_RECEIVE12_Pos)
  #define IPCT_INTEN0_RECEIVE12_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE12_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE12_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE12_Enabled (0x1UL)

