pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RECEIVE13 @Bit 13 : Enable or disable interrupt for event RECEIVE[13] */
  #define IPCT_INTEN0_RECEIVE13_Pos (13UL)
  #define IPCT_INTEN0_RECEIVE13_Msk (0x1UL << IPCT_INTEN0_RECEIVE13_Pos)
  #define IPCT_INTEN0_RECEIVE13_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE13_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE13_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE13_Enabled (0x1UL)

/* RECEIVE14 @Bit 14 : Enable or disable interrupt for event RECEIVE[14] */
  #define IPCT_INTEN0_RECEIVE14_Pos (14UL)
  #define IPCT_INTEN0_RECEIVE14_Msk (0x1UL << IPCT_INTEN0_RECEIVE14_Pos)
  #define IPCT_INTEN0_RECEIVE14_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE14_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE14_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE14_Enabled (0x1UL)

/* RECEIVE15 @Bit 15 : Enable or disable interrupt for event RECEIVE[15] */
  #define IPCT_INTEN0_RECEIVE15_Pos (15UL)
  #define IPCT_INTEN0_RECEIVE15_Msk (0x1UL << IPCT_INTEN0_RECEIVE15_Pos)
  #define IPCT_INTEN0_RECEIVE15_Min (0x0UL)
  #define IPCT_INTEN0_RECEIVE15_Max (0x1UL)
  #define IPCT_INTEN0_RECEIVE15_Disabled (0x0UL)
  #define IPCT_INTEN0_RECEIVE15_Enabled (0x1UL)

/* READY0 @Bit 16 : Enable or disable interrupt for event READY[0] */
  #define IPCT_INTEN0_READY0_Pos (16UL)
  #define IPCT_INTEN0_READY0_Msk (0x1UL << IPCT_INTEN0_READY0_Pos)
  #define IPCT_INTEN0_READY0_Min (0x0UL)
  #define IPCT_INTEN0_READY0_Max (0x1UL)
  #define IPCT_INTEN0_READY0_Disabled (0x0UL)
  #define IPCT_INTEN0_READY0_Enabled (0x1UL)

/* READY1 @Bit 17 : Enable or disable interrupt for event READY[1] */
  #define IPCT_INTEN0_READY1_Pos (17UL)
  #define IPCT_INTEN0_READY1_Msk (0x1UL << IPCT_INTEN0_READY1_Pos)
  #define IPCT_INTEN0_READY1_Min (0x0UL)
  #define IPCT_INTEN0_READY1_Max (0x1UL)
  #define IPCT_INTEN0_READY1_Disabled (0x0UL)
  #define IPCT_INTEN0_READY1_Enabled (0x1UL)

/* READY2 @Bit 18 : Enable or disable interrupt for event READY[2] */
  #define IPCT_INTEN0_READY2_Pos (18UL)
  #define IPCT_INTEN0_READY2_Msk (0x1UL << IPCT_INTEN0_READY2_Pos)
  #define IPCT_INTEN0_READY2_Min (0x0UL)
  #define IPCT_INTEN0_READY2_Max (0x1UL)
  #define IPCT_INTEN0_READY2_Disabled (0x0UL)
  #define IPCT_INTEN0_READY2_Enabled (0x1UL)

/* READY3 @Bit 19 : Enable or disable interrupt for event READY[3] */
  #define IPCT_INTEN0_READY3_Pos (19UL)
  #define IPCT_INTEN0_READY3_Msk (0x1UL << IPCT_INTEN0_READY3_Pos)
  #define IPCT_INTEN0_READY3_Min (0x0UL)
  #define IPCT_INTEN0_READY3_Max (0x1UL)
  #define IPCT_INTEN0_READY3_Disabled (0x0UL)
  #define IPCT_INTEN0_READY3_Enabled (0x1UL)

/* READY4 @Bit 20 : Enable or disable interrupt for event READY[4] */
  #define IPCT_INTEN0_READY4_Pos (20UL)
  #define IPCT_INTEN0_READY4_Msk (0x1UL << IPCT_INTEN0_READY4_Pos)
  #define IPCT_INTEN0_READY4_Min (0x0UL)
  #define IPCT_INTEN0_READY4_Max (0x1UL)
  #define IPCT_INTEN0_READY4_Disabled (0x0UL)
  #define IPCT_INTEN0_READY4_Enabled (0x1UL)

/* READY5 @Bit 21 : Enable or disable interrupt for event READY[5] */
  #define IPCT_INTEN0_READY5_Pos (21UL)
  #define IPCT_INTEN0_READY5_Msk (0x1UL << IPCT_INTEN0_READY5_Pos)
  #define IPCT_INTEN0_READY5_Min (0x0UL)
  #define IPCT_INTEN0_READY5_Max (0x1UL)
  #define IPCT_INTEN0_READY5_Disabled (0x0UL)
  #define IPCT_INTEN0_READY5_Enabled (0x1UL)

/* READY6 @Bit 22 : Enable or disable interrupt for event READY[6] */
  #define IPCT_INTEN0_READY6_Pos (22UL)
  #define IPCT_INTEN0_READY6_Msk (0x1UL << IPCT_INTEN0_READY6_Pos)
  #define IPCT_INTEN0_READY6_Min (0x0UL)
  #define IPCT_INTEN0_READY6_Max (0x1UL)
  #define IPCT_INTEN0_READY6_Disabled (0x0UL)
  #define IPCT_INTEN0_READY6_Enabled (0x1UL)

/* READY7 @Bit 23 : Enable or disable interrupt for event READY[7] */
  #define IPCT_INTEN0_READY7_Pos (23UL)
  #define IPCT_INTEN0_READY7_Msk (0x1UL << IPCT_INTEN0_READY7_Pos)
  #define IPCT_INTEN0_READY7_Min (0x0UL)
  #define IPCT_INTEN0_READY7_Max (0x1UL)
  #define IPCT_INTEN0_READY7_Disabled (0x0UL)
  #define IPCT_INTEN0_READY7_Enabled (0x1UL)

/* READY8 @Bit 24 : Enable or disable interrupt for event READY[8] */
  #define IPCT_INTEN0_READY8_Pos (24UL)
  #define IPCT_INTEN0_READY8_Msk (0x1UL << IPCT_INTEN0_READY8_Pos)
  #define IPCT_INTEN0_READY8_Min (0x0UL)
  #define IPCT_INTEN0_READY8_Max (0x1UL)
  #define IPCT_INTEN0_READY8_Disabled (0x0UL)
  #define IPCT_INTEN0_READY8_Enabled (0x1UL)

/* READY9 @Bit 25 : Enable or disable interrupt for event READY[9] */
  #define IPCT_INTEN0_READY9_Pos (25UL)
  #define IPCT_INTEN0_READY9_Msk (0x1UL << IPCT_INTEN0_READY9_Pos)
  #define IPCT_INTEN0_READY9_Min (0x0UL)
  #define IPCT_INTEN0_READY9_Max (0x1UL)
  #define IPCT_INTEN0_READY9_Disabled (0x0UL)
  #define IPCT_INTEN0_READY9_Enabled (0x1UL)

/* READY10 @Bit 26 : Enable or disable interrupt for event READY[10] */
  #define IPCT_INTEN0_READY10_Pos (26UL)
  #define IPCT_INTEN0_READY10_Msk (0x1UL << IPCT_INTEN0_READY10_Pos)
  #define IPCT_INTEN0_READY10_Min (0x0UL)
  #define IPCT_INTEN0_READY10_Max (0x1UL)
  #define IPCT_INTEN0_READY10_Disabled (0x0UL)
  #define IPCT_INTEN0_READY10_Enabled (0x1UL)

/* READY11 @Bit 27 : Enable or disable interrupt for event READY[11] */
  #define IPCT_INTEN0_READY11_Pos (27UL)
  #define IPCT_INTEN0_READY11_Msk (0x1UL << IPCT_INTEN0_READY11_Pos)
  #define IPCT_INTEN0_READY11_Min (0x0UL)
  #define IPCT_INTEN0_READY11_Max (0x1UL)
  #define IPCT_INTEN0_READY11_Disabled (0x0UL)
  #define IPCT_INTEN0_READY11_Enabled (0x1UL)

/* READY12 @Bit 28 : Enable or disable interrupt for event READY[12] */
  #define IPCT_INTEN0_READY12_Pos (28UL)
  #define IPCT_INTEN0_READY12_Msk (0x1UL << IPCT_INTEN0_READY12_Pos)
  #define IPCT_INTEN0_READY12_Min (0x0UL)
  #define IPCT_INTEN0_READY12_Max (0x1UL)
  #define IPCT_INTEN0_READY12_Disabled (0x0UL)
  #define IPCT_INTEN0_READY12_Enabled (0x1UL)

/* READY13 @Bit 29 : Enable or disable interrupt for event READY[13] */
  #define IPCT_INTEN0_READY13_Pos (29UL)
  #define IPCT_INTEN0_READY13_Msk (0x1UL << IPCT_INTEN0_READY13_Pos)
  #define IPCT_INTEN0_READY13_Min (0x0UL)
  #define IPCT_INTEN0_READY13_Max (0x1UL)
  #define IPCT_INTEN0_READY13_Disabled (0x0UL)
  #define IPCT_INTEN0_READY13_Enabled (0x1UL)

/* READY14 @Bit 30 : Enable or disable interrupt for event READY[14] */
  #define IPCT_INTEN0_READY14_Pos (30UL)
  #define IPCT_INTEN0_READY14_Msk (0x1UL << IPCT_INTEN0_READY14_Pos)
  #define IPCT_INTEN0_READY14_Min (0x0UL)
  #define IPCT_INTEN0_READY14_Max (0x1UL)
  #define IPCT_INTEN0_READY14_Disabled (0x0UL)
  #define IPCT_INTEN0_READY14_Enabled (0x1UL)

