pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RECEIVE1 @Bit 1 : Read pending status of interrupt for event RECEIVE[1] */
  #define IPCT_INTPEND1_RECEIVE1_Pos (1UL)
  #define IPCT_INTPEND1_RECEIVE1_Msk (0x1UL << IPCT_INTPEND1_RECEIVE1_Pos)
  #define IPCT_INTPEND1_RECEIVE1_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE1_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE1_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE1_Pending (0x1UL)

/* RECEIVE2 @Bit 2 : Read pending status of interrupt for event RECEIVE[2] */
  #define IPCT_INTPEND1_RECEIVE2_Pos (2UL)
  #define IPCT_INTPEND1_RECEIVE2_Msk (0x1UL << IPCT_INTPEND1_RECEIVE2_Pos)
  #define IPCT_INTPEND1_RECEIVE2_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE2_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE2_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE2_Pending (0x1UL)

/* RECEIVE3 @Bit 3 : Read pending status of interrupt for event RECEIVE[3] */
  #define IPCT_INTPEND1_RECEIVE3_Pos (3UL)
  #define IPCT_INTPEND1_RECEIVE3_Msk (0x1UL << IPCT_INTPEND1_RECEIVE3_Pos)
  #define IPCT_INTPEND1_RECEIVE3_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE3_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE3_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE3_Pending (0x1UL)

/* RECEIVE4 @Bit 4 : Read pending status of interrupt for event RECEIVE[4] */
  #define IPCT_INTPEND1_RECEIVE4_Pos (4UL)
  #define IPCT_INTPEND1_RECEIVE4_Msk (0x1UL << IPCT_INTPEND1_RECEIVE4_Pos)
  #define IPCT_INTPEND1_RECEIVE4_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE4_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE4_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE4_Pending (0x1UL)

/* RECEIVE5 @Bit 5 : Read pending status of interrupt for event RECEIVE[5] */
  #define IPCT_INTPEND1_RECEIVE5_Pos (5UL)
  #define IPCT_INTPEND1_RECEIVE5_Msk (0x1UL << IPCT_INTPEND1_RECEIVE5_Pos)
  #define IPCT_INTPEND1_RECEIVE5_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE5_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE5_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE5_Pending (0x1UL)

/* RECEIVE6 @Bit 6 : Read pending status of interrupt for event RECEIVE[6] */
  #define IPCT_INTPEND1_RECEIVE6_Pos (6UL)
  #define IPCT_INTPEND1_RECEIVE6_Msk (0x1UL << IPCT_INTPEND1_RECEIVE6_Pos)
  #define IPCT_INTPEND1_RECEIVE6_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE6_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE6_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE6_Pending (0x1UL)

/* RECEIVE7 @Bit 7 : Read pending status of interrupt for event RECEIVE[7] */
  #define IPCT_INTPEND1_RECEIVE7_Pos (7UL)
  #define IPCT_INTPEND1_RECEIVE7_Msk (0x1UL << IPCT_INTPEND1_RECEIVE7_Pos)
  #define IPCT_INTPEND1_RECEIVE7_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE7_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE7_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE7_Pending (0x1UL)

/* RECEIVE8 @Bit 8 : Read pending status of interrupt for event RECEIVE[8] */
  #define IPCT_INTPEND1_RECEIVE8_Pos (8UL)
  #define IPCT_INTPEND1_RECEIVE8_Msk (0x1UL << IPCT_INTPEND1_RECEIVE8_Pos)
  #define IPCT_INTPEND1_RECEIVE8_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE8_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE8_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE8_Pending (0x1UL)

/* RECEIVE9 @Bit 9 : Read pending status of interrupt for event RECEIVE[9] */
  #define IPCT_INTPEND1_RECEIVE9_Pos (9UL)
  #define IPCT_INTPEND1_RECEIVE9_Msk (0x1UL << IPCT_INTPEND1_RECEIVE9_Pos)
  #define IPCT_INTPEND1_RECEIVE9_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE9_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE9_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE9_Pending (0x1UL)

/* RECEIVE10 @Bit 10 : Read pending status of interrupt for event RECEIVE[10] */
  #define IPCT_INTPEND1_RECEIVE10_Pos (10UL)
  #define IPCT_INTPEND1_RECEIVE10_Msk (0x1UL << IPCT_INTPEND1_RECEIVE10_Pos)
  #define IPCT_INTPEND1_RECEIVE10_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE10_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE10_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE10_Pending (0x1UL)

/* RECEIVE11 @Bit 11 : Read pending status of interrupt for event RECEIVE[11] */
  #define IPCT_INTPEND1_RECEIVE11_Pos (11UL)
  #define IPCT_INTPEND1_RECEIVE11_Msk (0x1UL << IPCT_INTPEND1_RECEIVE11_Pos)
  #define IPCT_INTPEND1_RECEIVE11_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE11_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE11_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE11_Pending (0x1UL)

/* RECEIVE12 @Bit 12 : Read pending status of interrupt for event RECEIVE[12] */
  #define IPCT_INTPEND1_RECEIVE12_Pos (12UL)
  #define IPCT_INTPEND1_RECEIVE12_Msk (0x1UL << IPCT_INTPEND1_RECEIVE12_Pos)
  #define IPCT_INTPEND1_RECEIVE12_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE12_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE12_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE12_Pending (0x1UL)

/* RECEIVE13 @Bit 13 : Read pending status of interrupt for event RECEIVE[13] */
  #define IPCT_INTPEND1_RECEIVE13_Pos (13UL)
  #define IPCT_INTPEND1_RECEIVE13_Msk (0x1UL << IPCT_INTPEND1_RECEIVE13_Pos)
  #define IPCT_INTPEND1_RECEIVE13_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE13_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE13_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE13_Pending (0x1UL)

/* RECEIVE14 @Bit 14 : Read pending status of interrupt for event RECEIVE[14] */
  #define IPCT_INTPEND1_RECEIVE14_Pos (14UL)
  #define IPCT_INTPEND1_RECEIVE14_Msk (0x1UL << IPCT_INTPEND1_RECEIVE14_Pos)
  #define IPCT_INTPEND1_RECEIVE14_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE14_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE14_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE14_Pending (0x1UL)

/* RECEIVE15 @Bit 15 : Read pending status of interrupt for event RECEIVE[15] */
  #define IPCT_INTPEND1_RECEIVE15_Pos (15UL)
  #define IPCT_INTPEND1_RECEIVE15_Msk (0x1UL << IPCT_INTPEND1_RECEIVE15_Pos)
  #define IPCT_INTPEND1_RECEIVE15_Min (0x0UL)
  #define IPCT_INTPEND1_RECEIVE15_Max (0x1UL)
  #define IPCT_INTPEND1_RECEIVE15_NotPending (0x0UL)
  #define IPCT_INTPEND1_RECEIVE15_Pending (0x1UL)

/* READY0 @Bit 16 : Read pending status of interrupt for event READY[0] */
  #define IPCT_INTPEND1_READY0_Pos (16UL)
  #define IPCT_INTPEND1_READY0_Msk (0x1UL << IPCT_INTPEND1_READY0_Pos)
  #define IPCT_INTPEND1_READY0_Min (0x0UL)
  #define IPCT_INTPEND1_READY0_Max (0x1UL)
  #define IPCT_INTPEND1_READY0_NotPending (0x0UL)
  #define IPCT_INTPEND1_READY0_Pending (0x1UL)

/* READY1 @Bit 17 : Read pending status of interrupt for event READY[1] */
  #define IPCT_INTPEND1_READY1_Pos (17UL)
  #define IPCT_INTPEND1_READY1_Msk (0x1UL << IPCT_INTPEND1_READY1_Pos)
  #define IPCT_INTPEND1_READY1_Min (0x0UL)
  #define IPCT_INTPEND1_READY1_Max (0x1UL)
  #define IPCT_INTPEND1_READY1_NotPending (0x0UL)
  #define IPCT_INTPEND1_READY1_Pending (0x1UL)

/* READY2 @Bit 18 : Read pending status of interrupt for event READY[2] */
  #define IPCT_INTPEND1_READY2_Pos (18UL)
  #define IPCT_INTPEND1_READY2_Msk (0x1UL << IPCT_INTPEND1_READY2_Pos)
  #define IPCT_INTPEND1_READY2_Min (0x0UL)
  #define IPCT_INTPEND1_READY2_Max (0x1UL)
  #define IPCT_INTPEND1_READY2_NotPending (0x0UL)
  #define IPCT_INTPEND1_READY2_Pending (0x1UL)

/* READY3 @Bit 19 : Read pending status of interrupt for event READY[3] */
  #define IPCT_INTPEND1_READY3_Pos (19UL)
  #define IPCT_INTPEND1_READY3_Msk (0x1UL << IPCT_INTPEND1_READY3_Pos)
  #define IPCT_INTPEND1_READY3_Min (0x0UL)
  #define IPCT_INTPEND1_READY3_Max (0x1UL)
  #define IPCT_INTPEND1_READY3_NotPending (0x0UL)
  #define IPCT_INTPEND1_READY3_Pending (0x1UL)

