pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RECEIVE6 @Bit 6 : Enable or disable interrupt for event RECEIVE[6] */
  #define IPCT_INTEN2_RECEIVE6_Pos (6UL)
  #define IPCT_INTEN2_RECEIVE6_Msk (0x1UL << IPCT_INTEN2_RECEIVE6_Pos)
  #define IPCT_INTEN2_RECEIVE6_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE6_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE6_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE6_Enabled (0x1UL)

/* RECEIVE7 @Bit 7 : Enable or disable interrupt for event RECEIVE[7] */
  #define IPCT_INTEN2_RECEIVE7_Pos (7UL)
  #define IPCT_INTEN2_RECEIVE7_Msk (0x1UL << IPCT_INTEN2_RECEIVE7_Pos)
  #define IPCT_INTEN2_RECEIVE7_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE7_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE7_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE7_Enabled (0x1UL)

/* RECEIVE8 @Bit 8 : Enable or disable interrupt for event RECEIVE[8] */
  #define IPCT_INTEN2_RECEIVE8_Pos (8UL)
  #define IPCT_INTEN2_RECEIVE8_Msk (0x1UL << IPCT_INTEN2_RECEIVE8_Pos)
  #define IPCT_INTEN2_RECEIVE8_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE8_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE8_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE8_Enabled (0x1UL)

/* RECEIVE9 @Bit 9 : Enable or disable interrupt for event RECEIVE[9] */
  #define IPCT_INTEN2_RECEIVE9_Pos (9UL)
  #define IPCT_INTEN2_RECEIVE9_Msk (0x1UL << IPCT_INTEN2_RECEIVE9_Pos)
  #define IPCT_INTEN2_RECEIVE9_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE9_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE9_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE9_Enabled (0x1UL)

/* RECEIVE10 @Bit 10 : Enable or disable interrupt for event RECEIVE[10] */
  #define IPCT_INTEN2_RECEIVE10_Pos (10UL)
  #define IPCT_INTEN2_RECEIVE10_Msk (0x1UL << IPCT_INTEN2_RECEIVE10_Pos)
  #define IPCT_INTEN2_RECEIVE10_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE10_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE10_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE10_Enabled (0x1UL)

/* RECEIVE11 @Bit 11 : Enable or disable interrupt for event RECEIVE[11] */
  #define IPCT_INTEN2_RECEIVE11_Pos (11UL)
  #define IPCT_INTEN2_RECEIVE11_Msk (0x1UL << IPCT_INTEN2_RECEIVE11_Pos)
  #define IPCT_INTEN2_RECEIVE11_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE11_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE11_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE11_Enabled (0x1UL)

/* RECEIVE12 @Bit 12 : Enable or disable interrupt for event RECEIVE[12] */
  #define IPCT_INTEN2_RECEIVE12_Pos (12UL)
  #define IPCT_INTEN2_RECEIVE12_Msk (0x1UL << IPCT_INTEN2_RECEIVE12_Pos)
  #define IPCT_INTEN2_RECEIVE12_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE12_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE12_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE12_Enabled (0x1UL)

/* RECEIVE13 @Bit 13 : Enable or disable interrupt for event RECEIVE[13] */
  #define IPCT_INTEN2_RECEIVE13_Pos (13UL)
  #define IPCT_INTEN2_RECEIVE13_Msk (0x1UL << IPCT_INTEN2_RECEIVE13_Pos)
  #define IPCT_INTEN2_RECEIVE13_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE13_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE13_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE13_Enabled (0x1UL)

/* RECEIVE14 @Bit 14 : Enable or disable interrupt for event RECEIVE[14] */
  #define IPCT_INTEN2_RECEIVE14_Pos (14UL)
  #define IPCT_INTEN2_RECEIVE14_Msk (0x1UL << IPCT_INTEN2_RECEIVE14_Pos)
  #define IPCT_INTEN2_RECEIVE14_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE14_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE14_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE14_Enabled (0x1UL)

/* RECEIVE15 @Bit 15 : Enable or disable interrupt for event RECEIVE[15] */
  #define IPCT_INTEN2_RECEIVE15_Pos (15UL)
  #define IPCT_INTEN2_RECEIVE15_Msk (0x1UL << IPCT_INTEN2_RECEIVE15_Pos)
  #define IPCT_INTEN2_RECEIVE15_Min (0x0UL)
  #define IPCT_INTEN2_RECEIVE15_Max (0x1UL)
  #define IPCT_INTEN2_RECEIVE15_Disabled (0x0UL)
  #define IPCT_INTEN2_RECEIVE15_Enabled (0x1UL)

/* READY0 @Bit 16 : Enable or disable interrupt for event READY[0] */
  #define IPCT_INTEN2_READY0_Pos (16UL)
  #define IPCT_INTEN2_READY0_Msk (0x1UL << IPCT_INTEN2_READY0_Pos)
  #define IPCT_INTEN2_READY0_Min (0x0UL)
  #define IPCT_INTEN2_READY0_Max (0x1UL)
  #define IPCT_INTEN2_READY0_Disabled (0x0UL)
  #define IPCT_INTEN2_READY0_Enabled (0x1UL)

/* READY1 @Bit 17 : Enable or disable interrupt for event READY[1] */
  #define IPCT_INTEN2_READY1_Pos (17UL)
  #define IPCT_INTEN2_READY1_Msk (0x1UL << IPCT_INTEN2_READY1_Pos)
  #define IPCT_INTEN2_READY1_Min (0x0UL)
  #define IPCT_INTEN2_READY1_Max (0x1UL)
  #define IPCT_INTEN2_READY1_Disabled (0x0UL)
  #define IPCT_INTEN2_READY1_Enabled (0x1UL)

/* READY2 @Bit 18 : Enable or disable interrupt for event READY[2] */
  #define IPCT_INTEN2_READY2_Pos (18UL)
  #define IPCT_INTEN2_READY2_Msk (0x1UL << IPCT_INTEN2_READY2_Pos)
  #define IPCT_INTEN2_READY2_Min (0x0UL)
  #define IPCT_INTEN2_READY2_Max (0x1UL)
  #define IPCT_INTEN2_READY2_Disabled (0x0UL)
  #define IPCT_INTEN2_READY2_Enabled (0x1UL)

/* READY3 @Bit 19 : Enable or disable interrupt for event READY[3] */
  #define IPCT_INTEN2_READY3_Pos (19UL)
  #define IPCT_INTEN2_READY3_Msk (0x1UL << IPCT_INTEN2_READY3_Pos)
  #define IPCT_INTEN2_READY3_Min (0x0UL)
  #define IPCT_INTEN2_READY3_Max (0x1UL)
  #define IPCT_INTEN2_READY3_Disabled (0x0UL)
  #define IPCT_INTEN2_READY3_Enabled (0x1UL)

/* READY4 @Bit 20 : Enable or disable interrupt for event READY[4] */
  #define IPCT_INTEN2_READY4_Pos (20UL)
  #define IPCT_INTEN2_READY4_Msk (0x1UL << IPCT_INTEN2_READY4_Pos)
  #define IPCT_INTEN2_READY4_Min (0x0UL)
  #define IPCT_INTEN2_READY4_Max (0x1UL)
  #define IPCT_INTEN2_READY4_Disabled (0x0UL)
  #define IPCT_INTEN2_READY4_Enabled (0x1UL)

/* READY5 @Bit 21 : Enable or disable interrupt for event READY[5] */
  #define IPCT_INTEN2_READY5_Pos (21UL)
  #define IPCT_INTEN2_READY5_Msk (0x1UL << IPCT_INTEN2_READY5_Pos)
  #define IPCT_INTEN2_READY5_Min (0x0UL)
  #define IPCT_INTEN2_READY5_Max (0x1UL)
  #define IPCT_INTEN2_READY5_Disabled (0x0UL)
  #define IPCT_INTEN2_READY5_Enabled (0x1UL)

/* READY6 @Bit 22 : Enable or disable interrupt for event READY[6] */
  #define IPCT_INTEN2_READY6_Pos (22UL)
  #define IPCT_INTEN2_READY6_Msk (0x1UL << IPCT_INTEN2_READY6_Pos)
  #define IPCT_INTEN2_READY6_Min (0x0UL)
  #define IPCT_INTEN2_READY6_Max (0x1UL)
  #define IPCT_INTEN2_READY6_Disabled (0x0UL)
  #define IPCT_INTEN2_READY6_Enabled (0x1UL)

