pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* READY2 @Bit 18 : Write '1' to disable interrupt for event READY[2] */
  #define IPCT_INTENCLR4_READY2_Pos (18UL)
  #define IPCT_INTENCLR4_READY2_Msk (0x1UL << IPCT_INTENCLR4_READY2_Pos)
  #define IPCT_INTENCLR4_READY2_Min (0x0UL)
  #define IPCT_INTENCLR4_READY2_Max (0x1UL)
  #define IPCT_INTENCLR4_READY2_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY2_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY2_Enabled (0x1UL)

/* READY3 @Bit 19 : Write '1' to disable interrupt for event READY[3] */
  #define IPCT_INTENCLR4_READY3_Pos (19UL)
  #define IPCT_INTENCLR4_READY3_Msk (0x1UL << IPCT_INTENCLR4_READY3_Pos)
  #define IPCT_INTENCLR4_READY3_Min (0x0UL)
  #define IPCT_INTENCLR4_READY3_Max (0x1UL)
  #define IPCT_INTENCLR4_READY3_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY3_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY3_Enabled (0x1UL)

/* READY4 @Bit 20 : Write '1' to disable interrupt for event READY[4] */
  #define IPCT_INTENCLR4_READY4_Pos (20UL)
  #define IPCT_INTENCLR4_READY4_Msk (0x1UL << IPCT_INTENCLR4_READY4_Pos)
  #define IPCT_INTENCLR4_READY4_Min (0x0UL)
  #define IPCT_INTENCLR4_READY4_Max (0x1UL)
  #define IPCT_INTENCLR4_READY4_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY4_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY4_Enabled (0x1UL)

/* READY5 @Bit 21 : Write '1' to disable interrupt for event READY[5] */
  #define IPCT_INTENCLR4_READY5_Pos (21UL)
  #define IPCT_INTENCLR4_READY5_Msk (0x1UL << IPCT_INTENCLR4_READY5_Pos)
  #define IPCT_INTENCLR4_READY5_Min (0x0UL)
  #define IPCT_INTENCLR4_READY5_Max (0x1UL)
  #define IPCT_INTENCLR4_READY5_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY5_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY5_Enabled (0x1UL)

/* READY6 @Bit 22 : Write '1' to disable interrupt for event READY[6] */
  #define IPCT_INTENCLR4_READY6_Pos (22UL)
  #define IPCT_INTENCLR4_READY6_Msk (0x1UL << IPCT_INTENCLR4_READY6_Pos)
  #define IPCT_INTENCLR4_READY6_Min (0x0UL)
  #define IPCT_INTENCLR4_READY6_Max (0x1UL)
  #define IPCT_INTENCLR4_READY6_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY6_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY6_Enabled (0x1UL)

/* READY7 @Bit 23 : Write '1' to disable interrupt for event READY[7] */
  #define IPCT_INTENCLR4_READY7_Pos (23UL)
  #define IPCT_INTENCLR4_READY7_Msk (0x1UL << IPCT_INTENCLR4_READY7_Pos)
  #define IPCT_INTENCLR4_READY7_Min (0x0UL)
  #define IPCT_INTENCLR4_READY7_Max (0x1UL)
  #define IPCT_INTENCLR4_READY7_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY7_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY7_Enabled (0x1UL)

/* READY8 @Bit 24 : Write '1' to disable interrupt for event READY[8] */
  #define IPCT_INTENCLR4_READY8_Pos (24UL)
  #define IPCT_INTENCLR4_READY8_Msk (0x1UL << IPCT_INTENCLR4_READY8_Pos)
  #define IPCT_INTENCLR4_READY8_Min (0x0UL)
  #define IPCT_INTENCLR4_READY8_Max (0x1UL)
  #define IPCT_INTENCLR4_READY8_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY8_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY8_Enabled (0x1UL)

/* READY9 @Bit 25 : Write '1' to disable interrupt for event READY[9] */
  #define IPCT_INTENCLR4_READY9_Pos (25UL)
  #define IPCT_INTENCLR4_READY9_Msk (0x1UL << IPCT_INTENCLR4_READY9_Pos)
  #define IPCT_INTENCLR4_READY9_Min (0x0UL)
  #define IPCT_INTENCLR4_READY9_Max (0x1UL)
  #define IPCT_INTENCLR4_READY9_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY9_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY9_Enabled (0x1UL)

/* READY10 @Bit 26 : Write '1' to disable interrupt for event READY[10] */
  #define IPCT_INTENCLR4_READY10_Pos (26UL)
  #define IPCT_INTENCLR4_READY10_Msk (0x1UL << IPCT_INTENCLR4_READY10_Pos)
  #define IPCT_INTENCLR4_READY10_Min (0x0UL)
  #define IPCT_INTENCLR4_READY10_Max (0x1UL)
  #define IPCT_INTENCLR4_READY10_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY10_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY10_Enabled (0x1UL)

/* READY11 @Bit 27 : Write '1' to disable interrupt for event READY[11] */
  #define IPCT_INTENCLR4_READY11_Pos (27UL)
  #define IPCT_INTENCLR4_READY11_Msk (0x1UL << IPCT_INTENCLR4_READY11_Pos)
  #define IPCT_INTENCLR4_READY11_Min (0x0UL)
  #define IPCT_INTENCLR4_READY11_Max (0x1UL)
  #define IPCT_INTENCLR4_READY11_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY11_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY11_Enabled (0x1UL)

/* READY12 @Bit 28 : Write '1' to disable interrupt for event READY[12] */
  #define IPCT_INTENCLR4_READY12_Pos (28UL)
  #define IPCT_INTENCLR4_READY12_Msk (0x1UL << IPCT_INTENCLR4_READY12_Pos)
  #define IPCT_INTENCLR4_READY12_Min (0x0UL)
  #define IPCT_INTENCLR4_READY12_Max (0x1UL)
  #define IPCT_INTENCLR4_READY12_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY12_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY12_Enabled (0x1UL)

/* READY13 @Bit 29 : Write '1' to disable interrupt for event READY[13] */
  #define IPCT_INTENCLR4_READY13_Pos (29UL)
  #define IPCT_INTENCLR4_READY13_Msk (0x1UL << IPCT_INTENCLR4_READY13_Pos)
  #define IPCT_INTENCLR4_READY13_Min (0x0UL)
  #define IPCT_INTENCLR4_READY13_Max (0x1UL)
  #define IPCT_INTENCLR4_READY13_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY13_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY13_Enabled (0x1UL)

/* READY14 @Bit 30 : Write '1' to disable interrupt for event READY[14] */
  #define IPCT_INTENCLR4_READY14_Pos (30UL)
  #define IPCT_INTENCLR4_READY14_Msk (0x1UL << IPCT_INTENCLR4_READY14_Pos)
  #define IPCT_INTENCLR4_READY14_Min (0x0UL)
  #define IPCT_INTENCLR4_READY14_Max (0x1UL)
  #define IPCT_INTENCLR4_READY14_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY14_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY14_Enabled (0x1UL)

/* READY15 @Bit 31 : Write '1' to disable interrupt for event READY[15] */
  #define IPCT_INTENCLR4_READY15_Pos (31UL)
  #define IPCT_INTENCLR4_READY15_Msk (0x1UL << IPCT_INTENCLR4_READY15_Pos)
  #define IPCT_INTENCLR4_READY15_Min (0x0UL)
  #define IPCT_INTENCLR4_READY15_Max (0x1UL)
  #define IPCT_INTENCLR4_READY15_Clear (0x1UL)
  #define IPCT_INTENCLR4_READY15_Disabled (0x0UL)
  #define IPCT_INTENCLR4_READY15_Enabled (0x1UL)


/* IPCT_INTPEND4: Pending interrupts */
  #define IPCT_INTPEND4_ResetValue (0x00000000UL)

/* RECEIVE0 @Bit 0 : Read pending status of interrupt for event RECEIVE[0] */
  #define IPCT_INTPEND4_RECEIVE0_Pos (0UL)
  #define IPCT_INTPEND4_RECEIVE0_Msk (0x1UL << IPCT_INTPEND4_RECEIVE0_Pos)
  #define IPCT_INTPEND4_RECEIVE0_Min (0x0UL)
  #define IPCT_INTPEND4_RECEIVE0_Max (0x1UL)
  #define IPCT_INTPEND4_RECEIVE0_NotPending (0x0UL)
  #define IPCT_INTPEND4_RECEIVE0_Pending (0x1UL)

