pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RECEIVE3 @Bit 3 : Write '1' to disable interrupt for event RECEIVE[3] */
  #define IPCT_INTENCLR6_RECEIVE3_Pos (3UL)
  #define IPCT_INTENCLR6_RECEIVE3_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE3_Pos)
  #define IPCT_INTENCLR6_RECEIVE3_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE3_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE3_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE3_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE3_Enabled (0x1UL)

/* RECEIVE4 @Bit 4 : Write '1' to disable interrupt for event RECEIVE[4] */
  #define IPCT_INTENCLR6_RECEIVE4_Pos (4UL)
  #define IPCT_INTENCLR6_RECEIVE4_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE4_Pos)
  #define IPCT_INTENCLR6_RECEIVE4_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE4_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE4_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE4_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE4_Enabled (0x1UL)

/* RECEIVE5 @Bit 5 : Write '1' to disable interrupt for event RECEIVE[5] */
  #define IPCT_INTENCLR6_RECEIVE5_Pos (5UL)
  #define IPCT_INTENCLR6_RECEIVE5_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE5_Pos)
  #define IPCT_INTENCLR6_RECEIVE5_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE5_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE5_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE5_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE5_Enabled (0x1UL)

/* RECEIVE6 @Bit 6 : Write '1' to disable interrupt for event RECEIVE[6] */
  #define IPCT_INTENCLR6_RECEIVE6_Pos (6UL)
  #define IPCT_INTENCLR6_RECEIVE6_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE6_Pos)
  #define IPCT_INTENCLR6_RECEIVE6_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE6_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE6_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE6_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE6_Enabled (0x1UL)

/* RECEIVE7 @Bit 7 : Write '1' to disable interrupt for event RECEIVE[7] */
  #define IPCT_INTENCLR6_RECEIVE7_Pos (7UL)
  #define IPCT_INTENCLR6_RECEIVE7_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE7_Pos)
  #define IPCT_INTENCLR6_RECEIVE7_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE7_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE7_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE7_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE7_Enabled (0x1UL)

/* RECEIVE8 @Bit 8 : Write '1' to disable interrupt for event RECEIVE[8] */
  #define IPCT_INTENCLR6_RECEIVE8_Pos (8UL)
  #define IPCT_INTENCLR6_RECEIVE8_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE8_Pos)
  #define IPCT_INTENCLR6_RECEIVE8_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE8_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE8_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE8_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE8_Enabled (0x1UL)

/* RECEIVE9 @Bit 9 : Write '1' to disable interrupt for event RECEIVE[9] */
  #define IPCT_INTENCLR6_RECEIVE9_Pos (9UL)
  #define IPCT_INTENCLR6_RECEIVE9_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE9_Pos)
  #define IPCT_INTENCLR6_RECEIVE9_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE9_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE9_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE9_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE9_Enabled (0x1UL)

/* RECEIVE10 @Bit 10 : Write '1' to disable interrupt for event RECEIVE[10] */
  #define IPCT_INTENCLR6_RECEIVE10_Pos (10UL)
  #define IPCT_INTENCLR6_RECEIVE10_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE10_Pos)
  #define IPCT_INTENCLR6_RECEIVE10_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE10_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE10_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE10_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE10_Enabled (0x1UL)

/* RECEIVE11 @Bit 11 : Write '1' to disable interrupt for event RECEIVE[11] */
  #define IPCT_INTENCLR6_RECEIVE11_Pos (11UL)
  #define IPCT_INTENCLR6_RECEIVE11_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE11_Pos)
  #define IPCT_INTENCLR6_RECEIVE11_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE11_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE11_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE11_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE11_Enabled (0x1UL)

/* RECEIVE12 @Bit 12 : Write '1' to disable interrupt for event RECEIVE[12] */
  #define IPCT_INTENCLR6_RECEIVE12_Pos (12UL)
  #define IPCT_INTENCLR6_RECEIVE12_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE12_Pos)
  #define IPCT_INTENCLR6_RECEIVE12_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE12_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE12_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE12_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE12_Enabled (0x1UL)

/* RECEIVE13 @Bit 13 : Write '1' to disable interrupt for event RECEIVE[13] */
  #define IPCT_INTENCLR6_RECEIVE13_Pos (13UL)
  #define IPCT_INTENCLR6_RECEIVE13_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE13_Pos)
  #define IPCT_INTENCLR6_RECEIVE13_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE13_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE13_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE13_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE13_Enabled (0x1UL)

/* RECEIVE14 @Bit 14 : Write '1' to disable interrupt for event RECEIVE[14] */
  #define IPCT_INTENCLR6_RECEIVE14_Pos (14UL)
  #define IPCT_INTENCLR6_RECEIVE14_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE14_Pos)
  #define IPCT_INTENCLR6_RECEIVE14_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE14_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE14_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE14_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE14_Enabled (0x1UL)

/* RECEIVE15 @Bit 15 : Write '1' to disable interrupt for event RECEIVE[15] */
  #define IPCT_INTENCLR6_RECEIVE15_Pos (15UL)
  #define IPCT_INTENCLR6_RECEIVE15_Msk (0x1UL << IPCT_INTENCLR6_RECEIVE15_Pos)
  #define IPCT_INTENCLR6_RECEIVE15_Min (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE15_Max (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE15_Clear (0x1UL)
  #define IPCT_INTENCLR6_RECEIVE15_Disabled (0x0UL)
  #define IPCT_INTENCLR6_RECEIVE15_Enabled (0x1UL)

/* READY0 @Bit 16 : Write '1' to disable interrupt for event READY[0] */
  #define IPCT_INTENCLR6_READY0_Pos (16UL)
  #define IPCT_INTENCLR6_READY0_Msk (0x1UL << IPCT_INTENCLR6_READY0_Pos)
  #define IPCT_INTENCLR6_READY0_Min (0x0UL)
  #define IPCT_INTENCLR6_READY0_Max (0x1UL)
  #define IPCT_INTENCLR6_READY0_Clear (0x1UL)
  #define IPCT_INTENCLR6_READY0_Disabled (0x0UL)
  #define IPCT_INTENCLR6_READY0_Enabled (0x1UL)

/* READY1 @Bit 17 : Write '1' to disable interrupt for event READY[1] */
  #define IPCT_INTENCLR6_READY1_Pos (17UL)
  #define IPCT_INTENCLR6_READY1_Msk (0x1UL << IPCT_INTENCLR6_READY1_Pos)
  #define IPCT_INTENCLR6_READY1_Min (0x0UL)
  #define IPCT_INTENCLR6_READY1_Max (0x1UL)
  #define IPCT_INTENCLR6_READY1_Clear (0x1UL)
  #define IPCT_INTENCLR6_READY1_Disabled (0x0UL)
  #define IPCT_INTENCLR6_READY1_Enabled (0x1UL)

