pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* READY4 @Bit 20 : Read pending status of interrupt for event READY[4] */
  #define IPCT_INTPEND6_READY4_Pos (20UL)
  #define IPCT_INTPEND6_READY4_Msk (0x1UL << IPCT_INTPEND6_READY4_Pos)
  #define IPCT_INTPEND6_READY4_Min (0x0UL)
  #define IPCT_INTPEND6_READY4_Max (0x1UL)
  #define IPCT_INTPEND6_READY4_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY4_Pending (0x1UL)

/* READY5 @Bit 21 : Read pending status of interrupt for event READY[5] */
  #define IPCT_INTPEND6_READY5_Pos (21UL)
  #define IPCT_INTPEND6_READY5_Msk (0x1UL << IPCT_INTPEND6_READY5_Pos)
  #define IPCT_INTPEND6_READY5_Min (0x0UL)
  #define IPCT_INTPEND6_READY5_Max (0x1UL)
  #define IPCT_INTPEND6_READY5_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY5_Pending (0x1UL)

/* READY6 @Bit 22 : Read pending status of interrupt for event READY[6] */
  #define IPCT_INTPEND6_READY6_Pos (22UL)
  #define IPCT_INTPEND6_READY6_Msk (0x1UL << IPCT_INTPEND6_READY6_Pos)
  #define IPCT_INTPEND6_READY6_Min (0x0UL)
  #define IPCT_INTPEND6_READY6_Max (0x1UL)
  #define IPCT_INTPEND6_READY6_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY6_Pending (0x1UL)

/* READY7 @Bit 23 : Read pending status of interrupt for event READY[7] */
  #define IPCT_INTPEND6_READY7_Pos (23UL)
  #define IPCT_INTPEND6_READY7_Msk (0x1UL << IPCT_INTPEND6_READY7_Pos)
  #define IPCT_INTPEND6_READY7_Min (0x0UL)
  #define IPCT_INTPEND6_READY7_Max (0x1UL)
  #define IPCT_INTPEND6_READY7_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY7_Pending (0x1UL)

/* READY8 @Bit 24 : Read pending status of interrupt for event READY[8] */
  #define IPCT_INTPEND6_READY8_Pos (24UL)
  #define IPCT_INTPEND6_READY8_Msk (0x1UL << IPCT_INTPEND6_READY8_Pos)
  #define IPCT_INTPEND6_READY8_Min (0x0UL)
  #define IPCT_INTPEND6_READY8_Max (0x1UL)
  #define IPCT_INTPEND6_READY8_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY8_Pending (0x1UL)

/* READY9 @Bit 25 : Read pending status of interrupt for event READY[9] */
  #define IPCT_INTPEND6_READY9_Pos (25UL)
  #define IPCT_INTPEND6_READY9_Msk (0x1UL << IPCT_INTPEND6_READY9_Pos)
  #define IPCT_INTPEND6_READY9_Min (0x0UL)
  #define IPCT_INTPEND6_READY9_Max (0x1UL)
  #define IPCT_INTPEND6_READY9_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY9_Pending (0x1UL)

/* READY10 @Bit 26 : Read pending status of interrupt for event READY[10] */
  #define IPCT_INTPEND6_READY10_Pos (26UL)
  #define IPCT_INTPEND6_READY10_Msk (0x1UL << IPCT_INTPEND6_READY10_Pos)
  #define IPCT_INTPEND6_READY10_Min (0x0UL)
  #define IPCT_INTPEND6_READY10_Max (0x1UL)
  #define IPCT_INTPEND6_READY10_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY10_Pending (0x1UL)

/* READY11 @Bit 27 : Read pending status of interrupt for event READY[11] */
  #define IPCT_INTPEND6_READY11_Pos (27UL)
  #define IPCT_INTPEND6_READY11_Msk (0x1UL << IPCT_INTPEND6_READY11_Pos)
  #define IPCT_INTPEND6_READY11_Min (0x0UL)
  #define IPCT_INTPEND6_READY11_Max (0x1UL)
  #define IPCT_INTPEND6_READY11_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY11_Pending (0x1UL)

/* READY12 @Bit 28 : Read pending status of interrupt for event READY[12] */
  #define IPCT_INTPEND6_READY12_Pos (28UL)
  #define IPCT_INTPEND6_READY12_Msk (0x1UL << IPCT_INTPEND6_READY12_Pos)
  #define IPCT_INTPEND6_READY12_Min (0x0UL)
  #define IPCT_INTPEND6_READY12_Max (0x1UL)
  #define IPCT_INTPEND6_READY12_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY12_Pending (0x1UL)

/* READY13 @Bit 29 : Read pending status of interrupt for event READY[13] */
  #define IPCT_INTPEND6_READY13_Pos (29UL)
  #define IPCT_INTPEND6_READY13_Msk (0x1UL << IPCT_INTPEND6_READY13_Pos)
  #define IPCT_INTPEND6_READY13_Min (0x0UL)
  #define IPCT_INTPEND6_READY13_Max (0x1UL)
  #define IPCT_INTPEND6_READY13_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY13_Pending (0x1UL)

/* READY14 @Bit 30 : Read pending status of interrupt for event READY[14] */
  #define IPCT_INTPEND6_READY14_Pos (30UL)
  #define IPCT_INTPEND6_READY14_Msk (0x1UL << IPCT_INTPEND6_READY14_Pos)
  #define IPCT_INTPEND6_READY14_Min (0x0UL)
  #define IPCT_INTPEND6_READY14_Max (0x1UL)
  #define IPCT_INTPEND6_READY14_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY14_Pending (0x1UL)

/* READY15 @Bit 31 : Read pending status of interrupt for event READY[15] */
  #define IPCT_INTPEND6_READY15_Pos (31UL)
  #define IPCT_INTPEND6_READY15_Msk (0x1UL << IPCT_INTPEND6_READY15_Pos)
  #define IPCT_INTPEND6_READY15_Min (0x0UL)
  #define IPCT_INTPEND6_READY15_Max (0x1UL)
  #define IPCT_INTPEND6_READY15_NotPending (0x0UL)
  #define IPCT_INTPEND6_READY15_Pending (0x1UL)


/* IPCT_INTEN7: Enable or disable interrupt */
  #define IPCT_INTEN7_ResetValue (0x00000000UL)

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN7_RECEIVE0_Pos (0UL)
  #define IPCT_INTEN7_RECEIVE0_Msk (0x1UL << IPCT_INTEN7_RECEIVE0_Pos)
  #define IPCT_INTEN7_RECEIVE0_Min (0x0UL)
  #define IPCT_INTEN7_RECEIVE0_Max (0x1UL)
  #define IPCT_INTEN7_RECEIVE0_Disabled (0x0UL)
  #define IPCT_INTEN7_RECEIVE0_Enabled (0x1UL)

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN7_RECEIVE1_Pos (1UL)
  #define IPCT_INTEN7_RECEIVE1_Msk (0x1UL << IPCT_INTEN7_RECEIVE1_Pos)
  #define IPCT_INTEN7_RECEIVE1_Min (0x0UL)
  #define IPCT_INTEN7_RECEIVE1_Max (0x1UL)
  #define IPCT_INTEN7_RECEIVE1_Disabled (0x0UL)
  #define IPCT_INTEN7_RECEIVE1_Enabled (0x1UL)

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN7_RECEIVE2_Pos (2UL)
  #define IPCT_INTEN7_RECEIVE2_Msk (0x1UL << IPCT_INTEN7_RECEIVE2_Pos)
  #define IPCT_INTEN7_RECEIVE2_Min (0x0UL)
  #define IPCT_INTEN7_RECEIVE2_Max (0x1UL)
  #define IPCT_INTEN7_RECEIVE2_Disabled (0x0UL)
  #define IPCT_INTEN7_RECEIVE2_Enabled (0x1UL)

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN7_RECEIVE3_Pos (3UL)
  #define IPCT_INTEN7_RECEIVE3_Msk (0x1UL << IPCT_INTEN7_RECEIVE3_Pos)
  #define IPCT_INTEN7_RECEIVE3_Min (0x0UL)
  #define IPCT_INTEN7_RECEIVE3_Max (0x1UL)
  #define IPCT_INTEN7_RECEIVE3_Disabled (0x0UL)
  #define IPCT_INTEN7_RECEIVE3_Enabled (0x1UL)

/* RECEIVE4 @Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
  #define IPCT_INTEN7_RECEIVE4_Pos (4UL)
  #define IPCT_INTEN7_RECEIVE4_Msk (0x1UL << IPCT_INTEN7_RECEIVE4_Pos)
  #define IPCT_INTEN7_RECEIVE4_Min (0x0UL)
  #define IPCT_INTEN7_RECEIVE4_Max (0x1UL)
  #define IPCT_INTEN7_RECEIVE4_Disabled (0x0UL)
  #define IPCT_INTEN7_RECEIVE4_Enabled (0x1UL)

/* RECEIVE5 @Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
  #define IPCT_INTEN7_RECEIVE5_Pos (5UL)
  #define IPCT_INTEN7_RECEIVE5_Msk (0x1UL << IPCT_INTEN7_RECEIVE5_Pos)
  #define IPCT_INTEN7_RECEIVE5_Min (0x0UL)
  #define IPCT_INTEN7_RECEIVE5_Max (0x1UL)
  #define IPCT_INTEN7_RECEIVE5_Disabled (0x0UL)
  #define IPCT_INTEN7_RECEIVE5_Enabled (0x1UL)

