pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define L2CACHEDATA_SET_WAY_MaxCount (2UL)
  #define L2CACHEDATA_SET_WAY_MaxIndex (1UL)
  #define L2CACHEDATA_SET_WAY_MinIndex (0UL)


/* ================================================= Struct L2CACHEDATA_SET ================================================== */
/**
  * @brief SET [L2CACHEDATA_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_L2CACHEDATA_SET_WAY_Type WAY[2];
} NRF_L2CACHEDATA_SET_Type;
  #define L2CACHEDATA_SET_MaxCount (2048UL)
  #define L2CACHEDATA_SET_MaxIndex (2047UL)
  #define L2CACHEDATA_SET_MinIndex (0UL)

/* =================================================== Struct L2CACHEDATA ==================================================== */
/**
  * @brief CACHEDATA
  */
  typedef struct {
    __IOM NRF_L2CACHEDATA_SET_Type SET[2048];
  } NRF_L2CACHEDATA_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        L2CACHEINFO                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct L2CACHEINFO_SET_WAY ================================================ */
/**
  * @brief WAY [L2CACHEINFO_SET_WAY] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INFO;
} NRF_L2CACHEINFO_SET_WAY_Type;
  #define L2CACHEINFO_SET_WAY_MaxCount (2UL)
  #define L2CACHEINFO_SET_WAY_MaxIndex (1UL)
  #define L2CACHEINFO_SET_WAY_MinIndex (0UL)

/* L2CACHEINFO_SET_WAY_INFO: Cache information for SET[n], WAY[o]. */
  #define L2CACHEINFO_SET_WAY_INFO_ResetValue (0x00000000UL)

/* TAG @Bits 0..14 : Cache tag. */
  #define L2CACHEINFO_SET_WAY_INFO_TAG_Pos (0UL)
  #define L2CACHEINFO_SET_WAY_INFO_TAG_Msk (0x7FFFUL << L2CACHEINFO_SET_WAY_INFO_TAG_Pos)

/* DUV0 @Bit 24 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Pos (24UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV0_Pos)
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Min (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Max (0x1UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Invalid (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV0_Valid (0x1UL)

/* DUV1 @Bit 25 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Pos (25UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV1_Pos)
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Min (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Max (0x1UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Invalid (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV1_Valid (0x1UL)

/* DUV2 @Bit 26 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Pos (26UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV2_Pos)
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Min (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Max (0x1UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Invalid (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV2_Valid (0x1UL)

/* DUV3 @Bit 27 : Data unit valid info. */
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Pos (27UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_DUV3_Pos)
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Min (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Max (0x1UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Invalid (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_DUV3_Valid (0x1UL)

/* D0 @Bit 28 : Dirty status of combined data unit 0 and 1. */
  #define L2CACHEINFO_SET_WAY_INFO_D0_Pos (28UL)
  #define L2CACHEINFO_SET_WAY_INFO_D0_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_D0_Pos)
  #define L2CACHEINFO_SET_WAY_INFO_D0_Min (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_D0_Max (0x1UL)
  #define L2CACHEINFO_SET_WAY_INFO_D0_Clean (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_D0_Dirty (0x1UL)

/* D1 @Bit 29 : Dirty status of combined data unit 2 and 3. */
  #define L2CACHEINFO_SET_WAY_INFO_D1_Pos (29UL)
  #define L2CACHEINFO_SET_WAY_INFO_D1_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_D1_Pos)
  #define L2CACHEINFO_SET_WAY_INFO_D1_Min (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_D1_Max (0x1UL)
  #define L2CACHEINFO_SET_WAY_INFO_D1_Clean (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_D1_Dirty (0x1UL)

/* V @Bit 30 : Line valid bit. */
  #define L2CACHEINFO_SET_WAY_INFO_V_Pos (30UL)
  #define L2CACHEINFO_SET_WAY_INFO_V_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_V_Pos)
  #define L2CACHEINFO_SET_WAY_INFO_V_Min (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_V_Max (0x1UL)
  #define L2CACHEINFO_SET_WAY_INFO_V_Invalid (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_V_Valid (0x1UL)

/* MRU @Bit 31 : Most recently used way. */
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Pos (31UL)
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Msk (0x1UL << L2CACHEINFO_SET_WAY_INFO_MRU_Pos)
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Min (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Max (0x1UL)
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Way0 (0x0UL)
  #define L2CACHEINFO_SET_WAY_INFO_MRU_Way1 (0x1UL)



/* ================================================= Struct L2CACHEINFO_SET ================================================== */
/**
  * @brief SET [L2CACHEINFO_SET] (unspecified)
  */
typedef struct {
  __IOM NRF_L2CACHEINFO_SET_WAY_Type WAY[2];
} NRF_L2CACHEINFO_SET_Type;
  #define L2CACHEINFO_SET_MaxCount (2048UL)
  #define L2CACHEINFO_SET_MaxIndex (2047UL)
  #define L2CACHEINFO_SET_MinIndex (0UL)

/* =================================================== Struct L2CACHEINFO ==================================================== */
/**
  * @brief CACHEINFO
  */
  typedef struct {
    __IOM NRF_L2CACHEINFO_SET_Type SET[2048];
  } NRF_L2CACHEINFO_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          LPCOMP                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct LPCOMP ====================================================== */
/**
  * @brief Low-power comparator
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_SAMPLE;
    __IM uint32_t RESERVED[29];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_SAMPLE;
    __IM uint32_t RESERVED1[29];
    __IOM uint32_t EVENTS_READY;
    __IOM uint32_t EVENTS_DOWN;
    __IOM uint32_t EVENTS_UP;
    __IOM uint32_t EVENTS_CROSS;
    __IM uint32_t RESERVED2[28];
    __IOM uint32_t PUBLISH_READY;
    __IOM uint32_t PUBLISH_DOWN;
    __IOM uint32_t PUBLISH_UP;
    __IOM uint32_t PUBLISH_CROSS;
    __IM uint32_t RESERVED3[28];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED4[63];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED5[60];
    __IM uint32_t RESULT;
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t ENABLE;
    __IOM uint32_t PSEL;
    __IOM uint32_t REFSEL;
    __IOM uint32_t EXTREFSEL;
    __IM uint32_t RESERVED7[4];
    __IOM uint32_t ANADETECT;
    __IM uint32_t RESERVED8[5];
    __IOM uint32_t HYST;
  } NRF_LPCOMP_Type;

/* LPCOMP_TASKS_START: Start comparator */
  #define LPCOMP_TASKS_START_ResetValue (0x00000000UL)

