pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* READY_SAMPLE @Bit 0 : Shortcut between event READY and task SAMPLE */
  #define LPCOMP_SHORTS_READY_SAMPLE_Pos (0UL)
  #define LPCOMP_SHORTS_READY_SAMPLE_Msk (0x1UL << LPCOMP_SHORTS_READY_SAMPLE_Pos)
  #define LPCOMP_SHORTS_READY_SAMPLE_Min (0x0UL)
  #define LPCOMP_SHORTS_READY_SAMPLE_Max (0x1UL)
  #define LPCOMP_SHORTS_READY_SAMPLE_Disabled (0x0UL)
  #define LPCOMP_SHORTS_READY_SAMPLE_Enabled (0x1UL)

/* READY_STOP @Bit 1 : Shortcut between event READY and task STOP */
  #define LPCOMP_SHORTS_READY_STOP_Pos (1UL)
  #define LPCOMP_SHORTS_READY_STOP_Msk (0x1UL << LPCOMP_SHORTS_READY_STOP_Pos)
  #define LPCOMP_SHORTS_READY_STOP_Min (0x0UL)
  #define LPCOMP_SHORTS_READY_STOP_Max (0x1UL)
  #define LPCOMP_SHORTS_READY_STOP_Disabled (0x0UL)
  #define LPCOMP_SHORTS_READY_STOP_Enabled (0x1UL)

/* DOWN_STOP @Bit 2 : Shortcut between event DOWN and task STOP */
  #define LPCOMP_SHORTS_DOWN_STOP_Pos (2UL)
  #define LPCOMP_SHORTS_DOWN_STOP_Msk (0x1UL << LPCOMP_SHORTS_DOWN_STOP_Pos)
  #define LPCOMP_SHORTS_DOWN_STOP_Min (0x0UL)
  #define LPCOMP_SHORTS_DOWN_STOP_Max (0x1UL)
  #define LPCOMP_SHORTS_DOWN_STOP_Disabled (0x0UL)
  #define LPCOMP_SHORTS_DOWN_STOP_Enabled (0x1UL)

/* UP_STOP @Bit 3 : Shortcut between event UP and task STOP */
  #define LPCOMP_SHORTS_UP_STOP_Pos (3UL)
  #define LPCOMP_SHORTS_UP_STOP_Msk (0x1UL << LPCOMP_SHORTS_UP_STOP_Pos)
  #define LPCOMP_SHORTS_UP_STOP_Min (0x0UL)
  #define LPCOMP_SHORTS_UP_STOP_Max (0x1UL)
  #define LPCOMP_SHORTS_UP_STOP_Disabled (0x0UL)
  #define LPCOMP_SHORTS_UP_STOP_Enabled (0x1UL)

/* CROSS_STOP @Bit 4 : Shortcut between event CROSS and task STOP */
  #define LPCOMP_SHORTS_CROSS_STOP_Pos (4UL)
  #define LPCOMP_SHORTS_CROSS_STOP_Msk (0x1UL << LPCOMP_SHORTS_CROSS_STOP_Pos)
  #define LPCOMP_SHORTS_CROSS_STOP_Min (0x0UL)
  #define LPCOMP_SHORTS_CROSS_STOP_Max (0x1UL)
  #define LPCOMP_SHORTS_CROSS_STOP_Disabled (0x0UL)
  #define LPCOMP_SHORTS_CROSS_STOP_Enabled (0x1UL)


/* LPCOMP_INTEN: Enable or disable interrupt */
  #define LPCOMP_INTEN_ResetValue (0x00000000UL)

/* READY @Bit 0 : Enable or disable interrupt for event READY */
  #define LPCOMP_INTEN_READY_Pos (0UL)
  #define LPCOMP_INTEN_READY_Msk (0x1UL << LPCOMP_INTEN_READY_Pos)
  #define LPCOMP_INTEN_READY_Min (0x0UL)
  #define LPCOMP_INTEN_READY_Max (0x1UL)
  #define LPCOMP_INTEN_READY_Disabled (0x0UL)
  #define LPCOMP_INTEN_READY_Enabled (0x1UL)

/* DOWN @Bit 1 : Enable or disable interrupt for event DOWN */
  #define LPCOMP_INTEN_DOWN_Pos (1UL)
  #define LPCOMP_INTEN_DOWN_Msk (0x1UL << LPCOMP_INTEN_DOWN_Pos)
  #define LPCOMP_INTEN_DOWN_Min (0x0UL)
  #define LPCOMP_INTEN_DOWN_Max (0x1UL)
  #define LPCOMP_INTEN_DOWN_Disabled (0x0UL)
  #define LPCOMP_INTEN_DOWN_Enabled (0x1UL)

/* UP @Bit 2 : Enable or disable interrupt for event UP */
  #define LPCOMP_INTEN_UP_Pos (2UL)
  #define LPCOMP_INTEN_UP_Msk (0x1UL << LPCOMP_INTEN_UP_Pos)
  #define LPCOMP_INTEN_UP_Min (0x0UL)
  #define LPCOMP_INTEN_UP_Max (0x1UL)
  #define LPCOMP_INTEN_UP_Disabled (0x0UL)
  #define LPCOMP_INTEN_UP_Enabled (0x1UL)

/* CROSS @Bit 3 : Enable or disable interrupt for event CROSS */
  #define LPCOMP_INTEN_CROSS_Pos (3UL)
  #define LPCOMP_INTEN_CROSS_Msk (0x1UL << LPCOMP_INTEN_CROSS_Pos)
  #define LPCOMP_INTEN_CROSS_Min (0x0UL)
  #define LPCOMP_INTEN_CROSS_Max (0x1UL)
  #define LPCOMP_INTEN_CROSS_Disabled (0x0UL)
  #define LPCOMP_INTEN_CROSS_Enabled (0x1UL)


/* LPCOMP_INTENSET: Enable interrupt */
  #define LPCOMP_INTENSET_ResetValue (0x00000000UL)

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define LPCOMP_INTENSET_READY_Pos (0UL)
  #define LPCOMP_INTENSET_READY_Msk (0x1UL << LPCOMP_INTENSET_READY_Pos)
  #define LPCOMP_INTENSET_READY_Min (0x0UL)
  #define LPCOMP_INTENSET_READY_Max (0x1UL)
  #define LPCOMP_INTENSET_READY_Set (0x1UL)
  #define LPCOMP_INTENSET_READY_Disabled (0x0UL)
  #define LPCOMP_INTENSET_READY_Enabled (0x1UL)

/* DOWN @Bit 1 : Write '1' to enable interrupt for event DOWN */
  #define LPCOMP_INTENSET_DOWN_Pos (1UL)
  #define LPCOMP_INTENSET_DOWN_Msk (0x1UL << LPCOMP_INTENSET_DOWN_Pos)
  #define LPCOMP_INTENSET_DOWN_Min (0x0UL)
  #define LPCOMP_INTENSET_DOWN_Max (0x1UL)
  #define LPCOMP_INTENSET_DOWN_Set (0x1UL)
  #define LPCOMP_INTENSET_DOWN_Disabled (0x0UL)
  #define LPCOMP_INTENSET_DOWN_Enabled (0x1UL)

/* UP @Bit 2 : Write '1' to enable interrupt for event UP */
  #define LPCOMP_INTENSET_UP_Pos (2UL)
  #define LPCOMP_INTENSET_UP_Msk (0x1UL << LPCOMP_INTENSET_UP_Pos)
  #define LPCOMP_INTENSET_UP_Min (0x0UL)
  #define LPCOMP_INTENSET_UP_Max (0x1UL)
  #define LPCOMP_INTENSET_UP_Set (0x1UL)
  #define LPCOMP_INTENSET_UP_Disabled (0x0UL)
  #define LPCOMP_INTENSET_UP_Enabled (0x1UL)

/* CROSS @Bit 3 : Write '1' to enable interrupt for event CROSS */
  #define LPCOMP_INTENSET_CROSS_Pos (3UL)
  #define LPCOMP_INTENSET_CROSS_Msk (0x1UL << LPCOMP_INTENSET_CROSS_Pos)
  #define LPCOMP_INTENSET_CROSS_Min (0x0UL)
  #define LPCOMP_INTENSET_CROSS_Max (0x1UL)
  #define LPCOMP_INTENSET_CROSS_Set (0x1UL)
  #define LPCOMP_INTENSET_CROSS_Disabled (0x0UL)
  #define LPCOMP_INTENSET_CROSS_Enabled (0x1UL)


/* LPCOMP_INTENCLR: Disable interrupt */
  #define LPCOMP_INTENCLR_ResetValue (0x00000000UL)

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define LPCOMP_INTENCLR_READY_Pos (0UL)
  #define LPCOMP_INTENCLR_READY_Msk (0x1UL << LPCOMP_INTENCLR_READY_Pos)
  #define LPCOMP_INTENCLR_READY_Min (0x0UL)
  #define LPCOMP_INTENCLR_READY_Max (0x1UL)
  #define LPCOMP_INTENCLR_READY_Clear (0x1UL)
  #define LPCOMP_INTENCLR_READY_Disabled (0x0UL)
  #define LPCOMP_INTENCLR_READY_Enabled (0x1UL)

/* DOWN @Bit 1 : Write '1' to disable interrupt for event DOWN */
  #define LPCOMP_INTENCLR_DOWN_Pos (1UL)
  #define LPCOMP_INTENCLR_DOWN_Msk (0x1UL << LPCOMP_INTENCLR_DOWN_Pos)
  #define LPCOMP_INTENCLR_DOWN_Min (0x0UL)
  #define LPCOMP_INTENCLR_DOWN_Max (0x1UL)
  #define LPCOMP_INTENCLR_DOWN_Clear (0x1UL)
  #define LPCOMP_INTENCLR_DOWN_Disabled (0x0UL)
  #define LPCOMP_INTENCLR_DOWN_Enabled (0x1UL)

/* UP @Bit 2 : Write '1' to disable interrupt for event UP */
  #define LPCOMP_INTENCLR_UP_Pos (2UL)
  #define LPCOMP_INTENCLR_UP_Msk (0x1UL << LPCOMP_INTENCLR_UP_Pos)
  #define LPCOMP_INTENCLR_UP_Min (0x0UL)
  #define LPCOMP_INTENCLR_UP_Max (0x1UL)
  #define LPCOMP_INTENCLR_UP_Clear (0x1UL)
  #define LPCOMP_INTENCLR_UP_Disabled (0x0UL)
  #define LPCOMP_INTENCLR_UP_Enabled (0x1UL)

/* CROSS @Bit 3 : Write '1' to disable interrupt for event CROSS */
  #define LPCOMP_INTENCLR_CROSS_Pos (3UL)
  #define LPCOMP_INTENCLR_CROSS_Msk (0x1UL << LPCOMP_INTENCLR_CROSS_Pos)
  #define LPCOMP_INTENCLR_CROSS_Min (0x0UL)
  #define LPCOMP_INTENCLR_CROSS_Max (0x1UL)
  #define LPCOMP_INTENCLR_CROSS_Clear (0x1UL)
  #define LPCOMP_INTENCLR_CROSS_Disabled (0x0UL)
  #define LPCOMP_INTENCLR_CROSS_Enabled (0x1UL)


