pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LPCOMP_INTPEND: Pending interrupts */
  #define LPCOMP_INTPEND_ResetValue (0x00000000UL)

/* READY @Bit 0 : Read pending status of interrupt for event READY */
  #define LPCOMP_INTPEND_READY_Pos (0UL)
  #define LPCOMP_INTPEND_READY_Msk (0x1UL << LPCOMP_INTPEND_READY_Pos)
  #define LPCOMP_INTPEND_READY_Min (0x0UL)
  #define LPCOMP_INTPEND_READY_Max (0x1UL)
  #define LPCOMP_INTPEND_READY_NotPending (0x0UL)
  #define LPCOMP_INTPEND_READY_Pending (0x1UL)

/* DOWN @Bit 1 : Read pending status of interrupt for event DOWN */
  #define LPCOMP_INTPEND_DOWN_Pos (1UL)
  #define LPCOMP_INTPEND_DOWN_Msk (0x1UL << LPCOMP_INTPEND_DOWN_Pos)
  #define LPCOMP_INTPEND_DOWN_Min (0x0UL)
  #define LPCOMP_INTPEND_DOWN_Max (0x1UL)
  #define LPCOMP_INTPEND_DOWN_NotPending (0x0UL)
  #define LPCOMP_INTPEND_DOWN_Pending (0x1UL)

/* UP @Bit 2 : Read pending status of interrupt for event UP */
  #define LPCOMP_INTPEND_UP_Pos (2UL)
  #define LPCOMP_INTPEND_UP_Msk (0x1UL << LPCOMP_INTPEND_UP_Pos)
  #define LPCOMP_INTPEND_UP_Min (0x0UL)
  #define LPCOMP_INTPEND_UP_Max (0x1UL)
  #define LPCOMP_INTPEND_UP_NotPending (0x0UL)
  #define LPCOMP_INTPEND_UP_Pending (0x1UL)

/* CROSS @Bit 3 : Read pending status of interrupt for event CROSS */
  #define LPCOMP_INTPEND_CROSS_Pos (3UL)
  #define LPCOMP_INTPEND_CROSS_Msk (0x1UL << LPCOMP_INTPEND_CROSS_Pos)
  #define LPCOMP_INTPEND_CROSS_Min (0x0UL)
  #define LPCOMP_INTPEND_CROSS_Max (0x1UL)
  #define LPCOMP_INTPEND_CROSS_NotPending (0x0UL)
  #define LPCOMP_INTPEND_CROSS_Pending (0x1UL)


/* LPCOMP_RESULT: Compare result */
  #define LPCOMP_RESULT_ResetValue (0x00000000UL)

/* RESULT @Bit 0 : Result of last compare. Decision point SAMPLE task. */
  #define LPCOMP_RESULT_RESULT_Pos (0UL)
  #define LPCOMP_RESULT_RESULT_Msk (0x1UL << LPCOMP_RESULT_RESULT_Pos)
  #define LPCOMP_RESULT_RESULT_Min (0x0UL)
  #define LPCOMP_RESULT_RESULT_Max (0x1UL)
  #define LPCOMP_RESULT_RESULT_Below (0x0UL)
  #define LPCOMP_RESULT_RESULT_Above (0x1UL)


/* LPCOMP_ENABLE: Enable LPCOMP */
  #define LPCOMP_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bits 0..1 : Enable or disable LPCOMP */
  #define LPCOMP_ENABLE_ENABLE_Pos (0UL)
  #define LPCOMP_ENABLE_ENABLE_Msk (0x3UL << LPCOMP_ENABLE_ENABLE_Pos)
  #define LPCOMP_ENABLE_ENABLE_Min (0x0UL)
  #define LPCOMP_ENABLE_ENABLE_Max (0x1UL)
  #define LPCOMP_ENABLE_ENABLE_Disabled (0x0UL)
  #define LPCOMP_ENABLE_ENABLE_Enabled (0x1UL)


/* LPCOMP_PSEL: Input pin select */
  #define LPCOMP_PSEL_ResetValue (0x00000000UL)

/* PIN @Bits 0..4 : Analog pin select */
  #define LPCOMP_PSEL_PIN_Pos (0UL)
  #define LPCOMP_PSEL_PIN_Msk (0x1FUL << LPCOMP_PSEL_PIN_Pos)

/* PORT @Bits 8..11 : GPIO Port selection */
  #define LPCOMP_PSEL_PORT_Pos (8UL)
  #define LPCOMP_PSEL_PORT_Msk (0xFUL << LPCOMP_PSEL_PORT_Pos)


/* LPCOMP_REFSEL: Reference select */
  #define LPCOMP_REFSEL_ResetValue (0x00000004UL)

/* REFSEL @Bits 0..3 : Reference select */
  #define LPCOMP_REFSEL_REFSEL_Pos (0UL)
  #define LPCOMP_REFSEL_REFSEL_Msk (0xFUL << LPCOMP_REFSEL_REFSEL_Pos)
  #define LPCOMP_REFSEL_REFSEL_Min (0x0UL)
  #define LPCOMP_REFSEL_REFSEL_Max (0xFUL)
  #define LPCOMP_REFSEL_REFSEL_Ref1_8Vdd (0x0UL)
  #define LPCOMP_REFSEL_REFSEL_Ref2_8Vdd (0x1UL)
  #define LPCOMP_REFSEL_REFSEL_Ref3_8Vdd (0x2UL)
  #define LPCOMP_REFSEL_REFSEL_Ref4_8Vdd (0x3UL)
  #define LPCOMP_REFSEL_REFSEL_Ref5_8Vdd (0x4UL)
  #define LPCOMP_REFSEL_REFSEL_Ref6_8Vdd (0x5UL)
  #define LPCOMP_REFSEL_REFSEL_Ref7_8Vdd (0x6UL)
  #define LPCOMP_REFSEL_REFSEL_ARef (0x7UL)
  #define LPCOMP_REFSEL_REFSEL_Ref1_16Vdd (0x8UL)
  #define LPCOMP_REFSEL_REFSEL_Ref3_16Vdd (0x9UL)
  #define LPCOMP_REFSEL_REFSEL_Ref5_16Vdd (0xAUL)
  #define LPCOMP_REFSEL_REFSEL_Ref7_16Vdd (0xBUL)
  #define LPCOMP_REFSEL_REFSEL_Ref9_16Vdd (0xCUL)
  #define LPCOMP_REFSEL_REFSEL_Ref11_16Vdd (0xDUL)
  #define LPCOMP_REFSEL_REFSEL_Ref13_16Vdd (0xEUL)
  #define LPCOMP_REFSEL_REFSEL_Ref15_16Vdd (0xFUL)


/* LPCOMP_EXTREFSEL: External reference select */
  #define LPCOMP_EXTREFSEL_ResetValue (0x00000000UL)

/* PIN @Bits 0..4 : External analog reference pin select */
  #define LPCOMP_EXTREFSEL_PIN_Pos (0UL)
  #define LPCOMP_EXTREFSEL_PIN_Msk (0x1FUL << LPCOMP_EXTREFSEL_PIN_Pos)

/* PORT @Bits 8..11 : GPIO Port selection */
  #define LPCOMP_EXTREFSEL_PORT_Pos (8UL)
  #define LPCOMP_EXTREFSEL_PORT_Msk (0xFUL << LPCOMP_EXTREFSEL_PORT_Pos)


/* LPCOMP_ANADETECT: Analog detect configuration */
  #define LPCOMP_ANADETECT_ResetValue (0x00000000UL)

/* ANADETECT @Bits 0..1 : Analog detect configuration */
  #define LPCOMP_ANADETECT_ANADETECT_Pos (0UL)
  #define LPCOMP_ANADETECT_ANADETECT_Msk (0x3UL << LPCOMP_ANADETECT_ANADETECT_Pos)
  #define LPCOMP_ANADETECT_ANADETECT_Min (0x0UL)
  #define LPCOMP_ANADETECT_ANADETECT_Max (0x2UL)
  #define LPCOMP_ANADETECT_ANADETECT_Cross (0x0UL)   /*!< Generate ANADETECT on crossing, both upward crossing and downward
                                                          crossing*/
  #define LPCOMP_ANADETECT_ANADETECT_Up (0x1UL)
  #define LPCOMP_ANADETECT_ANADETECT_Down (0x2UL)


/* LPCOMP_HYST: Comparator hysteresis enable */
  #define LPCOMP_HYST_ResetValue (0x00000000UL)

/* HYST @Bit 0 : Comparator hysteresis enable */
  #define LPCOMP_HYST_HYST_Pos (0UL)
  #define LPCOMP_HYST_HYST_Msk (0x1UL << LPCOMP_HYST_HYST_Pos)
  #define LPCOMP_HYST_HYST_Min (0x0UL)
  #define LPCOMP_HYST_HYST_Max (0x1UL)
  #define LPCOMP_HYST_HYST_Disabled (0x0UL)
  #define LPCOMP_HYST_HYST_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          LRCCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct LRCCONF_TASKS_CONSTLAT ============================================== */
/**
  * @brief TASKS_CONSTLAT [LRCCONF_TASKS_CONSTLAT] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  ENABLE;
  __OM  uint32_t  DISABLE;
} NRF_LRCCONF_TASKS_CONSTLAT_Type;

