pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LRCCONF_TASKS_CONSTLAT_ENABLE: Enable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Pos (0UL)
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Msk (0x1UL << LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Min (0x1UL)
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Max (0x1UL)
  #define LRCCONF_TASKS_CONSTLAT_ENABLE_ENABLE_Trigger (0x1UL)


/* LRCCONF_TASKS_CONSTLAT_DISABLE: Disable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_ResetValue (0x00000000UL)

/* DISABLE @Bit 0 : Disable constant latency mode */
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Pos (0UL)
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Msk (0x1UL << LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Pos) /*!< Bit mask of
                                                                            DISABLE field.*/
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Min (0x1UL)
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Max (0x1UL)
  #define LRCCONF_TASKS_CONSTLAT_DISABLE_DISABLE_Trigger (0x1UL)



/* ============================================= Struct LRCCONF_TASKS_SYSTEMOFF ============================================== */
/**
  * @brief TASKS_SYSTEMOFF [LRCCONF_TASKS_SYSTEMOFF] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  NOTREADY;
  __OM  uint32_t  READY;
} NRF_LRCCONF_TASKS_SYSTEMOFF_Type;

/* LRCCONF_TASKS_SYSTEMOFF_NOTREADY: Not ready to go to System OFF */
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_ResetValue (0x00000000UL)

/* NOTREADY @Bit 0 : Not ready to go to System OFF */
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Pos (0UL)
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Msk (0x1UL << LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Pos) /*!< Bit mask
                                                                            of NOTREADY field.*/
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Min (0x1UL)
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Max (0x1UL)
  #define LRCCONF_TASKS_SYSTEMOFF_NOTREADY_NOTREADY_Trigger (0x1UL)


/* LRCCONF_TASKS_SYSTEMOFF_READY: Ready to go to System OFF */
  #define LRCCONF_TASKS_SYSTEMOFF_READY_ResetValue (0x00000000UL)

/* READY @Bit 0 : Ready to go to System OFF */
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Pos (0UL)
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Msk (0x1UL << LRCCONF_TASKS_SYSTEMOFF_READY_READY_Pos) /*!< Bit mask of READY
                                                                            field.*/
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Min (0x1UL)
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Max (0x1UL)
  #define LRCCONF_TASKS_SYSTEMOFF_READY_READY_Trigger (0x1UL)



/* ================================================= Struct LRCCONF_CLKSTAT ================================================== */
/**
  * @brief CLKSTAT [LRCCONF_CLKSTAT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RUN;                               /*!< (@ 0x00000000) Status indicating that TASKS_REQCLKSRC task has been
                                                                         triggered for clock [n].*/
  __IOM uint32_t  SRC;
} NRF_LRCCONF_CLKSTAT_Type;
  #define LRCCONF_CLKSTAT_MaxCount (8UL)
  #define LRCCONF_CLKSTAT_MaxIndex (7UL)
  #define LRCCONF_CLKSTAT_MinIndex (0UL)

/* LRCCONF_CLKSTAT_RUN: Status indicating that TASKS_REQCLKSRC task has been triggered for clock [n]. */
  #define LRCCONF_CLKSTAT_RUN_ResetValue (0x00000000UL)

/* STATUS @Bit 0 : Clock start task triggered or not */
  #define LRCCONF_CLKSTAT_RUN_STATUS_Pos (0UL)
  #define LRCCONF_CLKSTAT_RUN_STATUS_Msk (0x1UL << LRCCONF_CLKSTAT_RUN_STATUS_Pos)
  #define LRCCONF_CLKSTAT_RUN_STATUS_Min (0x0UL)
  #define LRCCONF_CLKSTAT_RUN_STATUS_Max (0x1UL)
  #define LRCCONF_CLKSTAT_RUN_STATUS_NotTriggered (0x0UL)
  #define LRCCONF_CLKSTAT_RUN_STATUS_Triggered (0x1UL)


/* LRCCONF_CLKSTAT_SRC: Status indicating clock source for clock [n] */
  #define LRCCONF_CLKSTAT_SRC_ResetValue (0x00000000UL)

/* SRC @Bit 0 : Clock source status */
  #define LRCCONF_CLKSTAT_SRC_SRC_Pos (0UL)
  #define LRCCONF_CLKSTAT_SRC_SRC_Msk (0x1UL << LRCCONF_CLKSTAT_SRC_SRC_Pos)
  #define LRCCONF_CLKSTAT_SRC_SRC_Min (0x0UL)
  #define LRCCONF_CLKSTAT_SRC_SRC_Max (0x1UL)
  #define LRCCONF_CLKSTAT_SRC_SRC_OpenLoop (0x0UL)
  #define LRCCONF_CLKSTAT_SRC_SRC_ClosedLoop (0x1UL)



/* ================================================= Struct LRCCONF_CLKCTRL ================================================== */
/**
  * @brief CLKCTRL [LRCCONF_CLKCTRL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ALWAYSRUN;
  __IOM uint32_t  SRC;
} NRF_LRCCONF_CLKCTRL_Type;
  #define LRCCONF_CLKCTRL_MaxCount (8UL)
  #define LRCCONF_CLKCTRL_MaxIndex (7UL)
  #define LRCCONF_CLKCTRL_MinIndex (0UL)

/* LRCCONF_CLKCTRL_ALWAYSRUN: Force the clock [n] and tree running always */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_ResetValue (0x00000000UL)

/* FORCE @Bit 0 : Force the clock always running */
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Pos (0UL)
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Msk (0x1UL << LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Pos)
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Min (0x0UL)
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Max (0x1UL)
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_Automatic (0x0UL)
  #define LRCCONF_CLKCTRL_ALWAYSRUN_FORCE_AlwaysRun (0x1UL)


/* LRCCONF_CLKCTRL_SRC: Select the clock source for clock [n] */
  #define LRCCONF_CLKCTRL_SRC_ResetValue (0x00000000UL)

/* SRC @Bit 0 : Clock source */
  #define LRCCONF_CLKCTRL_SRC_SRC_Pos (0UL)
  #define LRCCONF_CLKCTRL_SRC_SRC_Msk (0x1UL << LRCCONF_CLKCTRL_SRC_SRC_Pos)
  #define LRCCONF_CLKCTRL_SRC_SRC_Min (0x0UL)
  #define LRCCONF_CLKCTRL_SRC_SRC_Max (0x1UL)
  #define LRCCONF_CLKCTRL_SRC_SRC_OpenLoop (0x0UL)
  #define LRCCONF_CLKCTRL_SRC_SRC_ClosedLoop (0x1UL)


/* ===================================================== Struct LRCCONF ====================================================== */
/**
  * @brief LRCCONF
  */
  typedef struct {
    __OM uint32_t TASKS_REQCLKSRC[8];
    __OM uint32_t TASKS_STOPREQCLKSRC[8];
    __OM NRF_LRCCONF_TASKS_CONSTLAT_Type TASKS_CONSTLAT;
    __OM NRF_LRCCONF_TASKS_SYSTEMOFF_Type TASKS_SYSTEMOFF;
    __OM uint32_t TASKS_REQHFXO;
    __OM uint32_t TASKS_STOPREQHFXO;
    __IM uint32_t RESERVED[42];
    __IOM uint32_t EVENTS_CLKSRCSTARTED[8];
    __IOM uint32_t EVENTS_HFXOSTARTED;
    __IM uint32_t RESERVED1[183];
    __IOM NRF_LRCCONF_CLKSTAT_Type CLKSTAT[8];
    __IOM NRF_LRCCONF_CLKCTRL_Type CLKCTRL[8];
    __IM uint32_t CONSTLATSTAT;
    __IM uint32_t RESERVED2[3];
    __IOM uint32_t POWERON;
    __IOM uint32_t RETAIN;
    __IM uint32_t RESERVED3[26];
    __IOM uint32_t AX2XWAITSTATES[16];               /*!< (@ 0x00000500) AX2X bridge waitstates for the domain [n], where n is
                                                                         the Domain ID.*/
  } NRF_LRCCONF_Type;

/* LRCCONF_TASKS_REQCLKSRC: Request the clock source for clock [n] */
  #define LRCCONF_TASKS_REQCLKSRC_MaxCount (8UL)
  #define LRCCONF_TASKS_REQCLKSRC_MaxIndex (7UL)
  #define LRCCONF_TASKS_REQCLKSRC_MinIndex (0UL)
  #define LRCCONF_TASKS_REQCLKSRC_ResetValue (0x00000000UL)

/* TASKS_REQCLKSRC @Bit 0 : Request the clock source for clock [n] */
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Pos (0UL)
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Msk (0x1UL << LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Pos) /*!< Bit mask of
                                                                            TASKS_REQCLKSRC field.*/
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Min (0x1UL)
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Max (0x1UL)
  #define LRCCONF_TASKS_REQCLKSRC_TASKS_REQCLKSRC_Trigger (0x1UL)


/* LRCCONF_TASKS_STOPREQCLKSRC: Stop requesting the clock source for clock [n] */
  #define LRCCONF_TASKS_STOPREQCLKSRC_MaxCount (8UL)
  #define LRCCONF_TASKS_STOPREQCLKSRC_MaxIndex (7UL)
  #define LRCCONF_TASKS_STOPREQCLKSRC_MinIndex (0UL)
  #define LRCCONF_TASKS_STOPREQCLKSRC_ResetValue (0x00000000UL)

/* TASKS_STOPREQCLKSRC @Bit 0 : Stop requesting the clock source for clock [n] */
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Pos (0UL)
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Msk (0x1UL << LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Pos)
                                                                            /*!< Bit mask of TASKS_STOPREQCLKSRC field.*/
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Min (0x1UL)
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Max (0x1UL)
  #define LRCCONF_TASKS_STOPREQCLKSRC_TASKS_STOPREQCLKSRC_Trigger (0x1UL)


/* LRCCONF_TASKS_REQHFXO: Request HFXO */
  #define LRCCONF_TASKS_REQHFXO_ResetValue (0x00000000UL)

/* TASKS_REQHFXO @Bit 0 : Request HFXO */
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Pos (0UL)
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Msk (0x1UL << LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Pos) /*!< Bit mask of
                                                                            TASKS_REQHFXO field.*/
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Min (0x1UL)
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Max (0x1UL)
  #define LRCCONF_TASKS_REQHFXO_TASKS_REQHFXO_Trigger (0x1UL)


/* LRCCONF_TASKS_STOPREQHFXO: Stop requesting HFXO */
  #define LRCCONF_TASKS_STOPREQHFXO_ResetValue (0x00000000UL)

/* TASKS_STOPREQHFXO @Bit 0 : Stop requesting HFXO */
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Pos (0UL)
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Msk (0x1UL << LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Pos) /*!< Bit
                                                                            mask of TASKS_STOPREQHFXO field.*/
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Min (0x1UL)
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Max (0x1UL)
  #define LRCCONF_TASKS_STOPREQHFXO_TASKS_STOPREQHFXO_Trigger (0x1UL)


/* LRCCONF_EVENTS_CLKSRCSTARTED: Clock source is started for clock [n] */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_MaxCount (8UL)
  #define LRCCONF_EVENTS_CLKSRCSTARTED_MaxIndex (7UL)
  #define LRCCONF_EVENTS_CLKSRCSTARTED_MinIndex (0UL)
  #define LRCCONF_EVENTS_CLKSRCSTARTED_ResetValue (0x00000000UL)

/* EVENTS_CLKSRCSTARTED @Bit 0 : Clock source is started for clock [n] */
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Pos (0UL)
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Msk (0x1UL << LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Pos)
                                                                            /*!< Bit mask of EVENTS_CLKSRCSTARTED field.*/
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_CLKSRCSTARTED
                                                                            field.*/
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_CLKSRCSTARTED
                                                                            field.*/
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_NotGenerated (0x0UL)
  #define LRCCONF_EVENTS_CLKSRCSTARTED_EVENTS_CLKSRCSTARTED_Generated (0x1UL)


