pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LRCCONF_EVENTS_HFXOSTARTED: HFXO is started */
  #define LRCCONF_EVENTS_HFXOSTARTED_ResetValue (0x00000000UL)

/* EVENTS_HFXOSTARTED @Bit 0 : HFXO is started */
  #define LRCCONF_EVENTS_HFXOSTARTED_EVENTS_HFXOSTARTED_Pos (0UL)
  #define LRCCONF_EVENTS_HFXOSTARTED_EVENTS_HFXOSTARTED_Msk (0x1UL << LRCCONF_EVENTS_HFXOSTARTED_EVENTS_HFXOSTARTED_Pos) /*!<
                                                                            Bit mask of EVENTS_HFXOSTARTED field.*/
  #define LRCCONF_EVENTS_HFXOSTARTED_EVENTS_HFXOSTARTED_Min (0x0UL)
  #define LRCCONF_EVENTS_HFXOSTARTED_EVENTS_HFXOSTARTED_Max (0x1UL)
  #define LRCCONF_EVENTS_HFXOSTARTED_EVENTS_HFXOSTARTED_NotGenerated (0x0UL)
  #define LRCCONF_EVENTS_HFXOSTARTED_EVENTS_HFXOSTARTED_Generated (0x1UL)


/* LRCCONF_CONSTLATSTAT: Status of constant latency */
  #define LRCCONF_CONSTLATSTAT_ResetValue (0x00000000UL)

/* STATUS @Bit 0 : Status */
  #define LRCCONF_CONSTLATSTAT_STATUS_Pos (0UL)
  #define LRCCONF_CONSTLATSTAT_STATUS_Msk (0x1UL << LRCCONF_CONSTLATSTAT_STATUS_Pos)
  #define LRCCONF_CONSTLATSTAT_STATUS_Min (0x0UL)
  #define LRCCONF_CONSTLATSTAT_STATUS_Max (0x1UL)
  #define LRCCONF_CONSTLATSTAT_STATUS_Disable (0x0UL)
  #define LRCCONF_CONSTLATSTAT_STATUS_Enable (0x1UL)


/* LRCCONF_POWERON: Force power domain ON */
  #define LRCCONF_POWERON_ResetValue (0x00000000UL)

/* MAIN @Bit 0 : Force the main power domain ON */
  #define LRCCONF_POWERON_MAIN_Pos (0UL)
  #define LRCCONF_POWERON_MAIN_Msk (0x1UL << LRCCONF_POWERON_MAIN_Pos)
  #define LRCCONF_POWERON_MAIN_Min (0x0UL)
  #define LRCCONF_POWERON_MAIN_Max (0x1UL)
  #define LRCCONF_POWERON_MAIN_Automatic (0x0UL)
  #define LRCCONF_POWERON_MAIN_AlwaysOn (0x1UL)

/* ACTIVE0 @Bit 4 : Force the active power domain[0] ON */
  #define LRCCONF_POWERON_ACTIVE0_Pos (4UL)
  #define LRCCONF_POWERON_ACTIVE0_Msk (0x1UL << LRCCONF_POWERON_ACTIVE0_Pos)
  #define LRCCONF_POWERON_ACTIVE0_Min (0x0UL)
  #define LRCCONF_POWERON_ACTIVE0_Max (0x1UL)
  #define LRCCONF_POWERON_ACTIVE0_Automatic (0x0UL)
  #define LRCCONF_POWERON_ACTIVE0_AlwaysOn (0x1UL)

/* ACTIVE1 @Bit 5 : Force the active power domain[1] ON */
  #define LRCCONF_POWERON_ACTIVE1_Pos (5UL)
  #define LRCCONF_POWERON_ACTIVE1_Msk (0x1UL << LRCCONF_POWERON_ACTIVE1_Pos)
  #define LRCCONF_POWERON_ACTIVE1_Min (0x0UL)
  #define LRCCONF_POWERON_ACTIVE1_Max (0x1UL)
  #define LRCCONF_POWERON_ACTIVE1_Automatic (0x0UL)
  #define LRCCONF_POWERON_ACTIVE1_AlwaysOn (0x1UL)

/* ACTIVE2 @Bit 6 : Force the active power domain[2] ON */
  #define LRCCONF_POWERON_ACTIVE2_Pos (6UL)
  #define LRCCONF_POWERON_ACTIVE2_Msk (0x1UL << LRCCONF_POWERON_ACTIVE2_Pos)
  #define LRCCONF_POWERON_ACTIVE2_Min (0x0UL)
  #define LRCCONF_POWERON_ACTIVE2_Max (0x1UL)
  #define LRCCONF_POWERON_ACTIVE2_Automatic (0x0UL)
  #define LRCCONF_POWERON_ACTIVE2_AlwaysOn (0x1UL)

/* ACTIVE3 @Bit 7 : Force the active power domain[3] ON */
  #define LRCCONF_POWERON_ACTIVE3_Pos (7UL)
  #define LRCCONF_POWERON_ACTIVE3_Msk (0x1UL << LRCCONF_POWERON_ACTIVE3_Pos)
  #define LRCCONF_POWERON_ACTIVE3_Min (0x0UL)
  #define LRCCONF_POWERON_ACTIVE3_Max (0x1UL)
  #define LRCCONF_POWERON_ACTIVE3_Automatic (0x0UL)
  #define LRCCONF_POWERON_ACTIVE3_AlwaysOn (0x1UL)

/* ACTIVE4 @Bit 8 : Force the active power domain[4] ON */
  #define LRCCONF_POWERON_ACTIVE4_Pos (8UL)
  #define LRCCONF_POWERON_ACTIVE4_Msk (0x1UL << LRCCONF_POWERON_ACTIVE4_Pos)
  #define LRCCONF_POWERON_ACTIVE4_Min (0x0UL)
  #define LRCCONF_POWERON_ACTIVE4_Max (0x1UL)
  #define LRCCONF_POWERON_ACTIVE4_Automatic (0x0UL)
  #define LRCCONF_POWERON_ACTIVE4_AlwaysOn (0x1UL)

/* ACTIVE5 @Bit 9 : Force the active power domain[5] ON */
  #define LRCCONF_POWERON_ACTIVE5_Pos (9UL)
  #define LRCCONF_POWERON_ACTIVE5_Msk (0x1UL << LRCCONF_POWERON_ACTIVE5_Pos)
  #define LRCCONF_POWERON_ACTIVE5_Min (0x0UL)
  #define LRCCONF_POWERON_ACTIVE5_Max (0x1UL)
  #define LRCCONF_POWERON_ACTIVE5_Automatic (0x0UL)
  #define LRCCONF_POWERON_ACTIVE5_AlwaysOn (0x1UL)

/* ACTIVE6 @Bit 10 : Force the active power domain[6] ON */
  #define LRCCONF_POWERON_ACTIVE6_Pos (10UL)
  #define LRCCONF_POWERON_ACTIVE6_Msk (0x1UL << LRCCONF_POWERON_ACTIVE6_Pos)
  #define LRCCONF_POWERON_ACTIVE6_Min (0x0UL)
  #define LRCCONF_POWERON_ACTIVE6_Max (0x1UL)
  #define LRCCONF_POWERON_ACTIVE6_Automatic (0x0UL)
  #define LRCCONF_POWERON_ACTIVE6_AlwaysOn (0x1UL)

/* ACTIVE7 @Bit 11 : Force the active power domain[7] ON */
  #define LRCCONF_POWERON_ACTIVE7_Pos (11UL)
  #define LRCCONF_POWERON_ACTIVE7_Msk (0x1UL << LRCCONF_POWERON_ACTIVE7_Pos)
  #define LRCCONF_POWERON_ACTIVE7_Min (0x0UL)
  #define LRCCONF_POWERON_ACTIVE7_Max (0x1UL)
  #define LRCCONF_POWERON_ACTIVE7_Automatic (0x0UL)
  #define LRCCONF_POWERON_ACTIVE7_AlwaysOn (0x1UL)


/* LRCCONF_RETAIN: Retain power domain */
  #define LRCCONF_RETAIN_ResetValue (0x00000FF1UL)

/* MAIN @Bit 0 : Retain the main power domain */
  #define LRCCONF_RETAIN_MAIN_Pos (0UL)
  #define LRCCONF_RETAIN_MAIN_Msk (0x1UL << LRCCONF_RETAIN_MAIN_Pos)
  #define LRCCONF_RETAIN_MAIN_Min (0x0UL)
  #define LRCCONF_RETAIN_MAIN_Max (0x1UL)
  #define LRCCONF_RETAIN_MAIN_Disable (0x0UL)
  #define LRCCONF_RETAIN_MAIN_Enable (0x1UL)

/* ACTIVE0 @Bit 4 : Retain the active power domain[0] */
  #define LRCCONF_RETAIN_ACTIVE0_Pos (4UL)
  #define LRCCONF_RETAIN_ACTIVE0_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE0_Pos)
  #define LRCCONF_RETAIN_ACTIVE0_Min (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE0_Max (0x1UL)
  #define LRCCONF_RETAIN_ACTIVE0_Disable (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE0_Enable (0x1UL)

/* ACTIVE1 @Bit 5 : Retain the active power domain[1] */
  #define LRCCONF_RETAIN_ACTIVE1_Pos (5UL)
  #define LRCCONF_RETAIN_ACTIVE1_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE1_Pos)
  #define LRCCONF_RETAIN_ACTIVE1_Min (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE1_Max (0x1UL)
  #define LRCCONF_RETAIN_ACTIVE1_Disable (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE1_Enable (0x1UL)

/* ACTIVE2 @Bit 6 : Retain the active power domain[2] */
  #define LRCCONF_RETAIN_ACTIVE2_Pos (6UL)
  #define LRCCONF_RETAIN_ACTIVE2_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE2_Pos)
  #define LRCCONF_RETAIN_ACTIVE2_Min (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE2_Max (0x1UL)
  #define LRCCONF_RETAIN_ACTIVE2_Disable (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE2_Enable (0x1UL)

/* ACTIVE3 @Bit 7 : Retain the active power domain[3] */
  #define LRCCONF_RETAIN_ACTIVE3_Pos (7UL)
  #define LRCCONF_RETAIN_ACTIVE3_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE3_Pos)
  #define LRCCONF_RETAIN_ACTIVE3_Min (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE3_Max (0x1UL)
  #define LRCCONF_RETAIN_ACTIVE3_Disable (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE3_Enable (0x1UL)

