pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ACTIVE4 @Bit 8 : Retain the active power domain[4] */
  #define LRCCONF_RETAIN_ACTIVE4_Pos (8UL)
  #define LRCCONF_RETAIN_ACTIVE4_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE4_Pos)
  #define LRCCONF_RETAIN_ACTIVE4_Min (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE4_Max (0x1UL)
  #define LRCCONF_RETAIN_ACTIVE4_Disable (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE4_Enable (0x1UL)

/* ACTIVE5 @Bit 9 : Retain the active power domain[5] */
  #define LRCCONF_RETAIN_ACTIVE5_Pos (9UL)
  #define LRCCONF_RETAIN_ACTIVE5_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE5_Pos)
  #define LRCCONF_RETAIN_ACTIVE5_Min (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE5_Max (0x1UL)
  #define LRCCONF_RETAIN_ACTIVE5_Disable (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE5_Enable (0x1UL)

/* ACTIVE6 @Bit 10 : Retain the active power domain[6] */
  #define LRCCONF_RETAIN_ACTIVE6_Pos (10UL)
  #define LRCCONF_RETAIN_ACTIVE6_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE6_Pos)
  #define LRCCONF_RETAIN_ACTIVE6_Min (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE6_Max (0x1UL)
  #define LRCCONF_RETAIN_ACTIVE6_Disable (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE6_Enable (0x1UL)

/* ACTIVE7 @Bit 11 : Retain the active power domain[7] */
  #define LRCCONF_RETAIN_ACTIVE7_Pos (11UL)
  #define LRCCONF_RETAIN_ACTIVE7_Msk (0x1UL << LRCCONF_RETAIN_ACTIVE7_Pos)
  #define LRCCONF_RETAIN_ACTIVE7_Min (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE7_Max (0x1UL)
  #define LRCCONF_RETAIN_ACTIVE7_Disable (0x0UL)
  #define LRCCONF_RETAIN_ACTIVE7_Enable (0x1UL)


/* LRCCONF_AX2XWAITSTATES: AX2X bridge waitstates for the domain [n], where n is the Domain ID. */
  #define LRCCONF_AX2XWAITSTATES_MaxCount (16UL)
  #define LRCCONF_AX2XWAITSTATES_MaxIndex (15UL)
  #define LRCCONF_AX2XWAITSTATES_MinIndex (0UL)
  #define LRCCONF_AX2XWAITSTATES_ResetValue (0x00000000UL)

/* WAITSTATES @Bits 0..2 : Number of waitstates */
  #define LRCCONF_AX2XWAITSTATES_WAITSTATES_Pos (0UL)
  #define LRCCONF_AX2XWAITSTATES_WAITSTATES_Msk (0x7UL << LRCCONF_AX2XWAITSTATES_WAITSTATES_Pos) /*!< Bit mask of WAITSTATES
                                                                            field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MCAN                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct MCAN ======================================================= */
/**
  * @brief MCAN
  */
  typedef struct {
    __IM uint32_t RESERVED;
    __IM uint32_t ENDN;
    __IM uint32_t RESERVED1;
    __IOM uint32_t DBTP;
    __IOM uint32_t TEST;
    __IOM uint32_t RWD;
    __IOM uint32_t CCCR;
    __IOM uint32_t NBTP;
    __IOM uint32_t TSCC;
    __IOM uint32_t TSCV;
    __IOM uint32_t TOCC;
    __IOM uint32_t TOCV;
    __IM uint32_t RESERVED2[4];
    __IOM uint32_t ECR;
    __IOM uint32_t PSR;
    __IOM uint32_t TDCR;
    __IM uint32_t RESERVED3;
    __IOM uint32_t IR;
    __IOM uint32_t IE;
    __IOM uint32_t ILS;
    __IOM uint32_t ILE;
    __IM uint32_t RESERVED4[8];
    __IOM uint32_t GFC;
    __IOM uint32_t SIDFC;
    __IOM uint32_t XIDFC;
    __IM uint32_t RESERVED5;
    __IOM uint32_t XIDAM;
    __IM uint32_t HPMS;
    __IOM uint32_t NDAT1;
    __IOM uint32_t NDAT2;
    __IOM uint32_t RXF0C;
    __IM uint32_t RXF0S;
    __IOM uint32_t RXF0A;
    __IOM uint32_t RXBC;
    __IOM uint32_t RXF1C;
    __IM uint32_t RXF1S;
    __IOM uint32_t RXF1A;
    __IOM uint32_t RXESC;
    __IOM uint32_t TXBC;
    __IM uint32_t TXFQS;
    __IOM uint32_t TXESC;
    __IM uint32_t TXBRP;
    __IOM uint32_t TXBAR;
    __IOM uint32_t TXBCR;
    __IM uint32_t TXBTO;
    __IM uint32_t TXBCF;
    __IOM uint32_t TXBTIE;
    __IOM uint32_t TXBCIE;
    __IM uint32_t RESERVED6[2];
    __IOM uint32_t TXEFC;
    __IM uint32_t TXEFS;
    __IOM uint32_t TXEFA;
  } NRF_MCAN_Type;

/* MCAN_ENDN: Endian Register */
  #define MCAN_ENDN_ResetValue (0x00000000UL)

/* ETV @Bits 0..31 : Endianness Test Value */
  #define MCAN_ENDN_ETV_Pos (0UL)
  #define MCAN_ENDN_ETV_Msk (0xFFFFFFFFUL << MCAN_ENDN_ETV_Pos)


/* MCAN_DBTP: Data Bit Timing and Prescaler Register */
  #define MCAN_DBTP_ResetValue (0x00000000UL)

/* DSJW @Bits 0..3 : Data (Re)Synchronization Jump Width */
  #define MCAN_DBTP_DSJW_Pos (0UL)
  #define MCAN_DBTP_DSJW_Msk (0xFUL << MCAN_DBTP_DSJW_Pos)

/* DTSEG2 @Bits 4..7 : Data time segment after sample point */
  #define MCAN_DBTP_DTSEG2_Pos (4UL)
  #define MCAN_DBTP_DTSEG2_Msk (0xFUL << MCAN_DBTP_DTSEG2_Pos)

/* DTSEG1 @Bits 8..12 : Data time segment before sample point */
  #define MCAN_DBTP_DTSEG1_Pos (8UL)
  #define MCAN_DBTP_DTSEG1_Msk (0x1FUL << MCAN_DBTP_DTSEG1_Pos)

/* DBRP @Bits 16..20 : Data Bit Rate Prescaler */
  #define MCAN_DBTP_DBRP_Pos (16UL)
  #define MCAN_DBTP_DBRP_Msk (0x1FUL << MCAN_DBTP_DBRP_Pos)

/* TDC @Bit 23 : Transmitter Delay Compensation */
  #define MCAN_DBTP_TDC_Pos (23UL)
  #define MCAN_DBTP_TDC_Msk (0x1UL << MCAN_DBTP_TDC_Pos)
  #define MCAN_DBTP_TDC_Min (0x0UL)
  #define MCAN_DBTP_TDC_Max (0x1UL)
  #define MCAN_DBTP_TDC_Disabled (0x0UL)
  #define MCAN_DBTP_TDC_Enabled (0x1UL)


/* MCAN_TEST: Test Register */
  #define MCAN_TEST_ResetValue (0x00000000UL)

/* LBCK @Bit 4 : Loop Back Mode */
  #define MCAN_TEST_LBCK_Pos (4UL)
  #define MCAN_TEST_LBCK_Msk (0x1UL << MCAN_TEST_LBCK_Pos)
  #define MCAN_TEST_LBCK_Min (0x0UL)
  #define MCAN_TEST_LBCK_Max (0x1UL)
  #define MCAN_TEST_LBCK_Disabled (0x0UL)
  #define MCAN_TEST_LBCK_Enabled (0x1UL)

/* TX @Bits 5..6 : Control of Transmit Pin */
  #define MCAN_TEST_TX_Pos (5UL)
  #define MCAN_TEST_TX_Msk (0x3UL << MCAN_TEST_TX_Pos)
  #define MCAN_TEST_TX_Min (0x0UL)
  #define MCAN_TEST_TX_Max (0x3UL)
  #define MCAN_TEST_TX_CanCore (0x0UL)
  #define MCAN_TEST_TX_Monitored (0x1UL)
  #define MCAN_TEST_TX_Dominant (0x2UL)
  #define MCAN_TEST_TX_Recessive (0x3UL)

/* RX @Bit 7 : Receive Pin */
  #define MCAN_TEST_RX_Pos (7UL)
  #define MCAN_TEST_RX_Msk (0x1UL << MCAN_TEST_RX_Pos)
  #define MCAN_TEST_RX_Min (0x0UL)
  #define MCAN_TEST_RX_Max (0x1UL)
  #define MCAN_TEST_RX_Dominant (0x0UL)
  #define MCAN_TEST_RX_Recessive (0x1UL)

/* TXBNP @Bits 8..12 : Tx Buffer Number Prepared */
  #define MCAN_TEST_TXBNP_Pos (8UL)
  #define MCAN_TEST_TXBNP_Msk (0x1FUL << MCAN_TEST_TXBNP_Pos)

