pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PVAL @Bit 13 : Prepared Valid */
  #define MCAN_TEST_PVAL_Pos (13UL)
  #define MCAN_TEST_PVAL_Msk (0x1UL << MCAN_TEST_PVAL_Pos)
  #define MCAN_TEST_PVAL_Min (0x0UL)
  #define MCAN_TEST_PVAL_Max (0x1UL)
  #define MCAN_TEST_PVAL_NotValid (0x0UL)
  #define MCAN_TEST_PVAL_Valid (0x1UL)

/* TXBNS @Bits 16..20 : Tx Buffer Number Started */
  #define MCAN_TEST_TXBNS_Pos (16UL)
  #define MCAN_TEST_TXBNS_Msk (0x1FUL << MCAN_TEST_TXBNS_Pos)

/* SVAL @Bit 21 : Started Valid */
  #define MCAN_TEST_SVAL_Pos (21UL)
  #define MCAN_TEST_SVAL_Msk (0x1UL << MCAN_TEST_SVAL_Pos)
  #define MCAN_TEST_SVAL_Min (0x0UL)
  #define MCAN_TEST_SVAL_Max (0x1UL)
  #define MCAN_TEST_SVAL_NotValid (0x0UL)
  #define MCAN_TEST_SVAL_Valid (0x1UL)


/* MCAN_RWD: RAM Watchdog */
  #define MCAN_RWD_ResetValue (0x00000000UL)

/* WDC @Bits 0..7 : Start value of the Message RAM Watchdog Counter. With the reset value of '00' the counter is disabled. */
  #define MCAN_RWD_WDC_Pos (0UL)
  #define MCAN_RWD_WDC_Msk (0xFFUL << MCAN_RWD_WDC_Pos)

/* WDV @Bits 8..15 : Actual Message RAM Watchdog Counter Value. */
  #define MCAN_RWD_WDV_Pos (8UL)
  #define MCAN_RWD_WDV_Msk (0xFFUL << MCAN_RWD_WDV_Pos)


/* MCAN_CCCR: CC Control Register */
  #define MCAN_CCCR_ResetValue (0x00000000UL)

/* INIT @Bit 0 : Initialization */
  #define MCAN_CCCR_INIT_Pos (0UL)
  #define MCAN_CCCR_INIT_Msk (0x1UL << MCAN_CCCR_INIT_Pos)
  #define MCAN_CCCR_INIT_Min (0x0UL)
  #define MCAN_CCCR_INIT_Max (0x1UL)
  #define MCAN_CCCR_INIT_Normal (0x0UL)
  #define MCAN_CCCR_INIT_Initialization (0x1UL)

/* CCE @Bit 1 : Configuration Change Enable */
  #define MCAN_CCCR_CCE_Pos (1UL)
  #define MCAN_CCCR_CCE_Msk (0x1UL << MCAN_CCCR_CCE_Pos)
  #define MCAN_CCCR_CCE_Min (0x0UL)
  #define MCAN_CCCR_CCE_Max (0x1UL)
  #define MCAN_CCCR_CCE_Disabled (0x0UL)
  #define MCAN_CCCR_CCE_Enabled (0x1UL)              /*!< The CPU has write access to the protected configuration registers
                                                          (while CCCR.INIT = '1')*/

/* ASM @Bit 2 : Restricted Operation Mode */
  #define MCAN_CCCR_ASM_Pos (2UL)
  #define MCAN_CCCR_ASM_Msk (0x1UL << MCAN_CCCR_ASM_Pos)
  #define MCAN_CCCR_ASM_Min (0x0UL)
  #define MCAN_CCCR_ASM_Max (0x1UL)
  #define MCAN_CCCR_ASM_Disabled (0x0UL)
  #define MCAN_CCCR_ASM_Enabled (0x1UL)

/* CSA @Bit 3 : Clock Stop Acknowledge */
  #define MCAN_CCCR_CSA_Pos (3UL)
  #define MCAN_CCCR_CSA_Msk (0x1UL << MCAN_CCCR_CSA_Pos)
  #define MCAN_CCCR_CSA_Min (0x0UL)
  #define MCAN_CCCR_CSA_Max (0x1UL)
  #define MCAN_CCCR_CSA_Disabled (0x0UL)
  #define MCAN_CCCR_CSA_Enabled (0x1UL)

/* CSR @Bit 4 : Clock Stop Request */
  #define MCAN_CCCR_CSR_Pos (4UL)
  #define MCAN_CCCR_CSR_Msk (0x1UL << MCAN_CCCR_CSR_Pos)
  #define MCAN_CCCR_CSR_Min (0x0UL)
  #define MCAN_CCCR_CSR_Max (0x1UL)
  #define MCAN_CCCR_CSR_Disabled (0x0UL)
  #define MCAN_CCCR_CSR_Enabled (0x1UL)

/* MON @Bit 5 : Bus Monitoring Mode */
  #define MCAN_CCCR_MON_Pos (5UL)
  #define MCAN_CCCR_MON_Msk (0x1UL << MCAN_CCCR_MON_Pos)
  #define MCAN_CCCR_MON_Min (0x0UL)
  #define MCAN_CCCR_MON_Max (0x1UL)
  #define MCAN_CCCR_MON_Disabled (0x0UL)
  #define MCAN_CCCR_MON_Enabled (0x1UL)

/* DAR @Bit 6 : Disable Automatic Retransmission */
  #define MCAN_CCCR_DAR_Pos (6UL)
  #define MCAN_CCCR_DAR_Msk (0x1UL << MCAN_CCCR_DAR_Pos)
  #define MCAN_CCCR_DAR_Min (0x0UL)
  #define MCAN_CCCR_DAR_Max (0x1UL)
  #define MCAN_CCCR_DAR_Enabled (0x0UL)              /*!< Automatic retransmission of messages not transmitted successfully
                                                          enabled*/
  #define MCAN_CCCR_DAR_Disabled (0x1UL)

/* TEST @Bit 7 : Test Mode Enable */
  #define MCAN_CCCR_TEST_Pos (7UL)
  #define MCAN_CCCR_TEST_Msk (0x1UL << MCAN_CCCR_TEST_Pos)
  #define MCAN_CCCR_TEST_Min (0x0UL)
  #define MCAN_CCCR_TEST_Max (0x1UL)
  #define MCAN_CCCR_TEST_Disabled (0x0UL)
  #define MCAN_CCCR_TEST_Enabled (0x1UL)

/* FDOE @Bit 8 : FD Operation Enable */
  #define MCAN_CCCR_FDOE_Pos (8UL)
  #define MCAN_CCCR_FDOE_Msk (0x1UL << MCAN_CCCR_FDOE_Pos)
  #define MCAN_CCCR_FDOE_Min (0x0UL)
  #define MCAN_CCCR_FDOE_Max (0x1UL)
  #define MCAN_CCCR_FDOE_Disabled (0x0UL)
  #define MCAN_CCCR_FDOE_Enabled (0x1UL)

/* BRSE @Bit 9 : Bit Rate Switch Enable */
  #define MCAN_CCCR_BRSE_Pos (9UL)
  #define MCAN_CCCR_BRSE_Msk (0x1UL << MCAN_CCCR_BRSE_Pos)
  #define MCAN_CCCR_BRSE_Min (0x0UL)
  #define MCAN_CCCR_BRSE_Max (0x1UL)
  #define MCAN_CCCR_BRSE_Disabled (0x0UL)
  #define MCAN_CCCR_BRSE_Enabled (0x1UL)

/* WMM @Bit 11 : Wide Message Marker */
  #define MCAN_CCCR_WMM_Pos (11UL)
  #define MCAN_CCCR_WMM_Msk (0x1UL << MCAN_CCCR_WMM_Pos)
  #define MCAN_CCCR_WMM_Min (0x0UL)
  #define MCAN_CCCR_WMM_Max (0x1UL)
  #define MCAN_CCCR_WMM_Disabled (0x0UL)
  #define MCAN_CCCR_WMM_Enabled (0x1UL)              /*!< 16-bit Message Marker used, replacing 16-bit timestamps in Tx Event
                                                          FIFO*/

/* PXHD @Bit 12 : Protocol Exception Handling Disable */
  #define MCAN_CCCR_PXHD_Pos (12UL)
  #define MCAN_CCCR_PXHD_Msk (0x1UL << MCAN_CCCR_PXHD_Pos)
  #define MCAN_CCCR_PXHD_Min (0x0UL)
  #define MCAN_CCCR_PXHD_Max (0x1UL)
  #define MCAN_CCCR_PXHD_Enabled (0x0UL)
  #define MCAN_CCCR_PXHD_Disabled (0x1UL)

/* EFBI @Bit 13 : Edge Filtering during Bus Integration */
  #define MCAN_CCCR_EFBI_Pos (13UL)
  #define MCAN_CCCR_EFBI_Msk (0x1UL << MCAN_CCCR_EFBI_Pos)
  #define MCAN_CCCR_EFBI_Min (0x0UL)
  #define MCAN_CCCR_EFBI_Max (0x1UL)
  #define MCAN_CCCR_EFBI_Disabled (0x0UL)
  #define MCAN_CCCR_EFBI_Enabled (0x1UL)             /*!< Two consecutive dominant tq required to detect an edge for hard
                                                          synchronization*/

/* TXP @Bit 14 : Transmit Pause */
  #define MCAN_CCCR_TXP_Pos (14UL)
  #define MCAN_CCCR_TXP_Msk (0x1UL << MCAN_CCCR_TXP_Pos)
  #define MCAN_CCCR_TXP_Min (0x0UL)
  #define MCAN_CCCR_TXP_Max (0x1UL)
  #define MCAN_CCCR_TXP_Disabled (0x0UL)
  #define MCAN_CCCR_TXP_Enabled (0x1UL)

/* NISO @Bit 15 : Non ISO Operation */
  #define MCAN_CCCR_NISO_Pos (15UL)
  #define MCAN_CCCR_NISO_Msk (0x1UL << MCAN_CCCR_NISO_Pos)
  #define MCAN_CCCR_NISO_Min (0x0UL)
  #define MCAN_CCCR_NISO_Max (0x1UL)
  #define MCAN_CCCR_NISO_Disabled (0x0UL)
  #define MCAN_CCCR_NISO_Enabled (0x1UL)


/* MCAN_NBTP: Nominal Bit Timing and Prescaler Register */
  #define MCAN_NBTP_ResetValue (0x00000000UL)

/* NTSEG2 @Bits 0..6 : Nominal Time segment after sample point */
  #define MCAN_NBTP_NTSEG2_Pos (0UL)
  #define MCAN_NBTP_NTSEG2_Msk (0x7FUL << MCAN_NBTP_NTSEG2_Pos)

/* NTSEG1 @Bits 8..15 : Nominal Time segment before sample point */
  #define MCAN_NBTP_NTSEG1_Pos (8UL)
  #define MCAN_NBTP_NTSEG1_Msk (0xFFUL << MCAN_NBTP_NTSEG1_Pos)

