pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* NBRP @Bits 16..24 : Nominal Bit Rate Prescaler */
  #define MCAN_NBTP_NBRP_Pos (16UL)
  #define MCAN_NBTP_NBRP_Msk (0x1FFUL << MCAN_NBTP_NBRP_Pos)

/* NSJW @Bits 25..31 : Nominal (Re)Synchronization Jump Width */
  #define MCAN_NBTP_NSJW_Pos (25UL)
  #define MCAN_NBTP_NSJW_Msk (0x7FUL << MCAN_NBTP_NSJW_Pos)


/* MCAN_TSCC: Timestamp Counter Configuration */
  #define MCAN_TSCC_ResetValue (0x00000000UL)

/* TSS @Bits 0..1 : Timestamp Select */
  #define MCAN_TSCC_TSS_Pos (0UL)
  #define MCAN_TSCC_TSS_Msk (0x3UL << MCAN_TSCC_TSS_Pos)
  #define MCAN_TSCC_TSS_Min (0x0UL)
  #define MCAN_TSCC_TSS_Max (0x3UL)
  #define MCAN_TSCC_TSS_Zero (0x0UL)
  #define MCAN_TSCC_TSS_Increment (0x1UL)
  #define MCAN_TSCC_TSS_External (0x2UL)
  #define MCAN_TSCC_TSS_Zero0 (0x3UL)

/* TCP @Bits 16..19 : Timestamp Counter Prescaler */
  #define MCAN_TSCC_TCP_Pos (16UL)
  #define MCAN_TSCC_TCP_Msk (0xFUL << MCAN_TSCC_TCP_Pos)


/* MCAN_TSCV: Timestamp Counter Value */
  #define MCAN_TSCV_ResetValue (0x00000000UL)

/* TSC @Bits 0..15 : Timestamp Counter */
  #define MCAN_TSCV_TSC_Pos (0UL)
  #define MCAN_TSCV_TSC_Msk (0xFFFFUL << MCAN_TSCV_TSC_Pos)


/* MCAN_TOCC: Timeout Counter Configuration */
  #define MCAN_TOCC_ResetValue (0x00000000UL)

/* ETOC @Bit 0 : Enable Timeout Counter */
  #define MCAN_TOCC_ETOC_Pos (0UL)
  #define MCAN_TOCC_ETOC_Msk (0x1UL << MCAN_TOCC_ETOC_Pos)
  #define MCAN_TOCC_ETOC_Min (0x0UL)
  #define MCAN_TOCC_ETOC_Max (0x1UL)
  #define MCAN_TOCC_ETOC_Disabled (0x0UL)
  #define MCAN_TOCC_ETOC_Enabled (0x1UL)

/* TOS @Bits 1..2 : Timeout Select */
  #define MCAN_TOCC_TOS_Pos (1UL)
  #define MCAN_TOCC_TOS_Msk (0x3UL << MCAN_TOCC_TOS_Pos)
  #define MCAN_TOCC_TOS_Min (0x0UL)
  #define MCAN_TOCC_TOS_Max (0x3UL)
  #define MCAN_TOCC_TOS_Continuous (0x0UL)
  #define MCAN_TOCC_TOS_TxEvent (0x1UL)
  #define MCAN_TOCC_TOS_RxFifo0 (0x2UL)
  #define MCAN_TOCC_TOS_RxFifo1 (0x3UL)

/* TOP @Bits 16..31 : Timeout Period */
  #define MCAN_TOCC_TOP_Pos (16UL)
  #define MCAN_TOCC_TOP_Msk (0xFFFFUL << MCAN_TOCC_TOP_Pos)


/* MCAN_TOCV: Timeout Counter Value */
  #define MCAN_TOCV_ResetValue (0x00000000UL)

/* TOC @Bits 0..15 : Timeout Counter */
  #define MCAN_TOCV_TOC_Pos (0UL)
  #define MCAN_TOCV_TOC_Msk (0xFFFFUL << MCAN_TOCV_TOC_Pos)


/* MCAN_ECR: Error Counter Register */
  #define MCAN_ECR_ResetValue (0x00000000UL)

/* TEC @Bits 0..7 : Transmit Error Counter */
  #define MCAN_ECR_TEC_Pos (0UL)
  #define MCAN_ECR_TEC_Msk (0xFFUL << MCAN_ECR_TEC_Pos)

/* REC @Bits 8..14 : Receive Error Counter */
  #define MCAN_ECR_REC_Pos (8UL)
  #define MCAN_ECR_REC_Msk (0x7FUL << MCAN_ECR_REC_Pos)

/* RP @Bit 15 : Receive Error Passive */
  #define MCAN_ECR_RP_Pos (15UL)
  #define MCAN_ECR_RP_Msk (0x1UL << MCAN_ECR_RP_Pos)
  #define MCAN_ECR_RP_Min (0x0UL)
  #define MCAN_ECR_RP_Max (0x1UL)
  #define MCAN_ECR_RP_Below (0x0UL)
  #define MCAN_ECR_RP_Reached (0x1UL)

/* CEL @Bits 16..23 : CAN Error Logging */
  #define MCAN_ECR_CEL_Pos (16UL)
  #define MCAN_ECR_CEL_Msk (0xFFUL << MCAN_ECR_CEL_Pos)


/* MCAN_PSR: Protocol Status Register */
  #define MCAN_PSR_ResetValue (0x00000000UL)

/* LEC @Bits 0..2 : Last Error Code */
  #define MCAN_PSR_LEC_Pos (0UL)
  #define MCAN_PSR_LEC_Msk (0x7UL << MCAN_PSR_LEC_Pos)
  #define MCAN_PSR_LEC_Min (0x0UL)
  #define MCAN_PSR_LEC_Max (0x7UL)
  #define MCAN_PSR_LEC_NoError (0x0UL)               /*!< No error occurred since LEC has been reset by successful reception or
                                                          transmission.*/
  #define MCAN_PSR_LEC_StuffError (0x1UL)            /*!< More than 5 equal bits in a sequence have occurred in a part of a
                                                          received message where this is not allowed.*/
  #define MCAN_PSR_LEC_FormError (0x2UL)
  #define MCAN_PSR_LEC_AckError (0x3UL)              /*!< The message transmitted by the MCAN was not acknowledged by another
                                                          node.*/
  #define MCAN_PSR_LEC_Bit1Error (0x4UL)             /*!< During the transmission of a message (with the exception of the
                                                          arbitration field), the device wanted to send a recessive level (bit
                                                          of logical value 1), but the monitored bus value was dominant.*/
  #define MCAN_PSR_LEC_Bit0Error (0x5UL)             /*!< During the transmission of a message (or acknowledge bit, or active
                                                          error flag, or overload flag), the device wanted to send a dominant
                                                          level (data or identifier bit logical value '0'), but the monitored
                                                          bus value was recessive. During Bus_Off recovery this status is set
                                                          each time a sequence of 11 recessive bits has been monitored. This
                                                          enables the CPU to monitor the proceeding of the Bus_Off recovery
                                                          sequence (indicating the bus is not stuck at dominant or continuously
                                                          disturbed).*/
  #define MCAN_PSR_LEC_CRCError (0x6UL)              /*!< The CRC check sum of a received message was incorrect. The CRC of an
                                                          incoming message does not match with the CRC calculated from the
                                                          received data.*/
  #define MCAN_PSR_LEC_NoChange (0x7UL)              /*!< Any read access to the Protocol Status Register re-initializes the LEC
                                                          to '7'. When the LEC shows the value '7', no CAN bus event was
                                                          detected since the last CPU read access to the Protocol Status
                                                          Register.*/

/* ACT @Bits 3..4 : Activity */
  #define MCAN_PSR_ACT_Pos (3UL)
  #define MCAN_PSR_ACT_Msk (0x3UL << MCAN_PSR_ACT_Pos)
  #define MCAN_PSR_ACT_Min (0x0UL)
  #define MCAN_PSR_ACT_Max (0x3UL)
  #define MCAN_PSR_ACT_Synchronizing (0x0UL)
  #define MCAN_PSR_ACT_Idle (0x1UL)
  #define MCAN_PSR_ACT_Receiver (0x2UL)
  #define MCAN_PSR_ACT_Transmitter (0x3UL)

/* EP @Bit 5 : Error Passive */
  #define MCAN_PSR_EP_Pos (5UL)
  #define MCAN_PSR_EP_Msk (0x1UL << MCAN_PSR_EP_Pos)
  #define MCAN_PSR_EP_Min (0x0UL)
  #define MCAN_PSR_EP_Max (0x1UL)
  #define MCAN_PSR_EP_Active (0x0UL)                 /*!< The MCAN is in the Error_Active state. It normally takes part in bus
                                                          communication and sends an active error flag when an error has been
                                                          detected*/
  #define MCAN_PSR_EP_Passive (0x1UL)

