pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EW @Bit 6 : Warning Status */
  #define MCAN_PSR_EW_Pos (6UL)
  #define MCAN_PSR_EW_Msk (0x1UL << MCAN_PSR_EW_Pos)
  #define MCAN_PSR_EW_Min (0x0UL)
  #define MCAN_PSR_EW_Max (0x1UL)
  #define MCAN_PSR_EW_Below (0x0UL)
  #define MCAN_PSR_EW_Reached (0x1UL)                /*!< At least one of error counter has reached the Error_Warning limit of
                                                          96*/

/* BO @Bit 7 : Bus_Off Status */
  #define MCAN_PSR_BO_Pos (7UL)
  #define MCAN_PSR_BO_Msk (0x1UL << MCAN_PSR_BO_Pos)
  #define MCAN_PSR_BO_Min (0x0UL)
  #define MCAN_PSR_BO_Max (0x1UL)
  #define MCAN_PSR_BO_On (0x0UL)
  #define MCAN_PSR_BO_Off (0x1UL)

/* DLEC @Bits 8..10 : Data Phase Last Error Code */
  #define MCAN_PSR_DLEC_Pos (8UL)
  #define MCAN_PSR_DLEC_Msk (0x7UL << MCAN_PSR_DLEC_Pos)

/* RESI @Bit 11 : ESI flag of last received CAN FD Message */
  #define MCAN_PSR_RESI_Pos (11UL)
  #define MCAN_PSR_RESI_Msk (0x1UL << MCAN_PSR_RESI_Pos)
  #define MCAN_PSR_RESI_Min (0x0UL)
  #define MCAN_PSR_RESI_Max (0x1UL)
  #define MCAN_PSR_RESI_NotReceived (0x0UL)
  #define MCAN_PSR_RESI_Received (0x1UL)

/* RBRS @Bit 12 : BRS flag of last received CAN FD Message */
  #define MCAN_PSR_RBRS_Pos (12UL)
  #define MCAN_PSR_RBRS_Msk (0x1UL << MCAN_PSR_RBRS_Pos)
  #define MCAN_PSR_RBRS_Min (0x0UL)
  #define MCAN_PSR_RBRS_Max (0x1UL)
  #define MCAN_PSR_RBRS_NotReceived (0x0UL)
  #define MCAN_PSR_RBRS_Received (0x1UL)

/* RFDF @Bit 13 : Received a CAN FD Message */
  #define MCAN_PSR_RFDF_Pos (13UL)
  #define MCAN_PSR_RFDF_Msk (0x1UL << MCAN_PSR_RFDF_Pos)
  #define MCAN_PSR_RFDF_Min (0x0UL)
  #define MCAN_PSR_RFDF_Max (0x1UL)
  #define MCAN_PSR_RFDF_NotReceived (0x0UL)          /*!< Since this bit was reset by the CPU, no CAN FD message has been
                                                          received*/
  #define MCAN_PSR_RFDF_Received (0x1UL)

/* PXE @Bit 14 : Protocol Exception Event */
  #define MCAN_PSR_PXE_Pos (14UL)
  #define MCAN_PSR_PXE_Msk (0x1UL << MCAN_PSR_PXE_Pos)
  #define MCAN_PSR_PXE_Min (0x0UL)
  #define MCAN_PSR_PXE_Max (0x1UL)
  #define MCAN_PSR_PXE_NotTriggered (0x0UL)
  #define MCAN_PSR_PXE_Triggered (0x1UL)

/* TDCV @Bits 16..22 : Transmitter Delay Compensation Value */
  #define MCAN_PSR_TDCV_Pos (16UL)
  #define MCAN_PSR_TDCV_Msk (0x7FUL << MCAN_PSR_TDCV_Pos)


/* MCAN_TDCR: Transmitter Delay Compensation Register */
  #define MCAN_TDCR_ResetValue (0x00000000UL)

/* TDCF @Bits 0..6 : Transmitter Delay Compensation Filter Window Length */
  #define MCAN_TDCR_TDCF_Pos (0UL)
  #define MCAN_TDCR_TDCF_Msk (0x7FUL << MCAN_TDCR_TDCF_Pos)

/* TDCO @Bits 8..14 : Transmitter Delay Compensation SSP Offset */
  #define MCAN_TDCR_TDCO_Pos (8UL)
  #define MCAN_TDCR_TDCO_Msk (0x7FUL << MCAN_TDCR_TDCO_Pos)


/* MCAN_IR: Interrupt Register */
  #define MCAN_IR_ResetValue (0x00000000UL)

/* RF0N @Bit 0 : Rx FIFO 0 New Message */
  #define MCAN_IR_RF0N_Pos (0UL)
  #define MCAN_IR_RF0N_Msk (0x1UL << MCAN_IR_RF0N_Pos)
  #define MCAN_IR_RF0N_Min (0x0UL)
  #define MCAN_IR_RF0N_Max (0x1UL)
  #define MCAN_IR_RF0N_Clear (0x1UL)
  #define MCAN_IR_RF0N_NotGenerated (0x0UL)
  #define MCAN_IR_RF0N_Generated (0x1UL)

/* RF0W @Bit 1 : Rx FIFO 0 Watermark Reached */
  #define MCAN_IR_RF0W_Pos (1UL)
  #define MCAN_IR_RF0W_Msk (0x1UL << MCAN_IR_RF0W_Pos)
  #define MCAN_IR_RF0W_Min (0x0UL)
  #define MCAN_IR_RF0W_Max (0x1UL)
  #define MCAN_IR_RF0W_Clear (0x1UL)
  #define MCAN_IR_RF0W_NotGenerated (0x0UL)
  #define MCAN_IR_RF0W_Generated (0x1UL)

/* RF0F @Bit 2 : Rx FIFO 0 Full */
  #define MCAN_IR_RF0F_Pos (2UL)
  #define MCAN_IR_RF0F_Msk (0x1UL << MCAN_IR_RF0F_Pos)
  #define MCAN_IR_RF0F_Min (0x0UL)
  #define MCAN_IR_RF0F_Max (0x1UL)
  #define MCAN_IR_RF0F_Clear (0x1UL)
  #define MCAN_IR_RF0F_NotGenerated (0x0UL)
  #define MCAN_IR_RF0F_Generated (0x1UL)

/* RF0L @Bit 3 : Rx FIFO 0 Message Lost */
  #define MCAN_IR_RF0L_Pos (3UL)
  #define MCAN_IR_RF0L_Msk (0x1UL << MCAN_IR_RF0L_Pos)
  #define MCAN_IR_RF0L_Min (0x0UL)
  #define MCAN_IR_RF0L_Max (0x1UL)
  #define MCAN_IR_RF0L_Clear (0x1UL)
  #define MCAN_IR_RF0L_NotGenerated (0x0UL)
  #define MCAN_IR_RF0L_Generated (0x1UL)             /*!< Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of
                                                          size zero*/

/* RF1N @Bit 4 : Rx FIFO 1 New Message */
  #define MCAN_IR_RF1N_Pos (4UL)
  #define MCAN_IR_RF1N_Msk (0x1UL << MCAN_IR_RF1N_Pos)
  #define MCAN_IR_RF1N_Min (0x0UL)
  #define MCAN_IR_RF1N_Max (0x1UL)
  #define MCAN_IR_RF1N_Clear (0x1UL)
  #define MCAN_IR_RF1N_NotGenerated (0x0UL)
  #define MCAN_IR_RF1N_Generated (0x1UL)

/* RF1W @Bit 5 : Rx FIFO 1 Watermark Reached */
  #define MCAN_IR_RF1W_Pos (5UL)
  #define MCAN_IR_RF1W_Msk (0x1UL << MCAN_IR_RF1W_Pos)
  #define MCAN_IR_RF1W_Min (0x0UL)
  #define MCAN_IR_RF1W_Max (0x1UL)
  #define MCAN_IR_RF1W_Clear (0x1UL)
  #define MCAN_IR_RF1W_NotGenerated (0x0UL)
  #define MCAN_IR_RF1W_Generated (0x1UL)

/* RF1F @Bit 6 : Rx FIFO 1 Full */
  #define MCAN_IR_RF1F_Pos (6UL)
  #define MCAN_IR_RF1F_Msk (0x1UL << MCAN_IR_RF1F_Pos)
  #define MCAN_IR_RF1F_Min (0x0UL)
  #define MCAN_IR_RF1F_Max (0x1UL)
  #define MCAN_IR_RF1F_Clear (0x1UL)
  #define MCAN_IR_RF1F_NotGenerated (0x0UL)
  #define MCAN_IR_RF1F_Generated (0x1UL)

/* RF1L @Bit 7 : Rx FIFO 1 Message Lost */
  #define MCAN_IR_RF1L_Pos (7UL)
  #define MCAN_IR_RF1L_Msk (0x1UL << MCAN_IR_RF1L_Pos)
  #define MCAN_IR_RF1L_Min (0x0UL)
  #define MCAN_IR_RF1L_Max (0x1UL)
  #define MCAN_IR_RF1L_Clear (0x1UL)
  #define MCAN_IR_RF1L_NotGenerated (0x0UL)
  #define MCAN_IR_RF1L_Generated (0x1UL)             /*!< Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of
                                                          size zero*/

/* HPM @Bit 8 : High Priority Message */
  #define MCAN_IR_HPM_Pos (8UL)
  #define MCAN_IR_HPM_Msk (0x1UL << MCAN_IR_HPM_Pos)
  #define MCAN_IR_HPM_Min (0x0UL)
  #define MCAN_IR_HPM_Max (0x1UL)
  #define MCAN_IR_HPM_Clear (0x1UL)
  #define MCAN_IR_HPM_NotGenerated (0x0UL)
  #define MCAN_IR_HPM_Generated (0x1UL)

