pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TC @Bit 9 : Transmission Completed */
  #define MCAN_IR_TC_Pos (9UL)
  #define MCAN_IR_TC_Msk (0x1UL << MCAN_IR_TC_Pos)
  #define MCAN_IR_TC_Min (0x0UL)
  #define MCAN_IR_TC_Max (0x1UL)
  #define MCAN_IR_TC_Clear (0x1UL)
  #define MCAN_IR_TC_NotGenerated (0x0UL)
  #define MCAN_IR_TC_Generated (0x1UL)

/* TCF @Bit 10 : Transmission Cancellation Finished */
  #define MCAN_IR_TCF_Pos (10UL)
  #define MCAN_IR_TCF_Msk (0x1UL << MCAN_IR_TCF_Pos)
  #define MCAN_IR_TCF_Min (0x0UL)
  #define MCAN_IR_TCF_Max (0x1UL)
  #define MCAN_IR_TCF_Clear (0x1UL)
  #define MCAN_IR_TCF_NotGenerated (0x0UL)
  #define MCAN_IR_TCF_Generated (0x1UL)

/* TFE @Bit 11 : Tx FIFO Empty */
  #define MCAN_IR_TFE_Pos (11UL)
  #define MCAN_IR_TFE_Msk (0x1UL << MCAN_IR_TFE_Pos)
  #define MCAN_IR_TFE_Min (0x0UL)
  #define MCAN_IR_TFE_Max (0x1UL)
  #define MCAN_IR_TFE_Clear (0x1UL)
  #define MCAN_IR_TFE_NotGenerated (0x0UL)
  #define MCAN_IR_TFE_Generated (0x1UL)

/* TEFN @Bit 12 : Tx Event FIFO New Entry */
  #define MCAN_IR_TEFN_Pos (12UL)
  #define MCAN_IR_TEFN_Msk (0x1UL << MCAN_IR_TEFN_Pos)
  #define MCAN_IR_TEFN_Min (0x0UL)
  #define MCAN_IR_TEFN_Max (0x1UL)
  #define MCAN_IR_TEFN_Clear (0x1UL)
  #define MCAN_IR_TEFN_NotGenerated (0x0UL)
  #define MCAN_IR_TEFN_Generated (0x1UL)

/* TEFW @Bit 13 : Tx Event FIFO Watermark Reached */
  #define MCAN_IR_TEFW_Pos (13UL)
  #define MCAN_IR_TEFW_Msk (0x1UL << MCAN_IR_TEFW_Pos)
  #define MCAN_IR_TEFW_Min (0x0UL)
  #define MCAN_IR_TEFW_Max (0x1UL)
  #define MCAN_IR_TEFW_Clear (0x1UL)
  #define MCAN_IR_TEFW_NotGenerated (0x0UL)
  #define MCAN_IR_TEFW_Generated (0x1UL)

/* TEFF @Bit 14 : Tx Event FIFO Full */
  #define MCAN_IR_TEFF_Pos (14UL)
  #define MCAN_IR_TEFF_Msk (0x1UL << MCAN_IR_TEFF_Pos)
  #define MCAN_IR_TEFF_Min (0x0UL)
  #define MCAN_IR_TEFF_Max (0x1UL)
  #define MCAN_IR_TEFF_Clear (0x1UL)
  #define MCAN_IR_TEFF_NotGenerated (0x0UL)
  #define MCAN_IR_TEFF_Generated (0x1UL)

/* TEFL @Bit 15 : Tx Event FIFO Element Lost */
  #define MCAN_IR_TEFL_Pos (15UL)
  #define MCAN_IR_TEFL_Msk (0x1UL << MCAN_IR_TEFL_Pos)
  #define MCAN_IR_TEFL_Min (0x0UL)
  #define MCAN_IR_TEFL_Max (0x1UL)
  #define MCAN_IR_TEFL_Clear (0x1UL)
  #define MCAN_IR_TEFL_NotGenerated (0x0UL)
  #define MCAN_IR_TEFL_Generated (0x1UL)             /*!< Tx Event FIFO element lost, also set after wr ite attempt to Tx Event
                                                          FIFO of siz e zero*/

/* TSW @Bit 16 : Timestamp Wraparound */
  #define MCAN_IR_TSW_Pos (16UL)
  #define MCAN_IR_TSW_Msk (0x1UL << MCAN_IR_TSW_Pos)
  #define MCAN_IR_TSW_Min (0x0UL)
  #define MCAN_IR_TSW_Max (0x1UL)
  #define MCAN_IR_TSW_Clear (0x1UL)
  #define MCAN_IR_TSW_NotGenerated (0x0UL)
  #define MCAN_IR_TSW_Generated (0x1UL)

/* MRAF @Bit 17 : Message RAM Access Failure */
  #define MCAN_IR_MRAF_Pos (17UL)
  #define MCAN_IR_MRAF_Msk (0x1UL << MCAN_IR_MRAF_Pos)
  #define MCAN_IR_MRAF_Min (0x0UL)
  #define MCAN_IR_MRAF_Max (0x1UL)
  #define MCAN_IR_MRAF_Clear (0x1UL)
  #define MCAN_IR_MRAF_NotGenerated (0x0UL)
  #define MCAN_IR_MRAF_Generated (0x1UL)

/* TOO @Bit 18 : Timeout Occurred */
  #define MCAN_IR_TOO_Pos (18UL)
  #define MCAN_IR_TOO_Msk (0x1UL << MCAN_IR_TOO_Pos)
  #define MCAN_IR_TOO_Min (0x0UL)
  #define MCAN_IR_TOO_Max (0x1UL)
  #define MCAN_IR_TOO_Clear (0x1UL)
  #define MCAN_IR_TOO_NotGenerated (0x0UL)
  #define MCAN_IR_TOO_Generated (0x1UL)

/* DRX @Bit 19 : Message stored to Dedicated Rx Buffer */
  #define MCAN_IR_DRX_Pos (19UL)
  #define MCAN_IR_DRX_Msk (0x1UL << MCAN_IR_DRX_Pos)
  #define MCAN_IR_DRX_Min (0x0UL)
  #define MCAN_IR_DRX_Max (0x1UL)
  #define MCAN_IR_DRX_Clear (0x1UL)
  #define MCAN_IR_DRX_NotGenerated (0x0UL)
  #define MCAN_IR_DRX_Generated (0x1UL)

/* BEU @Bit 21 : Bus Error Uncorrected */
  #define MCAN_IR_BEU_Pos (21UL)
  #define MCAN_IR_BEU_Msk (0x1UL << MCAN_IR_BEU_Pos)
  #define MCAN_IR_BEU_Min (0x0UL)
  #define MCAN_IR_BEU_Max (0x1UL)
  #define MCAN_IR_BEU_Clear (0x1UL)
  #define MCAN_IR_BEU_NotGenerated (0x0UL)
  #define MCAN_IR_BEU_Generated (0x1UL)

/* ELO @Bit 22 : Error Logging Overflow */
  #define MCAN_IR_ELO_Pos (22UL)
  #define MCAN_IR_ELO_Msk (0x1UL << MCAN_IR_ELO_Pos)
  #define MCAN_IR_ELO_Min (0x0UL)
  #define MCAN_IR_ELO_Max (0x1UL)
  #define MCAN_IR_ELO_Clear (0x1UL)
  #define MCAN_IR_ELO_NotGenerated (0x0UL)
  #define MCAN_IR_ELO_Generated (0x1UL)

/* EP @Bit 23 : Error Passive */
  #define MCAN_IR_EP_Pos (23UL)
  #define MCAN_IR_EP_Msk (0x1UL << MCAN_IR_EP_Pos)
  #define MCAN_IR_EP_Min (0x0UL)
  #define MCAN_IR_EP_Max (0x1UL)
  #define MCAN_IR_EP_Clear (0x1UL)
  #define MCAN_IR_EP_NotGenerated (0x0UL)
  #define MCAN_IR_EP_Generated (0x1UL)

/* EW @Bit 24 : Warning Status */
  #define MCAN_IR_EW_Pos (24UL)
  #define MCAN_IR_EW_Msk (0x1UL << MCAN_IR_EW_Pos)
  #define MCAN_IR_EW_Min (0x0UL)
  #define MCAN_IR_EW_Max (0x1UL)
  #define MCAN_IR_EW_Clear (0x1UL)
  #define MCAN_IR_EW_NotGenerated (0x0UL)
  #define MCAN_IR_EW_Generated (0x1UL)

/* BO @Bit 25 : Bus_Off Status */
  #define MCAN_IR_BO_Pos (25UL)
  #define MCAN_IR_BO_Msk (0x1UL << MCAN_IR_BO_Pos)
  #define MCAN_IR_BO_Min (0x0UL)
  #define MCAN_IR_BO_Max (0x1UL)
  #define MCAN_IR_BO_Clear (0x1UL)
  #define MCAN_IR_BO_NotGenerated (0x0UL)
  #define MCAN_IR_BO_Generated (0x1UL)

/* WDI @Bit 26 : Watchdog Interrupt */
  #define MCAN_IR_WDI_Pos (26UL)
  #define MCAN_IR_WDI_Msk (0x1UL << MCAN_IR_WDI_Pos)
  #define MCAN_IR_WDI_Min (0x0UL)
  #define MCAN_IR_WDI_Max (0x1UL)
  #define MCAN_IR_WDI_Clear (0x1UL)
  #define MCAN_IR_WDI_NotGenerated (0x0UL)
  #define MCAN_IR_WDI_Generated (0x1UL)

/* PEA @Bit 27 : Protocol Error in Arbitration Phase (Nominal Bit Time is used) */
  #define MCAN_IR_PEA_Pos (27UL)
  #define MCAN_IR_PEA_Msk (0x1UL << MCAN_IR_PEA_Pos)
  #define MCAN_IR_PEA_Min (0x0UL)
  #define MCAN_IR_PEA_Max (0x1UL)
  #define MCAN_IR_PEA_Clear (0x1UL)
  #define MCAN_IR_PEA_NotGenerated (0x0UL)
  #define MCAN_IR_PEA_Generated (0x1UL)

/* PED @Bit 28 : Protocol Error in Data Phase (Data Bit Time is used) */
  #define MCAN_IR_PED_Pos (28UL)
  #define MCAN_IR_PED_Msk (0x1UL << MCAN_IR_PED_Pos)
  #define MCAN_IR_PED_Min (0x0UL)
  #define MCAN_IR_PED_Max (0x1UL)
  #define MCAN_IR_PED_Clear (0x1UL)
  #define MCAN_IR_PED_NotGenerated (0x0UL)
  #define MCAN_IR_PED_Generated (0x1UL)

/* ARA @Bit 29 : Access to Reserved Address */
  #define MCAN_IR_ARA_Pos (29UL)
  #define MCAN_IR_ARA_Msk (0x1UL << MCAN_IR_ARA_Pos)
  #define MCAN_IR_ARA_Min (0x0UL)
  #define MCAN_IR_ARA_Max (0x1UL)
  #define MCAN_IR_ARA_Clear (0x1UL)
  #define MCAN_IR_ARA_NotGenerated (0x0UL)
  #define MCAN_IR_ARA_Generated (0x1UL)


