pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MCAN_IE: Interrupt Enable */
  #define MCAN_IE_ResetValue (0x00000000UL)

/* RF0NE @Bit 0 : Rx FIFO 0 New Message Interrupt Enable */
  #define MCAN_IE_RF0NE_Pos (0UL)
  #define MCAN_IE_RF0NE_Msk (0x1UL << MCAN_IE_RF0NE_Pos)
  #define MCAN_IE_RF0NE_Min (0x0UL)
  #define MCAN_IE_RF0NE_Max (0x1UL)
  #define MCAN_IE_RF0NE_Disable (0x0UL)
  #define MCAN_IE_RF0NE_Enable (0x1UL)

/* RF0WE @Bit 1 : Rx FIFO 0 Watermark Reached Interrupt Enable */
  #define MCAN_IE_RF0WE_Pos (1UL)
  #define MCAN_IE_RF0WE_Msk (0x1UL << MCAN_IE_RF0WE_Pos)
  #define MCAN_IE_RF0WE_Min (0x0UL)
  #define MCAN_IE_RF0WE_Max (0x1UL)
  #define MCAN_IE_RF0WE_Disable (0x0UL)
  #define MCAN_IE_RF0WE_Enable (0x1UL)

/* RF0FE @Bit 2 : Rx FIFO 0 Full Interrupt Enable */
  #define MCAN_IE_RF0FE_Pos (2UL)
  #define MCAN_IE_RF0FE_Msk (0x1UL << MCAN_IE_RF0FE_Pos)
  #define MCAN_IE_RF0FE_Min (0x0UL)
  #define MCAN_IE_RF0FE_Max (0x1UL)
  #define MCAN_IE_RF0FE_Disable (0x0UL)
  #define MCAN_IE_RF0FE_Enable (0x1UL)

/* RF0LE @Bit 3 : Rx FIFO 0 Message Lost Interrupt Enable */
  #define MCAN_IE_RF0LE_Pos (3UL)
  #define MCAN_IE_RF0LE_Msk (0x1UL << MCAN_IE_RF0LE_Pos)
  #define MCAN_IE_RF0LE_Min (0x0UL)
  #define MCAN_IE_RF0LE_Max (0x1UL)
  #define MCAN_IE_RF0LE_Disable (0x0UL)
  #define MCAN_IE_RF0LE_Enable (0x1UL)

/* RF1NE @Bit 4 : Rx FIFO 1 New Message Interrupt Enable */
  #define MCAN_IE_RF1NE_Pos (4UL)
  #define MCAN_IE_RF1NE_Msk (0x1UL << MCAN_IE_RF1NE_Pos)
  #define MCAN_IE_RF1NE_Min (0x0UL)
  #define MCAN_IE_RF1NE_Max (0x1UL)
  #define MCAN_IE_RF1NE_Disable (0x0UL)
  #define MCAN_IE_RF1NE_Enable (0x1UL)

/* RF1WE @Bit 5 : Rx FIFO 1 Watermark Reached Interrupt Enable */
  #define MCAN_IE_RF1WE_Pos (5UL)
  #define MCAN_IE_RF1WE_Msk (0x1UL << MCAN_IE_RF1WE_Pos)
  #define MCAN_IE_RF1WE_Min (0x0UL)
  #define MCAN_IE_RF1WE_Max (0x1UL)
  #define MCAN_IE_RF1WE_Disable (0x0UL)
  #define MCAN_IE_RF1WE_Enable (0x1UL)

/* RF1FE @Bit 6 : Rx FIFO 1 Full Interrupt Enable */
  #define MCAN_IE_RF1FE_Pos (6UL)
  #define MCAN_IE_RF1FE_Msk (0x1UL << MCAN_IE_RF1FE_Pos)
  #define MCAN_IE_RF1FE_Min (0x0UL)
  #define MCAN_IE_RF1FE_Max (0x1UL)
  #define MCAN_IE_RF1FE_Disable (0x0UL)
  #define MCAN_IE_RF1FE_Enable (0x1UL)

/* RF1LE @Bit 7 : Rx FIFO 1 Message Lost Interrupt Enable */
  #define MCAN_IE_RF1LE_Pos (7UL)
  #define MCAN_IE_RF1LE_Msk (0x1UL << MCAN_IE_RF1LE_Pos)
  #define MCAN_IE_RF1LE_Min (0x0UL)
  #define MCAN_IE_RF1LE_Max (0x1UL)
  #define MCAN_IE_RF1LE_Disable (0x0UL)
  #define MCAN_IE_RF1LE_Enable (0x1UL)

/* HPME @Bit 8 : High Priority Message Interrupt Enable */
  #define MCAN_IE_HPME_Pos (8UL)
  #define MCAN_IE_HPME_Msk (0x1UL << MCAN_IE_HPME_Pos)
  #define MCAN_IE_HPME_Min (0x0UL)
  #define MCAN_IE_HPME_Max (0x1UL)
  #define MCAN_IE_HPME_Disable (0x0UL)
  #define MCAN_IE_HPME_Enable (0x1UL)

/* TCE @Bit 9 : Transmission Completed Interrupt Enable */
  #define MCAN_IE_TCE_Pos (9UL)
  #define MCAN_IE_TCE_Msk (0x1UL << MCAN_IE_TCE_Pos)
  #define MCAN_IE_TCE_Min (0x0UL)
  #define MCAN_IE_TCE_Max (0x1UL)
  #define MCAN_IE_TCE_Disable (0x0UL)
  #define MCAN_IE_TCE_Enable (0x1UL)

/* TCFE @Bit 10 : Transmission Cancellation Finished Interrupt Enable */
  #define MCAN_IE_TCFE_Pos (10UL)
  #define MCAN_IE_TCFE_Msk (0x1UL << MCAN_IE_TCFE_Pos)
  #define MCAN_IE_TCFE_Min (0x0UL)
  #define MCAN_IE_TCFE_Max (0x1UL)
  #define MCAN_IE_TCFE_Disable (0x0UL)
  #define MCAN_IE_TCFE_Enable (0x1UL)

/* TFEE @Bit 11 : Tx FIFO Empty Interrupt Enable */
  #define MCAN_IE_TFEE_Pos (11UL)
  #define MCAN_IE_TFEE_Msk (0x1UL << MCAN_IE_TFEE_Pos)
  #define MCAN_IE_TFEE_Min (0x0UL)
  #define MCAN_IE_TFEE_Max (0x1UL)
  #define MCAN_IE_TFEE_Disable (0x0UL)
  #define MCAN_IE_TFEE_Enable (0x1UL)

/* TEFNE @Bit 12 : Tx Event FIFO New Entry Interrupt Enable */
  #define MCAN_IE_TEFNE_Pos (12UL)
  #define MCAN_IE_TEFNE_Msk (0x1UL << MCAN_IE_TEFNE_Pos)
  #define MCAN_IE_TEFNE_Min (0x0UL)
  #define MCAN_IE_TEFNE_Max (0x1UL)
  #define MCAN_IE_TEFNE_Disable (0x0UL)
  #define MCAN_IE_TEFNE_Enable (0x1UL)

/* TEFWE @Bit 13 : Tx Event FIFO Watermark Reached Interrupt Enable */
  #define MCAN_IE_TEFWE_Pos (13UL)
  #define MCAN_IE_TEFWE_Msk (0x1UL << MCAN_IE_TEFWE_Pos)
  #define MCAN_IE_TEFWE_Min (0x0UL)
  #define MCAN_IE_TEFWE_Max (0x1UL)
  #define MCAN_IE_TEFWE_Disable (0x0UL)
  #define MCAN_IE_TEFWE_Enable (0x1UL)

/* TEFFE @Bit 14 : Tx Event FIFO Full Interrupt Enable */
  #define MCAN_IE_TEFFE_Pos (14UL)
  #define MCAN_IE_TEFFE_Msk (0x1UL << MCAN_IE_TEFFE_Pos)
  #define MCAN_IE_TEFFE_Min (0x0UL)
  #define MCAN_IE_TEFFE_Max (0x1UL)
  #define MCAN_IE_TEFFE_Disable (0x0UL)
  #define MCAN_IE_TEFFE_Enable (0x1UL)

/* TEFLE @Bit 15 : Tx Event FIFO Event Lost Interrupt Enable */
  #define MCAN_IE_TEFLE_Pos (15UL)
  #define MCAN_IE_TEFLE_Msk (0x1UL << MCAN_IE_TEFLE_Pos)
  #define MCAN_IE_TEFLE_Min (0x0UL)
  #define MCAN_IE_TEFLE_Max (0x1UL)
  #define MCAN_IE_TEFLE_Disable (0x0UL)
  #define MCAN_IE_TEFLE_Enable (0x1UL)

/* TSWE @Bit 16 : Timestamp Wraparound Interrupt Enable */
  #define MCAN_IE_TSWE_Pos (16UL)
  #define MCAN_IE_TSWE_Msk (0x1UL << MCAN_IE_TSWE_Pos)
  #define MCAN_IE_TSWE_Min (0x0UL)
  #define MCAN_IE_TSWE_Max (0x1UL)
  #define MCAN_IE_TSWE_Disable (0x0UL)
  #define MCAN_IE_TSWE_Enable (0x1UL)

/* MRAFE @Bit 17 : Message RAM Access Failure Interrupt Enable */
  #define MCAN_IE_MRAFE_Pos (17UL)
  #define MCAN_IE_MRAFE_Msk (0x1UL << MCAN_IE_MRAFE_Pos)
  #define MCAN_IE_MRAFE_Min (0x0UL)
  #define MCAN_IE_MRAFE_Max (0x1UL)
  #define MCAN_IE_MRAFE_Disable (0x0UL)
  #define MCAN_IE_MRAFE_Enable (0x1UL)

/* TOOE @Bit 18 : Timeout Occurred Interrupt Enable */
  #define MCAN_IE_TOOE_Pos (18UL)
  #define MCAN_IE_TOOE_Msk (0x1UL << MCAN_IE_TOOE_Pos)
  #define MCAN_IE_TOOE_Min (0x0UL)
  #define MCAN_IE_TOOE_Max (0x1UL)
  #define MCAN_IE_TOOE_Disable (0x0UL)
  #define MCAN_IE_TOOE_Enable (0x1UL)

/* DRXE @Bit 19 : Message stored to Dedicated Rx Buffer Interrupt Enable */
  #define MCAN_IE_DRXE_Pos (19UL)
  #define MCAN_IE_DRXE_Msk (0x1UL << MCAN_IE_DRXE_Pos)
  #define MCAN_IE_DRXE_Min (0x0UL)
  #define MCAN_IE_DRXE_Max (0x1UL)
  #define MCAN_IE_DRXE_Disable (0x0UL)
  #define MCAN_IE_DRXE_Enable (0x1UL)

