pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* BEUE @Bit 21 : Bus Error Uncorrected Interrupt Enable */
  #define MCAN_IE_BEUE_Pos (21UL)
  #define MCAN_IE_BEUE_Msk (0x1UL << MCAN_IE_BEUE_Pos)
  #define MCAN_IE_BEUE_Min (0x0UL)
  #define MCAN_IE_BEUE_Max (0x1UL)
  #define MCAN_IE_BEUE_Disable (0x0UL)
  #define MCAN_IE_BEUE_Enable (0x1UL)

/* ELOE @Bit 22 : Error Logging Overflow Interrupt Enable */
  #define MCAN_IE_ELOE_Pos (22UL)
  #define MCAN_IE_ELOE_Msk (0x1UL << MCAN_IE_ELOE_Pos)
  #define MCAN_IE_ELOE_Min (0x0UL)
  #define MCAN_IE_ELOE_Max (0x1UL)
  #define MCAN_IE_ELOE_Disable (0x0UL)
  #define MCAN_IE_ELOE_Enable (0x1UL)

/* EPE @Bit 23 : Error Passive Interrupt Enable */
  #define MCAN_IE_EPE_Pos (23UL)
  #define MCAN_IE_EPE_Msk (0x1UL << MCAN_IE_EPE_Pos)
  #define MCAN_IE_EPE_Min (0x0UL)
  #define MCAN_IE_EPE_Max (0x1UL)
  #define MCAN_IE_EPE_Disable (0x0UL)
  #define MCAN_IE_EPE_Enable (0x1UL)

/* EWE @Bit 24 : Warning Status Interrupt Enable */
  #define MCAN_IE_EWE_Pos (24UL)
  #define MCAN_IE_EWE_Msk (0x1UL << MCAN_IE_EWE_Pos)
  #define MCAN_IE_EWE_Min (0x0UL)
  #define MCAN_IE_EWE_Max (0x1UL)
  #define MCAN_IE_EWE_Disable (0x0UL)
  #define MCAN_IE_EWE_Enable (0x1UL)

/* BOE @Bit 25 : Bus_Off Status Interrupt Enable */
  #define MCAN_IE_BOE_Pos (25UL)
  #define MCAN_IE_BOE_Msk (0x1UL << MCAN_IE_BOE_Pos)
  #define MCAN_IE_BOE_Min (0x0UL)
  #define MCAN_IE_BOE_Max (0x1UL)
  #define MCAN_IE_BOE_Disable (0x0UL)
  #define MCAN_IE_BOE_Enable (0x1UL)

/* WDIE @Bit 26 : Watchdog Interrupt Enable */
  #define MCAN_IE_WDIE_Pos (26UL)
  #define MCAN_IE_WDIE_Msk (0x1UL << MCAN_IE_WDIE_Pos)
  #define MCAN_IE_WDIE_Min (0x0UL)
  #define MCAN_IE_WDIE_Max (0x1UL)
  #define MCAN_IE_WDIE_Disable (0x0UL)
  #define MCAN_IE_WDIE_Enable (0x1UL)

/* PEAE @Bit 27 : Protocol Error in Arbitration Phase Enable */
  #define MCAN_IE_PEAE_Pos (27UL)
  #define MCAN_IE_PEAE_Msk (0x1UL << MCAN_IE_PEAE_Pos)
  #define MCAN_IE_PEAE_Min (0x0UL)
  #define MCAN_IE_PEAE_Max (0x1UL)
  #define MCAN_IE_PEAE_Disable (0x0UL)
  #define MCAN_IE_PEAE_Enable (0x1UL)

/* PEDE @Bit 28 : Protocol Error in Data Phase Enable */
  #define MCAN_IE_PEDE_Pos (28UL)
  #define MCAN_IE_PEDE_Msk (0x1UL << MCAN_IE_PEDE_Pos)
  #define MCAN_IE_PEDE_Min (0x0UL)
  #define MCAN_IE_PEDE_Max (0x1UL)
  #define MCAN_IE_PEDE_Disable (0x0UL)
  #define MCAN_IE_PEDE_Enable (0x1UL)

/* ARAE @Bit 29 : Access to Reserved Address Enable */
  #define MCAN_IE_ARAE_Pos (29UL)
  #define MCAN_IE_ARAE_Msk (0x1UL << MCAN_IE_ARAE_Pos)
  #define MCAN_IE_ARAE_Min (0x0UL)
  #define MCAN_IE_ARAE_Max (0x1UL)
  #define MCAN_IE_ARAE_Disable (0x0UL)
  #define MCAN_IE_ARAE_Enable (0x1UL)


/* MCAN_ILS: Interrupt Line Select */
  #define MCAN_ILS_ResetValue (0x00000000UL)

/* RF0NL @Bit 0 : Rx FIFO 0 New Message Interrupt Line */
  #define MCAN_ILS_RF0NL_Pos (0UL)
  #define MCAN_ILS_RF0NL_Msk (0x1UL << MCAN_ILS_RF0NL_Pos)
  #define MCAN_ILS_RF0NL_Min (0x0UL)
  #define MCAN_ILS_RF0NL_Max (0x1UL)
  #define MCAN_ILS_RF0NL_Assigned0 (0x0UL)
  #define MCAN_ILS_RF0NL_Assigned1 (0x1UL)

/* RF0WL @Bit 1 : Rx FIFO 0 Watermark Reached Interrupt Line */
  #define MCAN_ILS_RF0WL_Pos (1UL)
  #define MCAN_ILS_RF0WL_Msk (0x1UL << MCAN_ILS_RF0WL_Pos)
  #define MCAN_ILS_RF0WL_Min (0x0UL)
  #define MCAN_ILS_RF0WL_Max (0x1UL)
  #define MCAN_ILS_RF0WL_Assigned0 (0x0UL)
  #define MCAN_ILS_RF0WL_Assigned1 (0x1UL)

/* RF0FL @Bit 2 : Rx FIFO 0 Full Interrupt Line */
  #define MCAN_ILS_RF0FL_Pos (2UL)
  #define MCAN_ILS_RF0FL_Msk (0x1UL << MCAN_ILS_RF0FL_Pos)
  #define MCAN_ILS_RF0FL_Min (0x0UL)
  #define MCAN_ILS_RF0FL_Max (0x1UL)
  #define MCAN_ILS_RF0FL_Assigned0 (0x0UL)
  #define MCAN_ILS_RF0FL_Assigned1 (0x1UL)

/* RF0LL @Bit 3 : Rx FIFO 0 Message Lost Interrupt Line */
  #define MCAN_ILS_RF0LL_Pos (3UL)
  #define MCAN_ILS_RF0LL_Msk (0x1UL << MCAN_ILS_RF0LL_Pos)
  #define MCAN_ILS_RF0LL_Min (0x0UL)
  #define MCAN_ILS_RF0LL_Max (0x1UL)
  #define MCAN_ILS_RF0LL_Assigned0 (0x0UL)
  #define MCAN_ILS_RF0LL_Assigned1 (0x1UL)

/* RF1NL @Bit 4 : Rx FIFO 1 New Message Interrupt Line */
  #define MCAN_ILS_RF1NL_Pos (4UL)
  #define MCAN_ILS_RF1NL_Msk (0x1UL << MCAN_ILS_RF1NL_Pos)
  #define MCAN_ILS_RF1NL_Min (0x0UL)
  #define MCAN_ILS_RF1NL_Max (0x1UL)
  #define MCAN_ILS_RF1NL_Assigned0 (0x0UL)
  #define MCAN_ILS_RF1NL_Assigned1 (0x1UL)

/* RF1WL @Bit 5 : Rx FIFO 1 Watermark Reached Interrupt Line */
  #define MCAN_ILS_RF1WL_Pos (5UL)
  #define MCAN_ILS_RF1WL_Msk (0x1UL << MCAN_ILS_RF1WL_Pos)
  #define MCAN_ILS_RF1WL_Min (0x0UL)
  #define MCAN_ILS_RF1WL_Max (0x1UL)
  #define MCAN_ILS_RF1WL_Assigned0 (0x0UL)
  #define MCAN_ILS_RF1WL_Assigned1 (0x1UL)

/* RF1FL @Bit 6 : Rx FIFO 1 Full Interrupt Line */
  #define MCAN_ILS_RF1FL_Pos (6UL)
  #define MCAN_ILS_RF1FL_Msk (0x1UL << MCAN_ILS_RF1FL_Pos)
  #define MCAN_ILS_RF1FL_Min (0x0UL)
  #define MCAN_ILS_RF1FL_Max (0x1UL)
  #define MCAN_ILS_RF1FL_Assigned0 (0x0UL)
  #define MCAN_ILS_RF1FL_Assigned1 (0x1UL)

/* RF1LL @Bit 7 : Rx FIFO 1 Message Lost Interrupt Line */
  #define MCAN_ILS_RF1LL_Pos (7UL)
  #define MCAN_ILS_RF1LL_Msk (0x1UL << MCAN_ILS_RF1LL_Pos)
  #define MCAN_ILS_RF1LL_Min (0x0UL)
  #define MCAN_ILS_RF1LL_Max (0x1UL)
  #define MCAN_ILS_RF1LL_Assigned0 (0x0UL)
  #define MCAN_ILS_RF1LL_Assigned1 (0x1UL)

/* HPML @Bit 8 : High Priority Message Interrupt Line */
  #define MCAN_ILS_HPML_Pos (8UL)
  #define MCAN_ILS_HPML_Msk (0x1UL << MCAN_ILS_HPML_Pos)
  #define MCAN_ILS_HPML_Min (0x0UL)
  #define MCAN_ILS_HPML_Max (0x1UL)
  #define MCAN_ILS_HPML_Assigned0 (0x0UL)
  #define MCAN_ILS_HPML_Assigned1 (0x1UL)

/* TCL @Bit 9 : Transmission Completed Interrupt Line */
  #define MCAN_ILS_TCL_Pos (9UL)
  #define MCAN_ILS_TCL_Msk (0x1UL << MCAN_ILS_TCL_Pos)
  #define MCAN_ILS_TCL_Min (0x0UL)
  #define MCAN_ILS_TCL_Max (0x1UL)
  #define MCAN_ILS_TCL_Assigned0 (0x0UL)
  #define MCAN_ILS_TCL_Assigned1 (0x1UL)

/* TCFL @Bit 10 : Transmission Cancellation Finished Interrupt Line */
  #define MCAN_ILS_TCFL_Pos (10UL)
  #define MCAN_ILS_TCFL_Msk (0x1UL << MCAN_ILS_TCFL_Pos)
  #define MCAN_ILS_TCFL_Min (0x0UL)
  #define MCAN_ILS_TCFL_Max (0x1UL)
  #define MCAN_ILS_TCFL_Assigned0 (0x0UL)
  #define MCAN_ILS_TCFL_Assigned1 (0x1UL)

