pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TFEL @Bit 11 : Tx FIFO Empty Interrupt Line */
  #define MCAN_ILS_TFEL_Pos (11UL)
  #define MCAN_ILS_TFEL_Msk (0x1UL << MCAN_ILS_TFEL_Pos)
  #define MCAN_ILS_TFEL_Min (0x0UL)
  #define MCAN_ILS_TFEL_Max (0x1UL)
  #define MCAN_ILS_TFEL_Assigned0 (0x0UL)
  #define MCAN_ILS_TFEL_Assigned1 (0x1UL)

/* TEFNL @Bit 12 : Tx Event FIFO New Entry Interrupt Line */
  #define MCAN_ILS_TEFNL_Pos (12UL)
  #define MCAN_ILS_TEFNL_Msk (0x1UL << MCAN_ILS_TEFNL_Pos)
  #define MCAN_ILS_TEFNL_Min (0x0UL)
  #define MCAN_ILS_TEFNL_Max (0x1UL)
  #define MCAN_ILS_TEFNL_Assigned0 (0x0UL)
  #define MCAN_ILS_TEFNL_Assigned1 (0x1UL)

/* TEFWL @Bit 13 : Tx Event FIFO Watermark Reached Interrupt Line */
  #define MCAN_ILS_TEFWL_Pos (13UL)
  #define MCAN_ILS_TEFWL_Msk (0x1UL << MCAN_ILS_TEFWL_Pos)
  #define MCAN_ILS_TEFWL_Min (0x0UL)
  #define MCAN_ILS_TEFWL_Max (0x1UL)
  #define MCAN_ILS_TEFWL_Assigned0 (0x0UL)
  #define MCAN_ILS_TEFWL_Assigned1 (0x1UL)

/* TEFFL @Bit 14 : Tx Event FIFO Full Interrupt Line */
  #define MCAN_ILS_TEFFL_Pos (14UL)
  #define MCAN_ILS_TEFFL_Msk (0x1UL << MCAN_ILS_TEFFL_Pos)
  #define MCAN_ILS_TEFFL_Min (0x0UL)
  #define MCAN_ILS_TEFFL_Max (0x1UL)
  #define MCAN_ILS_TEFFL_Assigned0 (0x0UL)
  #define MCAN_ILS_TEFFL_Assigned1 (0x1UL)

/* TEFLL @Bit 15 : Tx Event FIFO Event Lost Interrupt Line */
  #define MCAN_ILS_TEFLL_Pos (15UL)
  #define MCAN_ILS_TEFLL_Msk (0x1UL << MCAN_ILS_TEFLL_Pos)
  #define MCAN_ILS_TEFLL_Min (0x0UL)
  #define MCAN_ILS_TEFLL_Max (0x1UL)
  #define MCAN_ILS_TEFLL_Assigned0 (0x0UL)
  #define MCAN_ILS_TEFLL_Assigned1 (0x1UL)

/* TSWL @Bit 16 : Timestamp Wraparound Interrupt Line */
  #define MCAN_ILS_TSWL_Pos (16UL)
  #define MCAN_ILS_TSWL_Msk (0x1UL << MCAN_ILS_TSWL_Pos)
  #define MCAN_ILS_TSWL_Min (0x0UL)
  #define MCAN_ILS_TSWL_Max (0x1UL)
  #define MCAN_ILS_TSWL_Assigned0 (0x0UL)
  #define MCAN_ILS_TSWL_Assigned1 (0x1UL)

/* MRAFL @Bit 17 : Message RAM Access Failure Interrupt Line */
  #define MCAN_ILS_MRAFL_Pos (17UL)
  #define MCAN_ILS_MRAFL_Msk (0x1UL << MCAN_ILS_MRAFL_Pos)
  #define MCAN_ILS_MRAFL_Min (0x0UL)
  #define MCAN_ILS_MRAFL_Max (0x1UL)
  #define MCAN_ILS_MRAFL_Assigned0 (0x0UL)
  #define MCAN_ILS_MRAFL_Assigned1 (0x1UL)

/* TOOL @Bit 18 : Timeout Occurred Interrupt Line */
  #define MCAN_ILS_TOOL_Pos (18UL)
  #define MCAN_ILS_TOOL_Msk (0x1UL << MCAN_ILS_TOOL_Pos)
  #define MCAN_ILS_TOOL_Min (0x0UL)
  #define MCAN_ILS_TOOL_Max (0x1UL)
  #define MCAN_ILS_TOOL_Assigned0 (0x0UL)
  #define MCAN_ILS_TOOL_Assigned1 (0x1UL)

/* DRXL @Bit 19 : Message stored to Dedicated Rx Buffer Interrupt Line */
  #define MCAN_ILS_DRXL_Pos (19UL)
  #define MCAN_ILS_DRXL_Msk (0x1UL << MCAN_ILS_DRXL_Pos)
  #define MCAN_ILS_DRXL_Min (0x0UL)
  #define MCAN_ILS_DRXL_Max (0x1UL)
  #define MCAN_ILS_DRXL_Assigned0 (0x0UL)
  #define MCAN_ILS_DRXL_Assigned1 (0x1UL)

/* BEUL @Bit 21 : Bus Error Uncorrected Interrupt Line */
  #define MCAN_ILS_BEUL_Pos (21UL)
  #define MCAN_ILS_BEUL_Msk (0x1UL << MCAN_ILS_BEUL_Pos)
  #define MCAN_ILS_BEUL_Min (0x0UL)
  #define MCAN_ILS_BEUL_Max (0x1UL)
  #define MCAN_ILS_BEUL_Assigned0 (0x0UL)
  #define MCAN_ILS_BEUL_Assigned1 (0x1UL)

/* ELOL @Bit 22 : Error Logging Overflow Interrupt Line */
  #define MCAN_ILS_ELOL_Pos (22UL)
  #define MCAN_ILS_ELOL_Msk (0x1UL << MCAN_ILS_ELOL_Pos)
  #define MCAN_ILS_ELOL_Min (0x0UL)
  #define MCAN_ILS_ELOL_Max (0x1UL)
  #define MCAN_ILS_ELOL_Assigned0 (0x0UL)
  #define MCAN_ILS_ELOL_Assigned1 (0x1UL)

/* EPL @Bit 23 : Error Passive Interrupt Line */
  #define MCAN_ILS_EPL_Pos (23UL)
  #define MCAN_ILS_EPL_Msk (0x1UL << MCAN_ILS_EPL_Pos)
  #define MCAN_ILS_EPL_Min (0x0UL)
  #define MCAN_ILS_EPL_Max (0x1UL)
  #define MCAN_ILS_EPL_Assigned0 (0x0UL)
  #define MCAN_ILS_EPL_Assigned1 (0x1UL)

/* EWL @Bit 24 : Warning Status Interrupt Line */
  #define MCAN_ILS_EWL_Pos (24UL)
  #define MCAN_ILS_EWL_Msk (0x1UL << MCAN_ILS_EWL_Pos)
  #define MCAN_ILS_EWL_Min (0x0UL)
  #define MCAN_ILS_EWL_Max (0x1UL)
  #define MCAN_ILS_EWL_Assigned0 (0x0UL)
  #define MCAN_ILS_EWL_Assigned1 (0x1UL)

/* BOL @Bit 25 : Bus_Off Status Interrupt Line */
  #define MCAN_ILS_BOL_Pos (25UL)
  #define MCAN_ILS_BOL_Msk (0x1UL << MCAN_ILS_BOL_Pos)
  #define MCAN_ILS_BOL_Min (0x0UL)
  #define MCAN_ILS_BOL_Max (0x1UL)
  #define MCAN_ILS_BOL_Assigned0 (0x0UL)
  #define MCAN_ILS_BOL_Assigned1 (0x1UL)

/* WDIL @Bit 26 : Watchdog Interrupt Line */
  #define MCAN_ILS_WDIL_Pos (26UL)
  #define MCAN_ILS_WDIL_Msk (0x1UL << MCAN_ILS_WDIL_Pos)
  #define MCAN_ILS_WDIL_Min (0x0UL)
  #define MCAN_ILS_WDIL_Max (0x1UL)
  #define MCAN_ILS_WDIL_Assigned0 (0x0UL)
  #define MCAN_ILS_WDIL_Assigned1 (0x1UL)

/* PEAL @Bit 27 : Protocol Error in Arbitration Phase Line */
  #define MCAN_ILS_PEAL_Pos (27UL)
  #define MCAN_ILS_PEAL_Msk (0x1UL << MCAN_ILS_PEAL_Pos)
  #define MCAN_ILS_PEAL_Min (0x0UL)
  #define MCAN_ILS_PEAL_Max (0x1UL)
  #define MCAN_ILS_PEAL_Assigned0 (0x0UL)
  #define MCAN_ILS_PEAL_Assigned1 (0x1UL)

/* PEDL @Bit 28 : Protocol Error in Data Phase Line */
  #define MCAN_ILS_PEDL_Pos (28UL)
  #define MCAN_ILS_PEDL_Msk (0x1UL << MCAN_ILS_PEDL_Pos)
  #define MCAN_ILS_PEDL_Min (0x0UL)
  #define MCAN_ILS_PEDL_Max (0x1UL)
  #define MCAN_ILS_PEDL_Assigned0 (0x0UL)
  #define MCAN_ILS_PEDL_Assigned1 (0x1UL)

/* ARAL @Bit 29 : Access to Reserved Address Line */
  #define MCAN_ILS_ARAL_Pos (29UL)
  #define MCAN_ILS_ARAL_Msk (0x1UL << MCAN_ILS_ARAL_Pos)
  #define MCAN_ILS_ARAL_Min (0x0UL)
  #define MCAN_ILS_ARAL_Max (0x1UL)
  #define MCAN_ILS_ARAL_Assigned0 (0x0UL)
  #define MCAN_ILS_ARAL_Assigned1 (0x1UL)


/* MCAN_ILE: Interrupt Line Enable */
  #define MCAN_ILE_ResetValue (0x00000000UL)

/* EINT0 @Bit 0 : Enable Interrupt Line 0 */
  #define MCAN_ILE_EINT0_Pos (0UL)
  #define MCAN_ILE_EINT0_Msk (0x1UL << MCAN_ILE_EINT0_Pos)
  #define MCAN_ILE_EINT0_Min (0x0UL)
  #define MCAN_ILE_EINT0_Max (0x1UL)
  #define MCAN_ILE_EINT0_Disable (0x0UL)
  #define MCAN_ILE_EINT0_Enable (0x1UL)

/* EINT1 @Bit 1 : Enable Interrupt Line 1 */
  #define MCAN_ILE_EINT1_Pos (1UL)
  #define MCAN_ILE_EINT1_Msk (0x1UL << MCAN_ILE_EINT1_Pos)
  #define MCAN_ILE_EINT1_Min (0x0UL)
  #define MCAN_ILE_EINT1_Max (0x1UL)
  #define MCAN_ILE_EINT1_Disable (0x0UL)
  #define MCAN_ILE_EINT1_Enable (0x1UL)


/* MCAN_GFC: Global Filter Configuration */
  #define MCAN_GFC_ResetValue (0x00000000UL)

/* RRFE @Bit 0 : Reject Remote Frames Extended */
  #define MCAN_GFC_RRFE_Pos (0UL)
  #define MCAN_GFC_RRFE_Msk (0x1UL << MCAN_GFC_RRFE_Pos)
  #define MCAN_GFC_RRFE_Min (0x0UL)
  #define MCAN_GFC_RRFE_Max (0x1UL)
  #define MCAN_GFC_RRFE_Filter (0x0UL)
  #define MCAN_GFC_RRFE_Reject (0x1UL)

/* RRFS @Bit 1 : Reject Remote Frames Standard */
  #define MCAN_GFC_RRFS_Pos (1UL)
  #define MCAN_GFC_RRFS_Msk (0x1UL << MCAN_GFC_RRFS_Pos)
  #define MCAN_GFC_RRFS_Min (0x0UL)
  #define MCAN_GFC_RRFS_Max (0x1UL)
  #define MCAN_GFC_RRFS_Filter (0x0UL)
  #define MCAN_GFC_RRFS_Reject (0x1UL)

