pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ANFE @Bits 2..3 : Accept Non-matching Frames Extended */
  #define MCAN_GFC_ANFE_Pos (2UL)
  #define MCAN_GFC_ANFE_Msk (0x3UL << MCAN_GFC_ANFE_Pos)
  #define MCAN_GFC_ANFE_Min (0x0UL)
  #define MCAN_GFC_ANFE_Max (0x3UL)
  #define MCAN_GFC_ANFE_Accept0 (0x0UL)
  #define MCAN_GFC_ANFE_Accept1 (0x1UL)
  #define MCAN_GFC_ANFE_Reject0 (0x2UL)
  #define MCAN_GFC_ANFE_Reject1 (0x3UL)

/* ANFS @Bits 4..5 : (unspecified) */
  #define MCAN_GFC_ANFS_Pos (4UL)
  #define MCAN_GFC_ANFS_Msk (0x3UL << MCAN_GFC_ANFS_Pos)
  #define MCAN_GFC_ANFS_Min (0x0UL)
  #define MCAN_GFC_ANFS_Max (0x3UL)
  #define MCAN_GFC_ANFS_Accept0 (0x0UL)
  #define MCAN_GFC_ANFS_Accept1 (0x1UL)
  #define MCAN_GFC_ANFS_Reject0 (0x2UL)
  #define MCAN_GFC_ANFS_Reject1 (0x3UL)


/* MCAN_SIDFC: Standard ID Filter Configuration */
  #define MCAN_SIDFC_ResetValue (0x00000000UL)

/* FLSSA @Bits 2..15 : Filter List Standard Start Address */
  #define MCAN_SIDFC_FLSSA_Pos (2UL)
  #define MCAN_SIDFC_FLSSA_Msk (0x3FFFUL << MCAN_SIDFC_FLSSA_Pos)

/* LSS @Bits 16..23 : List Size Standard */
  #define MCAN_SIDFC_LSS_Pos (16UL)
  #define MCAN_SIDFC_LSS_Msk (0xFFUL << MCAN_SIDFC_LSS_Pos)


/* MCAN_XIDFC: Extended ID Filter Configuration */
  #define MCAN_XIDFC_ResetValue (0x00000000UL)

/* FLESA @Bits 2..15 : Filter List Extended Start Address */
  #define MCAN_XIDFC_FLESA_Pos (2UL)
  #define MCAN_XIDFC_FLESA_Msk (0x3FFFUL << MCAN_XIDFC_FLESA_Pos)

/* LSE @Bits 16..22 : List Size Extended */
  #define MCAN_XIDFC_LSE_Pos (16UL)
  #define MCAN_XIDFC_LSE_Msk (0x7FUL << MCAN_XIDFC_LSE_Pos)


/* MCAN_XIDAM: Extended ID AND Mask */
  #define MCAN_XIDAM_ResetValue (0x00000000UL)

/* EIDM @Bits 0..28 : Extended ID Mask */
  #define MCAN_XIDAM_EIDM_Pos (0UL)
  #define MCAN_XIDAM_EIDM_Msk (0x1FFFFFFFUL << MCAN_XIDAM_EIDM_Pos)


/* MCAN_HPMS: High Priority Message Status */
  #define MCAN_HPMS_ResetValue (0x00000000UL)

/* BIDX @Bits 0..5 : Buffer Index */
  #define MCAN_HPMS_BIDX_Pos (0UL)
  #define MCAN_HPMS_BIDX_Msk (0x3FUL << MCAN_HPMS_BIDX_Pos)

/* MSI @Bits 6..7 : Message Storage Indicator */
  #define MCAN_HPMS_MSI_Pos (6UL)
  #define MCAN_HPMS_MSI_Msk (0x3UL << MCAN_HPMS_MSI_Pos)
  #define MCAN_HPMS_MSI_Min (0x0UL)
  #define MCAN_HPMS_MSI_Max (0x3UL)
  #define MCAN_HPMS_MSI_NotSelected (0x0UL)
  #define MCAN_HPMS_MSI_Lost (0x1UL)
  #define MCAN_HPMS_MSI_Stored0 (0x2UL)
  #define MCAN_HPMS_MSI_Stored1 (0x3UL)

/* FIDX @Bits 8..14 : Filter Index */
  #define MCAN_HPMS_FIDX_Pos (8UL)
  #define MCAN_HPMS_FIDX_Msk (0x7FUL << MCAN_HPMS_FIDX_Pos)

/* FLST @Bit 15 : Filter List */
  #define MCAN_HPMS_FLST_Pos (15UL)
  #define MCAN_HPMS_FLST_Msk (0x1UL << MCAN_HPMS_FLST_Pos)
  #define MCAN_HPMS_FLST_Min (0x0UL)
  #define MCAN_HPMS_FLST_Max (0x1UL)
  #define MCAN_HPMS_FLST_Standard (0x0UL)
  #define MCAN_HPMS_FLST_Extended (0x1UL)


/* MCAN_NDAT1: New Data 1 */
  #define MCAN_NDAT1_ResetValue (0x00000000UL)

/* ND @Bits 0..31 : New Data */
  #define MCAN_NDAT1_ND_Pos (0UL)
  #define MCAN_NDAT1_ND_Msk (0xFFFFFFFFUL << MCAN_NDAT1_ND_Pos)
  #define MCAN_NDAT1_ND_Min (0x0UL)
  #define MCAN_NDAT1_ND_Max (0x1UL)
  #define MCAN_NDAT1_ND_NotUpdated (0x00000000UL)
  #define MCAN_NDAT1_ND_Updated (0x00000001UL)


/* MCAN_NDAT2: New Data 2 */
  #define MCAN_NDAT2_ResetValue (0x00000000UL)

/* ND @Bits 0..31 : New Data */
  #define MCAN_NDAT2_ND_Pos (0UL)
  #define MCAN_NDAT2_ND_Msk (0xFFFFFFFFUL << MCAN_NDAT2_ND_Pos)
  #define MCAN_NDAT2_ND_Min (0x0UL)
  #define MCAN_NDAT2_ND_Max (0x1UL)
  #define MCAN_NDAT2_ND_NotUpdated (0x00000000UL)
  #define MCAN_NDAT2_ND_Updated (0x00000001UL)


/* MCAN_RXF0C: Rx FIFO 0 Configuration */
  #define MCAN_RXF0C_ResetValue (0x00000000UL)

/* F0SA @Bits 2..15 : Rx FIFO 0 Start Address */
  #define MCAN_RXF0C_F0SA_Pos (2UL)
  #define MCAN_RXF0C_F0SA_Msk (0x3FFFUL << MCAN_RXF0C_F0SA_Pos)

/* F0S @Bits 16..22 : Rx FIFO 0 Size */
  #define MCAN_RXF0C_F0S_Pos (16UL)
  #define MCAN_RXF0C_F0S_Msk (0x7FUL << MCAN_RXF0C_F0S_Pos)

/* F0WM @Bits 24..30 : Rx FIFO 0 Watermark */
  #define MCAN_RXF0C_F0WM_Pos (24UL)
  #define MCAN_RXF0C_F0WM_Msk (0x7FUL << MCAN_RXF0C_F0WM_Pos)

/* F0OM @Bit 31 : FIFO 0 Operation Mode */
  #define MCAN_RXF0C_F0OM_Pos (31UL)
  #define MCAN_RXF0C_F0OM_Msk (0x1UL << MCAN_RXF0C_F0OM_Pos)
  #define MCAN_RXF0C_F0OM_Min (0x0UL)
  #define MCAN_RXF0C_F0OM_Max (0x1UL)
  #define MCAN_RXF0C_F0OM_Blocking (0x0UL)
  #define MCAN_RXF0C_F0OM_Overwrite (0x1UL)


/* MCAN_RXF0S: Rx FIFO 0 Status */
  #define MCAN_RXF0S_ResetValue (0x00000000UL)

/* F0FL @Bits 0..6 : Rx FIFO 0 Fill Leve */
  #define MCAN_RXF0S_F0FL_Pos (0UL)
  #define MCAN_RXF0S_F0FL_Msk (0x7FUL << MCAN_RXF0S_F0FL_Pos)

/* F0GI @Bits 8..13 : Rx FIFO 0 Get Index */
  #define MCAN_RXF0S_F0GI_Pos (8UL)
  #define MCAN_RXF0S_F0GI_Msk (0x3FUL << MCAN_RXF0S_F0GI_Pos)

/* F0PI @Bits 16..21 : Rx FIFO 0 Put Index */
  #define MCAN_RXF0S_F0PI_Pos (16UL)
  #define MCAN_RXF0S_F0PI_Msk (0x3FUL << MCAN_RXF0S_F0PI_Pos)

/* F0F @Bit 24 : Rx FIFO 0 Full */
  #define MCAN_RXF0S_F0F_Pos (24UL)
  #define MCAN_RXF0S_F0F_Msk (0x1UL << MCAN_RXF0S_F0F_Pos)
  #define MCAN_RXF0S_F0F_Min (0x0UL)
  #define MCAN_RXF0S_F0F_Max (0x1UL)
  #define MCAN_RXF0S_F0F_NotFull (0x0UL)
  #define MCAN_RXF0S_F0F_Full (0x1UL)

/* RF0L @Bit 25 : Rx FIFO 0 Message Lost */
  #define MCAN_RXF0S_RF0L_Pos (25UL)
  #define MCAN_RXF0S_RF0L_Msk (0x1UL << MCAN_RXF0S_RF0L_Pos)
  #define MCAN_RXF0S_RF0L_Min (0x0UL)
  #define MCAN_RXF0S_RF0L_Max (0x1UL)
  #define MCAN_RXF0S_RF0L_NotLost (0x0UL)
  #define MCAN_RXF0S_RF0L_Lost (0x1UL)               /*!< Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of
                                                          size zero.*/


/* MCAN_RXF0A: Rx FIFO 0 Acknowledge */
  #define MCAN_RXF0A_ResetValue (0x00000000UL)

/* F0AI @Bits 0..5 : Rx FIFO 0 Acknowledge Index */
  #define MCAN_RXF0A_F0AI_Pos (0UL)
  #define MCAN_RXF0A_F0AI_Msk (0x3FUL << MCAN_RXF0A_F0AI_Pos)


/* MCAN_RXBC: Rx Buffer Configuration */
  #define MCAN_RXBC_ResetValue (0x00000000UL)

/* RBSA @Bits 2..15 : Rx Buffer Start Address */
  #define MCAN_RXBC_RBSA_Pos (2UL)
  #define MCAN_RXBC_RBSA_Msk (0x3FFFUL << MCAN_RXBC_RBSA_Pos)


/* MCAN_RXF1C: Rx FIFO 1 Configuration */
  #define MCAN_RXF1C_ResetValue (0x00000000UL)

/* F1SA @Bits 2..15 : Rx FIFO 1 Start Address */
  #define MCAN_RXF1C_F1SA_Pos (2UL)
  #define MCAN_RXF1C_F1SA_Msk (0x3FFFUL << MCAN_RXF1C_F1SA_Pos)

/* F1S @Bits 16..22 : Rx FIFO 1 Size */
  #define MCAN_RXF1C_F1S_Pos (16UL)
  #define MCAN_RXF1C_F1S_Msk (0x7FUL << MCAN_RXF1C_F1S_Pos)

/* F1WM @Bits 24..30 : Rx FIFO 1 Watermark */
  #define MCAN_RXF1C_F1WM_Pos (24UL)
  #define MCAN_RXF1C_F1WM_Msk (0x7FUL << MCAN_RXF1C_F1WM_Pos)

