pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* F1OM @Bit 31 : FIFO 1 Operation Mode */
  #define MCAN_RXF1C_F1OM_Pos (31UL)
  #define MCAN_RXF1C_F1OM_Msk (0x1UL << MCAN_RXF1C_F1OM_Pos)
  #define MCAN_RXF1C_F1OM_Min (0x0UL)
  #define MCAN_RXF1C_F1OM_Max (0x1UL)
  #define MCAN_RXF1C_F1OM_BlockingMode (0x0UL)
  #define MCAN_RXF1C_F1OM_OwerwriteMode (0x1UL)


/* MCAN_RXF1S: Rx FIFO 1 Status */
  #define MCAN_RXF1S_ResetValue (0x00000000UL)

/* F1FL @Bits 0..6 : Rx FIFO 1 Fill Level */
  #define MCAN_RXF1S_F1FL_Pos (0UL)
  #define MCAN_RXF1S_F1FL_Msk (0x7FUL << MCAN_RXF1S_F1FL_Pos)

/* F1GI @Bits 8..13 : Rx FIFO 1 Get Index */
  #define MCAN_RXF1S_F1GI_Pos (8UL)
  #define MCAN_RXF1S_F1GI_Msk (0x3FUL << MCAN_RXF1S_F1GI_Pos)

/* F1PI @Bits 16..21 : Rx FIFO 1 Put Index */
  #define MCAN_RXF1S_F1PI_Pos (16UL)
  #define MCAN_RXF1S_F1PI_Msk (0x3FUL << MCAN_RXF1S_F1PI_Pos)

/* F1F @Bit 24 : Rx FIFO 1 Full */
  #define MCAN_RXF1S_F1F_Pos (24UL)
  #define MCAN_RXF1S_F1F_Msk (0x1UL << MCAN_RXF1S_F1F_Pos)
  #define MCAN_RXF1S_F1F_Min (0x0UL)
  #define MCAN_RXF1S_F1F_Max (0x1UL)
  #define MCAN_RXF1S_F1F_NotFull (0x0UL)
  #define MCAN_RXF1S_F1F_Full (0x1UL)

/* RF1L @Bit 25 : Rx FIFO 1 Message Lost */
  #define MCAN_RXF1S_RF1L_Pos (25UL)
  #define MCAN_RXF1S_RF1L_Msk (0x1UL << MCAN_RXF1S_RF1L_Pos)
  #define MCAN_RXF1S_RF1L_Min (0x0UL)
  #define MCAN_RXF1S_RF1L_Max (0x1UL)
  #define MCAN_RXF1S_RF1L_NoMessageLost (0x0UL)
  #define MCAN_RXF1S_RF1L_MessageLost (0x1UL)        /*!< Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of
                                                          size zero*/

/* DMS @Bits 30..31 : Debug Message Status */
  #define MCAN_RXF1S_DMS_Pos (30UL)
  #define MCAN_RXF1S_DMS_Msk (0x3UL << MCAN_RXF1S_DMS_Pos)
  #define MCAN_RXF1S_DMS_Min (0x0UL)
  #define MCAN_RXF1S_DMS_Max (0x3UL)
  #define MCAN_RXF1S_DMS_Idle (0x0UL)                /*!< Idle state, wait for reception of debug messages, DMA request is
                                                          cleared*/
  #define MCAN_RXF1S_DMS_ReceivedMesA (0x1UL)
  #define MCAN_RXF1S_DMS_ReceivedMesAB (0x2UL)
  #define MCAN_RXF1S_DMS_ReceivedMesABC (0x3UL)


/* MCAN_RXF1A: Rx FIFO 1 Acknowledge */
  #define MCAN_RXF1A_ResetValue (0x00000000UL)

/* F1AI @Bits 0..5 : Rx FIFO 1 Acknowledge Index */
  #define MCAN_RXF1A_F1AI_Pos (0UL)
  #define MCAN_RXF1A_F1AI_Msk (0x3FUL << MCAN_RXF1A_F1AI_Pos)


/* MCAN_RXESC: Rx Buffer / FIFO Element Size Configuration */
  #define MCAN_RXESC_ResetValue (0x00000000UL)

/* F0DS @Bits 0..2 : Rx FIFO 0 Data Field Size */
  #define MCAN_RXESC_F0DS_Pos (0UL)
  #define MCAN_RXESC_F0DS_Msk (0x7UL << MCAN_RXESC_F0DS_Pos)
  #define MCAN_RXESC_F0DS_Min (0x0UL)
  #define MCAN_RXESC_F0DS_Max (0x7UL)
  #define MCAN_RXESC_F0DS_DataField8B (0x0UL)
  #define MCAN_RXESC_F0DS_DataField12B (0x1UL)
  #define MCAN_RXESC_F0DS_DataField16B (0x2UL)
  #define MCAN_RXESC_F0DS_DataField20B (0x3UL)
  #define MCAN_RXESC_F0DS_DataField24B (0x4UL)
  #define MCAN_RXESC_F0DS_DataField32B (0x5UL)
  #define MCAN_RXESC_F0DS_DataField48B (0x6UL)
  #define MCAN_RXESC_F0DS_DataField64B (0x7UL)

/* F1DS @Bits 4..6 : Rx FIFO 1 Data Field Size */
  #define MCAN_RXESC_F1DS_Pos (4UL)
  #define MCAN_RXESC_F1DS_Msk (0x7UL << MCAN_RXESC_F1DS_Pos)
  #define MCAN_RXESC_F1DS_Min (0x0UL)
  #define MCAN_RXESC_F1DS_Max (0x7UL)
  #define MCAN_RXESC_F1DS_DataField8B (0x0UL)
  #define MCAN_RXESC_F1DS_DataField12B (0x1UL)
  #define MCAN_RXESC_F1DS_DataField16B (0x2UL)
  #define MCAN_RXESC_F1DS_DataField20B (0x3UL)
  #define MCAN_RXESC_F1DS_DataField24B (0x4UL)
  #define MCAN_RXESC_F1DS_DataField32B (0x5UL)
  #define MCAN_RXESC_F1DS_DataField48B (0x6UL)
  #define MCAN_RXESC_F1DS_DataField64B (0x7UL)

/* RBDS @Bits 8..10 : Rx Buffer Data Field Size */
  #define MCAN_RXESC_RBDS_Pos (8UL)
  #define MCAN_RXESC_RBDS_Msk (0x7UL << MCAN_RXESC_RBDS_Pos)
  #define MCAN_RXESC_RBDS_Min (0x0UL)
  #define MCAN_RXESC_RBDS_Max (0x7UL)
  #define MCAN_RXESC_RBDS_DataField8B (0x0UL)
  #define MCAN_RXESC_RBDS_DataField12B (0x1UL)
  #define MCAN_RXESC_RBDS_DataField16B (0x2UL)
  #define MCAN_RXESC_RBDS_DataField20B (0x3UL)
  #define MCAN_RXESC_RBDS_DataField24B (0x4UL)
  #define MCAN_RXESC_RBDS_DataField32B (0x5UL)
  #define MCAN_RXESC_RBDS_DataField48B (0x6UL)
  #define MCAN_RXESC_RBDS_DataField64B (0x7UL)


/* MCAN_TXBC: Tx Buffer Configuration */
  #define MCAN_TXBC_ResetValue (0x00000000UL)

/* TBSA @Bits 2..15 : Tx Buffers Start Address */
  #define MCAN_TXBC_TBSA_Pos (2UL)
  #define MCAN_TXBC_TBSA_Msk (0x3FFFUL << MCAN_TXBC_TBSA_Pos)

/* NDTB @Bits 16..21 : Number of Dedicated Transmit Buffers */
  #define MCAN_TXBC_NDTB_Pos (16UL)
  #define MCAN_TXBC_NDTB_Msk (0x3FUL << MCAN_TXBC_NDTB_Pos)

/* TFQS @Bits 24..29 : Transmit FIFO/Queue Size */
  #define MCAN_TXBC_TFQS_Pos (24UL)
  #define MCAN_TXBC_TFQS_Msk (0x3FUL << MCAN_TXBC_TFQS_Pos)

/* TFQM @Bit 30 : Tx FIFO/Queue Mode */
  #define MCAN_TXBC_TFQM_Pos (30UL)
  #define MCAN_TXBC_TFQM_Msk (0x1UL << MCAN_TXBC_TFQM_Pos)
  #define MCAN_TXBC_TFQM_Min (0x0UL)
  #define MCAN_TXBC_TFQM_Max (0x1UL)
  #define MCAN_TXBC_TFQM_TxFIFO (0x0UL)
  #define MCAN_TXBC_TFQM_TxQueue (0x1UL)


/* MCAN_TXFQS: Tx FIFO/Queue Status */
  #define MCAN_TXFQS_ResetValue (0x00000000UL)

/* TFFL @Bits 0..5 : Tx FIFO Free Level */
  #define MCAN_TXFQS_TFFL_Pos (0UL)
  #define MCAN_TXFQS_TFFL_Msk (0x3FUL << MCAN_TXFQS_TFFL_Pos)

/* TFGI @Bits 8..12 : Tx FIFO Get Index */
  #define MCAN_TXFQS_TFGI_Pos (8UL)
  #define MCAN_TXFQS_TFGI_Msk (0x1FUL << MCAN_TXFQS_TFGI_Pos)

/* TFQPI @Bits 16..20 : Tx FIFO/Queue Put Index */
  #define MCAN_TXFQS_TFQPI_Pos (16UL)
  #define MCAN_TXFQS_TFQPI_Msk (0x1FUL << MCAN_TXFQS_TFQPI_Pos)

/* TFQF @Bit 21 : Tx FIFO/Queue Full */
  #define MCAN_TXFQS_TFQF_Pos (21UL)
  #define MCAN_TXFQS_TFQF_Msk (0x1UL << MCAN_TXFQS_TFQF_Pos)
  #define MCAN_TXFQS_TFQF_Min (0x0UL)
  #define MCAN_TXFQS_TFQF_Max (0x1UL)
  #define MCAN_TXFQS_TFQF_NotFull (0x0UL)
  #define MCAN_TXFQS_TFQF_Full (0x1UL)


/* MCAN_TXESC: Tx Buffer Element Size Configuration */
  #define MCAN_TXESC_ResetValue (0x00000000UL)

/* TBDS @Bits 0..2 : Tx Buffer Data Field Size */
  #define MCAN_TXESC_TBDS_Pos (0UL)
  #define MCAN_TXESC_TBDS_Msk (0x7UL << MCAN_TXESC_TBDS_Pos)
  #define MCAN_TXESC_TBDS_Min (0x0UL)
  #define MCAN_TXESC_TBDS_Max (0x7UL)
  #define MCAN_TXESC_TBDS_DataField8B (0x0UL)
  #define MCAN_TXESC_TBDS_DataField12B (0x1UL)
  #define MCAN_TXESC_TBDS_DataField16B (0x2UL)
  #define MCAN_TXESC_TBDS_DataField20B (0x3UL)
  #define MCAN_TXESC_TBDS_DataField24B (0x4UL)
  #define MCAN_TXESC_TBDS_DataField32B (0x5UL)
  #define MCAN_TXESC_TBDS_DataField48B (0x6UL)
  #define MCAN_TXESC_TBDS_DataField64B (0x7UL)


