pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MCAN_TXBRP: Tx Buffer Request Pending */
  #define MCAN_TXBRP_ResetValue (0x00000000UL)

/* TRP @Bits 0..31 : Transmission Request Pending */
  #define MCAN_TXBRP_TRP_Pos (0UL)
  #define MCAN_TXBRP_TRP_Msk (0xFFFFFFFFUL << MCAN_TXBRP_TRP_Pos)
  #define MCAN_TXBRP_TRP_Min (0x0UL)
  #define MCAN_TXBRP_TRP_Max (0x1UL)
  #define MCAN_TXBRP_TRP_NoRequest (0x00000000UL)
  #define MCAN_TXBRP_TRP_Request (0x00000001UL)


/* MCAN_TXBAR: Tx Buffer Add Request */
  #define MCAN_TXBAR_ResetValue (0x00000000UL)

/* AR @Bits 0..31 : Add Request */
  #define MCAN_TXBAR_AR_Pos (0UL)
  #define MCAN_TXBAR_AR_Msk (0xFFFFFFFFUL << MCAN_TXBAR_AR_Pos)
  #define MCAN_TXBAR_AR_Min (0x0UL)
  #define MCAN_TXBAR_AR_Max (0x1UL)
  #define MCAN_TXBAR_AR_NoRequest (0x00000000UL)
  #define MCAN_TXBAR_AR_Request (0x00000001UL)


/* MCAN_TXBCR: Tx Buffer Cancellation Request */
  #define MCAN_TXBCR_ResetValue (0x00000000UL)

/* CR @Bits 0..31 : Cancellation Request */
  #define MCAN_TXBCR_CR_Pos (0UL)
  #define MCAN_TXBCR_CR_Msk (0xFFFFFFFFUL << MCAN_TXBCR_CR_Pos)
  #define MCAN_TXBCR_CR_Min (0x0UL)
  #define MCAN_TXBCR_CR_Max (0x1UL)
  #define MCAN_TXBCR_CR_NoCancellation (0x00000000UL)
  #define MCAN_TXBCR_CR_Cancellation (0x00000001UL)


/* MCAN_TXBTO: Tx Buffer Transmission Occurred */
  #define MCAN_TXBTO_ResetValue (0x00000000UL)

/* TO @Bits 0..31 : Transmission Occurred */
  #define MCAN_TXBTO_TO_Pos (0UL)
  #define MCAN_TXBTO_TO_Msk (0xFFFFFFFFUL << MCAN_TXBTO_TO_Pos)
  #define MCAN_TXBTO_TO_Min (0x0UL)
  #define MCAN_TXBTO_TO_Max (0x1UL)
  #define MCAN_TXBTO_TO_NoTransmittion (0x00000000UL)
  #define MCAN_TXBTO_TO_Transmittion (0x00000001UL)


/* MCAN_TXBCF: Tx Buffer Cancellation Finished */
  #define MCAN_TXBCF_ResetValue (0x00000000UL)

/* CF @Bits 0..31 : Cancellation Finished */
  #define MCAN_TXBCF_CF_Pos (0UL)
  #define MCAN_TXBCF_CF_Msk (0xFFFFFFFFUL << MCAN_TXBCF_CF_Pos)
  #define MCAN_TXBCF_CF_Min (0x0UL)
  #define MCAN_TXBCF_CF_Max (0x1UL)
  #define MCAN_TXBCF_CF_NoCancellation (0x00000000UL)
  #define MCAN_TXBCF_CF_CancellationFinished (0x00000001UL)


/* MCAN_TXBTIE: Tx Buffer Transmission Interrupt Enable */
  #define MCAN_TXBTIE_ResetValue (0x00000000UL)

/* TIE @Bits 0..31 : Transmission Interrupt Enable */
  #define MCAN_TXBTIE_TIE_Pos (0UL)
  #define MCAN_TXBTIE_TIE_Msk (0xFFFFFFFFUL << MCAN_TXBTIE_TIE_Pos)
  #define MCAN_TXBTIE_TIE_Min (0x0UL)
  #define MCAN_TXBTIE_TIE_Max (0x1UL)
  #define MCAN_TXBTIE_TIE_Disable (0x00000000UL)
  #define MCAN_TXBTIE_TIE_Enable (0x00000001UL)


/* MCAN_TXBCIE: Tx Buffer Cancellation Finished Interrupt Enable */
  #define MCAN_TXBCIE_ResetValue (0x00000000UL)

/* CFIE @Bits 0..31 : Cancellation Finished Interrupt Enable */
  #define MCAN_TXBCIE_CFIE_Pos (0UL)
  #define MCAN_TXBCIE_CFIE_Msk (0xFFFFFFFFUL << MCAN_TXBCIE_CFIE_Pos)
  #define MCAN_TXBCIE_CFIE_Min (0x0UL)
  #define MCAN_TXBCIE_CFIE_Max (0x1UL)
  #define MCAN_TXBCIE_CFIE_Disable (0x00000000UL)
  #define MCAN_TXBCIE_CFIE_Enable (0x00000001UL)


/* MCAN_TXEFC: Tx Event FIFO Configuration */
  #define MCAN_TXEFC_ResetValue (0x00000000UL)

/* EFSA @Bits 2..15 : Event FIFO Start Address */
  #define MCAN_TXEFC_EFSA_Pos (2UL)
  #define MCAN_TXEFC_EFSA_Msk (0x3FFFUL << MCAN_TXEFC_EFSA_Pos)

/* EFS @Bits 16..21 : Event FIFO Size */
  #define MCAN_TXEFC_EFS_Pos (16UL)
  #define MCAN_TXEFC_EFS_Msk (0x3FUL << MCAN_TXEFC_EFS_Pos)

/* EFWM @Bits 24..29 : Event FIFO Watermark */
  #define MCAN_TXEFC_EFWM_Pos (24UL)
  #define MCAN_TXEFC_EFWM_Msk (0x3FUL << MCAN_TXEFC_EFWM_Pos)


/* MCAN_TXEFS: Tx Event FIFO Status */
  #define MCAN_TXEFS_ResetValue (0x00000000UL)

/* EFFL @Bits 0..5 : Event FIFO Fill Level */
  #define MCAN_TXEFS_EFFL_Pos (0UL)
  #define MCAN_TXEFS_EFFL_Msk (0x3FUL << MCAN_TXEFS_EFFL_Pos)

/* EFGI @Bits 8..12 : Event FIFO Get Index */
  #define MCAN_TXEFS_EFGI_Pos (8UL)
  #define MCAN_TXEFS_EFGI_Msk (0x1FUL << MCAN_TXEFS_EFGI_Pos)

/* EFPI @Bits 16..20 : Event FIFO Put Index */
  #define MCAN_TXEFS_EFPI_Pos (16UL)
  #define MCAN_TXEFS_EFPI_Msk (0x1FUL << MCAN_TXEFS_EFPI_Pos)

/* EFF @Bit 24 : Event FIFO Full */
  #define MCAN_TXEFS_EFF_Pos (24UL)
  #define MCAN_TXEFS_EFF_Msk (0x1UL << MCAN_TXEFS_EFF_Pos)
  #define MCAN_TXEFS_EFF_Min (0x0UL)
  #define MCAN_TXEFS_EFF_Max (0x1UL)
  #define MCAN_TXEFS_EFF_NotFull (0x0UL)
  #define MCAN_TXEFS_EFF_Full (0x1UL)

/* TEFL @Bit 25 : Tx Event FIFO Element Lost */
  #define MCAN_TXEFS_TEFL_Pos (25UL)
  #define MCAN_TXEFS_TEFL_Msk (0x1UL << MCAN_TXEFS_TEFL_Pos)
  #define MCAN_TXEFS_TEFL_Min (0x0UL)
  #define MCAN_TXEFS_TEFL_Max (0x1UL)
  #define MCAN_TXEFS_TEFL_NotLost (0x0UL)
  #define MCAN_TXEFS_TEFL_Lost (0x1UL)               /*!< Tx Event FIFO element lost, also set after wr ite attempt to Tx Event
                                                          FIFO of siz e zero.*/


/* MCAN_TXEFA: Tx Event FIFO Acknowledge */
  #define MCAN_TXEFA_ResetValue (0x00000000UL)

/* EFAI @Bits 0..4 : Event FIFO Acknowledge Index */
  #define MCAN_TXEFA_EFAI_Pos (0UL)
  #define MCAN_TXEFA_EFAI_Msk (0x1FUL << MCAN_TXEFA_EFAI_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          MEMCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct MEMCONF_POWER =================================================== */
/**
  * @brief POWER [MEMCONF_POWER] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONTROL;
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  RET;
  __IOM uint32_t  RET2;
} NRF_MEMCONF_POWER_Type;
