pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define MEMCONF_POWER_MaxCount (2UL)
  #define MEMCONF_POWER_MaxIndex (1UL)
  #define MEMCONF_POWER_MinIndex (0UL)

/* MEMCONF_POWER_CONTROL: Control memory block power. */
  #define MEMCONF_POWER_CONTROL_ResetValue (0xFFFFFFFFUL)

/* MEM0 @Bit 0 : Keep the memory block MEM[0] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM0_Pos (0UL)
  #define MEMCONF_POWER_CONTROL_MEM0_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM0_Pos)
  #define MEMCONF_POWER_CONTROL_MEM0_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM0_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM0_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM0_On (0x1UL)

/* MEM1 @Bit 1 : Keep the memory block MEM[1] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM1_Pos (1UL)
  #define MEMCONF_POWER_CONTROL_MEM1_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM1_Pos)
  #define MEMCONF_POWER_CONTROL_MEM1_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM1_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM1_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM1_On (0x1UL)

/* MEM2 @Bit 2 : Keep the memory block MEM[2] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM2_Pos (2UL)
  #define MEMCONF_POWER_CONTROL_MEM2_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM2_Pos)
  #define MEMCONF_POWER_CONTROL_MEM2_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM2_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM2_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM2_On (0x1UL)

/* MEM3 @Bit 3 : Keep the memory block MEM[3] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM3_Pos (3UL)
  #define MEMCONF_POWER_CONTROL_MEM3_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM3_Pos)
  #define MEMCONF_POWER_CONTROL_MEM3_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM3_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM3_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM3_On (0x1UL)

/* MEM4 @Bit 4 : Keep the memory block MEM[4] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM4_Pos (4UL)
  #define MEMCONF_POWER_CONTROL_MEM4_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM4_Pos)
  #define MEMCONF_POWER_CONTROL_MEM4_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM4_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM4_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM4_On (0x1UL)

/* MEM5 @Bit 5 : Keep the memory block MEM[5] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM5_Pos (5UL)
  #define MEMCONF_POWER_CONTROL_MEM5_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM5_Pos)
  #define MEMCONF_POWER_CONTROL_MEM5_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM5_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM5_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM5_On (0x1UL)

/* MEM6 @Bit 6 : Keep the memory block MEM[6] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM6_Pos (6UL)
  #define MEMCONF_POWER_CONTROL_MEM6_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM6_Pos)
  #define MEMCONF_POWER_CONTROL_MEM6_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM6_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM6_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM6_On (0x1UL)

/* MEM7 @Bit 7 : Keep the memory block MEM[7] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM7_Pos (7UL)
  #define MEMCONF_POWER_CONTROL_MEM7_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM7_Pos)
  #define MEMCONF_POWER_CONTROL_MEM7_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM7_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM7_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM7_On (0x1UL)

/* MEM8 @Bit 8 : Keep the memory block MEM[8] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM8_Pos (8UL)
  #define MEMCONF_POWER_CONTROL_MEM8_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM8_Pos)
  #define MEMCONF_POWER_CONTROL_MEM8_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM8_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM8_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM8_On (0x1UL)

/* MEM9 @Bit 9 : Keep the memory block MEM[9] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM9_Pos (9UL)
  #define MEMCONF_POWER_CONTROL_MEM9_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM9_Pos)
  #define MEMCONF_POWER_CONTROL_MEM9_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM9_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM9_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM9_On (0x1UL)

/* MEM10 @Bit 10 : Keep the memory block MEM[10] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM10_Pos (10UL)
  #define MEMCONF_POWER_CONTROL_MEM10_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM10_Pos)
  #define MEMCONF_POWER_CONTROL_MEM10_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM10_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM10_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM10_On (0x1UL)

/* MEM11 @Bit 11 : Keep the memory block MEM[11] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM11_Pos (11UL)
  #define MEMCONF_POWER_CONTROL_MEM11_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM11_Pos)
  #define MEMCONF_POWER_CONTROL_MEM11_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM11_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM11_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM11_On (0x1UL)

/* MEM12 @Bit 12 : Keep the memory block MEM[12] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM12_Pos (12UL)
  #define MEMCONF_POWER_CONTROL_MEM12_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM12_Pos)
  #define MEMCONF_POWER_CONTROL_MEM12_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM12_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM12_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM12_On (0x1UL)

/* MEM13 @Bit 13 : Keep the memory block MEM[13] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM13_Pos (13UL)
  #define MEMCONF_POWER_CONTROL_MEM13_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM13_Pos)
  #define MEMCONF_POWER_CONTROL_MEM13_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM13_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM13_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM13_On (0x1UL)

/* MEM14 @Bit 14 : Keep the memory block MEM[14] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM14_Pos (14UL)
  #define MEMCONF_POWER_CONTROL_MEM14_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM14_Pos)
  #define MEMCONF_POWER_CONTROL_MEM14_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM14_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM14_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM14_On (0x1UL)

/* MEM15 @Bit 15 : Keep the memory block MEM[15] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM15_Pos (15UL)
  #define MEMCONF_POWER_CONTROL_MEM15_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM15_Pos)
  #define MEMCONF_POWER_CONTROL_MEM15_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM15_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM15_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM15_On (0x1UL)

/* MEM16 @Bit 16 : Keep the memory block MEM[16] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM16_Pos (16UL)
  #define MEMCONF_POWER_CONTROL_MEM16_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM16_Pos)
  #define MEMCONF_POWER_CONTROL_MEM16_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM16_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM16_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM16_On (0x1UL)

/* MEM17 @Bit 17 : Keep the memory block MEM[17] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM17_Pos (17UL)
  #define MEMCONF_POWER_CONTROL_MEM17_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM17_Pos)
  #define MEMCONF_POWER_CONTROL_MEM17_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM17_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM17_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM17_On (0x1UL)

