pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MEM18 @Bit 18 : Keep the memory block MEM[18] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM18_Pos (18UL)
  #define MEMCONF_POWER_CONTROL_MEM18_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM18_Pos)
  #define MEMCONF_POWER_CONTROL_MEM18_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM18_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM18_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM18_On (0x1UL)

/* MEM19 @Bit 19 : Keep the memory block MEM[19] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM19_Pos (19UL)
  #define MEMCONF_POWER_CONTROL_MEM19_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM19_Pos)
  #define MEMCONF_POWER_CONTROL_MEM19_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM19_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM19_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM19_On (0x1UL)

/* MEM20 @Bit 20 : Keep the memory block MEM[20] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM20_Pos (20UL)
  #define MEMCONF_POWER_CONTROL_MEM20_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM20_Pos)
  #define MEMCONF_POWER_CONTROL_MEM20_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM20_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM20_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM20_On (0x1UL)

/* MEM21 @Bit 21 : Keep the memory block MEM[21] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM21_Pos (21UL)
  #define MEMCONF_POWER_CONTROL_MEM21_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM21_Pos)
  #define MEMCONF_POWER_CONTROL_MEM21_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM21_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM21_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM21_On (0x1UL)

/* MEM22 @Bit 22 : Keep the memory block MEM[22] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM22_Pos (22UL)
  #define MEMCONF_POWER_CONTROL_MEM22_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM22_Pos)
  #define MEMCONF_POWER_CONTROL_MEM22_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM22_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM22_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM22_On (0x1UL)

/* MEM23 @Bit 23 : Keep the memory block MEM[23] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM23_Pos (23UL)
  #define MEMCONF_POWER_CONTROL_MEM23_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM23_Pos)
  #define MEMCONF_POWER_CONTROL_MEM23_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM23_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM23_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM23_On (0x1UL)

/* MEM24 @Bit 24 : Keep the memory block MEM[24] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM24_Pos (24UL)
  #define MEMCONF_POWER_CONTROL_MEM24_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM24_Pos)
  #define MEMCONF_POWER_CONTROL_MEM24_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM24_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM24_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM24_On (0x1UL)

/* MEM25 @Bit 25 : Keep the memory block MEM[25] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM25_Pos (25UL)
  #define MEMCONF_POWER_CONTROL_MEM25_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM25_Pos)
  #define MEMCONF_POWER_CONTROL_MEM25_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM25_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM25_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM25_On (0x1UL)

/* MEM26 @Bit 26 : Keep the memory block MEM[26] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM26_Pos (26UL)
  #define MEMCONF_POWER_CONTROL_MEM26_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM26_Pos)
  #define MEMCONF_POWER_CONTROL_MEM26_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM26_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM26_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM26_On (0x1UL)

/* MEM27 @Bit 27 : Keep the memory block MEM[27] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM27_Pos (27UL)
  #define MEMCONF_POWER_CONTROL_MEM27_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM27_Pos)
  #define MEMCONF_POWER_CONTROL_MEM27_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM27_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM27_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM27_On (0x1UL)

/* MEM28 @Bit 28 : Keep the memory block MEM[28] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM28_Pos (28UL)
  #define MEMCONF_POWER_CONTROL_MEM28_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM28_Pos)
  #define MEMCONF_POWER_CONTROL_MEM28_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM28_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM28_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM28_On (0x1UL)

/* MEM29 @Bit 29 : Keep the memory block MEM[29] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM29_Pos (29UL)
  #define MEMCONF_POWER_CONTROL_MEM29_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM29_Pos)
  #define MEMCONF_POWER_CONTROL_MEM29_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM29_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM29_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM29_On (0x1UL)

/* MEM30 @Bit 30 : Keep the memory block MEM[30] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM30_Pos (30UL)
  #define MEMCONF_POWER_CONTROL_MEM30_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM30_Pos)
  #define MEMCONF_POWER_CONTROL_MEM30_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM30_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM30_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM30_On (0x1UL)

/* MEM31 @Bit 31 : Keep the memory block MEM[31] on or off when in System ON mode. */
  #define MEMCONF_POWER_CONTROL_MEM31_Pos (31UL)
  #define MEMCONF_POWER_CONTROL_MEM31_Msk (0x1UL << MEMCONF_POWER_CONTROL_MEM31_Pos)
  #define MEMCONF_POWER_CONTROL_MEM31_Min (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM31_Max (0x1UL)
  #define MEMCONF_POWER_CONTROL_MEM31_Off (0x0UL)
  #define MEMCONF_POWER_CONTROL_MEM31_On (0x1UL)


/* MEMCONF_POWER_RET: RAM retention for RAM [n]. */
  #define MEMCONF_POWER_RET_ResetValue (0x00000000UL)

/* MEM0 @Bit 0 : Keep the RAM block MEM[0] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM0_Pos (0UL)
  #define MEMCONF_POWER_RET_MEM0_Msk (0x1UL << MEMCONF_POWER_RET_MEM0_Pos)
  #define MEMCONF_POWER_RET_MEM0_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM0_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM0_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM0_On (0x1UL)

/* MEM1 @Bit 1 : Keep the RAM block MEM[1] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM1_Pos (1UL)
  #define MEMCONF_POWER_RET_MEM1_Msk (0x1UL << MEMCONF_POWER_RET_MEM1_Pos)
  #define MEMCONF_POWER_RET_MEM1_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM1_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM1_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM1_On (0x1UL)

/* MEM2 @Bit 2 : Keep the RAM block MEM[2] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM2_Pos (2UL)
  #define MEMCONF_POWER_RET_MEM2_Msk (0x1UL << MEMCONF_POWER_RET_MEM2_Pos)
  #define MEMCONF_POWER_RET_MEM2_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM2_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM2_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM2_On (0x1UL)

/* MEM3 @Bit 3 : Keep the RAM block MEM[3] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM3_Pos (3UL)
  #define MEMCONF_POWER_RET_MEM3_Msk (0x1UL << MEMCONF_POWER_RET_MEM3_Pos)
  #define MEMCONF_POWER_RET_MEM3_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM3_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM3_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM3_On (0x1UL)

/* MEM4 @Bit 4 : Keep the RAM block MEM[4] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM4_Pos (4UL)
  #define MEMCONF_POWER_RET_MEM4_Msk (0x1UL << MEMCONF_POWER_RET_MEM4_Pos)
  #define MEMCONF_POWER_RET_MEM4_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM4_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM4_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM4_On (0x1UL)

/* MEM5 @Bit 5 : Keep the RAM block MEM[5] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM5_Pos (5UL)
  #define MEMCONF_POWER_RET_MEM5_Msk (0x1UL << MEMCONF_POWER_RET_MEM5_Pos)
  #define MEMCONF_POWER_RET_MEM5_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM5_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM5_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM5_On (0x1UL)

/* MEM6 @Bit 6 : Keep the RAM block MEM[6] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM6_Pos (6UL)
  #define MEMCONF_POWER_RET_MEM6_Msk (0x1UL << MEMCONF_POWER_RET_MEM6_Pos)
  #define MEMCONF_POWER_RET_MEM6_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM6_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM6_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM6_On (0x1UL)

/* MEM7 @Bit 7 : Keep the RAM block MEM[7] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM7_Pos (7UL)
  #define MEMCONF_POWER_RET_MEM7_Msk (0x1UL << MEMCONF_POWER_RET_MEM7_Pos)
  #define MEMCONF_POWER_RET_MEM7_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM7_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM7_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM7_On (0x1UL)

/* MEM8 @Bit 8 : Keep the RAM block MEM[8] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM8_Pos (8UL)
  #define MEMCONF_POWER_RET_MEM8_Msk (0x1UL << MEMCONF_POWER_RET_MEM8_Pos)
  #define MEMCONF_POWER_RET_MEM8_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM8_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM8_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM8_On (0x1UL)

/* MEM9 @Bit 9 : Keep the RAM block MEM[9] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM9_Pos (9UL)
  #define MEMCONF_POWER_RET_MEM9_Msk (0x1UL << MEMCONF_POWER_RET_MEM9_Pos)
  #define MEMCONF_POWER_RET_MEM9_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM9_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM9_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM9_On (0x1UL)

/* MEM10 @Bit 10 : Keep the RAM block MEM[10] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM10_Pos (10UL)
  #define MEMCONF_POWER_RET_MEM10_Msk (0x1UL << MEMCONF_POWER_RET_MEM10_Pos)
  #define MEMCONF_POWER_RET_MEM10_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM10_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM10_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM10_On (0x1UL)

/* MEM11 @Bit 11 : Keep the RAM block MEM[11] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM11_Pos (11UL)
  #define MEMCONF_POWER_RET_MEM11_Msk (0x1UL << MEMCONF_POWER_RET_MEM11_Pos)
  #define MEMCONF_POWER_RET_MEM11_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM11_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM11_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM11_On (0x1UL)

/* MEM12 @Bit 12 : Keep the RAM block MEM[12] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM12_Pos (12UL)
  #define MEMCONF_POWER_RET_MEM12_Msk (0x1UL << MEMCONF_POWER_RET_MEM12_Pos)
  #define MEMCONF_POWER_RET_MEM12_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM12_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM12_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM12_On (0x1UL)

/* MEM13 @Bit 13 : Keep the RAM block MEM[13] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM13_Pos (13UL)
  #define MEMCONF_POWER_RET_MEM13_Msk (0x1UL << MEMCONF_POWER_RET_MEM13_Pos)
  #define MEMCONF_POWER_RET_MEM13_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM13_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM13_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM13_On (0x1UL)

/* MEM14 @Bit 14 : Keep the RAM block MEM[14] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM14_Pos (14UL)
  #define MEMCONF_POWER_RET_MEM14_Msk (0x1UL << MEMCONF_POWER_RET_MEM14_Pos)
  #define MEMCONF_POWER_RET_MEM14_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM14_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM14_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM14_On (0x1UL)

/* MEM15 @Bit 15 : Keep the RAM block MEM[15] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM15_Pos (15UL)
  #define MEMCONF_POWER_RET_MEM15_Msk (0x1UL << MEMCONF_POWER_RET_MEM15_Pos)
  #define MEMCONF_POWER_RET_MEM15_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM15_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM15_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM15_On (0x1UL)

/* MEM16 @Bit 16 : Keep the RAM block MEM[16] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM16_Pos (16UL)
  #define MEMCONF_POWER_RET_MEM16_Msk (0x1UL << MEMCONF_POWER_RET_MEM16_Pos)
  #define MEMCONF_POWER_RET_MEM16_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM16_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM16_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM16_On (0x1UL)

/* MEM17 @Bit 17 : Keep the RAM block MEM[17] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM17_Pos (17UL)
  #define MEMCONF_POWER_RET_MEM17_Msk (0x1UL << MEMCONF_POWER_RET_MEM17_Pos)
  #define MEMCONF_POWER_RET_MEM17_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM17_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM17_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM17_On (0x1UL)

/* MEM18 @Bit 18 : Keep the RAM block MEM[18] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM18_Pos (18UL)
  #define MEMCONF_POWER_RET_MEM18_Msk (0x1UL << MEMCONF_POWER_RET_MEM18_Pos)
  #define MEMCONF_POWER_RET_MEM18_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM18_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM18_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM18_On (0x1UL)

/* MEM19 @Bit 19 : Keep the RAM block MEM[19] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM19_Pos (19UL)
  #define MEMCONF_POWER_RET_MEM19_Msk (0x1UL << MEMCONF_POWER_RET_MEM19_Pos)
  #define MEMCONF_POWER_RET_MEM19_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM19_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM19_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM19_On (0x1UL)

/* MEM20 @Bit 20 : Keep the RAM block MEM[20] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM20_Pos (20UL)
  #define MEMCONF_POWER_RET_MEM20_Msk (0x1UL << MEMCONF_POWER_RET_MEM20_Pos)
  #define MEMCONF_POWER_RET_MEM20_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM20_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM20_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM20_On (0x1UL)

/* MEM21 @Bit 21 : Keep the RAM block MEM[21] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM21_Pos (21UL)
  #define MEMCONF_POWER_RET_MEM21_Msk (0x1UL << MEMCONF_POWER_RET_MEM21_Pos)
  #define MEMCONF_POWER_RET_MEM21_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM21_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM21_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM21_On (0x1UL)

/* MEM22 @Bit 22 : Keep the RAM block MEM[22] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM22_Pos (22UL)
  #define MEMCONF_POWER_RET_MEM22_Msk (0x1UL << MEMCONF_POWER_RET_MEM22_Pos)
  #define MEMCONF_POWER_RET_MEM22_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM22_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM22_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM22_On (0x1UL)

/* MEM23 @Bit 23 : Keep the RAM block MEM[23] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM23_Pos (23UL)
  #define MEMCONF_POWER_RET_MEM23_Msk (0x1UL << MEMCONF_POWER_RET_MEM23_Pos)
  #define MEMCONF_POWER_RET_MEM23_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM23_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM23_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM23_On (0x1UL)

/* MEM24 @Bit 24 : Keep the RAM block MEM[24] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM24_Pos (24UL)
  #define MEMCONF_POWER_RET_MEM24_Msk (0x1UL << MEMCONF_POWER_RET_MEM24_Pos)
  #define MEMCONF_POWER_RET_MEM24_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM24_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM24_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM24_On (0x1UL)

/* MEM25 @Bit 25 : Keep the RAM block MEM[25] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM25_Pos (25UL)
  #define MEMCONF_POWER_RET_MEM25_Msk (0x1UL << MEMCONF_POWER_RET_MEM25_Pos)
  #define MEMCONF_POWER_RET_MEM25_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM25_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM25_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM25_On (0x1UL)

/* MEM26 @Bit 26 : Keep the RAM block MEM[26] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM26_Pos (26UL)
  #define MEMCONF_POWER_RET_MEM26_Msk (0x1UL << MEMCONF_POWER_RET_MEM26_Pos)
  #define MEMCONF_POWER_RET_MEM26_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM26_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM26_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM26_On (0x1UL)

/* MEM27 @Bit 27 : Keep the RAM block MEM[27] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM27_Pos (27UL)
  #define MEMCONF_POWER_RET_MEM27_Msk (0x1UL << MEMCONF_POWER_RET_MEM27_Pos)
  #define MEMCONF_POWER_RET_MEM27_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM27_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM27_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM27_On (0x1UL)

/* MEM28 @Bit 28 : Keep the RAM block MEM[28] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM28_Pos (28UL)
  #define MEMCONF_POWER_RET_MEM28_Msk (0x1UL << MEMCONF_POWER_RET_MEM28_Pos)
  #define MEMCONF_POWER_RET_MEM28_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM28_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM28_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM28_On (0x1UL)

/* MEM29 @Bit 29 : Keep the RAM block MEM[29] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM29_Pos (29UL)
  #define MEMCONF_POWER_RET_MEM29_Msk (0x1UL << MEMCONF_POWER_RET_MEM29_Pos)
  #define MEMCONF_POWER_RET_MEM29_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM29_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM29_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM29_On (0x1UL)

/* MEM30 @Bit 30 : Keep the RAM block MEM[30] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM30_Pos (30UL)
  #define MEMCONF_POWER_RET_MEM30_Msk (0x1UL << MEMCONF_POWER_RET_MEM30_Pos)
  #define MEMCONF_POWER_RET_MEM30_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM30_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM30_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM30_On (0x1UL)

/* MEM31 @Bit 31 : Keep the RAM block MEM[31] retained when the parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET_MEM31_Pos (31UL)
  #define MEMCONF_POWER_RET_MEM31_Msk (0x1UL << MEMCONF_POWER_RET_MEM31_Pos)
  #define MEMCONF_POWER_RET_MEM31_Min (0x0UL)
  #define MEMCONF_POWER_RET_MEM31_Max (0x1UL)
  #define MEMCONF_POWER_RET_MEM31_Off (0x0UL)
  #define MEMCONF_POWER_RET_MEM31_On (0x1UL)


/* MEMCONF_POWER_RET2: RAM retention for the second bank in the RAM block */
  #define MEMCONF_POWER_RET2_ResetValue (0x00000000UL)

/* MEM0 @Bit 0 : Keep the second bank in RAM block MEM[0] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM0_Pos (0UL)
  #define MEMCONF_POWER_RET2_MEM0_Msk (0x1UL << MEMCONF_POWER_RET2_MEM0_Pos)
  #define MEMCONF_POWER_RET2_MEM0_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM0_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM0_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM0_On (0x1UL)

/* MEM1 @Bit 1 : Keep the second bank in RAM block MEM[1] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM1_Pos (1UL)
  #define MEMCONF_POWER_RET2_MEM1_Msk (0x1UL << MEMCONF_POWER_RET2_MEM1_Pos)
  #define MEMCONF_POWER_RET2_MEM1_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM1_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM1_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM1_On (0x1UL)

/* MEM2 @Bit 2 : Keep the second bank in RAM block MEM[2] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM2_Pos (2UL)
  #define MEMCONF_POWER_RET2_MEM2_Msk (0x1UL << MEMCONF_POWER_RET2_MEM2_Pos)
  #define MEMCONF_POWER_RET2_MEM2_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM2_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM2_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM2_On (0x1UL)

/* MEM3 @Bit 3 : Keep the second bank in RAM block MEM[3] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM3_Pos (3UL)
  #define MEMCONF_POWER_RET2_MEM3_Msk (0x1UL << MEMCONF_POWER_RET2_MEM3_Pos)
  #define MEMCONF_POWER_RET2_MEM3_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM3_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM3_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM3_On (0x1UL)

