pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MEM4 @Bit 4 : Keep the second bank in RAM block MEM[4] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM4_Pos (4UL)
  #define MEMCONF_POWER_RET2_MEM4_Msk (0x1UL << MEMCONF_POWER_RET2_MEM4_Pos)
  #define MEMCONF_POWER_RET2_MEM4_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM4_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM4_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM4_On (0x1UL)

/* MEM5 @Bit 5 : Keep the second bank in RAM block MEM[5] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM5_Pos (5UL)
  #define MEMCONF_POWER_RET2_MEM5_Msk (0x1UL << MEMCONF_POWER_RET2_MEM5_Pos)
  #define MEMCONF_POWER_RET2_MEM5_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM5_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM5_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM5_On (0x1UL)

/* MEM6 @Bit 6 : Keep the second bank in RAM block MEM[6] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM6_Pos (6UL)
  #define MEMCONF_POWER_RET2_MEM6_Msk (0x1UL << MEMCONF_POWER_RET2_MEM6_Pos)
  #define MEMCONF_POWER_RET2_MEM6_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM6_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM6_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM6_On (0x1UL)

/* MEM7 @Bit 7 : Keep the second bank in RAM block MEM[7] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM7_Pos (7UL)
  #define MEMCONF_POWER_RET2_MEM7_Msk (0x1UL << MEMCONF_POWER_RET2_MEM7_Pos)
  #define MEMCONF_POWER_RET2_MEM7_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM7_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM7_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM7_On (0x1UL)

/* MEM8 @Bit 8 : Keep the second bank in RAM block MEM[8] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM8_Pos (8UL)
  #define MEMCONF_POWER_RET2_MEM8_Msk (0x1UL << MEMCONF_POWER_RET2_MEM8_Pos)
  #define MEMCONF_POWER_RET2_MEM8_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM8_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM8_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM8_On (0x1UL)

/* MEM9 @Bit 9 : Keep the second bank in RAM block MEM[9] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM9_Pos (9UL)
  #define MEMCONF_POWER_RET2_MEM9_Msk (0x1UL << MEMCONF_POWER_RET2_MEM9_Pos)
  #define MEMCONF_POWER_RET2_MEM9_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM9_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM9_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM9_On (0x1UL)

/* MEM10 @Bit 10 : Keep the second bank in RAM block MEM[10] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM10_Pos (10UL)
  #define MEMCONF_POWER_RET2_MEM10_Msk (0x1UL << MEMCONF_POWER_RET2_MEM10_Pos)
  #define MEMCONF_POWER_RET2_MEM10_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM10_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM10_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM10_On (0x1UL)

/* MEM11 @Bit 11 : Keep the second bank in RAM block MEM[11] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM11_Pos (11UL)
  #define MEMCONF_POWER_RET2_MEM11_Msk (0x1UL << MEMCONF_POWER_RET2_MEM11_Pos)
  #define MEMCONF_POWER_RET2_MEM11_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM11_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM11_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM11_On (0x1UL)

/* MEM12 @Bit 12 : Keep the second bank in RAM block MEM[12] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM12_Pos (12UL)
  #define MEMCONF_POWER_RET2_MEM12_Msk (0x1UL << MEMCONF_POWER_RET2_MEM12_Pos)
  #define MEMCONF_POWER_RET2_MEM12_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM12_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM12_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM12_On (0x1UL)

/* MEM13 @Bit 13 : Keep the second bank in RAM block MEM[13] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM13_Pos (13UL)
  #define MEMCONF_POWER_RET2_MEM13_Msk (0x1UL << MEMCONF_POWER_RET2_MEM13_Pos)
  #define MEMCONF_POWER_RET2_MEM13_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM13_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM13_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM13_On (0x1UL)

/* MEM14 @Bit 14 : Keep the second bank in RAM block MEM[14] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM14_Pos (14UL)
  #define MEMCONF_POWER_RET2_MEM14_Msk (0x1UL << MEMCONF_POWER_RET2_MEM14_Pos)
  #define MEMCONF_POWER_RET2_MEM14_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM14_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM14_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM14_On (0x1UL)

/* MEM15 @Bit 15 : Keep the second bank in RAM block MEM[15] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM15_Pos (15UL)
  #define MEMCONF_POWER_RET2_MEM15_Msk (0x1UL << MEMCONF_POWER_RET2_MEM15_Pos)
  #define MEMCONF_POWER_RET2_MEM15_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM15_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM15_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM15_On (0x1UL)

/* MEM16 @Bit 16 : Keep the second bank in RAM block MEM[16] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM16_Pos (16UL)
  #define MEMCONF_POWER_RET2_MEM16_Msk (0x1UL << MEMCONF_POWER_RET2_MEM16_Pos)
  #define MEMCONF_POWER_RET2_MEM16_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM16_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM16_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM16_On (0x1UL)

/* MEM17 @Bit 17 : Keep the second bank in RAM block MEM[17] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM17_Pos (17UL)
  #define MEMCONF_POWER_RET2_MEM17_Msk (0x1UL << MEMCONF_POWER_RET2_MEM17_Pos)
  #define MEMCONF_POWER_RET2_MEM17_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM17_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM17_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM17_On (0x1UL)

/* MEM18 @Bit 18 : Keep the second bank in RAM block MEM[18] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM18_Pos (18UL)
  #define MEMCONF_POWER_RET2_MEM18_Msk (0x1UL << MEMCONF_POWER_RET2_MEM18_Pos)
  #define MEMCONF_POWER_RET2_MEM18_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM18_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM18_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM18_On (0x1UL)

/* MEM19 @Bit 19 : Keep the second bank in RAM block MEM[19] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM19_Pos (19UL)
  #define MEMCONF_POWER_RET2_MEM19_Msk (0x1UL << MEMCONF_POWER_RET2_MEM19_Pos)
  #define MEMCONF_POWER_RET2_MEM19_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM19_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM19_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM19_On (0x1UL)

/* MEM20 @Bit 20 : Keep the second bank in RAM block MEM[20] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM20_Pos (20UL)
  #define MEMCONF_POWER_RET2_MEM20_Msk (0x1UL << MEMCONF_POWER_RET2_MEM20_Pos)
  #define MEMCONF_POWER_RET2_MEM20_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM20_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM20_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM20_On (0x1UL)

