pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MEM21 @Bit 21 : Keep the second bank in RAM block MEM[21] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM21_Pos (21UL)
  #define MEMCONF_POWER_RET2_MEM21_Msk (0x1UL << MEMCONF_POWER_RET2_MEM21_Pos)
  #define MEMCONF_POWER_RET2_MEM21_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM21_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM21_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM21_On (0x1UL)

/* MEM22 @Bit 22 : Keep the second bank in RAM block MEM[22] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM22_Pos (22UL)
  #define MEMCONF_POWER_RET2_MEM22_Msk (0x1UL << MEMCONF_POWER_RET2_MEM22_Pos)
  #define MEMCONF_POWER_RET2_MEM22_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM22_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM22_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM22_On (0x1UL)

/* MEM23 @Bit 23 : Keep the second bank in RAM block MEM[23] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM23_Pos (23UL)
  #define MEMCONF_POWER_RET2_MEM23_Msk (0x1UL << MEMCONF_POWER_RET2_MEM23_Pos)
  #define MEMCONF_POWER_RET2_MEM23_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM23_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM23_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM23_On (0x1UL)

/* MEM24 @Bit 24 : Keep the second bank in RAM block MEM[24] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM24_Pos (24UL)
  #define MEMCONF_POWER_RET2_MEM24_Msk (0x1UL << MEMCONF_POWER_RET2_MEM24_Pos)
  #define MEMCONF_POWER_RET2_MEM24_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM24_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM24_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM24_On (0x1UL)

/* MEM25 @Bit 25 : Keep the second bank in RAM block MEM[25] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM25_Pos (25UL)
  #define MEMCONF_POWER_RET2_MEM25_Msk (0x1UL << MEMCONF_POWER_RET2_MEM25_Pos)
  #define MEMCONF_POWER_RET2_MEM25_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM25_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM25_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM25_On (0x1UL)

/* MEM26 @Bit 26 : Keep the second bank in RAM block MEM[26] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM26_Pos (26UL)
  #define MEMCONF_POWER_RET2_MEM26_Msk (0x1UL << MEMCONF_POWER_RET2_MEM26_Pos)
  #define MEMCONF_POWER_RET2_MEM26_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM26_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM26_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM26_On (0x1UL)

/* MEM27 @Bit 27 : Keep the second bank in RAM block MEM[27] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM27_Pos (27UL)
  #define MEMCONF_POWER_RET2_MEM27_Msk (0x1UL << MEMCONF_POWER_RET2_MEM27_Pos)
  #define MEMCONF_POWER_RET2_MEM27_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM27_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM27_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM27_On (0x1UL)

/* MEM28 @Bit 28 : Keep the second bank in RAM block MEM[28] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM28_Pos (28UL)
  #define MEMCONF_POWER_RET2_MEM28_Msk (0x1UL << MEMCONF_POWER_RET2_MEM28_Pos)
  #define MEMCONF_POWER_RET2_MEM28_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM28_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM28_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM28_On (0x1UL)

/* MEM29 @Bit 29 : Keep the second bank in RAM block MEM[29] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM29_Pos (29UL)
  #define MEMCONF_POWER_RET2_MEM29_Msk (0x1UL << MEMCONF_POWER_RET2_MEM29_Pos)
  #define MEMCONF_POWER_RET2_MEM29_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM29_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM29_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM29_On (0x1UL)

/* MEM30 @Bit 30 : Keep the second bank in RAM block MEM[30] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM30_Pos (30UL)
  #define MEMCONF_POWER_RET2_MEM30_Msk (0x1UL << MEMCONF_POWER_RET2_MEM30_Pos)
  #define MEMCONF_POWER_RET2_MEM30_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM30_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM30_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM30_On (0x1UL)

/* MEM31 @Bit 31 : Keep the second bank in RAM block MEM[31] retained when parent power domain of the RAM is off. */
  #define MEMCONF_POWER_RET2_MEM31_Pos (31UL)
  #define MEMCONF_POWER_RET2_MEM31_Msk (0x1UL << MEMCONF_POWER_RET2_MEM31_Pos)
  #define MEMCONF_POWER_RET2_MEM31_Min (0x0UL)
  #define MEMCONF_POWER_RET2_MEM31_Max (0x1UL)
  #define MEMCONF_POWER_RET2_MEM31_Off (0x0UL)
  #define MEMCONF_POWER_RET2_MEM31_On (0x1UL)



/* ================================================== Struct MEMCONF_REPAIR ================================================== */
/**
  * @brief REPAIR [MEMCONF_REPAIR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  BITLINE;
} NRF_MEMCONF_REPAIR_Type;
  #define MEMCONF_REPAIR_MaxCount (192UL)
  #define MEMCONF_REPAIR_MaxIndex (191UL)
  #define MEMCONF_REPAIR_MinIndex (0UL)

/* MEMCONF_REPAIR_BITLINE: Repair configuration for RAM blocks. */
  #define MEMCONF_REPAIR_BITLINE_ResetValue (0x00000000UL)

/* ADDR @Bits 0..6 : Repair address of the bitline */
  #define MEMCONF_REPAIR_BITLINE_ADDR_Pos (0UL)
  #define MEMCONF_REPAIR_BITLINE_ADDR_Msk (0x7FUL << MEMCONF_REPAIR_BITLINE_ADDR_Pos)

/* EN @Bit 31 : Enable bitline repair */
  #define MEMCONF_REPAIR_BITLINE_EN_Pos (31UL)
  #define MEMCONF_REPAIR_BITLINE_EN_Msk (0x1UL << MEMCONF_REPAIR_BITLINE_EN_Pos)
  #define MEMCONF_REPAIR_BITLINE_EN_Min (0x0UL)
  #define MEMCONF_REPAIR_BITLINE_EN_Max (0x1UL)
  #define MEMCONF_REPAIR_BITLINE_EN_Disabled (0x0UL)
  #define MEMCONF_REPAIR_BITLINE_EN_Enabled (0x1UL)



/* ================================================ Struct MEMCONF_BLOCKTYPE ================================================= */
/**
  * @brief BLOCKTYPE [MEMCONF_BLOCKTYPE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TRIM;
} NRF_MEMCONF_BLOCKTYPE_Type;
  #define MEMCONF_BLOCKTYPE_MaxCount (64UL)
  #define MEMCONF_BLOCKTYPE_MaxIndex (63UL)
  #define MEMCONF_BLOCKTYPE_MinIndex (0UL)

/* MEMCONF_BLOCKTYPE_TRIM: Trim configuration for the memory block types. */
  #define MEMCONF_BLOCKTYPE_TRIM_ResetValue (0x00000000UL)

/* MEMTRIM0 @Bit 0 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Pos (0UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM0_Pos)

