pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MEMTRIM1 @Bit 1 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Pos (1UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM1_Pos)

/* MEMTRIM2 @Bit 2 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Pos (2UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM2_Pos)

/* MEMTRIM3 @Bit 3 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Pos (3UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM3_Pos)

/* MEMTRIM4 @Bit 4 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Pos (4UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM4_Pos)

/* MEMTRIM5 @Bit 5 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Pos (5UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM5_Pos)

/* MEMTRIM6 @Bit 6 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Pos (6UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM6_Pos)

/* MEMTRIM7 @Bit 7 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Pos (7UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM7_Pos)

/* MEMTRIM8 @Bit 8 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Pos (8UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM8_Pos)

/* MEMTRIM9 @Bit 9 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Pos (9UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM9_Pos)

/* MEMTRIM10 @Bit 10 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Pos (10UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM10_Pos) /*!< Bit mask of MEMTRIM10
                                                                            field.*/

/* MEMTRIM11 @Bit 11 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Pos (11UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM11_Pos) /*!< Bit mask of MEMTRIM11
                                                                            field.*/

/* MEMTRIM12 @Bit 12 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Pos (12UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM12_Pos) /*!< Bit mask of MEMTRIM12
                                                                            field.*/

/* MEMTRIM13 @Bit 13 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Pos (13UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM13_Pos) /*!< Bit mask of MEMTRIM13
                                                                            field.*/

/* MEMTRIM14 @Bit 14 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Pos (14UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM14_Pos) /*!< Bit mask of MEMTRIM14
                                                                            field.*/

/* MEMTRIM15 @Bit 15 : Read/write margin trim. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Pos (15UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMTRIM15_Pos) /*!< Bit mask of MEMTRIM15
                                                                            field.*/

/* MEMRETTRIM0 @Bit 16 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Pos (16UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM0_Pos) /*!< Bit mask of MEMRETTRIM0
                                                                            field.*/

/* MEMRETTRIM1 @Bit 17 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Pos (17UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM1_Pos) /*!< Bit mask of MEMRETTRIM1
                                                                            field.*/

/* MEMRETTRIM2 @Bit 18 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Pos (18UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM2_Pos) /*!< Bit mask of MEMRETTRIM2
                                                                            field.*/

/* MEMRETTRIM3 @Bit 19 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Pos (19UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM3_Pos) /*!< Bit mask of MEMRETTRIM3
                                                                            field.*/

/* MEMRETTRIM4 @Bit 20 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Pos (20UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM4_Pos) /*!< Bit mask of MEMRETTRIM4
                                                                            field.*/

/* MEMRETTRIM5 @Bit 21 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Pos (21UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM5_Pos) /*!< Bit mask of MEMRETTRIM5
                                                                            field.*/

/* MEMRETTRIM6 @Bit 22 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Pos (22UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM6_Pos) /*!< Bit mask of MEMRETTRIM6
                                                                            field.*/

/* MEMRETTRIM7 @Bit 23 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Pos (23UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM7_Pos) /*!< Bit mask of MEMRETTRIM7
                                                                            field.*/

/* MEMRETTRIM8 @Bit 24 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Pos (24UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM8_Pos) /*!< Bit mask of MEMRETTRIM8
                                                                            field.*/

/* MEMRETTRIM9 @Bit 25 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Pos (25UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM9_Pos) /*!< Bit mask of MEMRETTRIM9
                                                                            field.*/

