pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MEMRETTRIM10 @Bit 26 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Pos (26UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM10_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM10 field.*/

/* MEMRETTRIM11 @Bit 27 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Pos (27UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM11_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM11 field.*/

/* MEMRETTRIM12 @Bit 28 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Pos (28UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM12_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM12 field.*/

/* MEMRETTRIM13 @Bit 29 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Pos (29UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM13_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM13 field.*/

/* MEMRETTRIM14 @Bit 30 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Pos (30UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM14_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM14 field.*/

/* MEMRETTRIM15 @Bit 31 : Trimming for retention mode for decreased leakage. Must be kept active in RAM retention mode. */
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Pos (31UL)
  #define MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Msk (0x1UL << MEMCONF_BLOCKTYPE_TRIM_MEMRETTRIM15_Pos) /*!< Bit mask of
                                                                            MEMRETTRIM15 field.*/


/* ===================================================== Struct MEMCONF ====================================================== */
/**
  * @brief Memory configuration
  */
  typedef struct {
    __IM uint32_t RESERVED[320];
    __IOM NRF_MEMCONF_POWER_Type POWER[2];
    __IM uint32_t RESERVED1[56];
    __IOM NRF_MEMCONF_REPAIR_Type REPAIR[192];
    __IOM NRF_MEMCONF_BLOCKTYPE_Type BLOCKTYPE[64];
  } NRF_MEMCONF_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            MPC                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct MPC_MEMACCERR =================================================== */
/**
  * @brief MEMACCERR [MPC_MEMACCERR] Memory Access Error status registers
  */
typedef struct {
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000000) Target Address of Memory Access Error. Register content
                                                                         won't be changed as long as MEMACCERR event is active.*/
  __IM  uint32_t  INFO;                              /*!< (@ 0x00000004) Access information for the transaction that triggered a
                                                                         memory access error. Register content won't be changed
                                                                         as long as MEMACCERR event is active.*/
} NRF_MPC_MEMACCERR_Type;

/* MPC_MEMACCERR_ADDRESS: Target Address of Memory Access Error. Register content won't be changed as long as MEMACCERR event is
                           active. */

  #define MPC_MEMACCERR_ADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : Target address for erroneous access */
  #define MPC_MEMACCERR_ADDRESS_ADDRESS_Pos (0UL)
  #define MPC_MEMACCERR_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MPC_MEMACCERR_ADDRESS_ADDRESS_Pos)


/* MPC_MEMACCERR_INFO: Access information for the transaction that triggered a memory access error. Register content won't be
                        changed as long as MEMACCERR event is active. */

  #define MPC_MEMACCERR_INFO_ResetValue (0x00000000UL)

/* OWNERID @Bits 0..3 : Owner identifier of the erroneous access */
  #define MPC_MEMACCERR_INFO_OWNERID_Pos (0UL)
  #define MPC_MEMACCERR_INFO_OWNERID_Msk (0xFUL << MPC_MEMACCERR_INFO_OWNERID_Pos)
  #define MPC_MEMACCERR_INFO_OWNERID_Min (0x0UL)
  #define MPC_MEMACCERR_INFO_OWNERID_Max (0xFUL)

/* MASTERPORT @Bits 4..8 : Master port where erroneous access is detected */
  #define MPC_MEMACCERR_INFO_MASTERPORT_Pos (4UL)
  #define MPC_MEMACCERR_INFO_MASTERPORT_Msk (0x1FUL << MPC_MEMACCERR_INFO_MASTERPORT_Pos)
  #define MPC_MEMACCERR_INFO_MASTERPORT_Min (0x00UL)
  #define MPC_MEMACCERR_INFO_MASTERPORT_Max (0x1FUL)

/* READ @Bit 12 : Read bit of bus access */
  #define MPC_MEMACCERR_INFO_READ_Pos (12UL)
  #define MPC_MEMACCERR_INFO_READ_Msk (0x1UL << MPC_MEMACCERR_INFO_READ_Pos)
  #define MPC_MEMACCERR_INFO_READ_Min (0x0UL)
  #define MPC_MEMACCERR_INFO_READ_Max (0x1UL)
  #define MPC_MEMACCERR_INFO_READ_Set (0x1UL)
  #define MPC_MEMACCERR_INFO_READ_NotSet (0x0UL)

/* WRITE @Bit 13 : Write bit of bus access */
  #define MPC_MEMACCERR_INFO_WRITE_Pos (13UL)
  #define MPC_MEMACCERR_INFO_WRITE_Msk (0x1UL << MPC_MEMACCERR_INFO_WRITE_Pos)
  #define MPC_MEMACCERR_INFO_WRITE_Min (0x0UL)
  #define MPC_MEMACCERR_INFO_WRITE_Max (0x1UL)
  #define MPC_MEMACCERR_INFO_WRITE_Set (0x1UL)
  #define MPC_MEMACCERR_INFO_WRITE_NotSet (0x0UL)

/* EXECUTE @Bit 14 : Execute bit of bus access */
  #define MPC_MEMACCERR_INFO_EXECUTE_Pos (14UL)
  #define MPC_MEMACCERR_INFO_EXECUTE_Msk (0x1UL << MPC_MEMACCERR_INFO_EXECUTE_Pos)
  #define MPC_MEMACCERR_INFO_EXECUTE_Min (0x0UL)
  #define MPC_MEMACCERR_INFO_EXECUTE_Max (0x1UL)
  #define MPC_MEMACCERR_INFO_EXECUTE_Set (0x1UL)
  #define MPC_MEMACCERR_INFO_EXECUTE_NotSet (0x0UL)

/* SECURE @Bit 15 : Secure bit of bus access */
  #define MPC_MEMACCERR_INFO_SECURE_Pos (15UL)
  #define MPC_MEMACCERR_INFO_SECURE_Msk (0x1UL << MPC_MEMACCERR_INFO_SECURE_Pos)
  #define MPC_MEMACCERR_INFO_SECURE_Min (0x0UL)
  #define MPC_MEMACCERR_INFO_SECURE_Max (0x1UL)
  #define MPC_MEMACCERR_INFO_SECURE_Set (0x1UL)
  #define MPC_MEMACCERR_INFO_SECURE_NotSet (0x0UL)

