pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ERRORSOURCE @Bit 16 : Source of memory access error */
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Pos (16UL)
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Msk (0x1UL << MPC_MEMACCERR_INFO_ERRORSOURCE_Pos)
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Min (0x0UL)
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Max (0x1UL)
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_MPC (0x1UL)
  #define MPC_MEMACCERR_INFO_ERRORSOURCE_Slave (0x0UL)



/* ================================================= Struct MPC_GLOBALSLAVE ================================================== */
/**
  * @brief GLOBALSLAVE [MPC_GLOBALSLAVE] Global slave master port connection information
  */
typedef struct {
  __IOM uint32_t  MASTERPORT;
  __IOM uint32_t  LOCK;
} NRF_MPC_GLOBALSLAVE_Type;

/* MPC_GLOBALSLAVE_MASTERPORT: Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_ResetValue (0x00000000UL)

/* CONNECTION0 @Bit 0 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Pos (0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Pos) /*!< Bit mask of
                                                                            CONNECTION0 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION0_Enabled (0x1UL)

/* CONNECTION1 @Bit 1 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Pos (1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Pos) /*!< Bit mask of
                                                                            CONNECTION1 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION1_Enabled (0x1UL)

/* CONNECTION2 @Bit 2 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Pos (2UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Pos) /*!< Bit mask of
                                                                            CONNECTION2 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION2_Enabled (0x1UL)

/* CONNECTION3 @Bit 3 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Pos (3UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Pos) /*!< Bit mask of
                                                                            CONNECTION3 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION3_Enabled (0x1UL)

/* CONNECTION4 @Bit 4 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Pos (4UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Pos) /*!< Bit mask of
                                                                            CONNECTION4 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION4_Enabled (0x1UL)

/* CONNECTION5 @Bit 5 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Pos (5UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Pos) /*!< Bit mask of
                                                                            CONNECTION5 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION5_Enabled (0x1UL)

/* CONNECTION6 @Bit 6 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Pos (6UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Pos) /*!< Bit mask of
                                                                            CONNECTION6 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION6_Enabled (0x1UL)

/* CONNECTION7 @Bit 7 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Pos (7UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Pos) /*!< Bit mask of
                                                                            CONNECTION7 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION7_Enabled (0x1UL)

/* CONNECTION8 @Bit 8 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Pos (8UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Pos) /*!< Bit mask of
                                                                            CONNECTION8 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION8_Enabled (0x1UL)

/* CONNECTION9 @Bit 9 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Pos (9UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Pos) /*!< Bit mask of
                                                                            CONNECTION9 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION9_Enabled (0x1UL)

