pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CONNECTION10 @Bit 10 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Pos (10UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Pos) /*!< Bit mask of
                                                                            CONNECTION10 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION10_Enabled (0x1UL)

/* CONNECTION11 @Bit 11 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Pos (11UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Pos) /*!< Bit mask of
                                                                            CONNECTION11 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION11_Enabled (0x1UL)

/* CONNECTION12 @Bit 12 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Pos (12UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Pos) /*!< Bit mask of
                                                                            CONNECTION12 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION12_Enabled (0x1UL)

/* CONNECTION13 @Bit 13 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Pos (13UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Pos) /*!< Bit mask of
                                                                            CONNECTION13 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION13_Enabled (0x1UL)

/* CONNECTION14 @Bit 14 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Pos (14UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Pos) /*!< Bit mask of
                                                                            CONNECTION14 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION14_Enabled (0x1UL)

/* CONNECTION15 @Bit 15 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Pos (15UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Pos) /*!< Bit mask of
                                                                            CONNECTION15 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION15_Enabled (0x1UL)

/* CONNECTION16 @Bit 16 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Pos (16UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Pos) /*!< Bit mask of
                                                                            CONNECTION16 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION16_Enabled (0x1UL)

/* CONNECTION17 @Bit 17 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Pos (17UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Pos) /*!< Bit mask of
                                                                            CONNECTION17 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION17_Enabled (0x1UL)

/* CONNECTION18 @Bit 18 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Pos (18UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Pos) /*!< Bit mask of
                                                                            CONNECTION18 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION18_Enabled (0x1UL)

/* CONNECTION19 @Bit 19 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Pos (19UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Pos) /*!< Bit mask of
                                                                            CONNECTION19 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION19_Enabled (0x1UL)

/* CONNECTION20 @Bit 20 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Pos (20UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Pos) /*!< Bit mask of
                                                                            CONNECTION20 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION20_Enabled (0x1UL)

/* CONNECTION21 @Bit 21 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Pos (21UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Pos) /*!< Bit mask of
                                                                            CONNECTION21 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION21_Enabled (0x1UL)

/* CONNECTION22 @Bit 22 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Pos (22UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Pos) /*!< Bit mask of
                                                                            CONNECTION22 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION22_Enabled (0x1UL)

/* CONNECTION23 @Bit 23 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Pos (23UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Pos) /*!< Bit mask of
                                                                            CONNECTION23 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION23_Enabled (0x1UL)

/* CONNECTION24 @Bit 24 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Pos (24UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Pos) /*!< Bit mask of
                                                                            CONNECTION24 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION24_Enabled (0x1UL)

/* CONNECTION25 @Bit 25 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Pos (25UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Pos) /*!< Bit mask of
                                                                            CONNECTION25 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION25_Enabled (0x1UL)

/* CONNECTION26 @Bit 26 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Pos (26UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Pos) /*!< Bit mask of
                                                                            CONNECTION26 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION26_Enabled (0x1UL)

/* CONNECTION27 @Bit 27 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Pos (27UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Pos) /*!< Bit mask of
                                                                            CONNECTION27 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION27_Enabled (0x1UL)

/* CONNECTION28 @Bit 28 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Pos (28UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Pos) /*!< Bit mask of
                                                                            CONNECTION28 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION28_Enabled (0x1UL)

/* CONNECTION29 @Bit 29 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Pos (29UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Pos) /*!< Bit mask of
                                                                            CONNECTION29 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION29_Enabled (0x1UL)

/* CONNECTION30 @Bit 30 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Pos (30UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Pos) /*!< Bit mask of
                                                                            CONNECTION30 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION30_Enabled (0x1UL)

/* CONNECTION31 @Bit 31 : Global slave connection information for master port */
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Pos (31UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Msk (0x1UL << MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Pos) /*!< Bit mask of
                                                                            CONNECTION31 field.*/
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Min (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Max (0x1UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_MASTERPORT_CONNECTION31_Enabled (0x1UL)


/* MPC_GLOBALSLAVE_LOCK: Lock global slave registers */
  #define MPC_GLOBALSLAVE_LOCK_ResetValue (0x00000000UL)

/* LOCK @Bit 0 : Enable lock */
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Pos (0UL)
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Msk (0x1UL << MPC_GLOBALSLAVE_LOCK_LOCK_Pos)
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Min (0x0UL)
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Max (0x1UL)
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Disabled (0x0UL)
  #define MPC_GLOBALSLAVE_LOCK_LOCK_Enabled (0x1UL)



/* =================================================== Struct MPC_RTCHOKE ==================================================== */
/**
  * @brief RTCHOKE [MPC_RTCHOKE] Real time choke configuration for AXI master port
  */
typedef struct {
  __IOM uint32_t  WRITEACCESS;                       /*!< (@ 0x00000000) Enable AXI Write Address Channel Real Time Choke for
                                                                         master port*/
  __IOM uint32_t  READACCESS;                        /*!< (@ 0x00000004) Enable AXI Read Address Channel Real Time Choke for
                                                                         master port*/
  __IM  uint32_t  RESERVED[22];
  __IOM uint32_t  DELAY[32];
} NRF_MPC_RTCHOKE_Type;

/* MPC_RTCHOKE_WRITEACCESS: Enable AXI Write Address Channel Real Time Choke for master port */
  #define MPC_RTCHOKE_WRITEACCESS_ResetValue (0x00000000UL)

/* ENABLE0 @Bit 0 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Pos (0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE0_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 0 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE0_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 0 Write Address
                                                              Channel*/

/* ENABLE1 @Bit 1 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Pos (1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE1_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 1 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE1_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 1 Write Address
                                                              Channel*/

/* ENABLE2 @Bit 2 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Pos (2UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE2_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 2 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE2_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 2 Write Address
                                                              Channel*/

/* ENABLE3 @Bit 3 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Pos (3UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE3_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 3 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE3_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 3 Write Address
                                                              Channel*/

