pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE4 @Bit 4 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE4_Pos (4UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE4_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE4_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE4_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE4_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE4_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 4 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE4_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 4 Write Address
                                                              Channel*/

/* ENABLE5 @Bit 5 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE5_Pos (5UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE5_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE5_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE5_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE5_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE5_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 5 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE5_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 5 Write Address
                                                              Channel*/

/* ENABLE6 @Bit 6 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE6_Pos (6UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE6_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE6_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE6_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE6_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE6_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 6 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE6_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 6 Write Address
                                                              Channel*/

/* ENABLE7 @Bit 7 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE7_Pos (7UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE7_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE7_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE7_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE7_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE7_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 7 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE7_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 7 Write Address
                                                              Channel*/

/* ENABLE8 @Bit 8 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE8_Pos (8UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE8_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE8_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE8_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE8_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE8_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 8 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE8_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 8 Write Address
                                                              Channel*/

/* ENABLE9 @Bit 9 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE9_Pos (9UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE9_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE9_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE9_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE9_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE9_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 9 Write Address
                                                               Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE9_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 9 Write Address
                                                              Channel*/

/* ENABLE10 @Bit 10 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE10_Pos (10UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE10_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE10_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE10_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE10_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE10_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 10 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE10_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 10 Write Address
                                                               Channel*/

/* ENABLE11 @Bit 11 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE11_Pos (11UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE11_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE11_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE11_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE11_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE11_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 11 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE11_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 11 Write Address
                                                               Channel*/

/* ENABLE12 @Bit 12 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE12_Pos (12UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE12_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE12_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE12_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE12_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE12_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 12 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE12_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 12 Write Address
                                                               Channel*/

/* ENABLE13 @Bit 13 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE13_Pos (13UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE13_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE13_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE13_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE13_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE13_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 13 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE13_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 13 Write Address
                                                               Channel*/

