pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE28 @Bit 28 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Pos (28UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE28_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 28 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE28_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 28 Write Address
                                                               Channel*/

/* ENABLE29 @Bit 29 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Pos (29UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE29_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 29 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE29_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 29 Write Address
                                                               Channel*/

/* ENABLE30 @Bit 30 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Pos (30UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE30_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 30 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE30_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 30 Write Address
                                                               Channel*/

/* ENABLE31 @Bit 31 : Enable Real Time Choke for Write Address Channel */
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Pos (31UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Msk (0x1UL << MPC_RTCHOKE_WRITEACCESS_ENABLE31_Pos)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Min (0x0UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Max (0x1UL)
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 31 Write Address
                                                                Channel*/
  #define MPC_RTCHOKE_WRITEACCESS_ENABLE31_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 31 Write Address
                                                               Channel*/


/* MPC_RTCHOKE_READACCESS: Enable AXI Read Address Channel Real Time Choke for master port */
  #define MPC_RTCHOKE_READACCESS_ResetValue (0x00000000UL)

/* ENABLE0 @Bit 0 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Pos (0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE0_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 0 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE0_Enable (0x1UL)

/* ENABLE1 @Bit 1 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Pos (1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE1_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 1 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE1_Enable (0x1UL)

/* ENABLE2 @Bit 2 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Pos (2UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE2_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 2 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE2_Enable (0x1UL)

/* ENABLE3 @Bit 3 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Pos (3UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE3_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 3 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE3_Enable (0x1UL)

/* ENABLE4 @Bit 4 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Pos (4UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE4_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 4 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE4_Enable (0x1UL)

/* ENABLE5 @Bit 5 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Pos (5UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE5_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 5 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE5_Enable (0x1UL)

/* ENABLE6 @Bit 6 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Pos (6UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE6_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 6 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE6_Enable (0x1UL)

/* ENABLE7 @Bit 7 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Pos (7UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE7_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 7 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE7_Enable (0x1UL)

/* ENABLE8 @Bit 8 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Pos (8UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE8_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 8 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE8_Enable (0x1UL)

/* ENABLE9 @Bit 9 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Pos (9UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE9_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 9 Read Address
                                                              Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE9_Enable (0x1UL)

/* ENABLE10 @Bit 10 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Pos (10UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE10_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 10 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE10_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 10 Read Address
                                                              Channel*/

/* ENABLE11 @Bit 11 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Pos (11UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE11_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 11 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE11_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 11 Read Address
                                                              Channel*/

/* ENABLE12 @Bit 12 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Pos (12UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE12_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 12 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE12_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 12 Read Address
                                                              Channel*/

