pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE13 @Bit 13 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Pos (13UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE13_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 13 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE13_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 13 Read Address
                                                              Channel*/

/* ENABLE14 @Bit 14 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Pos (14UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE14_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 14 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE14_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 14 Read Address
                                                              Channel*/

/* ENABLE15 @Bit 15 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Pos (15UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE15_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 15 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE15_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 15 Read Address
                                                              Channel*/

/* ENABLE16 @Bit 16 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Pos (16UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE16_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 16 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE16_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 16 Read Address
                                                              Channel*/

/* ENABLE17 @Bit 17 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Pos (17UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE17_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 17 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE17_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 17 Read Address
                                                              Channel*/

/* ENABLE18 @Bit 18 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Pos (18UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE18_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 18 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE18_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 18 Read Address
                                                              Channel*/

/* ENABLE19 @Bit 19 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Pos (19UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE19_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 19 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE19_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 19 Read Address
                                                              Channel*/

/* ENABLE20 @Bit 20 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Pos (20UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE20_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 20 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE20_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 20 Read Address
                                                              Channel*/

/* ENABLE21 @Bit 21 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Pos (21UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE21_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 21 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE21_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 21 Read Address
                                                              Channel*/

/* ENABLE22 @Bit 22 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Pos (22UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE22_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 22 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE22_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 22 Read Address
                                                              Channel*/

