pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE23 @Bit 23 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Pos (23UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE23_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 23 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE23_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 23 Read Address
                                                              Channel*/

/* ENABLE24 @Bit 24 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Pos (24UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE24_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 24 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE24_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 24 Read Address
                                                              Channel*/

/* ENABLE25 @Bit 25 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Pos (25UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE25_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 25 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE25_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 25 Read Address
                                                              Channel*/

/* ENABLE26 @Bit 26 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Pos (26UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE26_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 26 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE26_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 26 Read Address
                                                              Channel*/

/* ENABLE27 @Bit 27 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Pos (27UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE27_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 27 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE27_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 27 Read Address
                                                              Channel*/

/* ENABLE28 @Bit 28 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Pos (28UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE28_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 28 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE28_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 28 Read Address
                                                              Channel*/

/* ENABLE29 @Bit 29 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Pos (29UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE29_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 29 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE29_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 29 Read Address
                                                              Channel*/

/* ENABLE30 @Bit 30 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Pos (30UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE30_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 30 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE30_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 30 Read Address
                                                              Channel*/

/* ENABLE31 @Bit 31 : Enable Real Time Choke for Read Address Channel */
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Pos (31UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Msk (0x1UL << MPC_RTCHOKE_READACCESS_ENABLE31_Pos)
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Min (0x0UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Max (0x1UL)
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Disable (0x0UL) /*!< Real Time Choke is disabled for master port 31 Read Address
                                                               Channel*/
  #define MPC_RTCHOKE_READACCESS_ENABLE31_Enable (0x1UL) /*!< Real Time Choke is enabled for master port 31 Read Address
                                                              Channel*/


/* MPC_RTCHOKE_DELAY: Real Time Choke delay value for slave number n */
  #define MPC_RTCHOKE_DELAY_MaxCount (32UL)
  #define MPC_RTCHOKE_DELAY_MaxIndex (31UL)
  #define MPC_RTCHOKE_DELAY_MinIndex (0UL)
  #define MPC_RTCHOKE_DELAY_ResetValue (0x00000000UL)

/* DELAY @Bits 0..7 : Real Time Choke delay in bus clock cycles. */
  #define MPC_RTCHOKE_DELAY_DELAY_Pos (0UL)
  #define MPC_RTCHOKE_DELAY_DELAY_Msk (0xFFUL << MPC_RTCHOKE_DELAY_DELAY_Pos)
  #define MPC_RTCHOKE_DELAY_DELAY_Min (0x00UL)
  #define MPC_RTCHOKE_DELAY_DELAY_Max (0xFFUL)



/* ==================================================== Struct MPC_REGION ==================================================== */
/**
  * @brief REGION [MPC_REGION] Memory region to slave decoding table
  */
typedef struct {
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  STARTADDR;
  __IOM uint32_t  ADDRMASK;                          /*!< (@ 0x00000008) Select which bits of the incoming address are compared
                                                                         against the STARTADDR*/
  __IOM uint32_t  MASTERPORT;
} NRF_MPC_REGION_Type;
