pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define MPC_REGION_MaxCount (32UL)
  #define MPC_REGION_MaxIndex (31UL)
  #define MPC_REGION_MinIndex (0UL)

/* MPC_REGION_CONFIG: Slave region n Configuration register */
  #define MPC_REGION_CONFIG_ResetValue (0x00000000UL)

/* SLAVENUMBER @Bits 0..4 : Target slave number for region n accesses. Slave number 0 is reserved for default slave */
  #define MPC_REGION_CONFIG_SLAVENUMBER_Pos (0UL)
  #define MPC_REGION_CONFIG_SLAVENUMBER_Msk (0x1FUL << MPC_REGION_CONFIG_SLAVENUMBER_Pos)
  #define MPC_REGION_CONFIG_SLAVENUMBER_Min (0x00UL)
  #define MPC_REGION_CONFIG_SLAVENUMBER_Max (0x1FUL)

/* LOCK @Bit 8 : Locks the region n setting */
  #define MPC_REGION_CONFIG_LOCK_Pos (8UL)
  #define MPC_REGION_CONFIG_LOCK_Msk (0x1UL << MPC_REGION_CONFIG_LOCK_Pos)
  #define MPC_REGION_CONFIG_LOCK_Min (0x0UL)
  #define MPC_REGION_CONFIG_LOCK_Max (0x1UL)
  #define MPC_REGION_CONFIG_LOCK_Unlocked (0x0UL)
  #define MPC_REGION_CONFIG_LOCK_Locked (0x1UL)

/* ENABLE @Bit 9 : Region n enable */
  #define MPC_REGION_CONFIG_ENABLE_Pos (9UL)
  #define MPC_REGION_CONFIG_ENABLE_Msk (0x1UL << MPC_REGION_CONFIG_ENABLE_Pos)
  #define MPC_REGION_CONFIG_ENABLE_Min (0x0UL)
  #define MPC_REGION_CONFIG_ENABLE_Max (0x1UL)
  #define MPC_REGION_CONFIG_ENABLE_Disabled (0x0UL)
  #define MPC_REGION_CONFIG_ENABLE_Enabled (0x1UL)

/* READ @Bit 12 : Read access */
  #define MPC_REGION_CONFIG_READ_Pos (12UL)
  #define MPC_REGION_CONFIG_READ_Msk (0x1UL << MPC_REGION_CONFIG_READ_Pos)
  #define MPC_REGION_CONFIG_READ_Min (0x0UL)
  #define MPC_REGION_CONFIG_READ_Max (0x1UL)
  #define MPC_REGION_CONFIG_READ_NotAllowed (0x0UL)
  #define MPC_REGION_CONFIG_READ_Allowed (0x1UL)

/* WRITE @Bit 13 : Write access */
  #define MPC_REGION_CONFIG_WRITE_Pos (13UL)
  #define MPC_REGION_CONFIG_WRITE_Msk (0x1UL << MPC_REGION_CONFIG_WRITE_Pos)
  #define MPC_REGION_CONFIG_WRITE_Min (0x0UL)
  #define MPC_REGION_CONFIG_WRITE_Max (0x1UL)
  #define MPC_REGION_CONFIG_WRITE_NotAllowed (0x0UL)
  #define MPC_REGION_CONFIG_WRITE_Allowed (0x1UL)

/* EXECUTE @Bit 14 : Software execute */
  #define MPC_REGION_CONFIG_EXECUTE_Pos (14UL)
  #define MPC_REGION_CONFIG_EXECUTE_Msk (0x1UL << MPC_REGION_CONFIG_EXECUTE_Pos)
  #define MPC_REGION_CONFIG_EXECUTE_Min (0x0UL)
  #define MPC_REGION_CONFIG_EXECUTE_Max (0x1UL)
  #define MPC_REGION_CONFIG_EXECUTE_NotAllowed (0x0UL)
  #define MPC_REGION_CONFIG_EXECUTE_Allowed (0x1UL)

/* SECATTR @Bit 15 : Memory security mapping */
  #define MPC_REGION_CONFIG_SECATTR_Pos (15UL)
  #define MPC_REGION_CONFIG_SECATTR_Msk (0x1UL << MPC_REGION_CONFIG_SECATTR_Pos)
  #define MPC_REGION_CONFIG_SECATTR_Min (0x0UL)
  #define MPC_REGION_CONFIG_SECATTR_Max (0x1UL)
  #define MPC_REGION_CONFIG_SECATTR_Secure (0x1UL)
  #define MPC_REGION_CONFIG_SECATTR_NonSecure (0x0UL)

/* OWNERID @Bits 16..19 : Region owner identifier. */
  #define MPC_REGION_CONFIG_OWNERID_Pos (16UL)
  #define MPC_REGION_CONFIG_OWNERID_Msk (0xFUL << MPC_REGION_CONFIG_OWNERID_Pos)


/* MPC_REGION_STARTADDR: Region n start address */
  #define MPC_REGION_STARTADDR_ResetValue (0x00000000UL)

/* STARTADDR @Bits 0..31 : Start address for memory region n */
  #define MPC_REGION_STARTADDR_STARTADDR_Pos (0UL)
  #define MPC_REGION_STARTADDR_STARTADDR_Msk (0xFFFFFFFFUL << MPC_REGION_STARTADDR_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* MPC_REGION_ADDRMASK: Select which bits of the incoming address are compared against the STARTADDR */
  #define MPC_REGION_ADDRMASK_ResetValue (0x00000000UL)

/* ADDRMASK @Bits 0..31 : Address mask for memory region n */
  #define MPC_REGION_ADDRMASK_ADDRMASK_Pos (0UL)
  #define MPC_REGION_ADDRMASK_ADDRMASK_Msk (0xFFFFFFFFUL << MPC_REGION_ADDRMASK_ADDRMASK_Pos)


/* MPC_REGION_MASTERPORT: Region n local master enable */
  #define MPC_REGION_MASTERPORT_ResetValue (0x00000000UL)

/* ENABLE0 @Bit 0 : Enable region n for master port 0 */
  #define MPC_REGION_MASTERPORT_ENABLE0_Pos (0UL)
  #define MPC_REGION_MASTERPORT_ENABLE0_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE0_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE0_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE0_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE0_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE0_Enable (0x1UL)

/* ENABLE1 @Bit 1 : Enable region n for master port 1 */
  #define MPC_REGION_MASTERPORT_ENABLE1_Pos (1UL)
  #define MPC_REGION_MASTERPORT_ENABLE1_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE1_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE1_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE1_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE1_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE1_Enable (0x1UL)

/* ENABLE2 @Bit 2 : Enable region n for master port 2 */
  #define MPC_REGION_MASTERPORT_ENABLE2_Pos (2UL)
  #define MPC_REGION_MASTERPORT_ENABLE2_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE2_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE2_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE2_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE2_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE2_Enable (0x1UL)

/* ENABLE3 @Bit 3 : Enable region n for master port 3 */
  #define MPC_REGION_MASTERPORT_ENABLE3_Pos (3UL)
  #define MPC_REGION_MASTERPORT_ENABLE3_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE3_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE3_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE3_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE3_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE3_Enable (0x1UL)

/* ENABLE4 @Bit 4 : Enable region n for master port 4 */
  #define MPC_REGION_MASTERPORT_ENABLE4_Pos (4UL)
  #define MPC_REGION_MASTERPORT_ENABLE4_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE4_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE4_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE4_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE4_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE4_Enable (0x1UL)

/* ENABLE5 @Bit 5 : Enable region n for master port 5 */
  #define MPC_REGION_MASTERPORT_ENABLE5_Pos (5UL)
  #define MPC_REGION_MASTERPORT_ENABLE5_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE5_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE5_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE5_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE5_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE5_Enable (0x1UL)

/* ENABLE6 @Bit 6 : Enable region n for master port 6 */
  #define MPC_REGION_MASTERPORT_ENABLE6_Pos (6UL)
  #define MPC_REGION_MASTERPORT_ENABLE6_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE6_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE6_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE6_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE6_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE6_Enable (0x1UL)

/* ENABLE7 @Bit 7 : Enable region n for master port 7 */
  #define MPC_REGION_MASTERPORT_ENABLE7_Pos (7UL)
  #define MPC_REGION_MASTERPORT_ENABLE7_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE7_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE7_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE7_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE7_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE7_Enable (0x1UL)

/* ENABLE8 @Bit 8 : Enable region n for master port 8 */
  #define MPC_REGION_MASTERPORT_ENABLE8_Pos (8UL)
  #define MPC_REGION_MASTERPORT_ENABLE8_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE8_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE8_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE8_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE8_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE8_Enable (0x1UL)

