pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE9 @Bit 9 : Enable region n for master port 9 */
  #define MPC_REGION_MASTERPORT_ENABLE9_Pos (9UL)
  #define MPC_REGION_MASTERPORT_ENABLE9_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE9_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE9_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE9_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE9_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE9_Enable (0x1UL)

/* ENABLE10 @Bit 10 : Enable region n for master port 10 */
  #define MPC_REGION_MASTERPORT_ENABLE10_Pos (10UL)
  #define MPC_REGION_MASTERPORT_ENABLE10_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE10_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE10_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE10_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE10_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE10_Enable (0x1UL)

/* ENABLE11 @Bit 11 : Enable region n for master port 11 */
  #define MPC_REGION_MASTERPORT_ENABLE11_Pos (11UL)
  #define MPC_REGION_MASTERPORT_ENABLE11_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE11_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE11_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE11_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE11_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE11_Enable (0x1UL)

/* ENABLE12 @Bit 12 : Enable region n for master port 12 */
  #define MPC_REGION_MASTERPORT_ENABLE12_Pos (12UL)
  #define MPC_REGION_MASTERPORT_ENABLE12_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE12_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE12_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE12_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE12_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE12_Enable (0x1UL)

/* ENABLE13 @Bit 13 : Enable region n for master port 13 */
  #define MPC_REGION_MASTERPORT_ENABLE13_Pos (13UL)
  #define MPC_REGION_MASTERPORT_ENABLE13_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE13_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE13_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE13_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE13_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE13_Enable (0x1UL)

/* ENABLE14 @Bit 14 : Enable region n for master port 14 */
  #define MPC_REGION_MASTERPORT_ENABLE14_Pos (14UL)
  #define MPC_REGION_MASTERPORT_ENABLE14_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE14_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE14_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE14_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE14_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE14_Enable (0x1UL)

/* ENABLE15 @Bit 15 : Enable region n for master port 15 */
  #define MPC_REGION_MASTERPORT_ENABLE15_Pos (15UL)
  #define MPC_REGION_MASTERPORT_ENABLE15_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE15_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE15_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE15_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE15_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE15_Enable (0x1UL)

/* ENABLE16 @Bit 16 : Enable region n for master port 16 */
  #define MPC_REGION_MASTERPORT_ENABLE16_Pos (16UL)
  #define MPC_REGION_MASTERPORT_ENABLE16_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE16_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE16_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE16_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE16_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE16_Enable (0x1UL)

/* ENABLE17 @Bit 17 : Enable region n for master port 17 */
  #define MPC_REGION_MASTERPORT_ENABLE17_Pos (17UL)
  #define MPC_REGION_MASTERPORT_ENABLE17_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE17_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE17_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE17_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE17_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE17_Enable (0x1UL)

/* ENABLE18 @Bit 18 : Enable region n for master port 18 */
  #define MPC_REGION_MASTERPORT_ENABLE18_Pos (18UL)
  #define MPC_REGION_MASTERPORT_ENABLE18_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE18_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE18_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE18_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE18_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE18_Enable (0x1UL)

/* ENABLE19 @Bit 19 : Enable region n for master port 19 */
  #define MPC_REGION_MASTERPORT_ENABLE19_Pos (19UL)
  #define MPC_REGION_MASTERPORT_ENABLE19_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE19_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE19_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE19_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE19_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE19_Enable (0x1UL)

/* ENABLE20 @Bit 20 : Enable region n for master port 20 */
  #define MPC_REGION_MASTERPORT_ENABLE20_Pos (20UL)
  #define MPC_REGION_MASTERPORT_ENABLE20_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE20_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE20_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE20_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE20_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE20_Enable (0x1UL)

/* ENABLE21 @Bit 21 : Enable region n for master port 21 */
  #define MPC_REGION_MASTERPORT_ENABLE21_Pos (21UL)
  #define MPC_REGION_MASTERPORT_ENABLE21_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE21_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE21_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE21_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE21_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE21_Enable (0x1UL)

/* ENABLE22 @Bit 22 : Enable region n for master port 22 */
  #define MPC_REGION_MASTERPORT_ENABLE22_Pos (22UL)
  #define MPC_REGION_MASTERPORT_ENABLE22_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE22_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE22_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE22_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE22_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE22_Enable (0x1UL)

/* ENABLE23 @Bit 23 : Enable region n for master port 23 */
  #define MPC_REGION_MASTERPORT_ENABLE23_Pos (23UL)
  #define MPC_REGION_MASTERPORT_ENABLE23_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE23_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE23_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE23_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE23_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE23_Enable (0x1UL)

