pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE24 @Bit 24 : Enable region n for master port 24 */
  #define MPC_REGION_MASTERPORT_ENABLE24_Pos (24UL)
  #define MPC_REGION_MASTERPORT_ENABLE24_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE24_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE24_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE24_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE24_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE24_Enable (0x1UL)

/* ENABLE25 @Bit 25 : Enable region n for master port 25 */
  #define MPC_REGION_MASTERPORT_ENABLE25_Pos (25UL)
  #define MPC_REGION_MASTERPORT_ENABLE25_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE25_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE25_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE25_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE25_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE25_Enable (0x1UL)

/* ENABLE26 @Bit 26 : Enable region n for master port 26 */
  #define MPC_REGION_MASTERPORT_ENABLE26_Pos (26UL)
  #define MPC_REGION_MASTERPORT_ENABLE26_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE26_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE26_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE26_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE26_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE26_Enable (0x1UL)

/* ENABLE27 @Bit 27 : Enable region n for master port 27 */
  #define MPC_REGION_MASTERPORT_ENABLE27_Pos (27UL)
  #define MPC_REGION_MASTERPORT_ENABLE27_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE27_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE27_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE27_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE27_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE27_Enable (0x1UL)

/* ENABLE28 @Bit 28 : Enable region n for master port 28 */
  #define MPC_REGION_MASTERPORT_ENABLE28_Pos (28UL)
  #define MPC_REGION_MASTERPORT_ENABLE28_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE28_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE28_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE28_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE28_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE28_Enable (0x1UL)

/* ENABLE29 @Bit 29 : Enable region n for master port 29 */
  #define MPC_REGION_MASTERPORT_ENABLE29_Pos (29UL)
  #define MPC_REGION_MASTERPORT_ENABLE29_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE29_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE29_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE29_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE29_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE29_Enable (0x1UL)

/* ENABLE30 @Bit 30 : Enable region n for master port 30 */
  #define MPC_REGION_MASTERPORT_ENABLE30_Pos (30UL)
  #define MPC_REGION_MASTERPORT_ENABLE30_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE30_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE30_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE30_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE30_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE30_Enable (0x1UL)

/* ENABLE31 @Bit 31 : Enable region n for master port 31 */
  #define MPC_REGION_MASTERPORT_ENABLE31_Pos (31UL)
  #define MPC_REGION_MASTERPORT_ENABLE31_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE31_Pos)
  #define MPC_REGION_MASTERPORT_ENABLE31_Min (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE31_Max (0x1UL)
  #define MPC_REGION_MASTERPORT_ENABLE31_Disable (0x0UL)
  #define MPC_REGION_MASTERPORT_ENABLE31_Enable (0x1UL)



/* =================================================== Struct MPC_OVERRIDE =================================================== */
/**
  * @brief OVERRIDE [MPC_OVERRIDE] Special privilege tables
  */
typedef struct {
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  STARTADDR;
  __IOM uint32_t  ENDADDR;
  __IOM int32_t   OFFSET;                            /*!< (@ 0x0000000C) Address offset value divided by 2 for override region n
                                                                         address re-map*/
  __IOM uint32_t  PERM;
  __IOM uint32_t  PERMMASK;                          /*!< (@ 0x00000014) Masks permission setting fields from register
                                                                         OVERRIDE.PERM*/
  __IOM uint32_t  OWNER;
  __IOM uint32_t  MASTERPORT;
} NRF_MPC_OVERRIDE_Type;
  #define MPC_OVERRIDE_MaxCount (40UL)
  #define MPC_OVERRIDE_MaxIndex (39UL)
  #define MPC_OVERRIDE_MinIndex (0UL)

/* MPC_OVERRIDE_CONFIG: Override region n Configuration register */
  #define MPC_OVERRIDE_CONFIG_ResetValue (0x00000000UL)

/* SLAVENUMBER @Bits 0..4 : Target slave number for override region n accesses. Slave number 0 is reserved for default slave */
  #define MPC_OVERRIDE_CONFIG_SLAVENUMBER_Pos (0UL)
  #define MPC_OVERRIDE_CONFIG_SLAVENUMBER_Msk (0x1FUL << MPC_OVERRIDE_CONFIG_SLAVENUMBER_Pos) /*!< Bit mask of SLAVENUMBER
                                                                            field.*/
  #define MPC_OVERRIDE_CONFIG_SLAVENUMBER_Min (0x00UL)
  #define MPC_OVERRIDE_CONFIG_SLAVENUMBER_Max (0x1FUL)

/* LOCK @Bit 8 : Lock Override region n */
  #define MPC_OVERRIDE_CONFIG_LOCK_Pos (8UL)
  #define MPC_OVERRIDE_CONFIG_LOCK_Msk (0x1UL << MPC_OVERRIDE_CONFIG_LOCK_Pos)
  #define MPC_OVERRIDE_CONFIG_LOCK_Min (0x0UL)
  #define MPC_OVERRIDE_CONFIG_LOCK_Max (0x1UL)
  #define MPC_OVERRIDE_CONFIG_LOCK_Unlocked (0x0UL)
  #define MPC_OVERRIDE_CONFIG_LOCK_Locked (0x1UL)

/* ENABLE @Bit 9 : Enable Override region n */
  #define MPC_OVERRIDE_CONFIG_ENABLE_Pos (9UL)
  #define MPC_OVERRIDE_CONFIG_ENABLE_Msk (0x1UL << MPC_OVERRIDE_CONFIG_ENABLE_Pos)
  #define MPC_OVERRIDE_CONFIG_ENABLE_Min (0x0UL)
  #define MPC_OVERRIDE_CONFIG_ENABLE_Max (0x1UL)
  #define MPC_OVERRIDE_CONFIG_ENABLE_Disabled (0x0UL)
  #define MPC_OVERRIDE_CONFIG_ENABLE_Enabled (0x1UL)

/* SECDOMENABLE @Bit 10 : Secure domain access enable for Override region n */
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Pos (10UL)
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Msk (0x1UL << MPC_OVERRIDE_CONFIG_SECDOMENABLE_Pos) /*!< Bit mask of SECDOMENABLE
                                                                            field.*/
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Min (0x0UL)
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Max (0x1UL)
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Disabled (0x0UL) /*!< Overriding of secure domain permissions is disabled for
                                                                 override region n*/
  #define MPC_OVERRIDE_CONFIG_SECDOMENABLE_Enabled (0x1UL) /*!< Overriding of secure domain permissions is enabled for override
                                                                region n*/

/* SECUREMASK @Bit 12 : Secure mask enable for Override region n */
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Pos (12UL)
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Msk (0x1UL << MPC_OVERRIDE_CONFIG_SECUREMASK_Pos)
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Min (0x0UL)
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Max (0x1UL)
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Disabled (0x0UL)
  #define MPC_OVERRIDE_CONFIG_SECUREMASK_Enabled (0x1UL)


