pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MPC_OVERRIDE_STARTADDR: Override region n Start Address */
  #define MPC_OVERRIDE_STARTADDR_ResetValue (0x00000000UL)

/* STARTADDR @Bits 0..31 : Start address for override region n */
  #define MPC_OVERRIDE_STARTADDR_STARTADDR_Pos (0UL)
  #define MPC_OVERRIDE_STARTADDR_STARTADDR_Msk (0xFFFFFFFFUL << MPC_OVERRIDE_STARTADDR_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* MPC_OVERRIDE_ENDADDR: Override region n End Address */
  #define MPC_OVERRIDE_ENDADDR_ResetValue (0x00000000UL)

/* ENDADDR @Bits 0..31 : End address for override region n */
  #define MPC_OVERRIDE_ENDADDR_ENDADDR_Pos (0UL)
  #define MPC_OVERRIDE_ENDADDR_ENDADDR_Msk (0xFFFFFFFFUL << MPC_OVERRIDE_ENDADDR_ENDADDR_Pos)


/* MPC_OVERRIDE_OFFSET: Address offset value divided by 2 for override region n address re-map */
  #define MPC_OVERRIDE_OFFSET_ResetValue (0x00000000UL)

/* OFFSET @Bits 0..31 : Offset value */
  #define MPC_OVERRIDE_OFFSET_OFFSET_Pos (0UL)
  #define MPC_OVERRIDE_OFFSET_OFFSET_Msk (0xFFFFFFFFUL << MPC_OVERRIDE_OFFSET_OFFSET_Pos)


/* MPC_OVERRIDE_PERM: Permission settings for override region n */
  #define MPC_OVERRIDE_PERM_ResetValue (0x00000000UL)

/* READ @Bit 0 : Read access */
  #define MPC_OVERRIDE_PERM_READ_Pos (0UL)
  #define MPC_OVERRIDE_PERM_READ_Msk (0x1UL << MPC_OVERRIDE_PERM_READ_Pos)
  #define MPC_OVERRIDE_PERM_READ_Min (0x0UL)
  #define MPC_OVERRIDE_PERM_READ_Max (0x1UL)
  #define MPC_OVERRIDE_PERM_READ_NotAllowed (0x0UL)
  #define MPC_OVERRIDE_PERM_READ_Allowed (0x1UL)

/* WRITE @Bit 1 : Write access */
  #define MPC_OVERRIDE_PERM_WRITE_Pos (1UL)
  #define MPC_OVERRIDE_PERM_WRITE_Msk (0x1UL << MPC_OVERRIDE_PERM_WRITE_Pos)
  #define MPC_OVERRIDE_PERM_WRITE_Min (0x0UL)
  #define MPC_OVERRIDE_PERM_WRITE_Max (0x1UL)
  #define MPC_OVERRIDE_PERM_WRITE_NotAllowed (0x0UL)
  #define MPC_OVERRIDE_PERM_WRITE_Allowed (0x1UL)

/* EXECUTE @Bit 2 : Software execute */
  #define MPC_OVERRIDE_PERM_EXECUTE_Pos (2UL)
  #define MPC_OVERRIDE_PERM_EXECUTE_Msk (0x1UL << MPC_OVERRIDE_PERM_EXECUTE_Pos)
  #define MPC_OVERRIDE_PERM_EXECUTE_Min (0x0UL)
  #define MPC_OVERRIDE_PERM_EXECUTE_Max (0x1UL)
  #define MPC_OVERRIDE_PERM_EXECUTE_NotAllowed (0x0UL)
  #define MPC_OVERRIDE_PERM_EXECUTE_Allowed (0x1UL)

/* SECATTR @Bit 3 : Security mapping */
  #define MPC_OVERRIDE_PERM_SECATTR_Pos (3UL)
  #define MPC_OVERRIDE_PERM_SECATTR_Msk (0x1UL << MPC_OVERRIDE_PERM_SECATTR_Pos)
  #define MPC_OVERRIDE_PERM_SECATTR_Min (0x0UL)
  #define MPC_OVERRIDE_PERM_SECATTR_Max (0x1UL)
  #define MPC_OVERRIDE_PERM_SECATTR_Secure (0x1UL)
  #define MPC_OVERRIDE_PERM_SECATTR_NonSecure (0x0UL)


/* MPC_OVERRIDE_PERMMASK: Masks permission setting fields from register OVERRIDE.PERM */
  #define MPC_OVERRIDE_PERMMASK_ResetValue (0x00000000UL)

/* READ @Bit 0 : Read mask */
  #define MPC_OVERRIDE_PERMMASK_READ_Pos (0UL)
  #define MPC_OVERRIDE_PERMMASK_READ_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_READ_Pos)
  #define MPC_OVERRIDE_PERMMASK_READ_Min (0x0UL)
  #define MPC_OVERRIDE_PERMMASK_READ_Max (0x1UL)
  #define MPC_OVERRIDE_PERMMASK_READ_Masked (0x0UL)
  #define MPC_OVERRIDE_PERMMASK_READ_UnMasked (0x1UL)

/* WRITE @Bit 1 : Write mask */
  #define MPC_OVERRIDE_PERMMASK_WRITE_Pos (1UL)
  #define MPC_OVERRIDE_PERMMASK_WRITE_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_WRITE_Pos)
  #define MPC_OVERRIDE_PERMMASK_WRITE_Min (0x0UL)
  #define MPC_OVERRIDE_PERMMASK_WRITE_Max (0x1UL)
  #define MPC_OVERRIDE_PERMMASK_WRITE_Masked (0x0UL)
  #define MPC_OVERRIDE_PERMMASK_WRITE_UnMasked (0x1UL)

/* EXECUTE @Bit 2 : Execute mask */
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Pos (2UL)
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_EXECUTE_Pos)
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Min (0x0UL)
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Max (0x1UL)
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_Masked (0x0UL)
  #define MPC_OVERRIDE_PERMMASK_EXECUTE_UnMasked (0x1UL)

/* SECATTR @Bit 3 : Security mapping mask */
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Pos (3UL)
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Msk (0x1UL << MPC_OVERRIDE_PERMMASK_SECATTR_Pos)
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Min (0x0UL)
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Max (0x1UL)
  #define MPC_OVERRIDE_PERMMASK_SECATTR_Masked (0x0UL)
  #define MPC_OVERRIDE_PERMMASK_SECATTR_UnMasked (0x1UL)


/* MPC_OVERRIDE_OWNER: Owner for override region */
  #define MPC_OVERRIDE_OWNER_ResetValue (0x00000000UL)

/* OWNERID @Bits 0..3 : owner identifier for override region n */
  #define MPC_OVERRIDE_OWNER_OWNERID_Pos (0UL)
  #define MPC_OVERRIDE_OWNER_OWNERID_Msk (0xFUL << MPC_OVERRIDE_OWNER_OWNERID_Pos)
  #define MPC_OVERRIDE_OWNER_OWNERID_Min (0x0UL)
  #define MPC_OVERRIDE_OWNER_OWNERID_Max (0xFUL)


/* MPC_OVERRIDE_MASTERPORT: Override region n local master enable */
  #define MPC_OVERRIDE_MASTERPORT_ResetValue (0x00000000UL)

/* ENABLE0 @Bit 0 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Pos (0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE0_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE0_Enable (0x1UL)

/* ENABLE1 @Bit 1 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Pos (1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE1_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE1_Enable (0x1UL)

/* ENABLE2 @Bit 2 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Pos (2UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE2_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE2_Enable (0x1UL)

/* ENABLE3 @Bit 3 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Pos (3UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE3_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE3_Enable (0x1UL)

