pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE4 @Bit 4 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Pos (4UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE4_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE4_Enable (0x1UL)

/* ENABLE5 @Bit 5 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Pos (5UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE5_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE5_Enable (0x1UL)

/* ENABLE6 @Bit 6 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Pos (6UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE6_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE6_Enable (0x1UL)

/* ENABLE7 @Bit 7 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Pos (7UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE7_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE7_Enable (0x1UL)

/* ENABLE8 @Bit 8 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Pos (8UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE8_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE8_Enable (0x1UL)

/* ENABLE9 @Bit 9 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Pos (9UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE9_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE9_Enable (0x1UL)

/* ENABLE10 @Bit 10 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Pos (10UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE10_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE10_Enable (0x1UL)

/* ENABLE11 @Bit 11 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Pos (11UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE11_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE11_Enable (0x1UL)

/* ENABLE12 @Bit 12 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Pos (12UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE12_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE12_Enable (0x1UL)

/* ENABLE13 @Bit 13 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Pos (13UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE13_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE13_Enable (0x1UL)

/* ENABLE14 @Bit 14 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Pos (14UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE14_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE14_Enable (0x1UL)

/* ENABLE15 @Bit 15 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Pos (15UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE15_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE15_Enable (0x1UL)

/* ENABLE16 @Bit 16 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Pos (16UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE16_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE16_Enable (0x1UL)

/* ENABLE17 @Bit 17 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Pos (17UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE17_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE17_Enable (0x1UL)

/* ENABLE18 @Bit 18 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Pos (18UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE18_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE18_Enable (0x1UL)

/* ENABLE19 @Bit 19 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Pos (19UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE19_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE19_Enable (0x1UL)

