pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE20 @Bit 20 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Pos (20UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE20_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE20_Enable (0x1UL)

/* ENABLE21 @Bit 21 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Pos (21UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE21_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE21_Enable (0x1UL)

/* ENABLE22 @Bit 22 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Pos (22UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE22_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE22_Enable (0x1UL)

/* ENABLE23 @Bit 23 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Pos (23UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE23_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE23_Enable (0x1UL)

/* ENABLE24 @Bit 24 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Pos (24UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE24_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE24_Enable (0x1UL)

/* ENABLE25 @Bit 25 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Pos (25UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE25_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE25_Enable (0x1UL)

/* ENABLE26 @Bit 26 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Pos (26UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE26_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE26_Enable (0x1UL)

/* ENABLE27 @Bit 27 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Pos (27UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE27_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE27_Enable (0x1UL)

/* ENABLE28 @Bit 28 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Pos (28UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE28_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE28_Enable (0x1UL)

/* ENABLE29 @Bit 29 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Pos (29UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE29_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE29_Enable (0x1UL)

/* ENABLE30 @Bit 30 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Pos (30UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE30_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE30_Enable (0x1UL)

/* ENABLE31 @Bit 31 : Enable override */
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Pos (31UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Msk (0x1UL << MPC_OVERRIDE_MASTERPORT_ENABLE31_Pos)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Min (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Max (0x1UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Disable (0x0UL)
  #define MPC_OVERRIDE_MASTERPORT_ENABLE31_Enable (0x1UL)


/* ======================================================= Struct MPC ======================================================== */
/**
  * @brief Memory Privilege Controller
  */
  typedef struct {
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_MEMACCERR;
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED2[61];
    __IOM NRF_MPC_MEMACCERR_Type MEMACCERR;
    __IM uint32_t RESERVED3[2];
    __IOM NRF_MPC_GLOBALSLAVE_Type GLOBALSLAVE;
    __IOM uint32_t EXTENDCLKREQ;
    __IM uint32_t RESERVED4;
    __IOM NRF_MPC_RTCHOKE_Type RTCHOKE;
    __IM uint32_t RESERVED5[64];
    __IOM NRF_MPC_REGION_Type REGION[32];
    __IOM NRF_MPC_OVERRIDE_Type OVERRIDE[40];
  } NRF_MPC_Type;

/* MPC_EVENTS_MEMACCERR: Memory Access Error event */
  #define MPC_EVENTS_MEMACCERR_ResetValue (0x00000000UL)

/* EVENTS_MEMACCERR @Bit 0 : Memory Access Error event */
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Pos (0UL)
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Msk (0x1UL << MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Pos) /*!< Bit mask of
                                                                            EVENTS_MEMACCERR field.*/
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Min (0x0UL)
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Max (0x1UL)
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_NotGenerated (0x0UL)
  #define MPC_EVENTS_MEMACCERR_EVENTS_MEMACCERR_Generated (0x1UL)


/* MPC_INTEN: Enable or disable interrupt */
  #define MPC_INTEN_ResetValue (0x00000000UL)

/* MEMACCERR @Bit 0 : Enable or disable interrupt for event MEMACCERR */
  #define MPC_INTEN_MEMACCERR_Pos (0UL)
  #define MPC_INTEN_MEMACCERR_Msk (0x1UL << MPC_INTEN_MEMACCERR_Pos)
  #define MPC_INTEN_MEMACCERR_Min (0x0UL)
  #define MPC_INTEN_MEMACCERR_Max (0x1UL)
  #define MPC_INTEN_MEMACCERR_Disabled (0x0UL)
  #define MPC_INTEN_MEMACCERR_Enabled (0x1UL)


/* MPC_INTENSET: Enable interrupt */
  #define MPC_INTENSET_ResetValue (0x00000000UL)

/* MEMACCERR @Bit 0 : Write '1' to enable interrupt for event MEMACCERR */
  #define MPC_INTENSET_MEMACCERR_Pos (0UL)
  #define MPC_INTENSET_MEMACCERR_Msk (0x1UL << MPC_INTENSET_MEMACCERR_Pos)
  #define MPC_INTENSET_MEMACCERR_Min (0x0UL)
  #define MPC_INTENSET_MEMACCERR_Max (0x1UL)
  #define MPC_INTENSET_MEMACCERR_Set (0x1UL)
  #define MPC_INTENSET_MEMACCERR_Disabled (0x0UL)
  #define MPC_INTENSET_MEMACCERR_Enabled (0x1UL)


/* MPC_INTENCLR: Disable interrupt */
  #define MPC_INTENCLR_ResetValue (0x00000000UL)

/* MEMACCERR @Bit 0 : Write '1' to disable interrupt for event MEMACCERR */
  #define MPC_INTENCLR_MEMACCERR_Pos (0UL)
  #define MPC_INTENCLR_MEMACCERR_Msk (0x1UL << MPC_INTENCLR_MEMACCERR_Pos)
  #define MPC_INTENCLR_MEMACCERR_Min (0x0UL)
  #define MPC_INTENCLR_MEMACCERR_Max (0x1UL)
  #define MPC_INTENCLR_MEMACCERR_Clear (0x1UL)
  #define MPC_INTENCLR_MEMACCERR_Disabled (0x0UL)
  #define MPC_INTENCLR_MEMACCERR_Enabled (0x1UL)


/* MPC_EXTENDCLKREQ: Extend clock request configuration */
  #define MPC_EXTENDCLKREQ_ResetValue (0x00000003UL)

