pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INIT @Bits 0..15 : Initial value of the down counter used for extending the clock request. */
  #define MPC_EXTENDCLKREQ_INIT_Pos (0UL)
  #define MPC_EXTENDCLKREQ_INIT_Msk (0xFFFFUL << MPC_EXTENDCLKREQ_INIT_Pos)

/* ENABLE @Bit 31 : Enable the extend clock request feature */
  #define MPC_EXTENDCLKREQ_ENABLE_Pos (31UL)
  #define MPC_EXTENDCLKREQ_ENABLE_Msk (0x1UL << MPC_EXTENDCLKREQ_ENABLE_Pos)
  #define MPC_EXTENDCLKREQ_ENABLE_Min (0x0UL)
  #define MPC_EXTENDCLKREQ_ENABLE_Max (0x1UL)
  #define MPC_EXTENDCLKREQ_ENABLE_Disable (0x0UL)
  #define MPC_EXTENDCLKREQ_ENABLE_Enable (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MUTEX                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct MUTEX ======================================================= */
/**
  * @brief MUTEX
  */
  typedef struct {
    __IM uint32_t RESERVED[256];
    __IOM uint32_t MUTEX[32];
  } NRF_MUTEX_Type;

/* MUTEX_MUTEX: Mutex register */
  #define MUTEX_MUTEX_MaxCount (32UL)
  #define MUTEX_MUTEX_MaxIndex (31UL)
  #define MUTEX_MUTEX_MinIndex (0UL)
  #define MUTEX_MUTEX_ResetValue (0x00000000UL)

/* MUTEX @Bit 0 : Mutex register n */
  #define MUTEX_MUTEX_MUTEX_Pos (0UL)
  #define MUTEX_MUTEX_MUTEX_Msk (0x1UL << MUTEX_MUTEX_MUTEX_Pos)
  #define MUTEX_MUTEX_MUTEX_Min (0x0UL)
  #define MUTEX_MUTEX_MUTEX_Max (0x1UL)
  #define MUTEX_MUTEX_MUTEX_Unlocked (0x0UL)
  #define MUTEX_MUTEX_MUTEX_Locked (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           MVDMA                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct MVDMA_EVENTS_SOURCE ================================================ */
/**
  * @brief EVENTS_SOURCE [MVDMA_EVENTS_SOURCE] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) Event indicating that a bus error has been received on
                                                                         the Source channel.*/
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000004) Event indicating that a job on the Source channel with
                                                                         EVENT_ENABLE active has been processed.*/
} NRF_MVDMA_EVENTS_SOURCE_Type;

/* MVDMA_EVENTS_SOURCE_BUSERROR: Event indicating that a bus error has been received on the Source channel. */
  #define MVDMA_EVENTS_SOURCE_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bit 0 : Event indicating that a bus error has been received on the Source channel. */
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Pos (0UL)
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Msk (0x1UL << MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Pos) /*!< Bit mask of
                                                                            BUSERROR field.*/
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Min (0x0UL)
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Max (0x1UL)
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_SOURCE_BUSERROR_BUSERROR_Generated (0x1UL)


/* MVDMA_EVENTS_SOURCE_SELECTJOBDONE: Event indicating that a job on the Source channel with EVENT_ENABLE active has been
                                       processed. */

  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_ResetValue (0x00000000UL)

/* SELECTJOBDONE @Bit 0 : Event indicating that a job on the Source channel with EVENT_ENABLE active has been processed. */
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Pos (0UL)
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Msk (0x1UL << MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Pos)
                                                                            /*!< Bit mask of SELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Min (0x0UL)
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Max (0x1UL)
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_SOURCE_SELECTJOBDONE_SELECTJOBDONE_Generated (0x1UL)



/* ================================================ Struct MVDMA_EVENTS_SINK ================================================= */
/**
  * @brief EVENTS_SINK [MVDMA_EVENTS_SINK] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000000) Event indicating that a bus error has been received on
                                                                         the Sink channel.*/
  __IOM uint32_t  SELECTJOBDONE;                     /*!< (@ 0x00000004) Event indicating that a job on the Sink channel with
                                                                         EVENT_ENABLE active has been processed.*/
} NRF_MVDMA_EVENTS_SINK_Type;

/* MVDMA_EVENTS_SINK_BUSERROR: Event indicating that a bus error has been received on the Sink channel. */
  #define MVDMA_EVENTS_SINK_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bit 0 : Event indicating that a bus error has been received on the Sink channel. */
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Pos (0UL)
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Msk (0x1UL << MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Min (0x0UL)
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Max (0x1UL)
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_SINK_BUSERROR_BUSERROR_Generated (0x1UL)


