pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MVDMA_EVENTS_SINK_SELECTJOBDONE: Event indicating that a job on the Sink channel with EVENT_ENABLE active has been processed.
                                     */

  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_ResetValue (0x00000000UL)

/* SELECTJOBDONE @Bit 0 : Event indicating that a job on the Sink channel with EVENT_ENABLE active has been processed. */
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Pos (0UL)
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Msk (0x1UL << MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Pos) /*!<
                                                                            Bit mask of SELECTJOBDONE field.*/
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Min (0x0UL)
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Max (0x1UL)
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_SINK_SELECTJOBDONE_SELECTJOBDONE_Generated (0x1UL)



/* =============================================== Struct MVDMA_PUBLISH_SOURCE =============================================== */
/**
  * @brief PUBLISH_SOURCE [MVDMA_PUBLISH_SOURCE] Publish configuration for events
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SELECTJOBDONE;
} NRF_MVDMA_PUBLISH_SOURCE_Type;

/* MVDMA_PUBLISH_SOURCE_SELECTJOBDONE: Publish configuration for event SOURCE.SELECTJOBDONE */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event SOURCE.SELECTJOBDONE will publish to */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Pos (0UL)
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Min (0x00UL)
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Pos (31UL)
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Msk (0x1UL << MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Pos) /*!< Bit mask of EN
                                                                            field.*/
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Min (0x0UL)
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Max (0x1UL)
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Disabled (0x0UL)
  #define MVDMA_PUBLISH_SOURCE_SELECTJOBDONE_EN_Enabled (0x1UL)



/* ================================================ Struct MVDMA_PUBLISH_SINK ================================================ */
/**
  * @brief PUBLISH_SINK [MVDMA_PUBLISH_SINK] Publish configuration for events
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  SELECTJOBDONE;
} NRF_MVDMA_PUBLISH_SINK_Type;

/* MVDMA_PUBLISH_SINK_SELECTJOBDONE: Publish configuration for event SINK.SELECTJOBDONE */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event SINK.SELECTJOBDONE will publish to */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Pos (0UL)
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Pos) /*!< Bit mask of
                                                                            CHIDX field.*/
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Min (0x00UL)
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Pos (31UL)
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Msk (0x1UL << MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Pos)
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Min (0x0UL)
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Max (0x1UL)
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Disabled (0x0UL)
  #define MVDMA_PUBLISH_SINK_SELECTJOBDONE_EN_Enabled (0x1UL)



/* =================================================== Struct MVDMA_STATUS =================================================== */
/**
  * @brief STATUS [MVDMA_STATUS] MVDMA status registers.
  */
typedef struct {
  __IM  uint32_t  CRCRESULT;
  __IM  uint32_t  FIFO;                              /*!< (@ 0x00000004) Status of intermediate fifo: empty, not empty and full
                                                                         information available.*/
  __IM  uint32_t  ACTIVE;
} NRF_MVDMA_STATUS_Type;

/* MVDMA_STATUS_CRCRESULT: CRC checksum calculation result */
  #define MVDMA_STATUS_CRCRESULT_ResetValue (0x00000000UL)

/* CRC @Bits 0..31 : Result */
  #define MVDMA_STATUS_CRCRESULT_CRC_Pos (0UL)
  #define MVDMA_STATUS_CRCRESULT_CRC_Msk (0xFFFFFFFFUL << MVDMA_STATUS_CRCRESULT_CRC_Pos)


/* MVDMA_STATUS_FIFO: Status of intermediate fifo: empty, not empty and full information available. */
  #define MVDMA_STATUS_FIFO_ResetValue (0x00000000UL)

/* FIFOSTATUS @Bits 0..1 : Result */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Pos (0UL)
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Msk (0x3UL << MVDMA_STATUS_FIFO_FIFOSTATUS_Pos)
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Min (0x0UL)
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Max (0x2UL)
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Empty (0x0UL)
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_NotEmpty (0x1UL)
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Full (0x2UL)


/* MVDMA_STATUS_ACTIVE: Status of DMA transfer. */
  #define MVDMA_STATUS_ACTIVE_ResetValue (0x00000000UL)

/* ACTIVE @Bit 0 : DMA activity */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Pos (0UL)
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Msk (0x1UL << MVDMA_STATUS_ACTIVE_ACTIVE_Pos)
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Min (0x0UL)
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Max (0x1UL)
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Idle (0x0UL)
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Active (0x1UL)



/* =================================================== Struct MVDMA_CONFIG =================================================== */
/**
  * @brief CONFIG [MVDMA_CONFIG] MVDMA configuration registers.
  */
typedef struct {
  __IOM uint32_t  MODE;
  __IM  uint32_t  RESERVED;
} NRF_MVDMA_CONFIG_Type;

/* MVDMA_CONFIG_MODE: Configure MVDMA mode of operation. */
  #define MVDMA_CONFIG_MODE_ResetValue (0x00000000UL)

/* MODE @Bit 0 : (unspecified) */
  #define MVDMA_CONFIG_MODE_MODE_Pos (0UL)
  #define MVDMA_CONFIG_MODE_MODE_Msk (0x1UL << MVDMA_CONFIG_MODE_MODE_Pos)
  #define MVDMA_CONFIG_MODE_MODE_Min (0x0UL)
  #define MVDMA_CONFIG_MODE_MODE_Max (0x1UL)
  #define MVDMA_CONFIG_MODE_MODE_SingleMode (0x0UL)  /*!< Registers SOURCE.LISTPTR and SINK.LISTPTR contain start address of a
                                                          single job list.*/
  #define MVDMA_CONFIG_MODE_MODE_MultiMode (0x1UL)   /*!< Registers SOURCE.LISTPTR and SINK.LISTPTR contain start address of a
                                                          list of job list pointers in memory.*/



/* =================================================== Struct MVDMA_SOURCE =================================================== */
/**
  * @brief SOURCE [MVDMA_SOURCE] Source channel configuration and status.
  */
typedef struct {
  __IOM uint32_t  LISTPTR;                           /*!< (@ 0x00000000) Start address of Source job list or list of job list
                                                                         pointers, depending on value of CONFIG.MODE.*/
  __IM  uint32_t  BUSERROR;
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000008) Latest address being accessed on the Source channel.If
                                                                         a bus error occurs, these registers will contain the
                                                                         address that cause the error.*/
  __IM  uint32_t  JOBCOUNT;                          /*!< (@ 0x0000000C) Number of completed jobs in the current Source
                                                                         descriptor list. This resets to 0 when a new joblist is
                                                                         started.*/
} NRF_MVDMA_SOURCE_Type;

/* MVDMA_SOURCE_LISTPTR: Start address of Source job list or list of job list pointers, depending on value of CONFIG.MODE. */
  #define MVDMA_SOURCE_LISTPTR_ResetValue (0x00000000UL)

