pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ADDRESS @Bits 0..31 : Source job descriptor list address. */
  #define MVDMA_SOURCE_LISTPTR_ADDRESS_Pos (0UL)
  #define MVDMA_SOURCE_LISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SOURCE_LISTPTR_ADDRESS_Pos)


/* MVDMA_SOURCE_BUSERROR: Source bus error status. */
  #define MVDMA_SOURCE_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bits 0..1 : Bus error type */
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Pos (0UL)
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Msk (0x3UL << MVDMA_SOURCE_BUSERROR_BUSERROR_Pos)
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Min (0x0UL)
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_Max (0x2UL)
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_NoError (0x0UL)
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_ReadError (0x1UL) /*!< Error related to memory when reading joblist, or error related
                                                                to memory/register when reading data.*/
  #define MVDMA_SOURCE_BUSERROR_BUSERROR_ReadDecodeError (0x2UL) /*!< Error related to the joblist address when reading joblist,
                                                                      or error related to address when reading memory/register.*/


/* MVDMA_SOURCE_ADDRESS: Latest address being accessed on the Source channel.If a bus error occurs, these registers will contain
                          the address that cause the error. */

  #define MVDMA_SOURCE_ADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : Source address */
  #define MVDMA_SOURCE_ADDRESS_ADDRESS_Pos (0UL)
  #define MVDMA_SOURCE_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SOURCE_ADDRESS_ADDRESS_Pos)


/* MVDMA_SOURCE_JOBCOUNT: Number of completed jobs in the current Source descriptor list. This resets to 0 when a new joblist is
                           started. */

  #define MVDMA_SOURCE_JOBCOUNT_ResetValue (0x00000000UL)

/* COUNT @Bits 0..31 : Source job count */
  #define MVDMA_SOURCE_JOBCOUNT_COUNT_Pos (0UL)
  #define MVDMA_SOURCE_JOBCOUNT_COUNT_Msk (0xFFFFFFFFUL << MVDMA_SOURCE_JOBCOUNT_COUNT_Pos)



/* ==================================================== Struct MVDMA_SINK ==================================================== */
/**
  * @brief SINK [MVDMA_SINK] Sink channel configuration and status.
  */
typedef struct {
  __IOM uint32_t  LISTPTR;                           /*!< (@ 0x00000000) Start address of Sink job list or list of job list
                                                                         pointers, depending on value of CONFIG.MODE.*/
  __IM  uint32_t  BUSERROR;
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000008) Latest address being accessed on the Sink channel. If a
                                                                         bus error occurs, these registers will contain the
                                                                         address that cause the error.*/
  __IM  uint32_t  JOBCOUNT;                          /*!< (@ 0x0000000C) Number of completed jobs in the current Sink descriptor
                                                                         list. This resets to 0 when a new joblist is started.*/
} NRF_MVDMA_SINK_Type;

/* MVDMA_SINK_LISTPTR: Start address of Sink job list or list of job list pointers, depending on value of CONFIG.MODE. */
  #define MVDMA_SINK_LISTPTR_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : Sink descriptor list address. */
  #define MVDMA_SINK_LISTPTR_ADDRESS_Pos (0UL)
  #define MVDMA_SINK_LISTPTR_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SINK_LISTPTR_ADDRESS_Pos)


/* MVDMA_SINK_BUSERROR: Sink bus error status. */
  #define MVDMA_SINK_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bits 0..2 : Bus error type */
  #define MVDMA_SINK_BUSERROR_BUSERROR_Pos (0UL)
  #define MVDMA_SINK_BUSERROR_BUSERROR_Msk (0x7UL << MVDMA_SINK_BUSERROR_BUSERROR_Pos)
  #define MVDMA_SINK_BUSERROR_BUSERROR_Min (0x0UL)
  #define MVDMA_SINK_BUSERROR_BUSERROR_Max (0x4UL)
  #define MVDMA_SINK_BUSERROR_BUSERROR_NoError (0x0UL)
  #define MVDMA_SINK_BUSERROR_BUSERROR_ReadError (0x1UL)
  #define MVDMA_SINK_BUSERROR_BUSERROR_ReadDecodeError (0x2UL)
  #define MVDMA_SINK_BUSERROR_BUSERROR_WriteError (0x3UL)
  #define MVDMA_SINK_BUSERROR_BUSERROR_WriteDecodeError (0x4UL) /*!< Error related to the memory/register address when writing
                                                                     data.*/


/* MVDMA_SINK_ADDRESS: Latest address being accessed on the Sink channel. If a bus error occurs, these registers will contain
                        the address that cause the error. */

  #define MVDMA_SINK_ADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : Sink address */
  #define MVDMA_SINK_ADDRESS_ADDRESS_Pos (0UL)
  #define MVDMA_SINK_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << MVDMA_SINK_ADDRESS_ADDRESS_Pos)


/* MVDMA_SINK_JOBCOUNT: Number of completed jobs in the current Sink descriptor list. This resets to 0 when a new joblist is
                         started. */

  #define MVDMA_SINK_JOBCOUNT_ResetValue (0x00000000UL)

/* COUNT @Bits 0..31 : Sink job count */
  #define MVDMA_SINK_JOBCOUNT_COUNT_Pos (0UL)
  #define MVDMA_SINK_JOBCOUNT_COUNT_Msk (0xFFFFFFFFUL << MVDMA_SINK_JOBCOUNT_COUNT_Pos)


/* ====================================================== Struct MVDMA ======================================================= */
/**
  * @brief MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each
            transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and
            they contain data buffer information, address pointers, buffer sizes and data type attributes.

  */
  typedef struct {
    __OM uint32_t TASKS_PAUSE;
    __OM uint32_t TASKS_RESET;
    __OM uint32_t TASKS_START[8];                    /*!< (@ 0x00000008) Start operation of job list n. Base address for
                                                                         successive TASKS_STARTs.*/
    __IM uint32_t RESERVED[24];
    __IOM uint32_t SUBSCRIBE_START[8];
    __IM uint32_t RESERVED1[22];
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000100) Event indicating that Sink data descriptor list has
                                                                         been completed.*/
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000104) Event indicating that the source list processing has
                                                                         started.*/
    __IOM uint32_t EVENTS_PAUSED;                    /*!< (@ 0x00000108) Event indicating that the data transfer has been
                                                                         paused.*/
    __IOM uint32_t EVENTS_RESET;
    __IOM NRF_MVDMA_EVENTS_SOURCE_Type EVENTS_SOURCE;
    __IOM NRF_MVDMA_EVENTS_SINK_Type EVENTS_SINK;
    __IOM uint32_t EVENTS_COMPLETED[8];              /*!< (@ 0x00000120) Event indicating that the operation started by the task
                                                                         START[n] has been completed. Base address for
                                                                         successive EVENTS_COMPLETED.*/
    __IM uint32_t RESERVED2[16];
    __IOM uint32_t PUBLISH_END;
    __IM uint32_t RESERVED3[3];
    __IOM NRF_MVDMA_PUBLISH_SOURCE_Type PUBLISH_SOURCE;
    __IOM NRF_MVDMA_PUBLISH_SINK_Type PUBLISH_SINK;
    __IOM uint32_t PUBLISH_COMPLETED[8];
    __IM uint32_t RESERVED4[80];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED5[60];
    __IOM NRF_MVDMA_STATUS_Type STATUS;
    __IM uint32_t RESERVED6[61];
    __IOM NRF_MVDMA_CONFIG_Type CONFIG;
    __IM uint32_t RESERVED7[62];
    __IOM NRF_MVDMA_SOURCE_Type SOURCE;
    __IM uint32_t RESERVED8[4];
    __IOM NRF_MVDMA_SINK_Type SINK;
  } NRF_MVDMA_Type;

/* MVDMA_TASKS_PAUSE: Pause operation. */
  #define MVDMA_TASKS_PAUSE_ResetValue (0x00000000UL)

/* TASKS_PAUSE @Bit 0 : Pause operation. */
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Pos (0UL)
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Msk (0x1UL << MVDMA_TASKS_PAUSE_TASKS_PAUSE_Pos)
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Min (0x1UL)
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Max (0x1UL)
  #define MVDMA_TASKS_PAUSE_TASKS_PAUSE_Trigger (0x1UL)


/* MVDMA_TASKS_RESET: Reset operation. */
  #define MVDMA_TASKS_RESET_ResetValue (0x00000000UL)

