pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS_RESET @Bit 0 : Reset operation. */
  #define MVDMA_TASKS_RESET_TASKS_RESET_Pos (0UL)
  #define MVDMA_TASKS_RESET_TASKS_RESET_Msk (0x1UL << MVDMA_TASKS_RESET_TASKS_RESET_Pos)
  #define MVDMA_TASKS_RESET_TASKS_RESET_Min (0x1UL)
  #define MVDMA_TASKS_RESET_TASKS_RESET_Max (0x1UL)
  #define MVDMA_TASKS_RESET_TASKS_RESET_Trigger (0x1UL)


/* MVDMA_TASKS_START: Start operation of job list n. Base address for successive TASKS_STARTs. */
  #define MVDMA_TASKS_START_MaxCount (8UL)
  #define MVDMA_TASKS_START_MaxIndex (7UL)
  #define MVDMA_TASKS_START_MinIndex (0UL)
  #define MVDMA_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start operation of job list n. Base address for successive TASKS_STARTs. */
  #define MVDMA_TASKS_START_TASKS_START_Pos (0UL)
  #define MVDMA_TASKS_START_TASKS_START_Msk (0x1UL << MVDMA_TASKS_START_TASKS_START_Pos)
  #define MVDMA_TASKS_START_TASKS_START_Min (0x1UL)
  #define MVDMA_TASKS_START_TASKS_START_Max (0x1UL)
  #define MVDMA_TASKS_START_TASKS_START_Trigger (0x1UL)


/* MVDMA_SUBSCRIBE_START: Subscribe configuration for task START[n] */
  #define MVDMA_SUBSCRIBE_START_MaxCount (8UL)
  #define MVDMA_SUBSCRIBE_START_MaxIndex (7UL)
  #define MVDMA_SUBSCRIBE_START_MinIndex (0UL)
  #define MVDMA_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START[n] will subscribe to */
  #define MVDMA_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define MVDMA_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << MVDMA_SUBSCRIBE_START_CHIDX_Pos)
  #define MVDMA_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define MVDMA_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_SUBSCRIBE_START_EN_Pos (31UL)
  #define MVDMA_SUBSCRIBE_START_EN_Msk (0x1UL << MVDMA_SUBSCRIBE_START_EN_Pos)
  #define MVDMA_SUBSCRIBE_START_EN_Min (0x0UL)
  #define MVDMA_SUBSCRIBE_START_EN_Max (0x1UL)
  #define MVDMA_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define MVDMA_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* MVDMA_EVENTS_END: Event indicating that Sink data descriptor list has been completed. */
  #define MVDMA_EVENTS_END_ResetValue (0x00000000UL)

/* EVENTS_END @Bit 0 : Event indicating that Sink data descriptor list has been completed. */
  #define MVDMA_EVENTS_END_EVENTS_END_Pos (0UL)
  #define MVDMA_EVENTS_END_EVENTS_END_Msk (0x1UL << MVDMA_EVENTS_END_EVENTS_END_Pos)
  #define MVDMA_EVENTS_END_EVENTS_END_Min (0x0UL)
  #define MVDMA_EVENTS_END_EVENTS_END_Max (0x1UL)
  #define MVDMA_EVENTS_END_EVENTS_END_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_END_EVENTS_END_Generated (0x1UL)


/* MVDMA_EVENTS_STARTED: Event indicating that the source list processing has started. */
  #define MVDMA_EVENTS_STARTED_ResetValue (0x00000000UL)

/* EVENTS_STARTED @Bit 0 : Event indicating that the source list processing has started. */
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL)
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << MVDMA_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL)
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL)
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL)


/* MVDMA_EVENTS_PAUSED: Event indicating that the data transfer has been paused. */
  #define MVDMA_EVENTS_PAUSED_ResetValue (0x00000000UL)

/* EVENTS_PAUSED @Bit 0 : Event indicating that the data transfer has been paused. */
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Pos (0UL)
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Msk (0x1UL << MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Pos) /*!< Bit mask of EVENTS_PAUSED
                                                                            field.*/
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Min (0x0UL)
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Max (0x1UL)
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_PAUSED_EVENTS_PAUSED_Generated (0x1UL)


/* MVDMA_EVENTS_RESET: Event indicating that the peripheral has been reset. */
  #define MVDMA_EVENTS_RESET_ResetValue (0x00000000UL)

/* EVENTS_RESET @Bit 0 : Event indicating that the peripheral has been reset. */
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Pos (0UL)
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Msk (0x1UL << MVDMA_EVENTS_RESET_EVENTS_RESET_Pos) /*!< Bit mask of EVENTS_RESET
                                                                            field.*/
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Min (0x0UL)
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Max (0x1UL)
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_RESET_EVENTS_RESET_Generated (0x1UL)


/* MVDMA_EVENTS_COMPLETED: Event indicating that the operation started by the task START[n] has been completed. Base address for
                            successive EVENTS_COMPLETED. */

  #define MVDMA_EVENTS_COMPLETED_MaxCount (8UL)
  #define MVDMA_EVENTS_COMPLETED_MaxIndex (7UL)
  #define MVDMA_EVENTS_COMPLETED_MinIndex (0UL)
  #define MVDMA_EVENTS_COMPLETED_ResetValue (0x00000000UL)

/* EVENTS_COMPLETED @Bit 0 : Event indicating that the operation started by the task START[n] has been completed. Base address
                             for successive EVENTS_COMPLETED. */

  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Pos (0UL)
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Msk (0x1UL << MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Pos) /*!< Bit mask of
                                                                            EVENTS_COMPLETED field.*/
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Min (0x0UL)
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Max (0x1UL)
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_NotGenerated (0x0UL)
  #define MVDMA_EVENTS_COMPLETED_EVENTS_COMPLETED_Generated (0x1UL)


/* MVDMA_PUBLISH_END: Publish configuration for event END */
  #define MVDMA_PUBLISH_END_ResetValue (0x00000000UL)

