pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define MVDMA_PUBLISH_END_CHIDX_Pos (0UL)
  #define MVDMA_PUBLISH_END_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_END_CHIDX_Pos)
  #define MVDMA_PUBLISH_END_CHIDX_Min (0x00UL)
  #define MVDMA_PUBLISH_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_END_EN_Pos (31UL)
  #define MVDMA_PUBLISH_END_EN_Msk (0x1UL << MVDMA_PUBLISH_END_EN_Pos)
  #define MVDMA_PUBLISH_END_EN_Min (0x0UL)
  #define MVDMA_PUBLISH_END_EN_Max (0x1UL)
  #define MVDMA_PUBLISH_END_EN_Disabled (0x0UL)
  #define MVDMA_PUBLISH_END_EN_Enabled (0x1UL)


/* MVDMA_PUBLISH_COMPLETED: Publish configuration for event COMPLETED[n] */
  #define MVDMA_PUBLISH_COMPLETED_MaxCount (8UL)
  #define MVDMA_PUBLISH_COMPLETED_MaxIndex (7UL)
  #define MVDMA_PUBLISH_COMPLETED_MinIndex (0UL)
  #define MVDMA_PUBLISH_COMPLETED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event COMPLETED[n] will publish to */
  #define MVDMA_PUBLISH_COMPLETED_CHIDX_Pos (0UL)
  #define MVDMA_PUBLISH_COMPLETED_CHIDX_Msk (0xFFUL << MVDMA_PUBLISH_COMPLETED_CHIDX_Pos)
  #define MVDMA_PUBLISH_COMPLETED_CHIDX_Min (0x00UL)
  #define MVDMA_PUBLISH_COMPLETED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define MVDMA_PUBLISH_COMPLETED_EN_Pos (31UL)
  #define MVDMA_PUBLISH_COMPLETED_EN_Msk (0x1UL << MVDMA_PUBLISH_COMPLETED_EN_Pos)
  #define MVDMA_PUBLISH_COMPLETED_EN_Min (0x0UL)
  #define MVDMA_PUBLISH_COMPLETED_EN_Max (0x1UL)
  #define MVDMA_PUBLISH_COMPLETED_EN_Disabled (0x0UL)
  #define MVDMA_PUBLISH_COMPLETED_EN_Enabled (0x1UL)


/* MVDMA_INTEN: Enable or disable interrupt */
  #define MVDMA_INTEN_ResetValue (0x00000000UL)

/* END @Bit 0 : Enable or disable interrupt for event END */
  #define MVDMA_INTEN_END_Pos (0UL)
  #define MVDMA_INTEN_END_Msk (0x1UL << MVDMA_INTEN_END_Pos)
  #define MVDMA_INTEN_END_Min (0x0UL)
  #define MVDMA_INTEN_END_Max (0x1UL)
  #define MVDMA_INTEN_END_Disabled (0x0UL)
  #define MVDMA_INTEN_END_Enabled (0x1UL)

/* STARTED @Bit 1 : Enable or disable interrupt for event STARTED */
  #define MVDMA_INTEN_STARTED_Pos (1UL)
  #define MVDMA_INTEN_STARTED_Msk (0x1UL << MVDMA_INTEN_STARTED_Pos)
  #define MVDMA_INTEN_STARTED_Min (0x0UL)
  #define MVDMA_INTEN_STARTED_Max (0x1UL)
  #define MVDMA_INTEN_STARTED_Disabled (0x0UL)
  #define MVDMA_INTEN_STARTED_Enabled (0x1UL)

/* PAUSED @Bit 2 : Enable or disable interrupt for event PAUSED */
  #define MVDMA_INTEN_PAUSED_Pos (2UL)
  #define MVDMA_INTEN_PAUSED_Msk (0x1UL << MVDMA_INTEN_PAUSED_Pos)
  #define MVDMA_INTEN_PAUSED_Min (0x0UL)
  #define MVDMA_INTEN_PAUSED_Max (0x1UL)
  #define MVDMA_INTEN_PAUSED_Disabled (0x0UL)
  #define MVDMA_INTEN_PAUSED_Enabled (0x1UL)

/* RESET @Bit 3 : Enable or disable interrupt for event RESET */
  #define MVDMA_INTEN_RESET_Pos (3UL)
  #define MVDMA_INTEN_RESET_Msk (0x1UL << MVDMA_INTEN_RESET_Pos)
  #define MVDMA_INTEN_RESET_Min (0x0UL)
  #define MVDMA_INTEN_RESET_Max (0x1UL)
  #define MVDMA_INTEN_RESET_Disabled (0x0UL)
  #define MVDMA_INTEN_RESET_Enabled (0x1UL)

/* SOURCEBUSERROR @Bit 4 : Enable or disable interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTEN_SOURCEBUSERROR_Pos (4UL)
  #define MVDMA_INTEN_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTEN_SOURCEBUSERROR_Pos)
  #define MVDMA_INTEN_SOURCEBUSERROR_Min (0x0UL)
  #define MVDMA_INTEN_SOURCEBUSERROR_Max (0x1UL)
  #define MVDMA_INTEN_SOURCEBUSERROR_Disabled (0x0UL)
  #define MVDMA_INTEN_SOURCEBUSERROR_Enabled (0x1UL)

/* SOURCESELECTJOBDONE @Bit 5 : Enable or disable interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Pos (5UL)
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTEN_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Min (0x0UL)
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Max (0x1UL)
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Disabled (0x0UL)
  #define MVDMA_INTEN_SOURCESELECTJOBDONE_Enabled (0x1UL)

/* SINKBUSERROR @Bit 6 : Enable or disable interrupt for event SINKBUSERROR */
  #define MVDMA_INTEN_SINKBUSERROR_Pos (6UL)
  #define MVDMA_INTEN_SINKBUSERROR_Msk (0x1UL << MVDMA_INTEN_SINKBUSERROR_Pos)
  #define MVDMA_INTEN_SINKBUSERROR_Min (0x0UL)
  #define MVDMA_INTEN_SINKBUSERROR_Max (0x1UL)
  #define MVDMA_INTEN_SINKBUSERROR_Disabled (0x0UL)
  #define MVDMA_INTEN_SINKBUSERROR_Enabled (0x1UL)

/* SINKSELECTJOBDONE @Bit 7 : Enable or disable interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Pos (7UL)
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTEN_SINKSELECTJOBDONE_Pos) /*!< Bit mask of SINKSELECTJOBDONE
                                                                            field.*/
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Min (0x0UL)
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Max (0x1UL)
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Disabled (0x0UL)
  #define MVDMA_INTEN_SINKSELECTJOBDONE_Enabled (0x1UL)

/* COMPLETED0 @Bit 8 : Enable or disable interrupt for event COMPLETED[0] */
  #define MVDMA_INTEN_COMPLETED0_Pos (8UL)
  #define MVDMA_INTEN_COMPLETED0_Msk (0x1UL << MVDMA_INTEN_COMPLETED0_Pos)
  #define MVDMA_INTEN_COMPLETED0_Min (0x0UL)
  #define MVDMA_INTEN_COMPLETED0_Max (0x1UL)
  #define MVDMA_INTEN_COMPLETED0_Disabled (0x0UL)
  #define MVDMA_INTEN_COMPLETED0_Enabled (0x1UL)

/* COMPLETED1 @Bit 9 : Enable or disable interrupt for event COMPLETED[1] */
  #define MVDMA_INTEN_COMPLETED1_Pos (9UL)
  #define MVDMA_INTEN_COMPLETED1_Msk (0x1UL << MVDMA_INTEN_COMPLETED1_Pos)
  #define MVDMA_INTEN_COMPLETED1_Min (0x0UL)
  #define MVDMA_INTEN_COMPLETED1_Max (0x1UL)
  #define MVDMA_INTEN_COMPLETED1_Disabled (0x0UL)
  #define MVDMA_INTEN_COMPLETED1_Enabled (0x1UL)

/* COMPLETED2 @Bit 10 : Enable or disable interrupt for event COMPLETED[2] */
  #define MVDMA_INTEN_COMPLETED2_Pos (10UL)
  #define MVDMA_INTEN_COMPLETED2_Msk (0x1UL << MVDMA_INTEN_COMPLETED2_Pos)
  #define MVDMA_INTEN_COMPLETED2_Min (0x0UL)
  #define MVDMA_INTEN_COMPLETED2_Max (0x1UL)
  #define MVDMA_INTEN_COMPLETED2_Disabled (0x0UL)
  #define MVDMA_INTEN_COMPLETED2_Enabled (0x1UL)

