pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPLETED3 @Bit 11 : Enable or disable interrupt for event COMPLETED[3] */
  #define MVDMA_INTEN_COMPLETED3_Pos (11UL)
  #define MVDMA_INTEN_COMPLETED3_Msk (0x1UL << MVDMA_INTEN_COMPLETED3_Pos)
  #define MVDMA_INTEN_COMPLETED3_Min (0x0UL)
  #define MVDMA_INTEN_COMPLETED3_Max (0x1UL)
  #define MVDMA_INTEN_COMPLETED3_Disabled (0x0UL)
  #define MVDMA_INTEN_COMPLETED3_Enabled (0x1UL)

/* COMPLETED4 @Bit 12 : Enable or disable interrupt for event COMPLETED[4] */
  #define MVDMA_INTEN_COMPLETED4_Pos (12UL)
  #define MVDMA_INTEN_COMPLETED4_Msk (0x1UL << MVDMA_INTEN_COMPLETED4_Pos)
  #define MVDMA_INTEN_COMPLETED4_Min (0x0UL)
  #define MVDMA_INTEN_COMPLETED4_Max (0x1UL)
  #define MVDMA_INTEN_COMPLETED4_Disabled (0x0UL)
  #define MVDMA_INTEN_COMPLETED4_Enabled (0x1UL)

/* COMPLETED5 @Bit 13 : Enable or disable interrupt for event COMPLETED[5] */
  #define MVDMA_INTEN_COMPLETED5_Pos (13UL)
  #define MVDMA_INTEN_COMPLETED5_Msk (0x1UL << MVDMA_INTEN_COMPLETED5_Pos)
  #define MVDMA_INTEN_COMPLETED5_Min (0x0UL)
  #define MVDMA_INTEN_COMPLETED5_Max (0x1UL)
  #define MVDMA_INTEN_COMPLETED5_Disabled (0x0UL)
  #define MVDMA_INTEN_COMPLETED5_Enabled (0x1UL)

/* COMPLETED6 @Bit 14 : Enable or disable interrupt for event COMPLETED[6] */
  #define MVDMA_INTEN_COMPLETED6_Pos (14UL)
  #define MVDMA_INTEN_COMPLETED6_Msk (0x1UL << MVDMA_INTEN_COMPLETED6_Pos)
  #define MVDMA_INTEN_COMPLETED6_Min (0x0UL)
  #define MVDMA_INTEN_COMPLETED6_Max (0x1UL)
  #define MVDMA_INTEN_COMPLETED6_Disabled (0x0UL)
  #define MVDMA_INTEN_COMPLETED6_Enabled (0x1UL)

/* COMPLETED7 @Bit 15 : Enable or disable interrupt for event COMPLETED[7] */
  #define MVDMA_INTEN_COMPLETED7_Pos (15UL)
  #define MVDMA_INTEN_COMPLETED7_Msk (0x1UL << MVDMA_INTEN_COMPLETED7_Pos)
  #define MVDMA_INTEN_COMPLETED7_Min (0x0UL)
  #define MVDMA_INTEN_COMPLETED7_Max (0x1UL)
  #define MVDMA_INTEN_COMPLETED7_Disabled (0x0UL)
  #define MVDMA_INTEN_COMPLETED7_Enabled (0x1UL)


/* MVDMA_INTENSET: Enable interrupt */
  #define MVDMA_INTENSET_ResetValue (0x00000000UL)

/* END @Bit 0 : Write '1' to enable interrupt for event END */
  #define MVDMA_INTENSET_END_Pos (0UL)
  #define MVDMA_INTENSET_END_Msk (0x1UL << MVDMA_INTENSET_END_Pos)
  #define MVDMA_INTENSET_END_Min (0x0UL)
  #define MVDMA_INTENSET_END_Max (0x1UL)
  #define MVDMA_INTENSET_END_Set (0x1UL)
  #define MVDMA_INTENSET_END_Disabled (0x0UL)
  #define MVDMA_INTENSET_END_Enabled (0x1UL)

/* STARTED @Bit 1 : Write '1' to enable interrupt for event STARTED */
  #define MVDMA_INTENSET_STARTED_Pos (1UL)
  #define MVDMA_INTENSET_STARTED_Msk (0x1UL << MVDMA_INTENSET_STARTED_Pos)
  #define MVDMA_INTENSET_STARTED_Min (0x0UL)
  #define MVDMA_INTENSET_STARTED_Max (0x1UL)
  #define MVDMA_INTENSET_STARTED_Set (0x1UL)
  #define MVDMA_INTENSET_STARTED_Disabled (0x0UL)
  #define MVDMA_INTENSET_STARTED_Enabled (0x1UL)

/* PAUSED @Bit 2 : Write '1' to enable interrupt for event PAUSED */
  #define MVDMA_INTENSET_PAUSED_Pos (2UL)
  #define MVDMA_INTENSET_PAUSED_Msk (0x1UL << MVDMA_INTENSET_PAUSED_Pos)
  #define MVDMA_INTENSET_PAUSED_Min (0x0UL)
  #define MVDMA_INTENSET_PAUSED_Max (0x1UL)
  #define MVDMA_INTENSET_PAUSED_Set (0x1UL)
  #define MVDMA_INTENSET_PAUSED_Disabled (0x0UL)
  #define MVDMA_INTENSET_PAUSED_Enabled (0x1UL)

/* RESET @Bit 3 : Write '1' to enable interrupt for event RESET */
  #define MVDMA_INTENSET_RESET_Pos (3UL)
  #define MVDMA_INTENSET_RESET_Msk (0x1UL << MVDMA_INTENSET_RESET_Pos)
  #define MVDMA_INTENSET_RESET_Min (0x0UL)
  #define MVDMA_INTENSET_RESET_Max (0x1UL)
  #define MVDMA_INTENSET_RESET_Set (0x1UL)
  #define MVDMA_INTENSET_RESET_Disabled (0x0UL)
  #define MVDMA_INTENSET_RESET_Enabled (0x1UL)

/* SOURCEBUSERROR @Bit 4 : Write '1' to enable interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTENSET_SOURCEBUSERROR_Pos (4UL)
  #define MVDMA_INTENSET_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTENSET_SOURCEBUSERROR_Pos)
  #define MVDMA_INTENSET_SOURCEBUSERROR_Min (0x0UL)
  #define MVDMA_INTENSET_SOURCEBUSERROR_Max (0x1UL)
  #define MVDMA_INTENSET_SOURCEBUSERROR_Set (0x1UL)
  #define MVDMA_INTENSET_SOURCEBUSERROR_Disabled (0x0UL)
  #define MVDMA_INTENSET_SOURCEBUSERROR_Enabled (0x1UL)

/* SOURCESELECTJOBDONE @Bit 5 : Write '1' to enable interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Pos (5UL)
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTENSET_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Min (0x0UL)
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Max (0x1UL)
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Set (0x1UL)
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Disabled (0x0UL)
  #define MVDMA_INTENSET_SOURCESELECTJOBDONE_Enabled (0x1UL)

/* SINKBUSERROR @Bit 6 : Write '1' to enable interrupt for event SINKBUSERROR */
  #define MVDMA_INTENSET_SINKBUSERROR_Pos (6UL)
  #define MVDMA_INTENSET_SINKBUSERROR_Msk (0x1UL << MVDMA_INTENSET_SINKBUSERROR_Pos)
  #define MVDMA_INTENSET_SINKBUSERROR_Min (0x0UL)
  #define MVDMA_INTENSET_SINKBUSERROR_Max (0x1UL)
  #define MVDMA_INTENSET_SINKBUSERROR_Set (0x1UL)
  #define MVDMA_INTENSET_SINKBUSERROR_Disabled (0x0UL)
  #define MVDMA_INTENSET_SINKBUSERROR_Enabled (0x1UL)

/* SINKSELECTJOBDONE @Bit 7 : Write '1' to enable interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Pos (7UL)
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTENSET_SINKSELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SINKSELECTJOBDONE field.*/
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Min (0x0UL)
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Max (0x1UL)
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Set (0x1UL)
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Disabled (0x0UL)
  #define MVDMA_INTENSET_SINKSELECTJOBDONE_Enabled (0x1UL)

/* COMPLETED0 @Bit 8 : Write '1' to enable interrupt for event COMPLETED[0] */
  #define MVDMA_INTENSET_COMPLETED0_Pos (8UL)
  #define MVDMA_INTENSET_COMPLETED0_Msk (0x1UL << MVDMA_INTENSET_COMPLETED0_Pos)
  #define MVDMA_INTENSET_COMPLETED0_Min (0x0UL)
  #define MVDMA_INTENSET_COMPLETED0_Max (0x1UL)
  #define MVDMA_INTENSET_COMPLETED0_Set (0x1UL)
  #define MVDMA_INTENSET_COMPLETED0_Disabled (0x0UL)
  #define MVDMA_INTENSET_COMPLETED0_Enabled (0x1UL)

/* COMPLETED1 @Bit 9 : Write '1' to enable interrupt for event COMPLETED[1] */
  #define MVDMA_INTENSET_COMPLETED1_Pos (9UL)
  #define MVDMA_INTENSET_COMPLETED1_Msk (0x1UL << MVDMA_INTENSET_COMPLETED1_Pos)
  #define MVDMA_INTENSET_COMPLETED1_Min (0x0UL)
  #define MVDMA_INTENSET_COMPLETED1_Max (0x1UL)
  #define MVDMA_INTENSET_COMPLETED1_Set (0x1UL)
  #define MVDMA_INTENSET_COMPLETED1_Disabled (0x0UL)
  #define MVDMA_INTENSET_COMPLETED1_Enabled (0x1UL)

/* COMPLETED2 @Bit 10 : Write '1' to enable interrupt for event COMPLETED[2] */
  #define MVDMA_INTENSET_COMPLETED2_Pos (10UL)
  #define MVDMA_INTENSET_COMPLETED2_Msk (0x1UL << MVDMA_INTENSET_COMPLETED2_Pos)
  #define MVDMA_INTENSET_COMPLETED2_Min (0x0UL)
  #define MVDMA_INTENSET_COMPLETED2_Max (0x1UL)
  #define MVDMA_INTENSET_COMPLETED2_Set (0x1UL)
  #define MVDMA_INTENSET_COMPLETED2_Disabled (0x0UL)
  #define MVDMA_INTENSET_COMPLETED2_Enabled (0x1UL)

