pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPLETED2 @Bit 10 : Write '1' to disable interrupt for event COMPLETED[2] */
  #define MVDMA_INTENCLR_COMPLETED2_Pos (10UL)
  #define MVDMA_INTENCLR_COMPLETED2_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED2_Pos)
  #define MVDMA_INTENCLR_COMPLETED2_Min (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED2_Max (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED2_Clear (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED2_Disabled (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED2_Enabled (0x1UL)

/* COMPLETED3 @Bit 11 : Write '1' to disable interrupt for event COMPLETED[3] */
  #define MVDMA_INTENCLR_COMPLETED3_Pos (11UL)
  #define MVDMA_INTENCLR_COMPLETED3_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED3_Pos)
  #define MVDMA_INTENCLR_COMPLETED3_Min (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED3_Max (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED3_Clear (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED3_Disabled (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED3_Enabled (0x1UL)

/* COMPLETED4 @Bit 12 : Write '1' to disable interrupt for event COMPLETED[4] */
  #define MVDMA_INTENCLR_COMPLETED4_Pos (12UL)
  #define MVDMA_INTENCLR_COMPLETED4_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED4_Pos)
  #define MVDMA_INTENCLR_COMPLETED4_Min (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED4_Max (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED4_Clear (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED4_Disabled (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED4_Enabled (0x1UL)

/* COMPLETED5 @Bit 13 : Write '1' to disable interrupt for event COMPLETED[5] */
  #define MVDMA_INTENCLR_COMPLETED5_Pos (13UL)
  #define MVDMA_INTENCLR_COMPLETED5_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED5_Pos)
  #define MVDMA_INTENCLR_COMPLETED5_Min (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED5_Max (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED5_Clear (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED5_Disabled (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED5_Enabled (0x1UL)

/* COMPLETED6 @Bit 14 : Write '1' to disable interrupt for event COMPLETED[6] */
  #define MVDMA_INTENCLR_COMPLETED6_Pos (14UL)
  #define MVDMA_INTENCLR_COMPLETED6_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED6_Pos)
  #define MVDMA_INTENCLR_COMPLETED6_Min (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED6_Max (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED6_Clear (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED6_Disabled (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED6_Enabled (0x1UL)

/* COMPLETED7 @Bit 15 : Write '1' to disable interrupt for event COMPLETED[7] */
  #define MVDMA_INTENCLR_COMPLETED7_Pos (15UL)
  #define MVDMA_INTENCLR_COMPLETED7_Msk (0x1UL << MVDMA_INTENCLR_COMPLETED7_Pos)
  #define MVDMA_INTENCLR_COMPLETED7_Min (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED7_Max (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED7_Clear (0x1UL)
  #define MVDMA_INTENCLR_COMPLETED7_Disabled (0x0UL)
  #define MVDMA_INTENCLR_COMPLETED7_Enabled (0x1UL)


/* MVDMA_INTPEND: Pending interrupts */
  #define MVDMA_INTPEND_ResetValue (0x00000000UL)

/* END @Bit 0 : Read pending status of interrupt for event END */
  #define MVDMA_INTPEND_END_Pos (0UL)
  #define MVDMA_INTPEND_END_Msk (0x1UL << MVDMA_INTPEND_END_Pos)
  #define MVDMA_INTPEND_END_Min (0x0UL)
  #define MVDMA_INTPEND_END_Max (0x1UL)
  #define MVDMA_INTPEND_END_NotPending (0x0UL)
  #define MVDMA_INTPEND_END_Pending (0x1UL)

/* STARTED @Bit 1 : Read pending status of interrupt for event STARTED */
  #define MVDMA_INTPEND_STARTED_Pos (1UL)
  #define MVDMA_INTPEND_STARTED_Msk (0x1UL << MVDMA_INTPEND_STARTED_Pos)
  #define MVDMA_INTPEND_STARTED_Min (0x0UL)
  #define MVDMA_INTPEND_STARTED_Max (0x1UL)
  #define MVDMA_INTPEND_STARTED_NotPending (0x0UL)
  #define MVDMA_INTPEND_STARTED_Pending (0x1UL)

/* PAUSED @Bit 2 : Read pending status of interrupt for event PAUSED */
  #define MVDMA_INTPEND_PAUSED_Pos (2UL)
  #define MVDMA_INTPEND_PAUSED_Msk (0x1UL << MVDMA_INTPEND_PAUSED_Pos)
  #define MVDMA_INTPEND_PAUSED_Min (0x0UL)
  #define MVDMA_INTPEND_PAUSED_Max (0x1UL)
  #define MVDMA_INTPEND_PAUSED_NotPending (0x0UL)
  #define MVDMA_INTPEND_PAUSED_Pending (0x1UL)

/* RESET @Bit 3 : Read pending status of interrupt for event RESET */
  #define MVDMA_INTPEND_RESET_Pos (3UL)
  #define MVDMA_INTPEND_RESET_Msk (0x1UL << MVDMA_INTPEND_RESET_Pos)
  #define MVDMA_INTPEND_RESET_Min (0x0UL)
  #define MVDMA_INTPEND_RESET_Max (0x1UL)
  #define MVDMA_INTPEND_RESET_NotPending (0x0UL)
  #define MVDMA_INTPEND_RESET_Pending (0x1UL)

/* SOURCEBUSERROR @Bit 4 : Read pending status of interrupt for event SOURCEBUSERROR */
  #define MVDMA_INTPEND_SOURCEBUSERROR_Pos (4UL)
  #define MVDMA_INTPEND_SOURCEBUSERROR_Msk (0x1UL << MVDMA_INTPEND_SOURCEBUSERROR_Pos)
  #define MVDMA_INTPEND_SOURCEBUSERROR_Min (0x0UL)
  #define MVDMA_INTPEND_SOURCEBUSERROR_Max (0x1UL)
  #define MVDMA_INTPEND_SOURCEBUSERROR_NotPending (0x0UL)
  #define MVDMA_INTPEND_SOURCEBUSERROR_Pending (0x1UL)

/* SOURCESELECTJOBDONE @Bit 5 : Read pending status of interrupt for event SOURCESELECTJOBDONE */
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Pos (5UL)
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Msk (0x1UL << MVDMA_INTPEND_SOURCESELECTJOBDONE_Pos) /*!< Bit mask of
                                                                            SOURCESELECTJOBDONE field.*/
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Min (0x0UL)
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Max (0x1UL)
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_NotPending (0x0UL)
  #define MVDMA_INTPEND_SOURCESELECTJOBDONE_Pending (0x1UL)

/* SINKBUSERROR @Bit 6 : Read pending status of interrupt for event SINKBUSERROR */
  #define MVDMA_INTPEND_SINKBUSERROR_Pos (6UL)
  #define MVDMA_INTPEND_SINKBUSERROR_Msk (0x1UL << MVDMA_INTPEND_SINKBUSERROR_Pos)
  #define MVDMA_INTPEND_SINKBUSERROR_Min (0x0UL)
  #define MVDMA_INTPEND_SINKBUSERROR_Max (0x1UL)
  #define MVDMA_INTPEND_SINKBUSERROR_NotPending (0x0UL)
  #define MVDMA_INTPEND_SINKBUSERROR_Pending (0x1UL)

/* SINKSELECTJOBDONE @Bit 7 : Read pending status of interrupt for event SINKSELECTJOBDONE */
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Pos (7UL)
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Msk (0x1UL << MVDMA_INTPEND_SINKSELECTJOBDONE_Pos) /*!< Bit mask of SINKSELECTJOBDONE
                                                                            field.*/
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Min (0x0UL)
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Max (0x1UL)
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_NotPending (0x0UL)
  #define MVDMA_INTPEND_SINKSELECTJOBDONE_Pending (0x1UL)

