pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPLETED0 @Bit 8 : Read pending status of interrupt for event COMPLETED[0] */
  #define MVDMA_INTPEND_COMPLETED0_Pos (8UL)
  #define MVDMA_INTPEND_COMPLETED0_Msk (0x1UL << MVDMA_INTPEND_COMPLETED0_Pos)
  #define MVDMA_INTPEND_COMPLETED0_Min (0x0UL)
  #define MVDMA_INTPEND_COMPLETED0_Max (0x1UL)
  #define MVDMA_INTPEND_COMPLETED0_NotPending (0x0UL)
  #define MVDMA_INTPEND_COMPLETED0_Pending (0x1UL)

/* COMPLETED1 @Bit 9 : Read pending status of interrupt for event COMPLETED[1] */
  #define MVDMA_INTPEND_COMPLETED1_Pos (9UL)
  #define MVDMA_INTPEND_COMPLETED1_Msk (0x1UL << MVDMA_INTPEND_COMPLETED1_Pos)
  #define MVDMA_INTPEND_COMPLETED1_Min (0x0UL)
  #define MVDMA_INTPEND_COMPLETED1_Max (0x1UL)
  #define MVDMA_INTPEND_COMPLETED1_NotPending (0x0UL)
  #define MVDMA_INTPEND_COMPLETED1_Pending (0x1UL)

/* COMPLETED2 @Bit 10 : Read pending status of interrupt for event COMPLETED[2] */
  #define MVDMA_INTPEND_COMPLETED2_Pos (10UL)
  #define MVDMA_INTPEND_COMPLETED2_Msk (0x1UL << MVDMA_INTPEND_COMPLETED2_Pos)
  #define MVDMA_INTPEND_COMPLETED2_Min (0x0UL)
  #define MVDMA_INTPEND_COMPLETED2_Max (0x1UL)
  #define MVDMA_INTPEND_COMPLETED2_NotPending (0x0UL)
  #define MVDMA_INTPEND_COMPLETED2_Pending (0x1UL)

/* COMPLETED3 @Bit 11 : Read pending status of interrupt for event COMPLETED[3] */
  #define MVDMA_INTPEND_COMPLETED3_Pos (11UL)
  #define MVDMA_INTPEND_COMPLETED3_Msk (0x1UL << MVDMA_INTPEND_COMPLETED3_Pos)
  #define MVDMA_INTPEND_COMPLETED3_Min (0x0UL)
  #define MVDMA_INTPEND_COMPLETED3_Max (0x1UL)
  #define MVDMA_INTPEND_COMPLETED3_NotPending (0x0UL)
  #define MVDMA_INTPEND_COMPLETED3_Pending (0x1UL)

/* COMPLETED4 @Bit 12 : Read pending status of interrupt for event COMPLETED[4] */
  #define MVDMA_INTPEND_COMPLETED4_Pos (12UL)
  #define MVDMA_INTPEND_COMPLETED4_Msk (0x1UL << MVDMA_INTPEND_COMPLETED4_Pos)
  #define MVDMA_INTPEND_COMPLETED4_Min (0x0UL)
  #define MVDMA_INTPEND_COMPLETED4_Max (0x1UL)
  #define MVDMA_INTPEND_COMPLETED4_NotPending (0x0UL)
  #define MVDMA_INTPEND_COMPLETED4_Pending (0x1UL)

/* COMPLETED5 @Bit 13 : Read pending status of interrupt for event COMPLETED[5] */
  #define MVDMA_INTPEND_COMPLETED5_Pos (13UL)
  #define MVDMA_INTPEND_COMPLETED5_Msk (0x1UL << MVDMA_INTPEND_COMPLETED5_Pos)
  #define MVDMA_INTPEND_COMPLETED5_Min (0x0UL)
  #define MVDMA_INTPEND_COMPLETED5_Max (0x1UL)
  #define MVDMA_INTPEND_COMPLETED5_NotPending (0x0UL)
  #define MVDMA_INTPEND_COMPLETED5_Pending (0x1UL)

/* COMPLETED6 @Bit 14 : Read pending status of interrupt for event COMPLETED[6] */
  #define MVDMA_INTPEND_COMPLETED6_Pos (14UL)
  #define MVDMA_INTPEND_COMPLETED6_Msk (0x1UL << MVDMA_INTPEND_COMPLETED6_Pos)
  #define MVDMA_INTPEND_COMPLETED6_Min (0x0UL)
  #define MVDMA_INTPEND_COMPLETED6_Max (0x1UL)
  #define MVDMA_INTPEND_COMPLETED6_NotPending (0x0UL)
  #define MVDMA_INTPEND_COMPLETED6_Pending (0x1UL)

/* COMPLETED7 @Bit 15 : Read pending status of interrupt for event COMPLETED[7] */
  #define MVDMA_INTPEND_COMPLETED7_Pos (15UL)
  #define MVDMA_INTPEND_COMPLETED7_Msk (0x1UL << MVDMA_INTPEND_COMPLETED7_Pos)
  #define MVDMA_INTPEND_COMPLETED7_Min (0x0UL)
  #define MVDMA_INTPEND_COMPLETED7_Max (0x1UL)
  #define MVDMA_INTPEND_COMPLETED7_NotPending (0x0UL)
  #define MVDMA_INTPEND_COMPLETED7_Pending (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct PDM_PSEL ===================================================== */
/**
  * @brief PSEL [PDM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CLK;
  __IOM uint32_t  DIN;
} NRF_PDM_PSEL_Type;

/* PDM_PSEL_CLK: Pin number configuration for PDM CLK signal */
  #define PDM_PSEL_CLK_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define PDM_PSEL_CLK_PIN_Pos (0UL)
  #define PDM_PSEL_CLK_PIN_Msk (0x1FUL << PDM_PSEL_CLK_PIN_Pos)
  #define PDM_PSEL_CLK_PIN_Min (0x00UL)
  #define PDM_PSEL_CLK_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define PDM_PSEL_CLK_PORT_Pos (5UL)
  #define PDM_PSEL_CLK_PORT_Msk (0xFUL << PDM_PSEL_CLK_PORT_Pos)
  #define PDM_PSEL_CLK_PORT_Min (0x0UL)
  #define PDM_PSEL_CLK_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define PDM_PSEL_CLK_CONNECT_Pos (31UL)
  #define PDM_PSEL_CLK_CONNECT_Msk (0x1UL << PDM_PSEL_CLK_CONNECT_Pos)
  #define PDM_PSEL_CLK_CONNECT_Min (0x0UL)
  #define PDM_PSEL_CLK_CONNECT_Max (0x1UL)
  #define PDM_PSEL_CLK_CONNECT_Disconnected (0x1UL)
  #define PDM_PSEL_CLK_CONNECT_Connected (0x0UL)


/* PDM_PSEL_DIN: Pin number configuration for PDM DIN signal */
  #define PDM_PSEL_DIN_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define PDM_PSEL_DIN_PIN_Pos (0UL)
  #define PDM_PSEL_DIN_PIN_Msk (0x1FUL << PDM_PSEL_DIN_PIN_Pos)
  #define PDM_PSEL_DIN_PIN_Min (0x00UL)
  #define PDM_PSEL_DIN_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define PDM_PSEL_DIN_PORT_Pos (5UL)
  #define PDM_PSEL_DIN_PORT_Msk (0xFUL << PDM_PSEL_DIN_PORT_Pos)
  #define PDM_PSEL_DIN_PORT_Min (0x0UL)
  #define PDM_PSEL_DIN_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define PDM_PSEL_DIN_CONNECT_Pos (31UL)
  #define PDM_PSEL_DIN_CONNECT_Msk (0x1UL << PDM_PSEL_DIN_CONNECT_Pos)
  #define PDM_PSEL_DIN_CONNECT_Min (0x0UL)
  #define PDM_PSEL_DIN_CONNECT_Max (0x1UL)
  #define PDM_PSEL_DIN_CONNECT_Disconnected (0x1UL)
  #define PDM_PSEL_DIN_CONNECT_Connected (0x0UL)



/* ==================================================== Struct PDM_SAMPLE ==================================================== */
/**
  * @brief SAMPLE [PDM_SAMPLE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000004) Number of samples to allocate memory for in EasyDMA
                                                                         mode*/
  __IM  uint32_t  RESERVED;
} NRF_PDM_SAMPLE_Type;

