pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PDM_SAMPLE_PTR: RAM address pointer to write samples to with EasyDMA */
  #define PDM_SAMPLE_PTR_ResetValue (0x00000000UL)

/* SAMPLEPTR @Bits 0..31 : Address to write PDM samples to over DMA */
  #define PDM_SAMPLE_PTR_SAMPLEPTR_Pos (0UL)
  #define PDM_SAMPLE_PTR_SAMPLEPTR_Msk (0xFFFFFFFFUL << PDM_SAMPLE_PTR_SAMPLEPTR_Pos)


/* PDM_SAMPLE_MAXCNT: Number of samples to allocate memory for in EasyDMA mode */
  #define PDM_SAMPLE_MAXCNT_ResetValue (0x00000000UL)

/* BUFFSIZE @Bits 0..14 : Length of DMA RAM allocation in number of samples */
  #define PDM_SAMPLE_MAXCNT_BUFFSIZE_Pos (0UL)
  #define PDM_SAMPLE_MAXCNT_BUFFSIZE_Msk (0x7FFFUL << PDM_SAMPLE_MAXCNT_BUFFSIZE_Pos)
  #define PDM_SAMPLE_MAXCNT_BUFFSIZE_Min (0x0000UL)
  #define PDM_SAMPLE_MAXCNT_BUFFSIZE_Max (0x7FFFUL)



/* ===================================================== Struct PDM_DMA ====================================================== */
/**
  * @brief DMA [PDM_DMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x00000000) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IOM uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000004) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_PDM_DMA_Type;

/* PDM_DMA_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define PDM_DMA_TERMINATEONBUSERROR_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : (unspecified) */
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Pos (0UL)
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << PDM_DMA_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Min (0x0UL)
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Max (0x1UL)
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL)
  #define PDM_DMA_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL)


/* PDM_DMA_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define PDM_DMA_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define PDM_DMA_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define PDM_DMA_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << PDM_DMA_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* ======================================================= Struct PDM ======================================================== */
/**
  * @brief Pulse Density Modulation (Digital Microphone) Interface
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_STARTED;
    __IOM uint32_t EVENTS_STOPPED;
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000108) The PDM has written the last sample specified by
                                                                         SAMPLE.MAXCNT (or the last sample after a STOP task has
                                                                         been received) to Data RAM*/
    __IM uint32_t RESERVED2[29];
    __IOM uint32_t PUBLISH_STARTED;
    __IOM uint32_t PUBLISH_STOPPED;
    __IOM uint32_t PUBLISH_END;
    __IM uint32_t RESERVED3[93];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED4[124];
    __IOM uint32_t ENABLE;
    __IOM uint32_t PDMCLKCTRL;
    __IOM uint32_t MODE;                             /*!< (@ 0x00000508) Defines the routing of the connected PDM microphones'
                                                                         signals*/
    __IM uint32_t RESERVED5[3];
    __IOM uint32_t GAINL;
    __IOM uint32_t GAINR;
    __IOM uint32_t RATIO;                            /*!< (@ 0x00000520) Selects the decimation ratio between PDM_CLK and output
                                                                         sample rate. Change PDMCLKCTRL accordingly.*/
    __IM uint32_t RESERVED6[7];
    __IOM NRF_PDM_PSEL_Type PSEL;
    __IM uint32_t RESERVED7;
    __IOM uint32_t MCLKCONFIG;
    __IM uint32_t RESERVED8[4];
    __IOM NRF_PDM_SAMPLE_Type SAMPLE;
    __IM uint32_t RESERVED9[101];
    __IOM NRF_PDM_DMA_Type DMA;
  } NRF_PDM_Type;

/* PDM_TASKS_START: Starts continuous PDM transfer */
  #define PDM_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Starts continuous PDM transfer */
  #define PDM_TASKS_START_TASKS_START_Pos (0UL)
  #define PDM_TASKS_START_TASKS_START_Msk (0x1UL << PDM_TASKS_START_TASKS_START_Pos)
  #define PDM_TASKS_START_TASKS_START_Min (0x1UL)
  #define PDM_TASKS_START_TASKS_START_Max (0x1UL)
  #define PDM_TASKS_START_TASKS_START_Trigger (0x1UL)


/* PDM_TASKS_STOP: Stops PDM transfer */
  #define PDM_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stops PDM transfer */
  #define PDM_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define PDM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << PDM_TASKS_STOP_TASKS_STOP_Pos)
  #define PDM_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define PDM_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define PDM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* PDM_SUBSCRIBE_START: Subscribe configuration for task START */
  #define PDM_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define PDM_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define PDM_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << PDM_SUBSCRIBE_START_CHIDX_Pos)
  #define PDM_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define PDM_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PDM_SUBSCRIBE_START_EN_Pos (31UL)
  #define PDM_SUBSCRIBE_START_EN_Msk (0x1UL << PDM_SUBSCRIBE_START_EN_Pos)
  #define PDM_SUBSCRIBE_START_EN_Min (0x0UL)
  #define PDM_SUBSCRIBE_START_EN_Max (0x1UL)
  #define PDM_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define PDM_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* PDM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define PDM_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

