pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define PDM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define PDM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << PDM_SUBSCRIBE_STOP_CHIDX_Pos)
  #define PDM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define PDM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PDM_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define PDM_SUBSCRIBE_STOP_EN_Msk (0x1UL << PDM_SUBSCRIBE_STOP_EN_Pos)
  #define PDM_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define PDM_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define PDM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define PDM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* PDM_EVENTS_STARTED: PDM transfer has started */
  #define PDM_EVENTS_STARTED_ResetValue (0x00000000UL)

/* EVENTS_STARTED @Bit 0 : PDM transfer has started */
  #define PDM_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL)
  #define PDM_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << PDM_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of EVENTS_STARTED
                                                                            field.*/
  #define PDM_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL)
  #define PDM_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL)
  #define PDM_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL)
  #define PDM_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL)


/* PDM_EVENTS_STOPPED: PDM transfer has finished */
  #define PDM_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : PDM transfer has finished */
  #define PDM_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define PDM_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << PDM_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/
  #define PDM_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define PDM_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define PDM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define PDM_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* PDM_EVENTS_END: The PDM has written the last sample specified by SAMPLE.MAXCNT (or the last sample after a STOP task has been
                    received) to Data RAM */

  #define PDM_EVENTS_END_ResetValue (0x00000000UL)

/* EVENTS_END @Bit 0 : The PDM has written the last sample specified by SAMPLE.MAXCNT (or the last sample after a STOP task has
                       been received) to Data RAM */

  #define PDM_EVENTS_END_EVENTS_END_Pos (0UL)
  #define PDM_EVENTS_END_EVENTS_END_Msk (0x1UL << PDM_EVENTS_END_EVENTS_END_Pos)
  #define PDM_EVENTS_END_EVENTS_END_Min (0x0UL)
  #define PDM_EVENTS_END_EVENTS_END_Max (0x1UL)
  #define PDM_EVENTS_END_EVENTS_END_NotGenerated (0x0UL)
  #define PDM_EVENTS_END_EVENTS_END_Generated (0x1UL)


/* PDM_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define PDM_PUBLISH_STARTED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define PDM_PUBLISH_STARTED_CHIDX_Pos (0UL)
  #define PDM_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << PDM_PUBLISH_STARTED_CHIDX_Pos)
  #define PDM_PUBLISH_STARTED_CHIDX_Min (0x00UL)
  #define PDM_PUBLISH_STARTED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_STARTED_EN_Pos (31UL)
  #define PDM_PUBLISH_STARTED_EN_Msk (0x1UL << PDM_PUBLISH_STARTED_EN_Pos)
  #define PDM_PUBLISH_STARTED_EN_Min (0x0UL)
  #define PDM_PUBLISH_STARTED_EN_Max (0x1UL)
  #define PDM_PUBLISH_STARTED_EN_Disabled (0x0UL)
  #define PDM_PUBLISH_STARTED_EN_Enabled (0x1UL)


/* PDM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define PDM_PUBLISH_STOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define PDM_PUBLISH_STOPPED_CHIDX_Pos (0UL)
  #define PDM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << PDM_PUBLISH_STOPPED_CHIDX_Pos)
  #define PDM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)
  #define PDM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_STOPPED_EN_Pos (31UL)
  #define PDM_PUBLISH_STOPPED_EN_Msk (0x1UL << PDM_PUBLISH_STOPPED_EN_Pos)
  #define PDM_PUBLISH_STOPPED_EN_Min (0x0UL)
  #define PDM_PUBLISH_STOPPED_EN_Max (0x1UL)
  #define PDM_PUBLISH_STOPPED_EN_Disabled (0x0UL)
  #define PDM_PUBLISH_STOPPED_EN_Enabled (0x1UL)


/* PDM_PUBLISH_END: Publish configuration for event END */
  #define PDM_PUBLISH_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define PDM_PUBLISH_END_CHIDX_Pos (0UL)
  #define PDM_PUBLISH_END_CHIDX_Msk (0xFFUL << PDM_PUBLISH_END_CHIDX_Pos)
  #define PDM_PUBLISH_END_CHIDX_Min (0x00UL)
  #define PDM_PUBLISH_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_END_EN_Pos (31UL)
  #define PDM_PUBLISH_END_EN_Msk (0x1UL << PDM_PUBLISH_END_EN_Pos)
  #define PDM_PUBLISH_END_EN_Min (0x0UL)
  #define PDM_PUBLISH_END_EN_Max (0x1UL)
  #define PDM_PUBLISH_END_EN_Disabled (0x0UL)
  #define PDM_PUBLISH_END_EN_Enabled (0x1UL)


/* PDM_INTEN: Enable or disable interrupt */
  #define PDM_INTEN_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define PDM_INTEN_STARTED_Pos (0UL)
  #define PDM_INTEN_STARTED_Msk (0x1UL << PDM_INTEN_STARTED_Pos)
  #define PDM_INTEN_STARTED_Min (0x0UL)
  #define PDM_INTEN_STARTED_Max (0x1UL)
  #define PDM_INTEN_STARTED_Disabled (0x0UL)
  #define PDM_INTEN_STARTED_Enabled (0x1UL)

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define PDM_INTEN_STOPPED_Pos (1UL)
  #define PDM_INTEN_STOPPED_Msk (0x1UL << PDM_INTEN_STOPPED_Pos)
  #define PDM_INTEN_STOPPED_Min (0x0UL)
  #define PDM_INTEN_STOPPED_Max (0x1UL)
  #define PDM_INTEN_STOPPED_Disabled (0x0UL)
  #define PDM_INTEN_STOPPED_Enabled (0x1UL)

/* END @Bit 2 : Enable or disable interrupt for event END */
  #define PDM_INTEN_END_Pos (2UL)
  #define PDM_INTEN_END_Msk (0x1UL << PDM_INTEN_END_Pos)
  #define PDM_INTEN_END_Min (0x0UL)
  #define PDM_INTEN_END_Max (0x1UL)
  #define PDM_INTEN_END_Disabled (0x0UL)
  #define PDM_INTEN_END_Enabled (0x1UL)


/* PDM_INTENSET: Enable interrupt */
  #define PDM_INTENSET_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define PDM_INTENSET_STARTED_Pos (0UL)
  #define PDM_INTENSET_STARTED_Msk (0x1UL << PDM_INTENSET_STARTED_Pos)
  #define PDM_INTENSET_STARTED_Min (0x0UL)
  #define PDM_INTENSET_STARTED_Max (0x1UL)
  #define PDM_INTENSET_STARTED_Set (0x1UL)
  #define PDM_INTENSET_STARTED_Disabled (0x0UL)
  #define PDM_INTENSET_STARTED_Enabled (0x1UL)

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define PDM_INTENSET_STOPPED_Pos (1UL)
  #define PDM_INTENSET_STOPPED_Msk (0x1UL << PDM_INTENSET_STOPPED_Pos)
  #define PDM_INTENSET_STOPPED_Min (0x0UL)
  #define PDM_INTENSET_STOPPED_Max (0x1UL)
  #define PDM_INTENSET_STOPPED_Set (0x1UL)
  #define PDM_INTENSET_STOPPED_Disabled (0x0UL)
  #define PDM_INTENSET_STOPPED_Enabled (0x1UL)

