pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* END @Bit 2 : Write '1' to enable interrupt for event END */
  #define PDM_INTENSET_END_Pos (2UL)
  #define PDM_INTENSET_END_Msk (0x1UL << PDM_INTENSET_END_Pos)
  #define PDM_INTENSET_END_Min (0x0UL)
  #define PDM_INTENSET_END_Max (0x1UL)
  #define PDM_INTENSET_END_Set (0x1UL)
  #define PDM_INTENSET_END_Disabled (0x0UL)
  #define PDM_INTENSET_END_Enabled (0x1UL)


/* PDM_INTENCLR: Disable interrupt */
  #define PDM_INTENCLR_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define PDM_INTENCLR_STARTED_Pos (0UL)
  #define PDM_INTENCLR_STARTED_Msk (0x1UL << PDM_INTENCLR_STARTED_Pos)
  #define PDM_INTENCLR_STARTED_Min (0x0UL)
  #define PDM_INTENCLR_STARTED_Max (0x1UL)
  #define PDM_INTENCLR_STARTED_Clear (0x1UL)
  #define PDM_INTENCLR_STARTED_Disabled (0x0UL)
  #define PDM_INTENCLR_STARTED_Enabled (0x1UL)

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define PDM_INTENCLR_STOPPED_Pos (1UL)
  #define PDM_INTENCLR_STOPPED_Msk (0x1UL << PDM_INTENCLR_STOPPED_Pos)
  #define PDM_INTENCLR_STOPPED_Min (0x0UL)
  #define PDM_INTENCLR_STOPPED_Max (0x1UL)
  #define PDM_INTENCLR_STOPPED_Clear (0x1UL)
  #define PDM_INTENCLR_STOPPED_Disabled (0x0UL)
  #define PDM_INTENCLR_STOPPED_Enabled (0x1UL)

/* END @Bit 2 : Write '1' to disable interrupt for event END */
  #define PDM_INTENCLR_END_Pos (2UL)
  #define PDM_INTENCLR_END_Msk (0x1UL << PDM_INTENCLR_END_Pos)
  #define PDM_INTENCLR_END_Min (0x0UL)
  #define PDM_INTENCLR_END_Max (0x1UL)
  #define PDM_INTENCLR_END_Clear (0x1UL)
  #define PDM_INTENCLR_END_Disabled (0x0UL)
  #define PDM_INTENCLR_END_Enabled (0x1UL)


/* PDM_INTPEND: Pending interrupts */
  #define PDM_INTPEND_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define PDM_INTPEND_STARTED_Pos (0UL)
  #define PDM_INTPEND_STARTED_Msk (0x1UL << PDM_INTPEND_STARTED_Pos)
  #define PDM_INTPEND_STARTED_Min (0x0UL)
  #define PDM_INTPEND_STARTED_Max (0x1UL)
  #define PDM_INTPEND_STARTED_NotPending (0x0UL)
  #define PDM_INTPEND_STARTED_Pending (0x1UL)

/* STOPPED @Bit 1 : Read pending status of interrupt for event STOPPED */
  #define PDM_INTPEND_STOPPED_Pos (1UL)
  #define PDM_INTPEND_STOPPED_Msk (0x1UL << PDM_INTPEND_STOPPED_Pos)
  #define PDM_INTPEND_STOPPED_Min (0x0UL)
  #define PDM_INTPEND_STOPPED_Max (0x1UL)
  #define PDM_INTPEND_STOPPED_NotPending (0x0UL)
  #define PDM_INTPEND_STOPPED_Pending (0x1UL)

/* END @Bit 2 : Read pending status of interrupt for event END */
  #define PDM_INTPEND_END_Pos (2UL)
  #define PDM_INTPEND_END_Msk (0x1UL << PDM_INTPEND_END_Pos)
  #define PDM_INTPEND_END_Min (0x0UL)
  #define PDM_INTPEND_END_Max (0x1UL)
  #define PDM_INTPEND_END_NotPending (0x0UL)
  #define PDM_INTPEND_END_Pending (0x1UL)


/* PDM_ENABLE: PDM module enable register */
  #define PDM_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable or disable PDM module */
  #define PDM_ENABLE_ENABLE_Pos (0UL)
  #define PDM_ENABLE_ENABLE_Msk (0x1UL << PDM_ENABLE_ENABLE_Pos)
  #define PDM_ENABLE_ENABLE_Min (0x0UL)
  #define PDM_ENABLE_ENABLE_Max (0x1UL)
  #define PDM_ENABLE_ENABLE_Disabled (0x0UL)
  #define PDM_ENABLE_ENABLE_Enabled (0x1UL)


/* PDM_PDMCLKCTRL: PDM clock generator control */
  #define PDM_PDMCLKCTRL_ResetValue (0x08400000UL)

/* FREQ @Bits 0..31 : PDM_CLK frequency configuration. Enumerations are deprecated, use PDMCLKCTRL equation to find the register
                      value. The 12 least significant bits of the register are ignored and shall be set to zero. */

  #define PDM_PDMCLKCTRL_FREQ_Pos (0UL)
  #define PDM_PDMCLKCTRL_FREQ_Msk (0xFFFFFFFFUL << PDM_PDMCLKCTRL_FREQ_Pos)
  #define PDM_PDMCLKCTRL_FREQ_Min (0x8000000UL)
  #define PDM_PDMCLKCTRL_FREQ_Max (0xA800000UL)
  #define PDM_PDMCLKCTRL_FREQ_1000K (0x08000000UL)
  #define PDM_PDMCLKCTRL_FREQ_Default (0x08400000UL)
  #define PDM_PDMCLKCTRL_FREQ_1067K (0x08800000UL)
  #define PDM_PDMCLKCTRL_FREQ_1231K (0x09800000UL)
  #define PDM_PDMCLKCTRL_FREQ_1280K (0x0A000000UL)
  #define PDM_PDMCLKCTRL_FREQ_1333K (0x0A800000UL)


/* PDM_MODE: Defines the routing of the connected PDM microphones' signals */
  #define PDM_MODE_ResetValue (0x00000000UL)

/* OPERATION @Bit 0 : Mono or stereo operation */
  #define PDM_MODE_OPERATION_Pos (0UL)
  #define PDM_MODE_OPERATION_Msk (0x1UL << PDM_MODE_OPERATION_Pos)
  #define PDM_MODE_OPERATION_Min (0x0UL)
  #define PDM_MODE_OPERATION_Max (0x1UL)
  #define PDM_MODE_OPERATION_Stereo (0x0UL)          /*!< Sample and store one pair (left + right) of 16-bit samples per RAM
                                                          word R=[31:16]; L=[15:0]*/
  #define PDM_MODE_OPERATION_Mono (0x1UL)            /*!< Sample and store two successive left samples (16 bits each) per RAM
                                                          word L1=[31:16]; L0=[15:0]*/

/* EDGE @Bit 1 : Defines on which PDM_CLK edge left (or mono) is sampled. */
  #define PDM_MODE_EDGE_Pos (1UL)
  #define PDM_MODE_EDGE_Msk (0x1UL << PDM_MODE_EDGE_Pos)
  #define PDM_MODE_EDGE_Min (0x0UL)
  #define PDM_MODE_EDGE_Max (0x1UL)
  #define PDM_MODE_EDGE_LeftFalling (0x0UL)
  #define PDM_MODE_EDGE_LeftRising (0x1UL)


/* PDM_GAINL: Left output gain adjustment */
  #define PDM_GAINL_ResetValue (0x00000028UL)

/* GAINL @Bits 0..6 : Left output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)
                      0x00 -20 dB gain adjust 0x01 -19.5 dB gain adjust (...) 0x27 -0.5 dB gain adjust 0x28 0 dB gain adjust
                      0x29 +0.5 dB gain adjust (...) 0x4F +19.5 dB gain adjust 0x50 +20 dB gain adjust */

  #define PDM_GAINL_GAINL_Pos (0UL)
  #define PDM_GAINL_GAINL_Msk (0x7FUL << PDM_GAINL_GAINL_Pos)
  #define PDM_GAINL_GAINL_Min (0x0UL)
  #define PDM_GAINL_GAINL_Max (0x50UL)
  #define PDM_GAINL_GAINL_MinGain (0x00UL)
  #define PDM_GAINL_GAINL_DefaultGain (0x28UL)
  #define PDM_GAINL_GAINL_MaxGain (0x50UL)


/* PDM_GAINR: Right output gain adjustment */
  #define PDM_GAINR_ResetValue (0x00000028UL)

/* GAINR @Bits 0..6 : Right output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)
                      */

  #define PDM_GAINR_GAINR_Pos (0UL)
  #define PDM_GAINR_GAINR_Msk (0x7FUL << PDM_GAINR_GAINR_Pos)
  #define PDM_GAINR_GAINR_Min (0x0UL)
  #define PDM_GAINR_GAINR_Max (0x50UL)
  #define PDM_GAINR_GAINR_MinGain (0x00UL)
  #define PDM_GAINR_GAINR_DefaultGain (0x28UL)
  #define PDM_GAINR_GAINR_MaxGain (0x50UL)


/* PDM_RATIO: Selects the decimation ratio between PDM_CLK and output sample rate. Change PDMCLKCTRL accordingly. */
  #define PDM_RATIO_ResetValue (0x00000000UL)

/* RATIO @Bits 0..2 : Selects the decimation ratio between PDM_CLK and output sample rate */
  #define PDM_RATIO_RATIO_Pos (0UL)
  #define PDM_RATIO_RATIO_Msk (0x7UL << PDM_RATIO_RATIO_Pos)
  #define PDM_RATIO_RATIO_Min (0x0UL)
  #define PDM_RATIO_RATIO_Max (0x1UL)
  #define PDM_RATIO_RATIO_Ratio64 (0x0UL)
  #define PDM_RATIO_RATIO_Ratio80 (0x1UL)


