pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PDM_MCLKCONFIG: Master clock generator configuration */
  #define PDM_MCLKCONFIG_ResetValue (0x00000000UL)

/* SRC @Bit 0 : Master clock source selection */
  #define PDM_MCLKCONFIG_SRC_Pos (0UL)
  #define PDM_MCLKCONFIG_SRC_Msk (0x1UL << PDM_MCLKCONFIG_SRC_Pos)
  #define PDM_MCLKCONFIG_SRC_Min (0x0UL)
  #define PDM_MCLKCONFIG_SRC_Max (0x1UL)
  #define PDM_MCLKCONFIG_SRC_PCLK32M (0x0UL)
  #define PDM_MCLKCONFIG_SRC_ACLK (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           PPIB                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct PPIB_OVERFLOW =================================================== */
/**
  * @brief OVERFLOW [PPIB_OVERFLOW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SEND;                              /*!< (@ 0x00000000) The task overflow for SEND tasks using SUBSCRIBE_SEND.
                                                                         Write 0 to clear.*/
} NRF_PPIB_OVERFLOW_Type;

/* PPIB_OVERFLOW_SEND: The task overflow for SEND tasks using SUBSCRIBE_SEND. Write 0 to clear. */
  #define PPIB_OVERFLOW_SEND_ResetValue (0x00000000UL)

/* SEND0 @Bit 0 : The status for tasks overflow at SUBSCRIBE_SEND[0]. */
  #define PPIB_OVERFLOW_SEND_SEND0_Pos (0UL)
  #define PPIB_OVERFLOW_SEND_SEND0_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND0_Pos)
  #define PPIB_OVERFLOW_SEND_SEND0_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND0_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND0_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND0_NoOverflow (0x0UL)

/* SEND1 @Bit 1 : The status for tasks overflow at SUBSCRIBE_SEND[1]. */
  #define PPIB_OVERFLOW_SEND_SEND1_Pos (1UL)
  #define PPIB_OVERFLOW_SEND_SEND1_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND1_Pos)
  #define PPIB_OVERFLOW_SEND_SEND1_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND1_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND1_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND1_NoOverflow (0x0UL)

/* SEND2 @Bit 2 : The status for tasks overflow at SUBSCRIBE_SEND[2]. */
  #define PPIB_OVERFLOW_SEND_SEND2_Pos (2UL)
  #define PPIB_OVERFLOW_SEND_SEND2_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND2_Pos)
  #define PPIB_OVERFLOW_SEND_SEND2_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND2_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND2_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND2_NoOverflow (0x0UL)

/* SEND3 @Bit 3 : The status for tasks overflow at SUBSCRIBE_SEND[3]. */
  #define PPIB_OVERFLOW_SEND_SEND3_Pos (3UL)
  #define PPIB_OVERFLOW_SEND_SEND3_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND3_Pos)
  #define PPIB_OVERFLOW_SEND_SEND3_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND3_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND3_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND3_NoOverflow (0x0UL)

/* SEND4 @Bit 4 : The status for tasks overflow at SUBSCRIBE_SEND[4]. */
  #define PPIB_OVERFLOW_SEND_SEND4_Pos (4UL)
  #define PPIB_OVERFLOW_SEND_SEND4_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND4_Pos)
  #define PPIB_OVERFLOW_SEND_SEND4_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND4_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND4_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND4_NoOverflow (0x0UL)

/* SEND5 @Bit 5 : The status for tasks overflow at SUBSCRIBE_SEND[5]. */
  #define PPIB_OVERFLOW_SEND_SEND5_Pos (5UL)
  #define PPIB_OVERFLOW_SEND_SEND5_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND5_Pos)
  #define PPIB_OVERFLOW_SEND_SEND5_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND5_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND5_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND5_NoOverflow (0x0UL)

/* SEND6 @Bit 6 : The status for tasks overflow at SUBSCRIBE_SEND[6]. */
  #define PPIB_OVERFLOW_SEND_SEND6_Pos (6UL)
  #define PPIB_OVERFLOW_SEND_SEND6_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND6_Pos)
  #define PPIB_OVERFLOW_SEND_SEND6_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND6_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND6_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND6_NoOverflow (0x0UL)

/* SEND7 @Bit 7 : The status for tasks overflow at SUBSCRIBE_SEND[7]. */
  #define PPIB_OVERFLOW_SEND_SEND7_Pos (7UL)
  #define PPIB_OVERFLOW_SEND_SEND7_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND7_Pos)
  #define PPIB_OVERFLOW_SEND_SEND7_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND7_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND7_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND7_NoOverflow (0x0UL)

/* SEND8 @Bit 8 : The status for tasks overflow at SUBSCRIBE_SEND[8]. */
  #define PPIB_OVERFLOW_SEND_SEND8_Pos (8UL)
  #define PPIB_OVERFLOW_SEND_SEND8_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND8_Pos)
  #define PPIB_OVERFLOW_SEND_SEND8_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND8_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND8_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND8_NoOverflow (0x0UL)

/* SEND9 @Bit 9 : The status for tasks overflow at SUBSCRIBE_SEND[9]. */
  #define PPIB_OVERFLOW_SEND_SEND9_Pos (9UL)
  #define PPIB_OVERFLOW_SEND_SEND9_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND9_Pos)
  #define PPIB_OVERFLOW_SEND_SEND9_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND9_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND9_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND9_NoOverflow (0x0UL)

/* SEND10 @Bit 10 : The status for tasks overflow at SUBSCRIBE_SEND[10]. */
  #define PPIB_OVERFLOW_SEND_SEND10_Pos (10UL)
  #define PPIB_OVERFLOW_SEND_SEND10_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND10_Pos)
  #define PPIB_OVERFLOW_SEND_SEND10_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND10_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND10_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND10_NoOverflow (0x0UL)

/* SEND11 @Bit 11 : The status for tasks overflow at SUBSCRIBE_SEND[11]. */
  #define PPIB_OVERFLOW_SEND_SEND11_Pos (11UL)
  #define PPIB_OVERFLOW_SEND_SEND11_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND11_Pos)
  #define PPIB_OVERFLOW_SEND_SEND11_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND11_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND11_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND11_NoOverflow (0x0UL)

/* SEND12 @Bit 12 : The status for tasks overflow at SUBSCRIBE_SEND[12]. */
  #define PPIB_OVERFLOW_SEND_SEND12_Pos (12UL)
  #define PPIB_OVERFLOW_SEND_SEND12_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND12_Pos)
  #define PPIB_OVERFLOW_SEND_SEND12_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND12_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND12_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND12_NoOverflow (0x0UL)

/* SEND13 @Bit 13 : The status for tasks overflow at SUBSCRIBE_SEND[13]. */
  #define PPIB_OVERFLOW_SEND_SEND13_Pos (13UL)
  #define PPIB_OVERFLOW_SEND_SEND13_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND13_Pos)
  #define PPIB_OVERFLOW_SEND_SEND13_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND13_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND13_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND13_NoOverflow (0x0UL)

/* SEND14 @Bit 14 : The status for tasks overflow at SUBSCRIBE_SEND[14]. */
  #define PPIB_OVERFLOW_SEND_SEND14_Pos (14UL)
  #define PPIB_OVERFLOW_SEND_SEND14_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND14_Pos)
  #define PPIB_OVERFLOW_SEND_SEND14_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND14_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND14_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND14_NoOverflow (0x0UL)

/* SEND15 @Bit 15 : The status for tasks overflow at SUBSCRIBE_SEND[15]. */
  #define PPIB_OVERFLOW_SEND_SEND15_Pos (15UL)
  #define PPIB_OVERFLOW_SEND_SEND15_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND15_Pos)
  #define PPIB_OVERFLOW_SEND_SEND15_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND15_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND15_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND15_NoOverflow (0x0UL)

/* SEND16 @Bit 16 : The status for tasks overflow at SUBSCRIBE_SEND[16]. */
  #define PPIB_OVERFLOW_SEND_SEND16_Pos (16UL)
  #define PPIB_OVERFLOW_SEND_SEND16_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND16_Pos)
  #define PPIB_OVERFLOW_SEND_SEND16_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND16_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND16_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND16_NoOverflow (0x0UL)

/* SEND17 @Bit 17 : The status for tasks overflow at SUBSCRIBE_SEND[17]. */
  #define PPIB_OVERFLOW_SEND_SEND17_Pos (17UL)
  #define PPIB_OVERFLOW_SEND_SEND17_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND17_Pos)
  #define PPIB_OVERFLOW_SEND_SEND17_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND17_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND17_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND17_NoOverflow (0x0UL)

/* SEND18 @Bit 18 : The status for tasks overflow at SUBSCRIBE_SEND[18]. */
  #define PPIB_OVERFLOW_SEND_SEND18_Pos (18UL)
  #define PPIB_OVERFLOW_SEND_SEND18_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND18_Pos)
  #define PPIB_OVERFLOW_SEND_SEND18_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND18_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND18_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND18_NoOverflow (0x0UL)

/* SEND19 @Bit 19 : The status for tasks overflow at SUBSCRIBE_SEND[19]. */
  #define PPIB_OVERFLOW_SEND_SEND19_Pos (19UL)
  #define PPIB_OVERFLOW_SEND_SEND19_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND19_Pos)
  #define PPIB_OVERFLOW_SEND_SEND19_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND19_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND19_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND19_NoOverflow (0x0UL)

