pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SEND20 @Bit 20 : The status for tasks overflow at SUBSCRIBE_SEND[20]. */
  #define PPIB_OVERFLOW_SEND_SEND20_Pos (20UL)
  #define PPIB_OVERFLOW_SEND_SEND20_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND20_Pos)
  #define PPIB_OVERFLOW_SEND_SEND20_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND20_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND20_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND20_NoOverflow (0x0UL)

/* SEND21 @Bit 21 : The status for tasks overflow at SUBSCRIBE_SEND[21]. */
  #define PPIB_OVERFLOW_SEND_SEND21_Pos (21UL)
  #define PPIB_OVERFLOW_SEND_SEND21_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND21_Pos)
  #define PPIB_OVERFLOW_SEND_SEND21_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND21_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND21_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND21_NoOverflow (0x0UL)

/* SEND22 @Bit 22 : The status for tasks overflow at SUBSCRIBE_SEND[22]. */
  #define PPIB_OVERFLOW_SEND_SEND22_Pos (22UL)
  #define PPIB_OVERFLOW_SEND_SEND22_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND22_Pos)
  #define PPIB_OVERFLOW_SEND_SEND22_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND22_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND22_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND22_NoOverflow (0x0UL)

/* SEND23 @Bit 23 : The status for tasks overflow at SUBSCRIBE_SEND[23]. */
  #define PPIB_OVERFLOW_SEND_SEND23_Pos (23UL)
  #define PPIB_OVERFLOW_SEND_SEND23_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND23_Pos)
  #define PPIB_OVERFLOW_SEND_SEND23_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND23_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND23_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND23_NoOverflow (0x0UL)

/* SEND24 @Bit 24 : The status for tasks overflow at SUBSCRIBE_SEND[24]. */
  #define PPIB_OVERFLOW_SEND_SEND24_Pos (24UL)
  #define PPIB_OVERFLOW_SEND_SEND24_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND24_Pos)
  #define PPIB_OVERFLOW_SEND_SEND24_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND24_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND24_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND24_NoOverflow (0x0UL)

/* SEND25 @Bit 25 : The status for tasks overflow at SUBSCRIBE_SEND[25]. */
  #define PPIB_OVERFLOW_SEND_SEND25_Pos (25UL)
  #define PPIB_OVERFLOW_SEND_SEND25_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND25_Pos)
  #define PPIB_OVERFLOW_SEND_SEND25_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND25_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND25_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND25_NoOverflow (0x0UL)

/* SEND26 @Bit 26 : The status for tasks overflow at SUBSCRIBE_SEND[26]. */
  #define PPIB_OVERFLOW_SEND_SEND26_Pos (26UL)
  #define PPIB_OVERFLOW_SEND_SEND26_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND26_Pos)
  #define PPIB_OVERFLOW_SEND_SEND26_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND26_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND26_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND26_NoOverflow (0x0UL)

/* SEND27 @Bit 27 : The status for tasks overflow at SUBSCRIBE_SEND[27]. */
  #define PPIB_OVERFLOW_SEND_SEND27_Pos (27UL)
  #define PPIB_OVERFLOW_SEND_SEND27_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND27_Pos)
  #define PPIB_OVERFLOW_SEND_SEND27_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND27_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND27_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND27_NoOverflow (0x0UL)

/* SEND28 @Bit 28 : The status for tasks overflow at SUBSCRIBE_SEND[28]. */
  #define PPIB_OVERFLOW_SEND_SEND28_Pos (28UL)
  #define PPIB_OVERFLOW_SEND_SEND28_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND28_Pos)
  #define PPIB_OVERFLOW_SEND_SEND28_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND28_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND28_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND28_NoOverflow (0x0UL)

/* SEND29 @Bit 29 : The status for tasks overflow at SUBSCRIBE_SEND[29]. */
  #define PPIB_OVERFLOW_SEND_SEND29_Pos (29UL)
  #define PPIB_OVERFLOW_SEND_SEND29_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND29_Pos)
  #define PPIB_OVERFLOW_SEND_SEND29_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND29_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND29_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND29_NoOverflow (0x0UL)

/* SEND30 @Bit 30 : The status for tasks overflow at SUBSCRIBE_SEND[30]. */
  #define PPIB_OVERFLOW_SEND_SEND30_Pos (30UL)
  #define PPIB_OVERFLOW_SEND_SEND30_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND30_Pos)
  #define PPIB_OVERFLOW_SEND_SEND30_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND30_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND30_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND30_NoOverflow (0x0UL)

/* SEND31 @Bit 31 : The status for tasks overflow at SUBSCRIBE_SEND[31]. */
  #define PPIB_OVERFLOW_SEND_SEND31_Pos (31UL)
  #define PPIB_OVERFLOW_SEND_SEND31_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND31_Pos)
  #define PPIB_OVERFLOW_SEND_SEND31_Min (0x0UL)
  #define PPIB_OVERFLOW_SEND_SEND31_Max (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND31_Overflow (0x1UL)
  #define PPIB_OVERFLOW_SEND_SEND31_NoOverflow (0x0UL)


/* ======================================================= Struct PPIB ======================================================= */
/**
  * @brief PPIB APB registers
  */
  typedef struct {
    __OM uint32_t TASKS_SEND[32];                    /*!< (@ 0x00000000) This task is unused, but the PPIB provides the
                                                                         SUBSCRIBE task to connect SEND [n] task.*/
    __IOM uint32_t SUBSCRIBE_SEND[32];
    __IOM uint32_t EVENTS_RECEIVE[32];               /*!< (@ 0x00000100) This event is unused, but the PPIB provides the PUBLISH
                                                                         event to connect RECEIVE [n] event.*/
    __IOM uint32_t PUBLISH_RECEIVE[32];
    __IM uint32_t RESERVED[128];
    __IOM NRF_PPIB_OVERFLOW_Type OVERFLOW;
  } NRF_PPIB_Type;

/* PPIB_TASKS_SEND: This task is unused, but the PPIB provides the SUBSCRIBE task to connect SEND [n] task. */
  #define PPIB_TASKS_SEND_MaxCount (32UL)
  #define PPIB_TASKS_SEND_MaxIndex (31UL)
  #define PPIB_TASKS_SEND_MinIndex (0UL)
  #define PPIB_TASKS_SEND_ResetValue (0x00000000UL)

/* TASKS_SEND @Bit 0 : This task is unused, but the PPIB provides the SUBSCRIBE task to connect SEND [n] task. */
  #define PPIB_TASKS_SEND_TASKS_SEND_Pos (0UL)
  #define PPIB_TASKS_SEND_TASKS_SEND_Msk (0x1UL << PPIB_TASKS_SEND_TASKS_SEND_Pos)
  #define PPIB_TASKS_SEND_TASKS_SEND_Min (0x1UL)
  #define PPIB_TASKS_SEND_TASKS_SEND_Max (0x1UL)
  #define PPIB_TASKS_SEND_TASKS_SEND_Trigger (0x1UL)


/* PPIB_SUBSCRIBE_SEND: Subscribe configuration for task SEND[n] */
  #define PPIB_SUBSCRIBE_SEND_MaxCount (32UL)
  #define PPIB_SUBSCRIBE_SEND_MaxIndex (31UL)
  #define PPIB_SUBSCRIBE_SEND_MinIndex (0UL)
  #define PPIB_SUBSCRIBE_SEND_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SEND[n] will subscribe to */
  #define PPIB_SUBSCRIBE_SEND_CHIDX_Pos (0UL)
  #define PPIB_SUBSCRIBE_SEND_CHIDX_Msk (0xFFUL << PPIB_SUBSCRIBE_SEND_CHIDX_Pos)
  #define PPIB_SUBSCRIBE_SEND_CHIDX_Min (0x00UL)
  #define PPIB_SUBSCRIBE_SEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PPIB_SUBSCRIBE_SEND_EN_Pos (31UL)
  #define PPIB_SUBSCRIBE_SEND_EN_Msk (0x1UL << PPIB_SUBSCRIBE_SEND_EN_Pos)
  #define PPIB_SUBSCRIBE_SEND_EN_Min (0x0UL)
  #define PPIB_SUBSCRIBE_SEND_EN_Max (0x1UL)
  #define PPIB_SUBSCRIBE_SEND_EN_Disabled (0x0UL)
  #define PPIB_SUBSCRIBE_SEND_EN_Enabled (0x1UL)


/* PPIB_EVENTS_RECEIVE: This event is unused, but the PPIB provides the PUBLISH event to connect RECEIVE [n] event. */
  #define PPIB_EVENTS_RECEIVE_MaxCount (32UL)
  #define PPIB_EVENTS_RECEIVE_MaxIndex (31UL)
  #define PPIB_EVENTS_RECEIVE_MinIndex (0UL)
  #define PPIB_EVENTS_RECEIVE_ResetValue (0x00000000UL)

/* EVENTS_RECEIVE @Bit 0 : This event is unused, but the PPIB provides the PUBLISH event to connect RECEIVE [n] event. */
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos (0UL)
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Msk (0x1UL << PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos) /*!< Bit mask of
                                                                            EVENTS_RECEIVE field.*/
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Min (0x0UL)
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Max (0x1UL)
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_NotGenerated (0x0UL)
  #define PPIB_EVENTS_RECEIVE_EVENTS_RECEIVE_Generated (0x1UL)


/* PPIB_PUBLISH_RECEIVE: Publish configuration for event RECEIVE[n] */
  #define PPIB_PUBLISH_RECEIVE_MaxCount (32UL)
  #define PPIB_PUBLISH_RECEIVE_MaxIndex (31UL)
  #define PPIB_PUBLISH_RECEIVE_MinIndex (0UL)
  #define PPIB_PUBLISH_RECEIVE_ResetValue (0x00000000UL)

