pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Pos (0UL)
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << PPIB_PUBLISH_RECEIVE_CHIDX_Pos)
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PPIB_PUBLISH_RECEIVE_EN_Pos (31UL)
  #define PPIB_PUBLISH_RECEIVE_EN_Msk (0x1UL << PPIB_PUBLISH_RECEIVE_EN_Pos)
  #define PPIB_PUBLISH_RECEIVE_EN_Min (0x0UL)
  #define PPIB_PUBLISH_RECEIVE_EN_Max (0x1UL)
  #define PPIB_PUBLISH_RECEIVE_EN_Disabled (0x0UL)
  #define PPIB_PUBLISH_RECEIVE_EN_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PWM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct PWM_TASKS_DMA_SEQ ================================================= */
/**
  * @brief SEQ [PWM_TASKS_DMA_SEQ] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/
  __OM  uint32_t  STOP;                              /*!< (@ 0x00000004) Stops operation using easyDMA. This does not trigger an
                                                                         END event.*/
} NRF_PWM_TASKS_DMA_SEQ_Type;
  #define PWM_TASKS_DMA_SEQ_MaxCount (2UL)
  #define PWM_TASKS_DMA_SEQ_MaxIndex (1UL)
  #define PWM_TASKS_DMA_SEQ_MinIndex (0UL)

/* PWM_TASKS_DMA_SEQ_START: Starts operation using easyDMA to load the values. See peripheral description for operation using
                             easyDMA. */

  #define PWM_TASKS_DMA_SEQ_START_ResetValue (0x00000000UL)

/* START @Bit 0 : Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA. */
  #define PWM_TASKS_DMA_SEQ_START_START_Pos (0UL)
  #define PWM_TASKS_DMA_SEQ_START_START_Msk (0x1UL << PWM_TASKS_DMA_SEQ_START_START_Pos)
  #define PWM_TASKS_DMA_SEQ_START_START_Min (0x1UL)
  #define PWM_TASKS_DMA_SEQ_START_START_Max (0x1UL)
  #define PWM_TASKS_DMA_SEQ_START_START_Trigger (0x1UL)


/* PWM_TASKS_DMA_SEQ_STOP: Stops operation using easyDMA. This does not trigger an END event. */
  #define PWM_TASKS_DMA_SEQ_STOP_ResetValue (0x00000000UL)

/* STOP @Bit 0 : Stops operation using easyDMA. This does not trigger an END event. */
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Pos (0UL)
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Msk (0x1UL << PWM_TASKS_DMA_SEQ_STOP_STOP_Pos)
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Min (0x1UL)
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Max (0x1UL)
  #define PWM_TASKS_DMA_SEQ_STOP_STOP_Trigger (0x1UL)



/* ================================================== Struct PWM_TASKS_DMA =================================================== */
/**
  * @brief TASKS_DMA [PWM_TASKS_DMA] Peripheral tasks.
  */
typedef struct {
  __OM  NRF_PWM_TASKS_DMA_SEQ_Type SEQ[2];
} NRF_PWM_TASKS_DMA_Type;


/* ============================================== Struct PWM_SUBSCRIBE_DMA_SEQ =============================================== */
/**
  * @brief SEQ [PWM_SUBSCRIBE_DMA_SEQ] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  START;
  __IOM uint32_t  STOP;
} NRF_PWM_SUBSCRIBE_DMA_SEQ_Type;
  #define PWM_SUBSCRIBE_DMA_SEQ_MaxCount (2UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_MaxIndex (1UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_MinIndex (0UL)

/* PWM_SUBSCRIBE_DMA_SEQ_START: Subscribe configuration for task START */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Pos (0UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Pos)
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Min (0x00UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Pos (31UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Msk (0x1UL << PWM_SUBSCRIBE_DMA_SEQ_START_EN_Pos)
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Min (0x0UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Max (0x1UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Disabled (0x0UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Enabled (0x1UL)


/* PWM_SUBSCRIBE_DMA_SEQ_STOP: Subscribe configuration for task STOP */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Pos (0UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Pos)
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Min (0x00UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Pos (31UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Msk (0x1UL << PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Pos)
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Min (0x0UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Max (0x1UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Disabled (0x0UL)
  #define PWM_SUBSCRIBE_DMA_SEQ_STOP_EN_Enabled (0x1UL)



/* ================================================ Struct PWM_SUBSCRIBE_DMA ================================================= */
/**
  * @brief SUBSCRIBE_DMA [PWM_SUBSCRIBE_DMA] Subscribe configuration for tasks
  */
typedef struct {
  __IOM NRF_PWM_SUBSCRIBE_DMA_SEQ_Type SEQ[2];
} NRF_PWM_SUBSCRIBE_DMA_Type;


/* ================================================ Struct PWM_EVENTS_DMA_SEQ ================================================ */
/**
  * @brief SEQ [PWM_EVENTS_DMA_SEQ] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;
} NRF_PWM_EVENTS_DMA_SEQ_Type;
  #define PWM_EVENTS_DMA_SEQ_MaxCount (2UL)
  #define PWM_EVENTS_DMA_SEQ_MaxIndex (1UL)
  #define PWM_EVENTS_DMA_SEQ_MinIndex (0UL)

/* PWM_EVENTS_DMA_SEQ_END: Generated after all MAXCNT bytes have been transferred */
  #define PWM_EVENTS_DMA_SEQ_END_ResetValue (0x00000000UL)

