pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* END @Bit 0 : Generated after all MAXCNT bytes have been transferred */
  #define PWM_EVENTS_DMA_SEQ_END_END_Pos (0UL)
  #define PWM_EVENTS_DMA_SEQ_END_END_Msk (0x1UL << PWM_EVENTS_DMA_SEQ_END_END_Pos)
  #define PWM_EVENTS_DMA_SEQ_END_END_Min (0x0UL)
  #define PWM_EVENTS_DMA_SEQ_END_END_Max (0x1UL)
  #define PWM_EVENTS_DMA_SEQ_END_END_NotGenerated (0x0UL)
  #define PWM_EVENTS_DMA_SEQ_END_END_Generated (0x1UL)


/* PWM_EVENTS_DMA_SEQ_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                              to be written to prepare for the next sequence. */

  #define PWM_EVENTS_DMA_SEQ_READY_ResetValue (0x00000000UL)

/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */

  #define PWM_EVENTS_DMA_SEQ_READY_READY_Pos (0UL)
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Msk (0x1UL << PWM_EVENTS_DMA_SEQ_READY_READY_Pos)
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Min (0x0UL)
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Max (0x1UL)
  #define PWM_EVENTS_DMA_SEQ_READY_READY_NotGenerated (0x0UL)
  #define PWM_EVENTS_DMA_SEQ_READY_READY_Generated (0x1UL)


/* PWM_EVENTS_DMA_SEQ_BUSERROR: An error occured during the bus transfer. */
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bit 0 : An error occured during the bus transfer. */
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Pos (0UL)
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Msk (0x1UL << PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Min (0x0UL)
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Max (0x1UL)
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_NotGenerated (0x0UL)
  #define PWM_EVENTS_DMA_SEQ_BUSERROR_BUSERROR_Generated (0x1UL)



/* ================================================== Struct PWM_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [PWM_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM NRF_PWM_EVENTS_DMA_SEQ_Type SEQ[2];
} NRF_PWM_EVENTS_DMA_Type;


/* =============================================== Struct PWM_PUBLISH_DMA_SEQ ================================================ */
/**
  * @brief SEQ [PWM_PUBLISH_DMA_SEQ] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;
  __IOM uint32_t  BUSERROR;
} NRF_PWM_PUBLISH_DMA_SEQ_Type;
  #define PWM_PUBLISH_DMA_SEQ_MaxCount (2UL)
  #define PWM_PUBLISH_DMA_SEQ_MaxIndex (1UL)
  #define PWM_PUBLISH_DMA_SEQ_MinIndex (0UL)

/* PWM_PUBLISH_DMA_SEQ_END: Publish configuration for event END */
  #define PWM_PUBLISH_DMA_SEQ_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define PWM_PUBLISH_DMA_SEQ_END_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_DMA_SEQ_END_CHIDX_Msk (0xFFUL << PWM_PUBLISH_DMA_SEQ_END_CHIDX_Pos)
  #define PWM_PUBLISH_DMA_SEQ_END_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_DMA_SEQ_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Pos (31UL)
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Msk (0x1UL << PWM_PUBLISH_DMA_SEQ_END_EN_Pos)
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Min (0x0UL)
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Max (0x1UL)
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_DMA_SEQ_END_EN_Enabled (0x1UL)


/* PWM_PUBLISH_DMA_SEQ_READY: Publish configuration for event READY */
  #define PWM_PUBLISH_DMA_SEQ_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Msk (0xFFUL << PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Pos)
  #define PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_DMA_SEQ_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Pos (31UL)
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Msk (0x1UL << PWM_PUBLISH_DMA_SEQ_READY_EN_Pos)
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Min (0x0UL)
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Max (0x1UL)
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_DMA_SEQ_READY_EN_Enabled (0x1UL)


/* PWM_PUBLISH_DMA_SEQ_BUSERROR: Publish configuration for event BUSERROR */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Msk (0xFFUL << PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Pos (31UL)
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Msk (0x1UL << PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Pos)
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Min (0x0UL)
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Max (0x1UL)
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_DMA_SEQ_BUSERROR_EN_Enabled (0x1UL)



/* ================================================= Struct PWM_PUBLISH_DMA ================================================== */
/**
  * @brief PUBLISH_DMA [PWM_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM NRF_PWM_PUBLISH_DMA_SEQ_Type SEQ[2];
} NRF_PWM_PUBLISH_DMA_Type;


/* ===================================================== Struct PWM_SEQ ====================================================== */
/**
  * @brief SEQ [PWM_SEQ] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  REFRESH;                           /*!< (@ 0x00000008) Number of additional PWM periods between samples loaded
                                                                         into compare register*/
  __IOM uint32_t  ENDDELAY;
  __IM  uint32_t  RESERVED1[4];
} NRF_PWM_SEQ_Type;
  #define PWM_SEQ_MaxCount (2UL)
  #define PWM_SEQ_MaxIndex (1UL)
  #define PWM_SEQ_MinIndex (0UL)

/* PWM_SEQ_REFRESH: Number of additional PWM periods between samples loaded into compare register */
  #define PWM_SEQ_REFRESH_ResetValue (0x00000001UL)

/* CNT @Bits 0..23 : Number of additional PWM periods between samples loaded into compare register (load every REFRESH.CNT+1 PWM
                     periods) */

  #define PWM_SEQ_REFRESH_CNT_Pos (0UL)
  #define PWM_SEQ_REFRESH_CNT_Msk (0xFFFFFFUL << PWM_SEQ_REFRESH_CNT_Pos)
  #define PWM_SEQ_REFRESH_CNT_Min (0x0UL)
  #define PWM_SEQ_REFRESH_CNT_Max (0x0UL)
  #define PWM_SEQ_REFRESH_CNT_Continuous (0x000000UL)


/* PWM_SEQ_ENDDELAY: Time added after the sequence */
  #define PWM_SEQ_ENDDELAY_ResetValue (0x00000000UL)

