pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CNT @Bits 0..23 : Time added after the sequence in PWM periods */
  #define PWM_SEQ_ENDDELAY_CNT_Pos (0UL)
  #define PWM_SEQ_ENDDELAY_CNT_Msk (0xFFFFFFUL << PWM_SEQ_ENDDELAY_CNT_Pos)



/* ===================================================== Struct PWM_PSEL ===================================================== */
/**
  * @brief PSEL [PWM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OUT[4];
} NRF_PWM_PSEL_Type;

/* PWM_PSEL_OUT: Output pin select for PWM channel n */
  #define PWM_PSEL_OUT_MaxCount (4UL)
  #define PWM_PSEL_OUT_MaxIndex (3UL)
  #define PWM_PSEL_OUT_MinIndex (0UL)
  #define PWM_PSEL_OUT_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define PWM_PSEL_OUT_PIN_Pos (0UL)
  #define PWM_PSEL_OUT_PIN_Msk (0x1FUL << PWM_PSEL_OUT_PIN_Pos)
  #define PWM_PSEL_OUT_PIN_Min (0x00UL)
  #define PWM_PSEL_OUT_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define PWM_PSEL_OUT_PORT_Pos (5UL)
  #define PWM_PSEL_OUT_PORT_Msk (0xFUL << PWM_PSEL_OUT_PORT_Pos)
  #define PWM_PSEL_OUT_PORT_Min (0x0UL)
  #define PWM_PSEL_OUT_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define PWM_PSEL_OUT_CONNECT_Pos (31UL)
  #define PWM_PSEL_OUT_CONNECT_Msk (0x1UL << PWM_PSEL_OUT_CONNECT_Pos)
  #define PWM_PSEL_OUT_CONNECT_Min (0x0UL)
  #define PWM_PSEL_OUT_CONNECT_Max (0x1UL)
  #define PWM_PSEL_OUT_CONNECT_Disconnected (0x1UL)
  #define PWM_PSEL_OUT_CONNECT_Connected (0x0UL)



/* =================================================== Struct PWM_DMA_SEQ ==================================================== */
/**
  * @brief SEQ [PWM_DMA_SEQ] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event.*/
  __IM  uint32_t  CURRENTAMOUNT;
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_PWM_DMA_SEQ_Type;
  #define PWM_DMA_SEQ_MaxCount (2UL)
  #define PWM_DMA_SEQ_MaxIndex (1UL)
  #define PWM_DMA_SEQ_MinIndex (0UL)

/* PWM_DMA_SEQ_PTR: RAM buffer start address */
  #define PWM_DMA_SEQ_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define PWM_DMA_SEQ_PTR_PTR_Pos (0UL)
  #define PWM_DMA_SEQ_PTR_PTR_Msk (0xFFFFFFFFUL << PWM_DMA_SEQ_PTR_PTR_Pos)


/* PWM_DMA_SEQ_MAXCNT: Maximum number of bytes in channel buffer */
  #define PWM_DMA_SEQ_MAXCNT_ResetValue (0x00000000UL)

/* MAXCNT @Bits 0..14 : Maximum number of bytes in channel buffer */
  #define PWM_DMA_SEQ_MAXCNT_MAXCNT_Pos (0UL)
  #define PWM_DMA_SEQ_MAXCNT_MAXCNT_Msk (0x7FFFUL << PWM_DMA_SEQ_MAXCNT_MAXCNT_Pos)
  #define PWM_DMA_SEQ_MAXCNT_MAXCNT_Min (0x0001UL)
  #define PWM_DMA_SEQ_MAXCNT_MAXCNT_Max (0x7FFFUL)


/* PWM_DMA_SEQ_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. */
  #define PWM_DMA_SEQ_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define PWM_DMA_SEQ_AMOUNT_AMOUNT_Pos (0UL)
  #define PWM_DMA_SEQ_AMOUNT_AMOUNT_Msk (0x7FFFUL << PWM_DMA_SEQ_AMOUNT_AMOUNT_Pos)
  #define PWM_DMA_SEQ_AMOUNT_AMOUNT_Min (0x0001UL)
  #define PWM_DMA_SEQ_AMOUNT_AMOUNT_Max (0x7FFFUL)


/* PWM_DMA_SEQ_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define PWM_DMA_SEQ_CURRENTAMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define PWM_DMA_SEQ_CURRENTAMOUNT_AMOUNT_Pos (0UL)
  #define PWM_DMA_SEQ_CURRENTAMOUNT_AMOUNT_Msk (0x7FFFUL << PWM_DMA_SEQ_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/
  #define PWM_DMA_SEQ_CURRENTAMOUNT_AMOUNT_Min (0x0001UL)
  #define PWM_DMA_SEQ_CURRENTAMOUNT_AMOUNT_Max (0x7FFFUL)


/* PWM_DMA_SEQ_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define PWM_DMA_SEQ_TERMINATEONBUSERROR_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : (unspecified) */
  #define PWM_DMA_SEQ_TERMINATEONBUSERROR_ENABLE_Pos (0UL)
  #define PWM_DMA_SEQ_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << PWM_DMA_SEQ_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define PWM_DMA_SEQ_TERMINATEONBUSERROR_ENABLE_Min (0x0UL)
  #define PWM_DMA_SEQ_TERMINATEONBUSERROR_ENABLE_Max (0x1UL)
  #define PWM_DMA_SEQ_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL)
  #define PWM_DMA_SEQ_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL)


/* PWM_DMA_SEQ_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define PWM_DMA_SEQ_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define PWM_DMA_SEQ_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define PWM_DMA_SEQ_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << PWM_DMA_SEQ_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ===================================================== Struct PWM_DMA ====================================================== */
/**
  * @brief DMA [PWM_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_PWM_DMA_SEQ_Type SEQ[2];
} NRF_PWM_DMA_Type;

/* ======================================================= Struct PWM ======================================================== */
/**
  * @brief Pulse width modulation unit
  */
  typedef struct {
    __IM uint32_t RESERVED;
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stops PWM pulse generation on all channels at the end
                                                                         of current PWM period, and stops sequence playback*/
    __OM uint32_t TASKS_NEXTSTEP;                    /*!< (@ 0x00000008) Steps by one value in the current sequence on all
                                                                         enabled channels if DECODER.MODE=NextStep. Does not
                                                                         cause PWM generation to start if not running.*/
    __IM uint32_t RESERVED1;
    __OM NRF_PWM_TASKS_DMA_Type TASKS_DMA;
    __IM uint32_t RESERVED2[25];
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_NEXTSTEP;
    __IM uint32_t RESERVED3;
    __IOM NRF_PWM_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA;
    __IM uint32_t RESERVED4[25];
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) Response to STOP task, emitted when PWM pulses are no
                                                                         longer generated*/
    __IOM uint32_t EVENTS_SEQSTARTED[2];
    __IOM uint32_t EVENTS_SEQEND[2];                 /*!< (@ 0x00000110) Emitted at end of every sequence n, when last value
                                                                         from RAM has been applied to wave counter*/
    __IOM uint32_t EVENTS_PWMPERIODEND;
    __IOM uint32_t EVENTS_LOOPSDONE;                 /*!< (@ 0x0000011C) Concatenated sequences have been played the amount of
                                                                         times defined in LOOP.CNT*/
    __IOM uint32_t EVENTS_RAMUNDERFLOW;              /*!< (@ 0x00000120) Emitted when retrieving from RAM does not complete in
                                                                         time for the PWM module*/
    __IOM NRF_PWM_EVENTS_DMA_Type EVENTS_DMA;
    __IOM uint32_t EVENTS_COMPAREMATCH[4];           /*!< (@ 0x0000013C) This event is generated when the compare matches for
                                                                         the compare channel [n].*/
    __IM uint32_t RESERVED5[14];
    __IOM uint32_t PUBLISH_STOPPED;
    __IOM uint32_t PUBLISH_SEQSTARTED[2];
    __IOM uint32_t PUBLISH_SEQEND[2];
    __IOM uint32_t PUBLISH_PWMPERIODEND;
    __IOM uint32_t PUBLISH_LOOPSDONE;
    __IOM uint32_t PUBLISH_RAMUNDERFLOW;
    __IOM NRF_PWM_PUBLISH_DMA_Type PUBLISH_DMA;
    __IOM uint32_t PUBLISH_COMPAREMATCH[4];
    __IM uint32_t RESERVED6[13];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED7[63];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED8[124];
    __IOM uint32_t ENABLE;
    __IOM uint32_t MODE;
    __IOM uint32_t COUNTERTOP;
    __IOM uint32_t PRESCALER;
    __IOM uint32_t DECODER;
    __IOM uint32_t LOOP;
    __IOM uint32_t IDLEOUT;                          /*!< (@ 0x00000518) Configure the output value on the PWM channel during
                                                                         idle*/
    __IM uint32_t RESERVED9;
    __IOM NRF_PWM_SEQ_Type SEQ[2];
    __IOM NRF_PWM_PSEL_Type PSEL;
    __IM uint32_t RESERVED10[100];
    __IOM NRF_PWM_DMA_Type DMA;
  } NRF_PWM_Type;

/* PWM_TASKS_STOP: Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback */
  #define PWM_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stops PWM pulse generation on all channels at the end of current PWM period, and stops sequence playback
                       */

  #define PWM_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define PWM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << PWM_TASKS_STOP_TASKS_STOP_Pos)
  #define PWM_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define PWM_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define PWM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* PWM_TASKS_NEXTSTEP: Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not
                        cause PWM generation to start if not running. */

  #define PWM_TASKS_NEXTSTEP_ResetValue (0x00000000UL)

