pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS_NEXTSTEP @Bit 0 : Steps by one value in the current sequence on all enabled channels if DECODER.MODE=NextStep. Does not
                           cause PWM generation to start if not running. */

  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Pos (0UL)
  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Msk (0x1UL << PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Pos) /*!< Bit mask of TASKS_NEXTSTEP
                                                                            field.*/
  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Min (0x1UL)
  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Max (0x1UL)
  #define PWM_TASKS_NEXTSTEP_TASKS_NEXTSTEP_Trigger (0x1UL)


/* PWM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define PWM_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define PWM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define PWM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_STOP_CHIDX_Pos)
  #define PWM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define PWM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define PWM_SUBSCRIBE_STOP_EN_Msk (0x1UL << PWM_SUBSCRIBE_STOP_EN_Pos)
  #define PWM_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define PWM_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define PWM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define PWM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* PWM_SUBSCRIBE_NEXTSTEP: Subscribe configuration for task NEXTSTEP */
  #define PWM_SUBSCRIBE_NEXTSTEP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task NEXTSTEP will subscribe to */
  #define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Pos (0UL)
  #define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Pos)
  #define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Min (0x00UL)
  #define PWM_SUBSCRIBE_NEXTSTEP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Pos (31UL)
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Msk (0x1UL << PWM_SUBSCRIBE_NEXTSTEP_EN_Pos)
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Min (0x0UL)
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Max (0x1UL)
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Disabled (0x0UL)
  #define PWM_SUBSCRIBE_NEXTSTEP_EN_Enabled (0x1UL)


/* PWM_EVENTS_STOPPED: Response to STOP task, emitted when PWM pulses are no longer generated */
  #define PWM_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : Response to STOP task, emitted when PWM pulses are no longer generated */
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << PWM_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define PWM_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* PWM_EVENTS_SEQSTARTED: First PWM period started on sequence n */
  #define PWM_EVENTS_SEQSTARTED_MaxCount (2UL)
  #define PWM_EVENTS_SEQSTARTED_MaxIndex (1UL)
  #define PWM_EVENTS_SEQSTARTED_MinIndex (0UL)
  #define PWM_EVENTS_SEQSTARTED_ResetValue (0x00000000UL)

/* EVENTS_SEQSTARTED @Bit 0 : First PWM period started on sequence n */
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Pos (0UL)
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Msk (0x1UL << PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_SEQSTARTED field.*/
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Min (0x0UL)
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Max (0x1UL)
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_NotGenerated (0x0UL)
  #define PWM_EVENTS_SEQSTARTED_EVENTS_SEQSTARTED_Generated (0x1UL)


/* PWM_EVENTS_SEQEND: Emitted at end of every sequence n, when last value from RAM has been applied to wave counter */
  #define PWM_EVENTS_SEQEND_MaxCount (2UL)
  #define PWM_EVENTS_SEQEND_MaxIndex (1UL)
  #define PWM_EVENTS_SEQEND_MinIndex (0UL)
  #define PWM_EVENTS_SEQEND_ResetValue (0x00000000UL)

/* EVENTS_SEQEND @Bit 0 : Emitted at end of every sequence n, when last value from RAM has been applied to wave counter */
  #define PWM_EVENTS_SEQEND_EVENTS_SEQEND_Pos (0UL)
  #define PWM_EVENTS_SEQEND_EVENTS_SEQEND_Msk (0x1UL << PWM_EVENTS_SEQEND_EVENTS_SEQEND_Pos) /*!< Bit mask of EVENTS_SEQEND
                                                                            field.*/
  #define PWM_EVENTS_SEQEND_EVENTS_SEQEND_Min (0x0UL)
  #define PWM_EVENTS_SEQEND_EVENTS_SEQEND_Max (0x1UL)
  #define PWM_EVENTS_SEQEND_EVENTS_SEQEND_NotGenerated (0x0UL)
  #define PWM_EVENTS_SEQEND_EVENTS_SEQEND_Generated (0x1UL)


/* PWM_EVENTS_PWMPERIODEND: Emitted at the end of each PWM period */
  #define PWM_EVENTS_PWMPERIODEND_ResetValue (0x00000000UL)

/* EVENTS_PWMPERIODEND @Bit 0 : Emitted at the end of each PWM period */
  #define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Pos (0UL)
  #define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Msk (0x1UL << PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Pos) /*!< Bit
                                                                            mask of EVENTS_PWMPERIODEND field.*/
  #define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Min (0x0UL)
  #define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Max (0x1UL)
  #define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_NotGenerated (0x0UL)
  #define PWM_EVENTS_PWMPERIODEND_EVENTS_PWMPERIODEND_Generated (0x1UL)


/* PWM_EVENTS_LOOPSDONE: Concatenated sequences have been played the amount of times defined in LOOP.CNT */
  #define PWM_EVENTS_LOOPSDONE_ResetValue (0x00000000UL)

/* EVENTS_LOOPSDONE @Bit 0 : Concatenated sequences have been played the amount of times defined in LOOP.CNT */
  #define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Pos (0UL)
  #define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Msk (0x1UL << PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Pos) /*!< Bit mask of
                                                                            EVENTS_LOOPSDONE field.*/
  #define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Min (0x0UL)
  #define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Max (0x1UL)
  #define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_NotGenerated (0x0UL)
  #define PWM_EVENTS_LOOPSDONE_EVENTS_LOOPSDONE_Generated (0x1UL)


/* PWM_EVENTS_RAMUNDERFLOW: Emitted when retrieving from RAM does not complete in time for the PWM module */
  #define PWM_EVENTS_RAMUNDERFLOW_ResetValue (0x00000000UL)

/* EVENTS_RAMUNDERFLOW @Bit 0 : Emitted when retrieving from RAM does not complete in time for the PWM module */
  #define PWM_EVENTS_RAMUNDERFLOW_EVENTS_RAMUNDERFLOW_Pos (0UL)
  #define PWM_EVENTS_RAMUNDERFLOW_EVENTS_RAMUNDERFLOW_Msk (0x1UL << PWM_EVENTS_RAMUNDERFLOW_EVENTS_RAMUNDERFLOW_Pos) /*!< Bit
                                                                            mask of EVENTS_RAMUNDERFLOW field.*/
  #define PWM_EVENTS_RAMUNDERFLOW_EVENTS_RAMUNDERFLOW_Min (0x0UL)
  #define PWM_EVENTS_RAMUNDERFLOW_EVENTS_RAMUNDERFLOW_Max (0x1UL)
  #define PWM_EVENTS_RAMUNDERFLOW_EVENTS_RAMUNDERFLOW_NotGenerated (0x0UL)
  #define PWM_EVENTS_RAMUNDERFLOW_EVENTS_RAMUNDERFLOW_Generated (0x1UL)


/* PWM_EVENTS_COMPAREMATCH: This event is generated when the compare matches for the compare channel [n]. */
  #define PWM_EVENTS_COMPAREMATCH_MaxCount (4UL)
  #define PWM_EVENTS_COMPAREMATCH_MaxIndex (3UL)
  #define PWM_EVENTS_COMPAREMATCH_MinIndex (0UL)
  #define PWM_EVENTS_COMPAREMATCH_ResetValue (0x00000000UL)

/* EVENTS_COMPAREMATCH @Bit 0 : This event is generated when the compare matches for the compare channel [n]. */
  #define PWM_EVENTS_COMPAREMATCH_EVENTS_COMPAREMATCH_Pos (0UL)
  #define PWM_EVENTS_COMPAREMATCH_EVENTS_COMPAREMATCH_Msk (0x1UL << PWM_EVENTS_COMPAREMATCH_EVENTS_COMPAREMATCH_Pos) /*!< Bit
                                                                            mask of EVENTS_COMPAREMATCH field.*/
  #define PWM_EVENTS_COMPAREMATCH_EVENTS_COMPAREMATCH_Min (0x0UL)
  #define PWM_EVENTS_COMPAREMATCH_EVENTS_COMPAREMATCH_Max (0x1UL)
  #define PWM_EVENTS_COMPAREMATCH_EVENTS_COMPAREMATCH_NotGenerated (0x0UL)
  #define PWM_EVENTS_COMPAREMATCH_EVENTS_COMPAREMATCH_Generated (0x1UL)


/* PWM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define PWM_PUBLISH_STOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define PWM_PUBLISH_STOPPED_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << PWM_PUBLISH_STOPPED_CHIDX_Pos)
  #define PWM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_STOPPED_EN_Pos (31UL)
  #define PWM_PUBLISH_STOPPED_EN_Msk (0x1UL << PWM_PUBLISH_STOPPED_EN_Pos)
  #define PWM_PUBLISH_STOPPED_EN_Min (0x0UL)
  #define PWM_PUBLISH_STOPPED_EN_Max (0x1UL)
  #define PWM_PUBLISH_STOPPED_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_STOPPED_EN_Enabled (0x1UL)


/* PWM_PUBLISH_SEQSTARTED: Publish configuration for event SEQSTARTED[n] */
  #define PWM_PUBLISH_SEQSTARTED_MaxCount (2UL)
  #define PWM_PUBLISH_SEQSTARTED_MaxIndex (1UL)
  #define PWM_PUBLISH_SEQSTARTED_MinIndex (0UL)
  #define PWM_PUBLISH_SEQSTARTED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event SEQSTARTED[n] will publish to */
  #define PWM_PUBLISH_SEQSTARTED_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_SEQSTARTED_CHIDX_Msk (0xFFUL << PWM_PUBLISH_SEQSTARTED_CHIDX_Pos)
  #define PWM_PUBLISH_SEQSTARTED_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_SEQSTARTED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_SEQSTARTED_EN_Pos (31UL)
  #define PWM_PUBLISH_SEQSTARTED_EN_Msk (0x1UL << PWM_PUBLISH_SEQSTARTED_EN_Pos)
  #define PWM_PUBLISH_SEQSTARTED_EN_Min (0x0UL)
  #define PWM_PUBLISH_SEQSTARTED_EN_Max (0x1UL)
  #define PWM_PUBLISH_SEQSTARTED_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_SEQSTARTED_EN_Enabled (0x1UL)


