pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PWM_PUBLISH_SEQEND: Publish configuration for event SEQEND[n] */
  #define PWM_PUBLISH_SEQEND_MaxCount (2UL)
  #define PWM_PUBLISH_SEQEND_MaxIndex (1UL)
  #define PWM_PUBLISH_SEQEND_MinIndex (0UL)
  #define PWM_PUBLISH_SEQEND_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event SEQEND[n] will publish to */
  #define PWM_PUBLISH_SEQEND_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_SEQEND_CHIDX_Msk (0xFFUL << PWM_PUBLISH_SEQEND_CHIDX_Pos)
  #define PWM_PUBLISH_SEQEND_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_SEQEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_SEQEND_EN_Pos (31UL)
  #define PWM_PUBLISH_SEQEND_EN_Msk (0x1UL << PWM_PUBLISH_SEQEND_EN_Pos)
  #define PWM_PUBLISH_SEQEND_EN_Min (0x0UL)
  #define PWM_PUBLISH_SEQEND_EN_Max (0x1UL)
  #define PWM_PUBLISH_SEQEND_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_SEQEND_EN_Enabled (0x1UL)


/* PWM_PUBLISH_PWMPERIODEND: Publish configuration for event PWMPERIODEND */
  #define PWM_PUBLISH_PWMPERIODEND_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event PWMPERIODEND will publish to */
  #define PWM_PUBLISH_PWMPERIODEND_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_PWMPERIODEND_CHIDX_Msk (0xFFUL << PWM_PUBLISH_PWMPERIODEND_CHIDX_Pos)
  #define PWM_PUBLISH_PWMPERIODEND_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_PWMPERIODEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_PWMPERIODEND_EN_Pos (31UL)
  #define PWM_PUBLISH_PWMPERIODEND_EN_Msk (0x1UL << PWM_PUBLISH_PWMPERIODEND_EN_Pos)
  #define PWM_PUBLISH_PWMPERIODEND_EN_Min (0x0UL)
  #define PWM_PUBLISH_PWMPERIODEND_EN_Max (0x1UL)
  #define PWM_PUBLISH_PWMPERIODEND_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_PWMPERIODEND_EN_Enabled (0x1UL)


/* PWM_PUBLISH_LOOPSDONE: Publish configuration for event LOOPSDONE */
  #define PWM_PUBLISH_LOOPSDONE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event LOOPSDONE will publish to */
  #define PWM_PUBLISH_LOOPSDONE_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_LOOPSDONE_CHIDX_Msk (0xFFUL << PWM_PUBLISH_LOOPSDONE_CHIDX_Pos)
  #define PWM_PUBLISH_LOOPSDONE_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_LOOPSDONE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_LOOPSDONE_EN_Pos (31UL)
  #define PWM_PUBLISH_LOOPSDONE_EN_Msk (0x1UL << PWM_PUBLISH_LOOPSDONE_EN_Pos)
  #define PWM_PUBLISH_LOOPSDONE_EN_Min (0x0UL)
  #define PWM_PUBLISH_LOOPSDONE_EN_Max (0x1UL)
  #define PWM_PUBLISH_LOOPSDONE_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_LOOPSDONE_EN_Enabled (0x1UL)


/* PWM_PUBLISH_RAMUNDERFLOW: Publish configuration for event RAMUNDERFLOW */
  #define PWM_PUBLISH_RAMUNDERFLOW_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event RAMUNDERFLOW will publish to */
  #define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Msk (0xFFUL << PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Pos)
  #define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Pos (31UL)
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Msk (0x1UL << PWM_PUBLISH_RAMUNDERFLOW_EN_Pos)
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Min (0x0UL)
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Max (0x1UL)
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Enabled (0x1UL)


/* PWM_PUBLISH_COMPAREMATCH: Publish configuration for event COMPAREMATCH[n] */
  #define PWM_PUBLISH_COMPAREMATCH_MaxCount (4UL)
  #define PWM_PUBLISH_COMPAREMATCH_MaxIndex (3UL)
  #define PWM_PUBLISH_COMPAREMATCH_MinIndex (0UL)
  #define PWM_PUBLISH_COMPAREMATCH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event COMPAREMATCH[n] will publish to */
  #define PWM_PUBLISH_COMPAREMATCH_CHIDX_Pos (0UL)
  #define PWM_PUBLISH_COMPAREMATCH_CHIDX_Msk (0xFFUL << PWM_PUBLISH_COMPAREMATCH_CHIDX_Pos)
  #define PWM_PUBLISH_COMPAREMATCH_CHIDX_Min (0x00UL)
  #define PWM_PUBLISH_COMPAREMATCH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_COMPAREMATCH_EN_Pos (31UL)
  #define PWM_PUBLISH_COMPAREMATCH_EN_Msk (0x1UL << PWM_PUBLISH_COMPAREMATCH_EN_Pos)
  #define PWM_PUBLISH_COMPAREMATCH_EN_Min (0x0UL)
  #define PWM_PUBLISH_COMPAREMATCH_EN_Max (0x1UL)
  #define PWM_PUBLISH_COMPAREMATCH_EN_Disabled (0x0UL)
  #define PWM_PUBLISH_COMPAREMATCH_EN_Enabled (0x1UL)


/* PWM_SHORTS: Shortcuts between local events and tasks */
  #define PWM_SHORTS_ResetValue (0x00000000UL)

/* SEQEND0_STOP @Bit 0 : Shortcut between event SEQEND[n] and task STOP */
  #define PWM_SHORTS_SEQEND0_STOP_Pos (0UL)
  #define PWM_SHORTS_SEQEND0_STOP_Msk (0x1UL << PWM_SHORTS_SEQEND0_STOP_Pos)
  #define PWM_SHORTS_SEQEND0_STOP_Min (0x0UL)
  #define PWM_SHORTS_SEQEND0_STOP_Max (0x1UL)
  #define PWM_SHORTS_SEQEND0_STOP_Disabled (0x0UL)
  #define PWM_SHORTS_SEQEND0_STOP_Enabled (0x1UL)

/* SEQEND1_STOP @Bit 1 : Shortcut between event SEQEND[n] and task STOP */
  #define PWM_SHORTS_SEQEND1_STOP_Pos (1UL)
  #define PWM_SHORTS_SEQEND1_STOP_Msk (0x1UL << PWM_SHORTS_SEQEND1_STOP_Pos)
  #define PWM_SHORTS_SEQEND1_STOP_Min (0x0UL)
  #define PWM_SHORTS_SEQEND1_STOP_Max (0x1UL)
  #define PWM_SHORTS_SEQEND1_STOP_Disabled (0x0UL)
  #define PWM_SHORTS_SEQEND1_STOP_Enabled (0x1UL)

/* LOOPSDONE_DMA_SEQ0_START @Bit 2 : Shortcut between event LOOPSDONE and task DMA.SEQ[n].START */
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Pos (2UL)
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Pos) /*!< Bit mask of
                                                                            LOOPSDONE_DMA_SEQ0_START field.*/
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Min (0x0UL)
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Max (0x1UL)
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Disabled (0x0UL)
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ0_START_Enabled (0x1UL)

/* LOOPSDONE_DMA_SEQ1_START @Bit 3 : Shortcut between event LOOPSDONE and task DMA.SEQ[n].START */
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Pos (3UL)
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Pos) /*!< Bit mask of
                                                                            LOOPSDONE_DMA_SEQ1_START field.*/
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Min (0x0UL)
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Max (0x1UL)
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Disabled (0x0UL)
  #define PWM_SHORTS_LOOPSDONE_DMA_SEQ1_START_Enabled (0x1UL)

