pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LOOPSDONE_STOP @Bit 4 : Shortcut between event LOOPSDONE and task STOP */
  #define PWM_SHORTS_LOOPSDONE_STOP_Pos (4UL)
  #define PWM_SHORTS_LOOPSDONE_STOP_Msk (0x1UL << PWM_SHORTS_LOOPSDONE_STOP_Pos)
  #define PWM_SHORTS_LOOPSDONE_STOP_Min (0x0UL)
  #define PWM_SHORTS_LOOPSDONE_STOP_Max (0x1UL)
  #define PWM_SHORTS_LOOPSDONE_STOP_Disabled (0x0UL)
  #define PWM_SHORTS_LOOPSDONE_STOP_Enabled (0x1UL)

/* RAMUNDERFLOW_STOP @Bit 5 : Shortcut between event RAMUNDERFLOW and task STOP */
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Pos (5UL)
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Msk (0x1UL << PWM_SHORTS_RAMUNDERFLOW_STOP_Pos) /*!< Bit mask of RAMUNDERFLOW_STOP
                                                                            field.*/
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Min (0x0UL)
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Max (0x1UL)
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Disabled (0x0UL)
  #define PWM_SHORTS_RAMUNDERFLOW_STOP_Enabled (0x1UL)

/* DMA_SEQ0_BUSERROR_STOP @Bit 6 : Shortcut between event DMA.SEQ[n].BUSERROR and task STOP */
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Pos (6UL)
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Msk (0x1UL << PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Pos) /*!< Bit mask of
                                                                            DMA_SEQ0_BUSERROR_STOP field.*/
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Min (0x0UL)
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Max (0x1UL)
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Disabled (0x0UL)
  #define PWM_SHORTS_DMA_SEQ0_BUSERROR_STOP_Enabled (0x1UL)

/* DMA_SEQ1_BUSERROR_STOP @Bit 7 : Shortcut between event DMA.SEQ[n].BUSERROR and task STOP */
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Pos (7UL)
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Msk (0x1UL << PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Pos) /*!< Bit mask of
                                                                            DMA_SEQ1_BUSERROR_STOP field.*/
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Min (0x0UL)
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Max (0x1UL)
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Disabled (0x0UL)
  #define PWM_SHORTS_DMA_SEQ1_BUSERROR_STOP_Enabled (0x1UL)


/* PWM_INTEN: Enable or disable interrupt */
  #define PWM_INTEN_ResetValue (0x00000000UL)

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define PWM_INTEN_STOPPED_Pos (1UL)
  #define PWM_INTEN_STOPPED_Msk (0x1UL << PWM_INTEN_STOPPED_Pos)
  #define PWM_INTEN_STOPPED_Min (0x0UL)
  #define PWM_INTEN_STOPPED_Max (0x1UL)
  #define PWM_INTEN_STOPPED_Disabled (0x0UL)
  #define PWM_INTEN_STOPPED_Enabled (0x1UL)

/* SEQSTARTED0 @Bit 2 : Enable or disable interrupt for event SEQSTARTED[0] */
  #define PWM_INTEN_SEQSTARTED0_Pos (2UL)
  #define PWM_INTEN_SEQSTARTED0_Msk (0x1UL << PWM_INTEN_SEQSTARTED0_Pos)
  #define PWM_INTEN_SEQSTARTED0_Min (0x0UL)
  #define PWM_INTEN_SEQSTARTED0_Max (0x1UL)
  #define PWM_INTEN_SEQSTARTED0_Disabled (0x0UL)
  #define PWM_INTEN_SEQSTARTED0_Enabled (0x1UL)

/* SEQSTARTED1 @Bit 3 : Enable or disable interrupt for event SEQSTARTED[1] */
  #define PWM_INTEN_SEQSTARTED1_Pos (3UL)
  #define PWM_INTEN_SEQSTARTED1_Msk (0x1UL << PWM_INTEN_SEQSTARTED1_Pos)
  #define PWM_INTEN_SEQSTARTED1_Min (0x0UL)
  #define PWM_INTEN_SEQSTARTED1_Max (0x1UL)
  #define PWM_INTEN_SEQSTARTED1_Disabled (0x0UL)
  #define PWM_INTEN_SEQSTARTED1_Enabled (0x1UL)

/* SEQEND0 @Bit 4 : Enable or disable interrupt for event SEQEND[0] */
  #define PWM_INTEN_SEQEND0_Pos (4UL)
  #define PWM_INTEN_SEQEND0_Msk (0x1UL << PWM_INTEN_SEQEND0_Pos)
  #define PWM_INTEN_SEQEND0_Min (0x0UL)
  #define PWM_INTEN_SEQEND0_Max (0x1UL)
  #define PWM_INTEN_SEQEND0_Disabled (0x0UL)
  #define PWM_INTEN_SEQEND0_Enabled (0x1UL)

/* SEQEND1 @Bit 5 : Enable or disable interrupt for event SEQEND[1] */
  #define PWM_INTEN_SEQEND1_Pos (5UL)
  #define PWM_INTEN_SEQEND1_Msk (0x1UL << PWM_INTEN_SEQEND1_Pos)
  #define PWM_INTEN_SEQEND1_Min (0x0UL)
  #define PWM_INTEN_SEQEND1_Max (0x1UL)
  #define PWM_INTEN_SEQEND1_Disabled (0x0UL)
  #define PWM_INTEN_SEQEND1_Enabled (0x1UL)

/* PWMPERIODEND @Bit 6 : Enable or disable interrupt for event PWMPERIODEND */
  #define PWM_INTEN_PWMPERIODEND_Pos (6UL)
  #define PWM_INTEN_PWMPERIODEND_Msk (0x1UL << PWM_INTEN_PWMPERIODEND_Pos)
  #define PWM_INTEN_PWMPERIODEND_Min (0x0UL)
  #define PWM_INTEN_PWMPERIODEND_Max (0x1UL)
  #define PWM_INTEN_PWMPERIODEND_Disabled (0x0UL)
  #define PWM_INTEN_PWMPERIODEND_Enabled (0x1UL)

/* LOOPSDONE @Bit 7 : Enable or disable interrupt for event LOOPSDONE */
  #define PWM_INTEN_LOOPSDONE_Pos (7UL)
  #define PWM_INTEN_LOOPSDONE_Msk (0x1UL << PWM_INTEN_LOOPSDONE_Pos)
  #define PWM_INTEN_LOOPSDONE_Min (0x0UL)
  #define PWM_INTEN_LOOPSDONE_Max (0x1UL)
  #define PWM_INTEN_LOOPSDONE_Disabled (0x0UL)
  #define PWM_INTEN_LOOPSDONE_Enabled (0x1UL)

/* RAMUNDERFLOW @Bit 8 : Enable or disable interrupt for event RAMUNDERFLOW */
  #define PWM_INTEN_RAMUNDERFLOW_Pos (8UL)
  #define PWM_INTEN_RAMUNDERFLOW_Msk (0x1UL << PWM_INTEN_RAMUNDERFLOW_Pos)
  #define PWM_INTEN_RAMUNDERFLOW_Min (0x0UL)
  #define PWM_INTEN_RAMUNDERFLOW_Max (0x1UL)
  #define PWM_INTEN_RAMUNDERFLOW_Disabled (0x0UL)
  #define PWM_INTEN_RAMUNDERFLOW_Enabled (0x1UL)

/* DMASEQ0END @Bit 9 : Enable or disable interrupt for event DMASEQ0END */
  #define PWM_INTEN_DMASEQ0END_Pos (9UL)
  #define PWM_INTEN_DMASEQ0END_Msk (0x1UL << PWM_INTEN_DMASEQ0END_Pos)
  #define PWM_INTEN_DMASEQ0END_Min (0x0UL)
  #define PWM_INTEN_DMASEQ0END_Max (0x1UL)
  #define PWM_INTEN_DMASEQ0END_Disabled (0x0UL)
  #define PWM_INTEN_DMASEQ0END_Enabled (0x1UL)

/* DMASEQ0READY @Bit 10 : Enable or disable interrupt for event DMASEQ0READY */
  #define PWM_INTEN_DMASEQ0READY_Pos (10UL)
  #define PWM_INTEN_DMASEQ0READY_Msk (0x1UL << PWM_INTEN_DMASEQ0READY_Pos)
  #define PWM_INTEN_DMASEQ0READY_Min (0x0UL)
  #define PWM_INTEN_DMASEQ0READY_Max (0x1UL)
  #define PWM_INTEN_DMASEQ0READY_Disabled (0x0UL)
  #define PWM_INTEN_DMASEQ0READY_Enabled (0x1UL)

/* DMASEQ0BUSERROR @Bit 11 : Enable or disable interrupt for event DMASEQ0BUSERROR */
  #define PWM_INTEN_DMASEQ0BUSERROR_Pos (11UL)
  #define PWM_INTEN_DMASEQ0BUSERROR_Msk (0x1UL << PWM_INTEN_DMASEQ0BUSERROR_Pos)
  #define PWM_INTEN_DMASEQ0BUSERROR_Min (0x0UL)
  #define PWM_INTEN_DMASEQ0BUSERROR_Max (0x1UL)
  #define PWM_INTEN_DMASEQ0BUSERROR_Disabled (0x0UL)
  #define PWM_INTEN_DMASEQ0BUSERROR_Enabled (0x1UL)

/* DMASEQ1END @Bit 12 : Enable or disable interrupt for event DMASEQ1END */
  #define PWM_INTEN_DMASEQ1END_Pos (12UL)
  #define PWM_INTEN_DMASEQ1END_Msk (0x1UL << PWM_INTEN_DMASEQ1END_Pos)
  #define PWM_INTEN_DMASEQ1END_Min (0x0UL)
  #define PWM_INTEN_DMASEQ1END_Max (0x1UL)
  #define PWM_INTEN_DMASEQ1END_Disabled (0x0UL)
  #define PWM_INTEN_DMASEQ1END_Enabled (0x1UL)

/* DMASEQ1READY @Bit 13 : Enable or disable interrupt for event DMASEQ1READY */
  #define PWM_INTEN_DMASEQ1READY_Pos (13UL)
  #define PWM_INTEN_DMASEQ1READY_Msk (0x1UL << PWM_INTEN_DMASEQ1READY_Pos)
  #define PWM_INTEN_DMASEQ1READY_Min (0x0UL)
  #define PWM_INTEN_DMASEQ1READY_Max (0x1UL)
  #define PWM_INTEN_DMASEQ1READY_Disabled (0x0UL)
  #define PWM_INTEN_DMASEQ1READY_Enabled (0x1UL)

/* DMASEQ1BUSERROR @Bit 14 : Enable or disable interrupt for event DMASEQ1BUSERROR */
  #define PWM_INTEN_DMASEQ1BUSERROR_Pos (14UL)
  #define PWM_INTEN_DMASEQ1BUSERROR_Msk (0x1UL << PWM_INTEN_DMASEQ1BUSERROR_Pos)
  #define PWM_INTEN_DMASEQ1BUSERROR_Min (0x0UL)
  #define PWM_INTEN_DMASEQ1BUSERROR_Max (0x1UL)
  #define PWM_INTEN_DMASEQ1BUSERROR_Disabled (0x0UL)
  #define PWM_INTEN_DMASEQ1BUSERROR_Enabled (0x1UL)

