pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPAREMATCH0 @Bit 15 : Enable or disable interrupt for event COMPAREMATCH[0] */
  #define PWM_INTEN_COMPAREMATCH0_Pos (15UL)
  #define PWM_INTEN_COMPAREMATCH0_Msk (0x1UL << PWM_INTEN_COMPAREMATCH0_Pos)
  #define PWM_INTEN_COMPAREMATCH0_Min (0x0UL)
  #define PWM_INTEN_COMPAREMATCH0_Max (0x1UL)
  #define PWM_INTEN_COMPAREMATCH0_Disabled (0x0UL)
  #define PWM_INTEN_COMPAREMATCH0_Enabled (0x1UL)

/* COMPAREMATCH1 @Bit 16 : Enable or disable interrupt for event COMPAREMATCH[1] */
  #define PWM_INTEN_COMPAREMATCH1_Pos (16UL)
  #define PWM_INTEN_COMPAREMATCH1_Msk (0x1UL << PWM_INTEN_COMPAREMATCH1_Pos)
  #define PWM_INTEN_COMPAREMATCH1_Min (0x0UL)
  #define PWM_INTEN_COMPAREMATCH1_Max (0x1UL)
  #define PWM_INTEN_COMPAREMATCH1_Disabled (0x0UL)
  #define PWM_INTEN_COMPAREMATCH1_Enabled (0x1UL)

/* COMPAREMATCH2 @Bit 17 : Enable or disable interrupt for event COMPAREMATCH[2] */
  #define PWM_INTEN_COMPAREMATCH2_Pos (17UL)
  #define PWM_INTEN_COMPAREMATCH2_Msk (0x1UL << PWM_INTEN_COMPAREMATCH2_Pos)
  #define PWM_INTEN_COMPAREMATCH2_Min (0x0UL)
  #define PWM_INTEN_COMPAREMATCH2_Max (0x1UL)
  #define PWM_INTEN_COMPAREMATCH2_Disabled (0x0UL)
  #define PWM_INTEN_COMPAREMATCH2_Enabled (0x1UL)

/* COMPAREMATCH3 @Bit 18 : Enable or disable interrupt for event COMPAREMATCH[3] */
  #define PWM_INTEN_COMPAREMATCH3_Pos (18UL)
  #define PWM_INTEN_COMPAREMATCH3_Msk (0x1UL << PWM_INTEN_COMPAREMATCH3_Pos)
  #define PWM_INTEN_COMPAREMATCH3_Min (0x0UL)
  #define PWM_INTEN_COMPAREMATCH3_Max (0x1UL)
  #define PWM_INTEN_COMPAREMATCH3_Disabled (0x0UL)
  #define PWM_INTEN_COMPAREMATCH3_Enabled (0x1UL)


/* PWM_INTENSET: Enable interrupt */
  #define PWM_INTENSET_ResetValue (0x00000000UL)

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define PWM_INTENSET_STOPPED_Pos (1UL)
  #define PWM_INTENSET_STOPPED_Msk (0x1UL << PWM_INTENSET_STOPPED_Pos)
  #define PWM_INTENSET_STOPPED_Min (0x0UL)
  #define PWM_INTENSET_STOPPED_Max (0x1UL)
  #define PWM_INTENSET_STOPPED_Set (0x1UL)
  #define PWM_INTENSET_STOPPED_Disabled (0x0UL)
  #define PWM_INTENSET_STOPPED_Enabled (0x1UL)

/* SEQSTARTED0 @Bit 2 : Write '1' to enable interrupt for event SEQSTARTED[0] */
  #define PWM_INTENSET_SEQSTARTED0_Pos (2UL)
  #define PWM_INTENSET_SEQSTARTED0_Msk (0x1UL << PWM_INTENSET_SEQSTARTED0_Pos)
  #define PWM_INTENSET_SEQSTARTED0_Min (0x0UL)
  #define PWM_INTENSET_SEQSTARTED0_Max (0x1UL)
  #define PWM_INTENSET_SEQSTARTED0_Set (0x1UL)
  #define PWM_INTENSET_SEQSTARTED0_Disabled (0x0UL)
  #define PWM_INTENSET_SEQSTARTED0_Enabled (0x1UL)

/* SEQSTARTED1 @Bit 3 : Write '1' to enable interrupt for event SEQSTARTED[1] */
  #define PWM_INTENSET_SEQSTARTED1_Pos (3UL)
  #define PWM_INTENSET_SEQSTARTED1_Msk (0x1UL << PWM_INTENSET_SEQSTARTED1_Pos)
  #define PWM_INTENSET_SEQSTARTED1_Min (0x0UL)
  #define PWM_INTENSET_SEQSTARTED1_Max (0x1UL)
  #define PWM_INTENSET_SEQSTARTED1_Set (0x1UL)
  #define PWM_INTENSET_SEQSTARTED1_Disabled (0x0UL)
  #define PWM_INTENSET_SEQSTARTED1_Enabled (0x1UL)

/* SEQEND0 @Bit 4 : Write '1' to enable interrupt for event SEQEND[0] */
  #define PWM_INTENSET_SEQEND0_Pos (4UL)
  #define PWM_INTENSET_SEQEND0_Msk (0x1UL << PWM_INTENSET_SEQEND0_Pos)
  #define PWM_INTENSET_SEQEND0_Min (0x0UL)
  #define PWM_INTENSET_SEQEND0_Max (0x1UL)
  #define PWM_INTENSET_SEQEND0_Set (0x1UL)
  #define PWM_INTENSET_SEQEND0_Disabled (0x0UL)
  #define PWM_INTENSET_SEQEND0_Enabled (0x1UL)

/* SEQEND1 @Bit 5 : Write '1' to enable interrupt for event SEQEND[1] */
  #define PWM_INTENSET_SEQEND1_Pos (5UL)
  #define PWM_INTENSET_SEQEND1_Msk (0x1UL << PWM_INTENSET_SEQEND1_Pos)
  #define PWM_INTENSET_SEQEND1_Min (0x0UL)
  #define PWM_INTENSET_SEQEND1_Max (0x1UL)
  #define PWM_INTENSET_SEQEND1_Set (0x1UL)
  #define PWM_INTENSET_SEQEND1_Disabled (0x0UL)
  #define PWM_INTENSET_SEQEND1_Enabled (0x1UL)

/* PWMPERIODEND @Bit 6 : Write '1' to enable interrupt for event PWMPERIODEND */
  #define PWM_INTENSET_PWMPERIODEND_Pos (6UL)
  #define PWM_INTENSET_PWMPERIODEND_Msk (0x1UL << PWM_INTENSET_PWMPERIODEND_Pos)
  #define PWM_INTENSET_PWMPERIODEND_Min (0x0UL)
  #define PWM_INTENSET_PWMPERIODEND_Max (0x1UL)
  #define PWM_INTENSET_PWMPERIODEND_Set (0x1UL)
  #define PWM_INTENSET_PWMPERIODEND_Disabled (0x0UL)
  #define PWM_INTENSET_PWMPERIODEND_Enabled (0x1UL)

/* LOOPSDONE @Bit 7 : Write '1' to enable interrupt for event LOOPSDONE */
  #define PWM_INTENSET_LOOPSDONE_Pos (7UL)
  #define PWM_INTENSET_LOOPSDONE_Msk (0x1UL << PWM_INTENSET_LOOPSDONE_Pos)
  #define PWM_INTENSET_LOOPSDONE_Min (0x0UL)
  #define PWM_INTENSET_LOOPSDONE_Max (0x1UL)
  #define PWM_INTENSET_LOOPSDONE_Set (0x1UL)
  #define PWM_INTENSET_LOOPSDONE_Disabled (0x0UL)
  #define PWM_INTENSET_LOOPSDONE_Enabled (0x1UL)

/* RAMUNDERFLOW @Bit 8 : Write '1' to enable interrupt for event RAMUNDERFLOW */
  #define PWM_INTENSET_RAMUNDERFLOW_Pos (8UL)
  #define PWM_INTENSET_RAMUNDERFLOW_Msk (0x1UL << PWM_INTENSET_RAMUNDERFLOW_Pos)
  #define PWM_INTENSET_RAMUNDERFLOW_Min (0x0UL)
  #define PWM_INTENSET_RAMUNDERFLOW_Max (0x1UL)
  #define PWM_INTENSET_RAMUNDERFLOW_Set (0x1UL)
  #define PWM_INTENSET_RAMUNDERFLOW_Disabled (0x0UL)
  #define PWM_INTENSET_RAMUNDERFLOW_Enabled (0x1UL)

/* DMASEQ0END @Bit 9 : Write '1' to enable interrupt for event DMASEQ0END */
  #define PWM_INTENSET_DMASEQ0END_Pos (9UL)
  #define PWM_INTENSET_DMASEQ0END_Msk (0x1UL << PWM_INTENSET_DMASEQ0END_Pos)
  #define PWM_INTENSET_DMASEQ0END_Min (0x0UL)
  #define PWM_INTENSET_DMASEQ0END_Max (0x1UL)
  #define PWM_INTENSET_DMASEQ0END_Set (0x1UL)
  #define PWM_INTENSET_DMASEQ0END_Disabled (0x0UL)
  #define PWM_INTENSET_DMASEQ0END_Enabled (0x1UL)

/* DMASEQ0READY @Bit 10 : Write '1' to enable interrupt for event DMASEQ0READY */
  #define PWM_INTENSET_DMASEQ0READY_Pos (10UL)
  #define PWM_INTENSET_DMASEQ0READY_Msk (0x1UL << PWM_INTENSET_DMASEQ0READY_Pos)
  #define PWM_INTENSET_DMASEQ0READY_Min (0x0UL)
  #define PWM_INTENSET_DMASEQ0READY_Max (0x1UL)
  #define PWM_INTENSET_DMASEQ0READY_Set (0x1UL)
  #define PWM_INTENSET_DMASEQ0READY_Disabled (0x0UL)
  #define PWM_INTENSET_DMASEQ0READY_Enabled (0x1UL)

/* DMASEQ0BUSERROR @Bit 11 : Write '1' to enable interrupt for event DMASEQ0BUSERROR */
  #define PWM_INTENSET_DMASEQ0BUSERROR_Pos (11UL)
  #define PWM_INTENSET_DMASEQ0BUSERROR_Msk (0x1UL << PWM_INTENSET_DMASEQ0BUSERROR_Pos)
  #define PWM_INTENSET_DMASEQ0BUSERROR_Min (0x0UL)
  #define PWM_INTENSET_DMASEQ0BUSERROR_Max (0x1UL)
  #define PWM_INTENSET_DMASEQ0BUSERROR_Set (0x1UL)
  #define PWM_INTENSET_DMASEQ0BUSERROR_Disabled (0x0UL)
  #define PWM_INTENSET_DMASEQ0BUSERROR_Enabled (0x1UL)

