pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DMASEQ1END @Bit 12 : Write '1' to enable interrupt for event DMASEQ1END */
  #define PWM_INTENSET_DMASEQ1END_Pos (12UL)
  #define PWM_INTENSET_DMASEQ1END_Msk (0x1UL << PWM_INTENSET_DMASEQ1END_Pos)
  #define PWM_INTENSET_DMASEQ1END_Min (0x0UL)
  #define PWM_INTENSET_DMASEQ1END_Max (0x1UL)
  #define PWM_INTENSET_DMASEQ1END_Set (0x1UL)
  #define PWM_INTENSET_DMASEQ1END_Disabled (0x0UL)
  #define PWM_INTENSET_DMASEQ1END_Enabled (0x1UL)

/* DMASEQ1READY @Bit 13 : Write '1' to enable interrupt for event DMASEQ1READY */
  #define PWM_INTENSET_DMASEQ1READY_Pos (13UL)
  #define PWM_INTENSET_DMASEQ1READY_Msk (0x1UL << PWM_INTENSET_DMASEQ1READY_Pos)
  #define PWM_INTENSET_DMASEQ1READY_Min (0x0UL)
  #define PWM_INTENSET_DMASEQ1READY_Max (0x1UL)
  #define PWM_INTENSET_DMASEQ1READY_Set (0x1UL)
  #define PWM_INTENSET_DMASEQ1READY_Disabled (0x0UL)
  #define PWM_INTENSET_DMASEQ1READY_Enabled (0x1UL)

/* DMASEQ1BUSERROR @Bit 14 : Write '1' to enable interrupt for event DMASEQ1BUSERROR */
  #define PWM_INTENSET_DMASEQ1BUSERROR_Pos (14UL)
  #define PWM_INTENSET_DMASEQ1BUSERROR_Msk (0x1UL << PWM_INTENSET_DMASEQ1BUSERROR_Pos)
  #define PWM_INTENSET_DMASEQ1BUSERROR_Min (0x0UL)
  #define PWM_INTENSET_DMASEQ1BUSERROR_Max (0x1UL)
  #define PWM_INTENSET_DMASEQ1BUSERROR_Set (0x1UL)
  #define PWM_INTENSET_DMASEQ1BUSERROR_Disabled (0x0UL)
  #define PWM_INTENSET_DMASEQ1BUSERROR_Enabled (0x1UL)

/* COMPAREMATCH0 @Bit 15 : Write '1' to enable interrupt for event COMPAREMATCH[0] */
  #define PWM_INTENSET_COMPAREMATCH0_Pos (15UL)
  #define PWM_INTENSET_COMPAREMATCH0_Msk (0x1UL << PWM_INTENSET_COMPAREMATCH0_Pos)
  #define PWM_INTENSET_COMPAREMATCH0_Min (0x0UL)
  #define PWM_INTENSET_COMPAREMATCH0_Max (0x1UL)
  #define PWM_INTENSET_COMPAREMATCH0_Set (0x1UL)
  #define PWM_INTENSET_COMPAREMATCH0_Disabled (0x0UL)
  #define PWM_INTENSET_COMPAREMATCH0_Enabled (0x1UL)

/* COMPAREMATCH1 @Bit 16 : Write '1' to enable interrupt for event COMPAREMATCH[1] */
  #define PWM_INTENSET_COMPAREMATCH1_Pos (16UL)
  #define PWM_INTENSET_COMPAREMATCH1_Msk (0x1UL << PWM_INTENSET_COMPAREMATCH1_Pos)
  #define PWM_INTENSET_COMPAREMATCH1_Min (0x0UL)
  #define PWM_INTENSET_COMPAREMATCH1_Max (0x1UL)
  #define PWM_INTENSET_COMPAREMATCH1_Set (0x1UL)
  #define PWM_INTENSET_COMPAREMATCH1_Disabled (0x0UL)
  #define PWM_INTENSET_COMPAREMATCH1_Enabled (0x1UL)

/* COMPAREMATCH2 @Bit 17 : Write '1' to enable interrupt for event COMPAREMATCH[2] */
  #define PWM_INTENSET_COMPAREMATCH2_Pos (17UL)
  #define PWM_INTENSET_COMPAREMATCH2_Msk (0x1UL << PWM_INTENSET_COMPAREMATCH2_Pos)
  #define PWM_INTENSET_COMPAREMATCH2_Min (0x0UL)
  #define PWM_INTENSET_COMPAREMATCH2_Max (0x1UL)
  #define PWM_INTENSET_COMPAREMATCH2_Set (0x1UL)
  #define PWM_INTENSET_COMPAREMATCH2_Disabled (0x0UL)
  #define PWM_INTENSET_COMPAREMATCH2_Enabled (0x1UL)

/* COMPAREMATCH3 @Bit 18 : Write '1' to enable interrupt for event COMPAREMATCH[3] */
  #define PWM_INTENSET_COMPAREMATCH3_Pos (18UL)
  #define PWM_INTENSET_COMPAREMATCH3_Msk (0x1UL << PWM_INTENSET_COMPAREMATCH3_Pos)
  #define PWM_INTENSET_COMPAREMATCH3_Min (0x0UL)
  #define PWM_INTENSET_COMPAREMATCH3_Max (0x1UL)
  #define PWM_INTENSET_COMPAREMATCH3_Set (0x1UL)
  #define PWM_INTENSET_COMPAREMATCH3_Disabled (0x0UL)
  #define PWM_INTENSET_COMPAREMATCH3_Enabled (0x1UL)


/* PWM_INTENCLR: Disable interrupt */
  #define PWM_INTENCLR_ResetValue (0x00000000UL)

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define PWM_INTENCLR_STOPPED_Pos (1UL)
  #define PWM_INTENCLR_STOPPED_Msk (0x1UL << PWM_INTENCLR_STOPPED_Pos)
  #define PWM_INTENCLR_STOPPED_Min (0x0UL)
  #define PWM_INTENCLR_STOPPED_Max (0x1UL)
  #define PWM_INTENCLR_STOPPED_Clear (0x1UL)
  #define PWM_INTENCLR_STOPPED_Disabled (0x0UL)
  #define PWM_INTENCLR_STOPPED_Enabled (0x1UL)

/* SEQSTARTED0 @Bit 2 : Write '1' to disable interrupt for event SEQSTARTED[0] */
  #define PWM_INTENCLR_SEQSTARTED0_Pos (2UL)
  #define PWM_INTENCLR_SEQSTARTED0_Msk (0x1UL << PWM_INTENCLR_SEQSTARTED0_Pos)
  #define PWM_INTENCLR_SEQSTARTED0_Min (0x0UL)
  #define PWM_INTENCLR_SEQSTARTED0_Max (0x1UL)
  #define PWM_INTENCLR_SEQSTARTED0_Clear (0x1UL)
  #define PWM_INTENCLR_SEQSTARTED0_Disabled (0x0UL)
  #define PWM_INTENCLR_SEQSTARTED0_Enabled (0x1UL)

/* SEQSTARTED1 @Bit 3 : Write '1' to disable interrupt for event SEQSTARTED[1] */
  #define PWM_INTENCLR_SEQSTARTED1_Pos (3UL)
  #define PWM_INTENCLR_SEQSTARTED1_Msk (0x1UL << PWM_INTENCLR_SEQSTARTED1_Pos)
  #define PWM_INTENCLR_SEQSTARTED1_Min (0x0UL)
  #define PWM_INTENCLR_SEQSTARTED1_Max (0x1UL)
  #define PWM_INTENCLR_SEQSTARTED1_Clear (0x1UL)
  #define PWM_INTENCLR_SEQSTARTED1_Disabled (0x0UL)
  #define PWM_INTENCLR_SEQSTARTED1_Enabled (0x1UL)

/* SEQEND0 @Bit 4 : Write '1' to disable interrupt for event SEQEND[0] */
  #define PWM_INTENCLR_SEQEND0_Pos (4UL)
  #define PWM_INTENCLR_SEQEND0_Msk (0x1UL << PWM_INTENCLR_SEQEND0_Pos)
  #define PWM_INTENCLR_SEQEND0_Min (0x0UL)
  #define PWM_INTENCLR_SEQEND0_Max (0x1UL)
  #define PWM_INTENCLR_SEQEND0_Clear (0x1UL)
  #define PWM_INTENCLR_SEQEND0_Disabled (0x0UL)
  #define PWM_INTENCLR_SEQEND0_Enabled (0x1UL)

/* SEQEND1 @Bit 5 : Write '1' to disable interrupt for event SEQEND[1] */
  #define PWM_INTENCLR_SEQEND1_Pos (5UL)
  #define PWM_INTENCLR_SEQEND1_Msk (0x1UL << PWM_INTENCLR_SEQEND1_Pos)
  #define PWM_INTENCLR_SEQEND1_Min (0x0UL)
  #define PWM_INTENCLR_SEQEND1_Max (0x1UL)
  #define PWM_INTENCLR_SEQEND1_Clear (0x1UL)
  #define PWM_INTENCLR_SEQEND1_Disabled (0x0UL)
  #define PWM_INTENCLR_SEQEND1_Enabled (0x1UL)

/* PWMPERIODEND @Bit 6 : Write '1' to disable interrupt for event PWMPERIODEND */
  #define PWM_INTENCLR_PWMPERIODEND_Pos (6UL)
  #define PWM_INTENCLR_PWMPERIODEND_Msk (0x1UL << PWM_INTENCLR_PWMPERIODEND_Pos)
  #define PWM_INTENCLR_PWMPERIODEND_Min (0x0UL)
  #define PWM_INTENCLR_PWMPERIODEND_Max (0x1UL)
  #define PWM_INTENCLR_PWMPERIODEND_Clear (0x1UL)
  #define PWM_INTENCLR_PWMPERIODEND_Disabled (0x0UL)
  #define PWM_INTENCLR_PWMPERIODEND_Enabled (0x1UL)

/* LOOPSDONE @Bit 7 : Write '1' to disable interrupt for event LOOPSDONE */
  #define PWM_INTENCLR_LOOPSDONE_Pos (7UL)
  #define PWM_INTENCLR_LOOPSDONE_Msk (0x1UL << PWM_INTENCLR_LOOPSDONE_Pos)
  #define PWM_INTENCLR_LOOPSDONE_Min (0x0UL)
  #define PWM_INTENCLR_LOOPSDONE_Max (0x1UL)
  #define PWM_INTENCLR_LOOPSDONE_Clear (0x1UL)
  #define PWM_INTENCLR_LOOPSDONE_Disabled (0x0UL)
  #define PWM_INTENCLR_LOOPSDONE_Enabled (0x1UL)

/* RAMUNDERFLOW @Bit 8 : Write '1' to disable interrupt for event RAMUNDERFLOW */
  #define PWM_INTENCLR_RAMUNDERFLOW_Pos (8UL)
  #define PWM_INTENCLR_RAMUNDERFLOW_Msk (0x1UL << PWM_INTENCLR_RAMUNDERFLOW_Pos)
  #define PWM_INTENCLR_RAMUNDERFLOW_Min (0x0UL)
  #define PWM_INTENCLR_RAMUNDERFLOW_Max (0x1UL)
  #define PWM_INTENCLR_RAMUNDERFLOW_Clear (0x1UL)
  #define PWM_INTENCLR_RAMUNDERFLOW_Disabled (0x0UL)
  #define PWM_INTENCLR_RAMUNDERFLOW_Enabled (0x1UL)

/* DMASEQ0END @Bit 9 : Write '1' to disable interrupt for event DMASEQ0END */
  #define PWM_INTENCLR_DMASEQ0END_Pos (9UL)
  #define PWM_INTENCLR_DMASEQ0END_Msk (0x1UL << PWM_INTENCLR_DMASEQ0END_Pos)
  #define PWM_INTENCLR_DMASEQ0END_Min (0x0UL)
  #define PWM_INTENCLR_DMASEQ0END_Max (0x1UL)
  #define PWM_INTENCLR_DMASEQ0END_Clear (0x1UL)
  #define PWM_INTENCLR_DMASEQ0END_Disabled (0x0UL)
  #define PWM_INTENCLR_DMASEQ0END_Enabled (0x1UL)

/* DMASEQ0READY @Bit 10 : Write '1' to disable interrupt for event DMASEQ0READY */
  #define PWM_INTENCLR_DMASEQ0READY_Pos (10UL)
  #define PWM_INTENCLR_DMASEQ0READY_Msk (0x1UL << PWM_INTENCLR_DMASEQ0READY_Pos)
  #define PWM_INTENCLR_DMASEQ0READY_Min (0x0UL)
  #define PWM_INTENCLR_DMASEQ0READY_Max (0x1UL)
  #define PWM_INTENCLR_DMASEQ0READY_Clear (0x1UL)
  #define PWM_INTENCLR_DMASEQ0READY_Disabled (0x0UL)
  #define PWM_INTENCLR_DMASEQ0READY_Enabled (0x1UL)

/* DMASEQ0BUSERROR @Bit 11 : Write '1' to disable interrupt for event DMASEQ0BUSERROR */
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Pos (11UL)
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Msk (0x1UL << PWM_INTENCLR_DMASEQ0BUSERROR_Pos)
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Min (0x0UL)
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Max (0x1UL)
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Clear (0x1UL)
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Disabled (0x0UL)
  #define PWM_INTENCLR_DMASEQ0BUSERROR_Enabled (0x1UL)

/* DMASEQ1END @Bit 12 : Write '1' to disable interrupt for event DMASEQ1END */
  #define PWM_INTENCLR_DMASEQ1END_Pos (12UL)
  #define PWM_INTENCLR_DMASEQ1END_Msk (0x1UL << PWM_INTENCLR_DMASEQ1END_Pos)
  #define PWM_INTENCLR_DMASEQ1END_Min (0x0UL)
  #define PWM_INTENCLR_DMASEQ1END_Max (0x1UL)
  #define PWM_INTENCLR_DMASEQ1END_Clear (0x1UL)
  #define PWM_INTENCLR_DMASEQ1END_Disabled (0x0UL)
  #define PWM_INTENCLR_DMASEQ1END_Enabled (0x1UL)

/* DMASEQ1READY @Bit 13 : Write '1' to disable interrupt for event DMASEQ1READY */
  #define PWM_INTENCLR_DMASEQ1READY_Pos (13UL)
  #define PWM_INTENCLR_DMASEQ1READY_Msk (0x1UL << PWM_INTENCLR_DMASEQ1READY_Pos)
  #define PWM_INTENCLR_DMASEQ1READY_Min (0x0UL)
  #define PWM_INTENCLR_DMASEQ1READY_Max (0x1UL)
  #define PWM_INTENCLR_DMASEQ1READY_Clear (0x1UL)
  #define PWM_INTENCLR_DMASEQ1READY_Disabled (0x0UL)
  #define PWM_INTENCLR_DMASEQ1READY_Enabled (0x1UL)

