pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DMASEQ1BUSERROR @Bit 14 : Write '1' to disable interrupt for event DMASEQ1BUSERROR */
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Pos (14UL)
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Msk (0x1UL << PWM_INTENCLR_DMASEQ1BUSERROR_Pos)
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Min (0x0UL)
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Max (0x1UL)
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Clear (0x1UL)
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Disabled (0x0UL)
  #define PWM_INTENCLR_DMASEQ1BUSERROR_Enabled (0x1UL)

/* COMPAREMATCH0 @Bit 15 : Write '1' to disable interrupt for event COMPAREMATCH[0] */
  #define PWM_INTENCLR_COMPAREMATCH0_Pos (15UL)
  #define PWM_INTENCLR_COMPAREMATCH0_Msk (0x1UL << PWM_INTENCLR_COMPAREMATCH0_Pos)
  #define PWM_INTENCLR_COMPAREMATCH0_Min (0x0UL)
  #define PWM_INTENCLR_COMPAREMATCH0_Max (0x1UL)
  #define PWM_INTENCLR_COMPAREMATCH0_Clear (0x1UL)
  #define PWM_INTENCLR_COMPAREMATCH0_Disabled (0x0UL)
  #define PWM_INTENCLR_COMPAREMATCH0_Enabled (0x1UL)

/* COMPAREMATCH1 @Bit 16 : Write '1' to disable interrupt for event COMPAREMATCH[1] */
  #define PWM_INTENCLR_COMPAREMATCH1_Pos (16UL)
  #define PWM_INTENCLR_COMPAREMATCH1_Msk (0x1UL << PWM_INTENCLR_COMPAREMATCH1_Pos)
  #define PWM_INTENCLR_COMPAREMATCH1_Min (0x0UL)
  #define PWM_INTENCLR_COMPAREMATCH1_Max (0x1UL)
  #define PWM_INTENCLR_COMPAREMATCH1_Clear (0x1UL)
  #define PWM_INTENCLR_COMPAREMATCH1_Disabled (0x0UL)
  #define PWM_INTENCLR_COMPAREMATCH1_Enabled (0x1UL)

/* COMPAREMATCH2 @Bit 17 : Write '1' to disable interrupt for event COMPAREMATCH[2] */
  #define PWM_INTENCLR_COMPAREMATCH2_Pos (17UL)
  #define PWM_INTENCLR_COMPAREMATCH2_Msk (0x1UL << PWM_INTENCLR_COMPAREMATCH2_Pos)
  #define PWM_INTENCLR_COMPAREMATCH2_Min (0x0UL)
  #define PWM_INTENCLR_COMPAREMATCH2_Max (0x1UL)
  #define PWM_INTENCLR_COMPAREMATCH2_Clear (0x1UL)
  #define PWM_INTENCLR_COMPAREMATCH2_Disabled (0x0UL)
  #define PWM_INTENCLR_COMPAREMATCH2_Enabled (0x1UL)

/* COMPAREMATCH3 @Bit 18 : Write '1' to disable interrupt for event COMPAREMATCH[3] */
  #define PWM_INTENCLR_COMPAREMATCH3_Pos (18UL)
  #define PWM_INTENCLR_COMPAREMATCH3_Msk (0x1UL << PWM_INTENCLR_COMPAREMATCH3_Pos)
  #define PWM_INTENCLR_COMPAREMATCH3_Min (0x0UL)
  #define PWM_INTENCLR_COMPAREMATCH3_Max (0x1UL)
  #define PWM_INTENCLR_COMPAREMATCH3_Clear (0x1UL)
  #define PWM_INTENCLR_COMPAREMATCH3_Disabled (0x0UL)
  #define PWM_INTENCLR_COMPAREMATCH3_Enabled (0x1UL)


/* PWM_INTPEND: Pending interrupts */
  #define PWM_INTPEND_ResetValue (0x00000000UL)

/* STOPPED @Bit 1 : Read pending status of interrupt for event STOPPED */
  #define PWM_INTPEND_STOPPED_Pos (1UL)
  #define PWM_INTPEND_STOPPED_Msk (0x1UL << PWM_INTPEND_STOPPED_Pos)
  #define PWM_INTPEND_STOPPED_Min (0x0UL)
  #define PWM_INTPEND_STOPPED_Max (0x1UL)
  #define PWM_INTPEND_STOPPED_NotPending (0x0UL)
  #define PWM_INTPEND_STOPPED_Pending (0x1UL)

/* SEQSTARTED0 @Bit 2 : Read pending status of interrupt for event SEQSTARTED[0] */
  #define PWM_INTPEND_SEQSTARTED0_Pos (2UL)
  #define PWM_INTPEND_SEQSTARTED0_Msk (0x1UL << PWM_INTPEND_SEQSTARTED0_Pos)
  #define PWM_INTPEND_SEQSTARTED0_Min (0x0UL)
  #define PWM_INTPEND_SEQSTARTED0_Max (0x1UL)
  #define PWM_INTPEND_SEQSTARTED0_NotPending (0x0UL)
  #define PWM_INTPEND_SEQSTARTED0_Pending (0x1UL)

/* SEQSTARTED1 @Bit 3 : Read pending status of interrupt for event SEQSTARTED[1] */
  #define PWM_INTPEND_SEQSTARTED1_Pos (3UL)
  #define PWM_INTPEND_SEQSTARTED1_Msk (0x1UL << PWM_INTPEND_SEQSTARTED1_Pos)
  #define PWM_INTPEND_SEQSTARTED1_Min (0x0UL)
  #define PWM_INTPEND_SEQSTARTED1_Max (0x1UL)
  #define PWM_INTPEND_SEQSTARTED1_NotPending (0x0UL)
  #define PWM_INTPEND_SEQSTARTED1_Pending (0x1UL)

/* SEQEND0 @Bit 4 : Read pending status of interrupt for event SEQEND[0] */
  #define PWM_INTPEND_SEQEND0_Pos (4UL)
  #define PWM_INTPEND_SEQEND0_Msk (0x1UL << PWM_INTPEND_SEQEND0_Pos)
  #define PWM_INTPEND_SEQEND0_Min (0x0UL)
  #define PWM_INTPEND_SEQEND0_Max (0x1UL)
  #define PWM_INTPEND_SEQEND0_NotPending (0x0UL)
  #define PWM_INTPEND_SEQEND0_Pending (0x1UL)

/* SEQEND1 @Bit 5 : Read pending status of interrupt for event SEQEND[1] */
  #define PWM_INTPEND_SEQEND1_Pos (5UL)
  #define PWM_INTPEND_SEQEND1_Msk (0x1UL << PWM_INTPEND_SEQEND1_Pos)
  #define PWM_INTPEND_SEQEND1_Min (0x0UL)
  #define PWM_INTPEND_SEQEND1_Max (0x1UL)
  #define PWM_INTPEND_SEQEND1_NotPending (0x0UL)
  #define PWM_INTPEND_SEQEND1_Pending (0x1UL)

/* PWMPERIODEND @Bit 6 : Read pending status of interrupt for event PWMPERIODEND */
  #define PWM_INTPEND_PWMPERIODEND_Pos (6UL)
  #define PWM_INTPEND_PWMPERIODEND_Msk (0x1UL << PWM_INTPEND_PWMPERIODEND_Pos)
  #define PWM_INTPEND_PWMPERIODEND_Min (0x0UL)
  #define PWM_INTPEND_PWMPERIODEND_Max (0x1UL)
  #define PWM_INTPEND_PWMPERIODEND_NotPending (0x0UL)
  #define PWM_INTPEND_PWMPERIODEND_Pending (0x1UL)

/* LOOPSDONE @Bit 7 : Read pending status of interrupt for event LOOPSDONE */
  #define PWM_INTPEND_LOOPSDONE_Pos (7UL)
  #define PWM_INTPEND_LOOPSDONE_Msk (0x1UL << PWM_INTPEND_LOOPSDONE_Pos)
  #define PWM_INTPEND_LOOPSDONE_Min (0x0UL)
  #define PWM_INTPEND_LOOPSDONE_Max (0x1UL)
  #define PWM_INTPEND_LOOPSDONE_NotPending (0x0UL)
  #define PWM_INTPEND_LOOPSDONE_Pending (0x1UL)

/* RAMUNDERFLOW @Bit 8 : Read pending status of interrupt for event RAMUNDERFLOW */
  #define PWM_INTPEND_RAMUNDERFLOW_Pos (8UL)
  #define PWM_INTPEND_RAMUNDERFLOW_Msk (0x1UL << PWM_INTPEND_RAMUNDERFLOW_Pos)
  #define PWM_INTPEND_RAMUNDERFLOW_Min (0x0UL)
  #define PWM_INTPEND_RAMUNDERFLOW_Max (0x1UL)
  #define PWM_INTPEND_RAMUNDERFLOW_NotPending (0x0UL)
  #define PWM_INTPEND_RAMUNDERFLOW_Pending (0x1UL)

/* DMASEQ0END @Bit 9 : Read pending status of interrupt for event DMASEQ0END */
  #define PWM_INTPEND_DMASEQ0END_Pos (9UL)
  #define PWM_INTPEND_DMASEQ0END_Msk (0x1UL << PWM_INTPEND_DMASEQ0END_Pos)
  #define PWM_INTPEND_DMASEQ0END_Min (0x0UL)
  #define PWM_INTPEND_DMASEQ0END_Max (0x1UL)
  #define PWM_INTPEND_DMASEQ0END_NotPending (0x0UL)
  #define PWM_INTPEND_DMASEQ0END_Pending (0x1UL)

/* DMASEQ0READY @Bit 10 : Read pending status of interrupt for event DMASEQ0READY */
  #define PWM_INTPEND_DMASEQ0READY_Pos (10UL)
  #define PWM_INTPEND_DMASEQ0READY_Msk (0x1UL << PWM_INTPEND_DMASEQ0READY_Pos)
  #define PWM_INTPEND_DMASEQ0READY_Min (0x0UL)
  #define PWM_INTPEND_DMASEQ0READY_Max (0x1UL)
  #define PWM_INTPEND_DMASEQ0READY_NotPending (0x0UL)
  #define PWM_INTPEND_DMASEQ0READY_Pending (0x1UL)

/* DMASEQ0BUSERROR @Bit 11 : Read pending status of interrupt for event DMASEQ0BUSERROR */
  #define PWM_INTPEND_DMASEQ0BUSERROR_Pos (11UL)
  #define PWM_INTPEND_DMASEQ0BUSERROR_Msk (0x1UL << PWM_INTPEND_DMASEQ0BUSERROR_Pos)
  #define PWM_INTPEND_DMASEQ0BUSERROR_Min (0x0UL)
  #define PWM_INTPEND_DMASEQ0BUSERROR_Max (0x1UL)
  #define PWM_INTPEND_DMASEQ0BUSERROR_NotPending (0x0UL)
  #define PWM_INTPEND_DMASEQ0BUSERROR_Pending (0x1UL)

/* DMASEQ1END @Bit 12 : Read pending status of interrupt for event DMASEQ1END */
  #define PWM_INTPEND_DMASEQ1END_Pos (12UL)
  #define PWM_INTPEND_DMASEQ1END_Msk (0x1UL << PWM_INTPEND_DMASEQ1END_Pos)
  #define PWM_INTPEND_DMASEQ1END_Min (0x0UL)
  #define PWM_INTPEND_DMASEQ1END_Max (0x1UL)
  #define PWM_INTPEND_DMASEQ1END_NotPending (0x0UL)
  #define PWM_INTPEND_DMASEQ1END_Pending (0x1UL)

/* DMASEQ1READY @Bit 13 : Read pending status of interrupt for event DMASEQ1READY */
  #define PWM_INTPEND_DMASEQ1READY_Pos (13UL)
  #define PWM_INTPEND_DMASEQ1READY_Msk (0x1UL << PWM_INTPEND_DMASEQ1READY_Pos)
  #define PWM_INTPEND_DMASEQ1READY_Min (0x0UL)
  #define PWM_INTPEND_DMASEQ1READY_Max (0x1UL)
  #define PWM_INTPEND_DMASEQ1READY_NotPending (0x0UL)
  #define PWM_INTPEND_DMASEQ1READY_Pending (0x1UL)

/* DMASEQ1BUSERROR @Bit 14 : Read pending status of interrupt for event DMASEQ1BUSERROR */
  #define PWM_INTPEND_DMASEQ1BUSERROR_Pos (14UL)
  #define PWM_INTPEND_DMASEQ1BUSERROR_Msk (0x1UL << PWM_INTPEND_DMASEQ1BUSERROR_Pos)
  #define PWM_INTPEND_DMASEQ1BUSERROR_Min (0x0UL)
  #define PWM_INTPEND_DMASEQ1BUSERROR_Max (0x1UL)
  #define PWM_INTPEND_DMASEQ1BUSERROR_NotPending (0x0UL)
  #define PWM_INTPEND_DMASEQ1BUSERROR_Pending (0x1UL)

/* COMPAREMATCH0 @Bit 15 : Read pending status of interrupt for event COMPAREMATCH[0] */
  #define PWM_INTPEND_COMPAREMATCH0_Pos (15UL)
  #define PWM_INTPEND_COMPAREMATCH0_Msk (0x1UL << PWM_INTPEND_COMPAREMATCH0_Pos)
  #define PWM_INTPEND_COMPAREMATCH0_Min (0x0UL)
  #define PWM_INTPEND_COMPAREMATCH0_Max (0x1UL)
  #define PWM_INTPEND_COMPAREMATCH0_NotPending (0x0UL)
  #define PWM_INTPEND_COMPAREMATCH0_Pending (0x1UL)

