pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPAREMATCH1 @Bit 16 : Read pending status of interrupt for event COMPAREMATCH[1] */
  #define PWM_INTPEND_COMPAREMATCH1_Pos (16UL)
  #define PWM_INTPEND_COMPAREMATCH1_Msk (0x1UL << PWM_INTPEND_COMPAREMATCH1_Pos)
  #define PWM_INTPEND_COMPAREMATCH1_Min (0x0UL)
  #define PWM_INTPEND_COMPAREMATCH1_Max (0x1UL)
  #define PWM_INTPEND_COMPAREMATCH1_NotPending (0x0UL)
  #define PWM_INTPEND_COMPAREMATCH1_Pending (0x1UL)

/* COMPAREMATCH2 @Bit 17 : Read pending status of interrupt for event COMPAREMATCH[2] */
  #define PWM_INTPEND_COMPAREMATCH2_Pos (17UL)
  #define PWM_INTPEND_COMPAREMATCH2_Msk (0x1UL << PWM_INTPEND_COMPAREMATCH2_Pos)
  #define PWM_INTPEND_COMPAREMATCH2_Min (0x0UL)
  #define PWM_INTPEND_COMPAREMATCH2_Max (0x1UL)
  #define PWM_INTPEND_COMPAREMATCH2_NotPending (0x0UL)
  #define PWM_INTPEND_COMPAREMATCH2_Pending (0x1UL)

/* COMPAREMATCH3 @Bit 18 : Read pending status of interrupt for event COMPAREMATCH[3] */
  #define PWM_INTPEND_COMPAREMATCH3_Pos (18UL)
  #define PWM_INTPEND_COMPAREMATCH3_Msk (0x1UL << PWM_INTPEND_COMPAREMATCH3_Pos)
  #define PWM_INTPEND_COMPAREMATCH3_Min (0x0UL)
  #define PWM_INTPEND_COMPAREMATCH3_Max (0x1UL)
  #define PWM_INTPEND_COMPAREMATCH3_NotPending (0x0UL)
  #define PWM_INTPEND_COMPAREMATCH3_Pending (0x1UL)


/* PWM_ENABLE: PWM module enable register */
  #define PWM_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable or disable PWM module */
  #define PWM_ENABLE_ENABLE_Pos (0UL)
  #define PWM_ENABLE_ENABLE_Msk (0x1UL << PWM_ENABLE_ENABLE_Pos)
  #define PWM_ENABLE_ENABLE_Min (0x0UL)
  #define PWM_ENABLE_ENABLE_Max (0x1UL)
  #define PWM_ENABLE_ENABLE_Disabled (0x0UL)
  #define PWM_ENABLE_ENABLE_Enabled (0x1UL)


/* PWM_MODE: Selects operating mode of the wave counter */
  #define PWM_MODE_ResetValue (0x00000000UL)

/* UPDOWN @Bit 0 : Selects up mode or up-and-down mode for the counter */
  #define PWM_MODE_UPDOWN_Pos (0UL)
  #define PWM_MODE_UPDOWN_Msk (0x1UL << PWM_MODE_UPDOWN_Pos)
  #define PWM_MODE_UPDOWN_Min (0x0UL)
  #define PWM_MODE_UPDOWN_Max (0x1UL)
  #define PWM_MODE_UPDOWN_Up (0x0UL)
  #define PWM_MODE_UPDOWN_UpAndDown (0x1UL)


/* PWM_COUNTERTOP: Value up to which the pulse generator counter counts */
  #define PWM_COUNTERTOP_ResetValue (0x000003FFUL)

/* COUNTERTOP @Bits 0..14 : Value up to which the pulse generator counter counts. This register is ignored when
                            DECODER.MODE=WaveForm and only values from RAM are used. */

  #define PWM_COUNTERTOP_COUNTERTOP_Pos (0UL)
  #define PWM_COUNTERTOP_COUNTERTOP_Msk (0x7FFFUL << PWM_COUNTERTOP_COUNTERTOP_Pos)
  #define PWM_COUNTERTOP_COUNTERTOP_Min (0x0003UL)
  #define PWM_COUNTERTOP_COUNTERTOP_Max (0x7FFFUL)


/* PWM_PRESCALER: Configuration for PWM_CLK */
  #define PWM_PRESCALER_ResetValue (0x00000000UL)

/* PRESCALER @Bits 0..2 : Prescaler of PWM_CLK */
  #define PWM_PRESCALER_PRESCALER_Pos (0UL)
  #define PWM_PRESCALER_PRESCALER_Msk (0x7UL << PWM_PRESCALER_PRESCALER_Pos)
  #define PWM_PRESCALER_PRESCALER_Min (0x0UL)
  #define PWM_PRESCALER_PRESCALER_Max (0x7UL)
  #define PWM_PRESCALER_PRESCALER_DIV_1 (0x0UL)
  #define PWM_PRESCALER_PRESCALER_DIV_2 (0x1UL)
  #define PWM_PRESCALER_PRESCALER_DIV_4 (0x2UL)
  #define PWM_PRESCALER_PRESCALER_DIV_8 (0x3UL)
  #define PWM_PRESCALER_PRESCALER_DIV_16 (0x4UL)
  #define PWM_PRESCALER_PRESCALER_DIV_32 (0x5UL)
  #define PWM_PRESCALER_PRESCALER_DIV_64 (0x6UL)
  #define PWM_PRESCALER_PRESCALER_DIV_128 (0x7UL)


/* PWM_DECODER: Configuration of the decoder */
  #define PWM_DECODER_ResetValue (0x00000000UL)

/* LOAD @Bits 0..1 : How a sequence is read from RAM and spread to the compare register */
  #define PWM_DECODER_LOAD_Pos (0UL)
  #define PWM_DECODER_LOAD_Msk (0x3UL << PWM_DECODER_LOAD_Pos)
  #define PWM_DECODER_LOAD_Min (0x0UL)
  #define PWM_DECODER_LOAD_Max (0x3UL)
  #define PWM_DECODER_LOAD_Common (0x0UL)
  #define PWM_DECODER_LOAD_Grouped (0x1UL)
  #define PWM_DECODER_LOAD_Individual (0x2UL)
  #define PWM_DECODER_LOAD_WaveForm (0x3UL)

/* MODE @Bit 8 : Selects source for advancing the active sequence */
  #define PWM_DECODER_MODE_Pos (8UL)
  #define PWM_DECODER_MODE_Msk (0x1UL << PWM_DECODER_MODE_Pos)
  #define PWM_DECODER_MODE_Min (0x0UL)
  #define PWM_DECODER_MODE_Max (0x1UL)
  #define PWM_DECODER_MODE_RefreshCount (0x0UL)      /*!< SEQ[n].REFRESH is used to determine loading internal compare
                                                          registers*/
  #define PWM_DECODER_MODE_NextStep (0x1UL)          /*!< NEXTSTEP task causes a new value to be loaded to internal compare
                                                          registers*/


/* PWM_LOOP: Number of playbacks of a loop */
  #define PWM_LOOP_ResetValue (0x00000000UL)

/* CNT @Bits 0..15 : Number of playbacks of pattern cycles */
  #define PWM_LOOP_CNT_Pos (0UL)
  #define PWM_LOOP_CNT_Msk (0xFFFFUL << PWM_LOOP_CNT_Pos)
  #define PWM_LOOP_CNT_Min (0x0UL)
  #define PWM_LOOP_CNT_Max (0x0UL)
  #define PWM_LOOP_CNT_Disabled (0x0000UL)


/* PWM_IDLEOUT: Configure the output value on the PWM channel during idle */
  #define PWM_IDLEOUT_ResetValue (0x00000000UL)

/* VAL0 @Bit 0 : Idle output value for PWM channel [0] */
  #define PWM_IDLEOUT_VAL0_Pos (0UL)
  #define PWM_IDLEOUT_VAL0_Msk (0x1UL << PWM_IDLEOUT_VAL0_Pos)

/* VAL1 @Bit 1 : Idle output value for PWM channel [1] */
  #define PWM_IDLEOUT_VAL1_Pos (1UL)
  #define PWM_IDLEOUT_VAL1_Msk (0x1UL << PWM_IDLEOUT_VAL1_Pos)

/* VAL2 @Bit 2 : Idle output value for PWM channel [2] */
  #define PWM_IDLEOUT_VAL2_Pos (2UL)
  #define PWM_IDLEOUT_VAL2_Msk (0x1UL << PWM_IDLEOUT_VAL2_Pos)

/* VAL3 @Bit 3 : Idle output value for PWM channel [3] */
  #define PWM_IDLEOUT_VAL3_Pos (3UL)
  #define PWM_IDLEOUT_VAL3_Msk (0x1UL << PWM_IDLEOUT_VAL3_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           QDEC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct QDEC_PSEL ===================================================== */
/**
  * @brief PSEL [QDEC_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LED;
  __IOM uint32_t  A;
  __IOM uint32_t  B;
} NRF_QDEC_PSEL_Type;

/* QDEC_PSEL_LED: Pin select for LED signal */
  #define QDEC_PSEL_LED_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define QDEC_PSEL_LED_PIN_Pos (0UL)
  #define QDEC_PSEL_LED_PIN_Msk (0x1FUL << QDEC_PSEL_LED_PIN_Pos)
  #define QDEC_PSEL_LED_PIN_Min (0x00UL)
  #define QDEC_PSEL_LED_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define QDEC_PSEL_LED_PORT_Pos (5UL)
  #define QDEC_PSEL_LED_PORT_Msk (0xFUL << QDEC_PSEL_LED_PORT_Pos)
  #define QDEC_PSEL_LED_PORT_Min (0x0UL)
  #define QDEC_PSEL_LED_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define QDEC_PSEL_LED_CONNECT_Pos (31UL)
  #define QDEC_PSEL_LED_CONNECT_Msk (0x1UL << QDEC_PSEL_LED_CONNECT_Pos)
  #define QDEC_PSEL_LED_CONNECT_Min (0x0UL)
  #define QDEC_PSEL_LED_CONNECT_Max (0x1UL)
  #define QDEC_PSEL_LED_CONNECT_Disconnected (0x1UL)
  #define QDEC_PSEL_LED_CONNECT_Connected (0x0UL)


/* QDEC_PSEL_A: Pin select for A signal */
  #define QDEC_PSEL_A_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define QDEC_PSEL_A_PIN_Pos (0UL)
  #define QDEC_PSEL_A_PIN_Msk (0x1FUL << QDEC_PSEL_A_PIN_Pos)
  #define QDEC_PSEL_A_PIN_Min (0x00UL)
  #define QDEC_PSEL_A_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define QDEC_PSEL_A_PORT_Pos (5UL)
  #define QDEC_PSEL_A_PORT_Msk (0xFUL << QDEC_PSEL_A_PORT_Pos)
  #define QDEC_PSEL_A_PORT_Min (0x0UL)
  #define QDEC_PSEL_A_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define QDEC_PSEL_A_CONNECT_Pos (31UL)
  #define QDEC_PSEL_A_CONNECT_Msk (0x1UL << QDEC_PSEL_A_CONNECT_Pos)
  #define QDEC_PSEL_A_CONNECT_Min (0x0UL)
  #define QDEC_PSEL_A_CONNECT_Max (0x1UL)
  #define QDEC_PSEL_A_CONNECT_Disconnected (0x1UL)
  #define QDEC_PSEL_A_CONNECT_Connected (0x0UL)


