pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* QDEC_PSEL_B: Pin select for B signal */
  #define QDEC_PSEL_B_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define QDEC_PSEL_B_PIN_Pos (0UL)
  #define QDEC_PSEL_B_PIN_Msk (0x1FUL << QDEC_PSEL_B_PIN_Pos)
  #define QDEC_PSEL_B_PIN_Min (0x00UL)
  #define QDEC_PSEL_B_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define QDEC_PSEL_B_PORT_Pos (5UL)
  #define QDEC_PSEL_B_PORT_Msk (0xFUL << QDEC_PSEL_B_PORT_Pos)
  #define QDEC_PSEL_B_PORT_Min (0x0UL)
  #define QDEC_PSEL_B_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define QDEC_PSEL_B_CONNECT_Pos (31UL)
  #define QDEC_PSEL_B_CONNECT_Msk (0x1UL << QDEC_PSEL_B_CONNECT_Pos)
  #define QDEC_PSEL_B_CONNECT_Min (0x0UL)
  #define QDEC_PSEL_B_CONNECT_Max (0x1UL)
  #define QDEC_PSEL_B_CONNECT_Disconnected (0x1UL)
  #define QDEC_PSEL_B_CONNECT_Connected (0x0UL)


/* ======================================================= Struct QDEC ======================================================= */
/**
  * @brief Quadrature Decoder
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_READCLRACC;
    __OM uint32_t TASKS_RDCLRACC;
    __OM uint32_t TASKS_RDCLRDBL;
    __IM uint32_t RESERVED[27];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_READCLRACC;
    __IOM uint32_t SUBSCRIBE_RDCLRACC;
    __IOM uint32_t SUBSCRIBE_RDCLRDBL;
    __IM uint32_t RESERVED1[27];
    __IOM uint32_t EVENTS_SAMPLERDY;                 /*!< (@ 0x00000100) Event being generated for every new sample value
                                                                         written to the SAMPLE register*/
    __IOM uint32_t EVENTS_REPORTRDY;
    __IOM uint32_t EVENTS_ACCOF;
    __IOM uint32_t EVENTS_DBLRDY;
    __IOM uint32_t EVENTS_STOPPED;
    __IM uint32_t RESERVED2[27];
    __IOM uint32_t PUBLISH_SAMPLERDY;
    __IOM uint32_t PUBLISH_REPORTRDY;
    __IOM uint32_t PUBLISH_ACCOF;
    __IOM uint32_t PUBLISH_DBLRDY;
    __IOM uint32_t PUBLISH_STOPPED;
    __IM uint32_t RESERVED3[27];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED4[64];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED5[125];
    __IOM uint32_t ENABLE;
    __IOM uint32_t LEDPOL;
    __IOM uint32_t SAMPLEPER;
    __IM int32_t  SAMPLE;
    __IOM uint32_t REPORTPER;                        /*!< (@ 0x00000510) Number of samples to be taken before REPORTRDY and
                                                                         DBLRDY events can be generated*/
    __IM int32_t  ACC;
    __IM int32_t  ACCREAD;                           /*!< (@ 0x00000518) Snapshot of the ACC register, updated by the READCLRACC
                                                                         or RDCLRACC task*/
    __IOM NRF_QDEC_PSEL_Type PSEL;
    __IOM uint32_t DBFEN;
    __IM uint32_t RESERVED6[5];
    __IOM uint32_t LEDPRE;
    __IM uint32_t ACCDBL;                            /*!< (@ 0x00000544) Register accumulating the number of detected double
                                                                         transitions*/
    __IM uint32_t ACCDBLREAD;                        /*!< (@ 0x00000548) Snapshot of the ACCDBL, updated by the READCLRACC or
                                                                         RDCLRDBL task*/
  } NRF_QDEC_Type;

/* QDEC_TASKS_START: Task starting the quadrature decoder */
  #define QDEC_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Task starting the quadrature decoder */
  #define QDEC_TASKS_START_TASKS_START_Pos (0UL)
  #define QDEC_TASKS_START_TASKS_START_Msk (0x1UL << QDEC_TASKS_START_TASKS_START_Pos)
  #define QDEC_TASKS_START_TASKS_START_Min (0x1UL)
  #define QDEC_TASKS_START_TASKS_START_Max (0x1UL)
  #define QDEC_TASKS_START_TASKS_START_Trigger (0x1UL)


/* QDEC_TASKS_STOP: Task stopping the quadrature decoder */
  #define QDEC_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Task stopping the quadrature decoder */
  #define QDEC_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define QDEC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << QDEC_TASKS_STOP_TASKS_STOP_Pos)
  #define QDEC_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define QDEC_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define QDEC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* QDEC_TASKS_READCLRACC: Read and clear ACC and ACCDBL */
  #define QDEC_TASKS_READCLRACC_ResetValue (0x00000000UL)

/* TASKS_READCLRACC @Bit 0 : Read and clear ACC and ACCDBL */
  #define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Pos (0UL)
  #define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Msk (0x1UL << QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Pos) /*!< Bit mask of
                                                                            TASKS_READCLRACC field.*/
  #define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Min (0x1UL)
  #define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Max (0x1UL)
  #define QDEC_TASKS_READCLRACC_TASKS_READCLRACC_Trigger (0x1UL)


/* QDEC_TASKS_RDCLRACC: Read and clear ACC */
  #define QDEC_TASKS_RDCLRACC_ResetValue (0x00000000UL)

/* TASKS_RDCLRACC @Bit 0 : Read and clear ACC */
  #define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Pos (0UL)
  #define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Msk (0x1UL << QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Pos) /*!< Bit mask of
                                                                            TASKS_RDCLRACC field.*/
  #define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Min (0x1UL)
  #define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Max (0x1UL)
  #define QDEC_TASKS_RDCLRACC_TASKS_RDCLRACC_Trigger (0x1UL)


/* QDEC_TASKS_RDCLRDBL: Read and clear ACCDBL */
  #define QDEC_TASKS_RDCLRDBL_ResetValue (0x00000000UL)

/* TASKS_RDCLRDBL @Bit 0 : Read and clear ACCDBL */
  #define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Pos (0UL)
  #define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Msk (0x1UL << QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Pos) /*!< Bit mask of
                                                                            TASKS_RDCLRDBL field.*/
  #define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Min (0x1UL)
  #define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Max (0x1UL)
  #define QDEC_TASKS_RDCLRDBL_TASKS_RDCLRDBL_Trigger (0x1UL)


/* QDEC_SUBSCRIBE_START: Subscribe configuration for task START */
  #define QDEC_SUBSCRIBE_START_ResetValue (0x00000000UL)

