pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define QDEC_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define QDEC_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << QDEC_SUBSCRIBE_START_CHIDX_Pos)
  #define QDEC_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define QDEC_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_SUBSCRIBE_START_EN_Pos (31UL)
  #define QDEC_SUBSCRIBE_START_EN_Msk (0x1UL << QDEC_SUBSCRIBE_START_EN_Pos)
  #define QDEC_SUBSCRIBE_START_EN_Min (0x0UL)
  #define QDEC_SUBSCRIBE_START_EN_Max (0x1UL)
  #define QDEC_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define QDEC_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* QDEC_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define QDEC_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define QDEC_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define QDEC_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << QDEC_SUBSCRIBE_STOP_CHIDX_Pos)
  #define QDEC_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define QDEC_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define QDEC_SUBSCRIBE_STOP_EN_Msk (0x1UL << QDEC_SUBSCRIBE_STOP_EN_Pos)
  #define QDEC_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define QDEC_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define QDEC_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define QDEC_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* QDEC_SUBSCRIBE_READCLRACC: Subscribe configuration for task READCLRACC */
  #define QDEC_SUBSCRIBE_READCLRACC_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task READCLRACC will subscribe to */
  #define QDEC_SUBSCRIBE_READCLRACC_CHIDX_Pos (0UL)
  #define QDEC_SUBSCRIBE_READCLRACC_CHIDX_Msk (0xFFUL << QDEC_SUBSCRIBE_READCLRACC_CHIDX_Pos)
  #define QDEC_SUBSCRIBE_READCLRACC_CHIDX_Min (0x00UL)
  #define QDEC_SUBSCRIBE_READCLRACC_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_SUBSCRIBE_READCLRACC_EN_Pos (31UL)
  #define QDEC_SUBSCRIBE_READCLRACC_EN_Msk (0x1UL << QDEC_SUBSCRIBE_READCLRACC_EN_Pos)
  #define QDEC_SUBSCRIBE_READCLRACC_EN_Min (0x0UL)
  #define QDEC_SUBSCRIBE_READCLRACC_EN_Max (0x1UL)
  #define QDEC_SUBSCRIBE_READCLRACC_EN_Disabled (0x0UL)
  #define QDEC_SUBSCRIBE_READCLRACC_EN_Enabled (0x1UL)


/* QDEC_SUBSCRIBE_RDCLRACC: Subscribe configuration for task RDCLRACC */
  #define QDEC_SUBSCRIBE_RDCLRACC_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RDCLRACC will subscribe to */
  #define QDEC_SUBSCRIBE_RDCLRACC_CHIDX_Pos (0UL)
  #define QDEC_SUBSCRIBE_RDCLRACC_CHIDX_Msk (0xFFUL << QDEC_SUBSCRIBE_RDCLRACC_CHIDX_Pos)
  #define QDEC_SUBSCRIBE_RDCLRACC_CHIDX_Min (0x00UL)
  #define QDEC_SUBSCRIBE_RDCLRACC_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_SUBSCRIBE_RDCLRACC_EN_Pos (31UL)
  #define QDEC_SUBSCRIBE_RDCLRACC_EN_Msk (0x1UL << QDEC_SUBSCRIBE_RDCLRACC_EN_Pos)
  #define QDEC_SUBSCRIBE_RDCLRACC_EN_Min (0x0UL)
  #define QDEC_SUBSCRIBE_RDCLRACC_EN_Max (0x1UL)
  #define QDEC_SUBSCRIBE_RDCLRACC_EN_Disabled (0x0UL)
  #define QDEC_SUBSCRIBE_RDCLRACC_EN_Enabled (0x1UL)


/* QDEC_SUBSCRIBE_RDCLRDBL: Subscribe configuration for task RDCLRDBL */
  #define QDEC_SUBSCRIBE_RDCLRDBL_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RDCLRDBL will subscribe to */
  #define QDEC_SUBSCRIBE_RDCLRDBL_CHIDX_Pos (0UL)
  #define QDEC_SUBSCRIBE_RDCLRDBL_CHIDX_Msk (0xFFUL << QDEC_SUBSCRIBE_RDCLRDBL_CHIDX_Pos)
  #define QDEC_SUBSCRIBE_RDCLRDBL_CHIDX_Min (0x00UL)
  #define QDEC_SUBSCRIBE_RDCLRDBL_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_SUBSCRIBE_RDCLRDBL_EN_Pos (31UL)
  #define QDEC_SUBSCRIBE_RDCLRDBL_EN_Msk (0x1UL << QDEC_SUBSCRIBE_RDCLRDBL_EN_Pos)
  #define QDEC_SUBSCRIBE_RDCLRDBL_EN_Min (0x0UL)
  #define QDEC_SUBSCRIBE_RDCLRDBL_EN_Max (0x1UL)
  #define QDEC_SUBSCRIBE_RDCLRDBL_EN_Disabled (0x0UL)
  #define QDEC_SUBSCRIBE_RDCLRDBL_EN_Enabled (0x1UL)


/* QDEC_EVENTS_SAMPLERDY: Event being generated for every new sample value written to the SAMPLE register */
  #define QDEC_EVENTS_SAMPLERDY_ResetValue (0x00000000UL)

/* EVENTS_SAMPLERDY @Bit 0 : Event being generated for every new sample value written to the SAMPLE register */
  #define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Pos (0UL)
  #define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Msk (0x1UL << QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Pos) /*!< Bit mask of
                                                                            EVENTS_SAMPLERDY field.*/
  #define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Min (0x0UL)
  #define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Max (0x1UL)
  #define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_NotGenerated (0x0UL)
  #define QDEC_EVENTS_SAMPLERDY_EVENTS_SAMPLERDY_Generated (0x1UL)


/* QDEC_EVENTS_REPORTRDY: Non-null report ready */
  #define QDEC_EVENTS_REPORTRDY_ResetValue (0x00000000UL)

/* EVENTS_REPORTRDY @Bit 0 : Non-null report ready */
  #define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Pos (0UL)
  #define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Msk (0x1UL << QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Pos) /*!< Bit mask of
                                                                            EVENTS_REPORTRDY field.*/
  #define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Min (0x0UL)
  #define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Max (0x1UL)
  #define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_NotGenerated (0x0UL)
  #define QDEC_EVENTS_REPORTRDY_EVENTS_REPORTRDY_Generated (0x1UL)


/* QDEC_EVENTS_ACCOF: ACC or ACCDBL register overflow */
  #define QDEC_EVENTS_ACCOF_ResetValue (0x00000000UL)

/* EVENTS_ACCOF @Bit 0 : ACC or ACCDBL register overflow */
  #define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Pos (0UL)
  #define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Msk (0x1UL << QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Pos)
  #define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Min (0x0UL)
  #define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Max (0x1UL)
  #define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_NotGenerated (0x0UL)
  #define QDEC_EVENTS_ACCOF_EVENTS_ACCOF_Generated (0x1UL)


/* QDEC_EVENTS_DBLRDY: Double displacement(s) detected */
  #define QDEC_EVENTS_DBLRDY_ResetValue (0x00000000UL)

/* EVENTS_DBLRDY @Bit 0 : Double displacement(s) detected */
  #define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Pos (0UL)
  #define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Msk (0x1UL << QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Pos) /*!< Bit mask of EVENTS_DBLRDY
                                                                            field.*/
  #define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Min (0x0UL)
  #define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Max (0x1UL)
  #define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_NotGenerated (0x0UL)
  #define QDEC_EVENTS_DBLRDY_EVENTS_DBLRDY_Generated (0x1UL)


