pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* QDEC_EVENTS_STOPPED: QDEC has been stopped */
  #define QDEC_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : QDEC has been stopped */
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define QDEC_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* QDEC_PUBLISH_SAMPLERDY: Publish configuration for event SAMPLERDY */
  #define QDEC_PUBLISH_SAMPLERDY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event SAMPLERDY will publish to */
  #define QDEC_PUBLISH_SAMPLERDY_CHIDX_Pos (0UL)
  #define QDEC_PUBLISH_SAMPLERDY_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_SAMPLERDY_CHIDX_Pos)
  #define QDEC_PUBLISH_SAMPLERDY_CHIDX_Min (0x00UL)
  #define QDEC_PUBLISH_SAMPLERDY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_SAMPLERDY_EN_Pos (31UL)
  #define QDEC_PUBLISH_SAMPLERDY_EN_Msk (0x1UL << QDEC_PUBLISH_SAMPLERDY_EN_Pos)
  #define QDEC_PUBLISH_SAMPLERDY_EN_Min (0x0UL)
  #define QDEC_PUBLISH_SAMPLERDY_EN_Max (0x1UL)
  #define QDEC_PUBLISH_SAMPLERDY_EN_Disabled (0x0UL)
  #define QDEC_PUBLISH_SAMPLERDY_EN_Enabled (0x1UL)


/* QDEC_PUBLISH_REPORTRDY: Publish configuration for event REPORTRDY */
  #define QDEC_PUBLISH_REPORTRDY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event REPORTRDY will publish to */
  #define QDEC_PUBLISH_REPORTRDY_CHIDX_Pos (0UL)
  #define QDEC_PUBLISH_REPORTRDY_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_REPORTRDY_CHIDX_Pos)
  #define QDEC_PUBLISH_REPORTRDY_CHIDX_Min (0x00UL)
  #define QDEC_PUBLISH_REPORTRDY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_REPORTRDY_EN_Pos (31UL)
  #define QDEC_PUBLISH_REPORTRDY_EN_Msk (0x1UL << QDEC_PUBLISH_REPORTRDY_EN_Pos)
  #define QDEC_PUBLISH_REPORTRDY_EN_Min (0x0UL)
  #define QDEC_PUBLISH_REPORTRDY_EN_Max (0x1UL)
  #define QDEC_PUBLISH_REPORTRDY_EN_Disabled (0x0UL)
  #define QDEC_PUBLISH_REPORTRDY_EN_Enabled (0x1UL)


/* QDEC_PUBLISH_ACCOF: Publish configuration for event ACCOF */
  #define QDEC_PUBLISH_ACCOF_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event ACCOF will publish to */
  #define QDEC_PUBLISH_ACCOF_CHIDX_Pos (0UL)
  #define QDEC_PUBLISH_ACCOF_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_ACCOF_CHIDX_Pos)
  #define QDEC_PUBLISH_ACCOF_CHIDX_Min (0x00UL)
  #define QDEC_PUBLISH_ACCOF_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_ACCOF_EN_Pos (31UL)
  #define QDEC_PUBLISH_ACCOF_EN_Msk (0x1UL << QDEC_PUBLISH_ACCOF_EN_Pos)
  #define QDEC_PUBLISH_ACCOF_EN_Min (0x0UL)
  #define QDEC_PUBLISH_ACCOF_EN_Max (0x1UL)
  #define QDEC_PUBLISH_ACCOF_EN_Disabled (0x0UL)
  #define QDEC_PUBLISH_ACCOF_EN_Enabled (0x1UL)


/* QDEC_PUBLISH_DBLRDY: Publish configuration for event DBLRDY */
  #define QDEC_PUBLISH_DBLRDY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event DBLRDY will publish to */
  #define QDEC_PUBLISH_DBLRDY_CHIDX_Pos (0UL)
  #define QDEC_PUBLISH_DBLRDY_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_DBLRDY_CHIDX_Pos)
  #define QDEC_PUBLISH_DBLRDY_CHIDX_Min (0x00UL)
  #define QDEC_PUBLISH_DBLRDY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_DBLRDY_EN_Pos (31UL)
  #define QDEC_PUBLISH_DBLRDY_EN_Msk (0x1UL << QDEC_PUBLISH_DBLRDY_EN_Pos)
  #define QDEC_PUBLISH_DBLRDY_EN_Min (0x0UL)
  #define QDEC_PUBLISH_DBLRDY_EN_Max (0x1UL)
  #define QDEC_PUBLISH_DBLRDY_EN_Disabled (0x0UL)
  #define QDEC_PUBLISH_DBLRDY_EN_Enabled (0x1UL)


/* QDEC_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define QDEC_PUBLISH_STOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define QDEC_PUBLISH_STOPPED_CHIDX_Pos (0UL)
  #define QDEC_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << QDEC_PUBLISH_STOPPED_CHIDX_Pos)
  #define QDEC_PUBLISH_STOPPED_CHIDX_Min (0x00UL)
  #define QDEC_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define QDEC_PUBLISH_STOPPED_EN_Pos (31UL)
  #define QDEC_PUBLISH_STOPPED_EN_Msk (0x1UL << QDEC_PUBLISH_STOPPED_EN_Pos)
  #define QDEC_PUBLISH_STOPPED_EN_Min (0x0UL)
  #define QDEC_PUBLISH_STOPPED_EN_Max (0x1UL)
  #define QDEC_PUBLISH_STOPPED_EN_Disabled (0x0UL)
  #define QDEC_PUBLISH_STOPPED_EN_Enabled (0x1UL)


/* QDEC_SHORTS: Shortcuts between local events and tasks */
  #define QDEC_SHORTS_ResetValue (0x00000000UL)

/* REPORTRDY_READCLRACC @Bit 0 : Shortcut between event REPORTRDY and task READCLRACC */
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Pos (0UL)
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Msk (0x1UL << QDEC_SHORTS_REPORTRDY_READCLRACC_Pos) /*!< Bit mask of
                                                                            REPORTRDY_READCLRACC field.*/
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Min (0x0UL)
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Max (0x1UL)
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Disabled (0x0UL)
  #define QDEC_SHORTS_REPORTRDY_READCLRACC_Enabled (0x1UL)

/* SAMPLERDY_STOP @Bit 1 : Shortcut between event SAMPLERDY and task STOP */
  #define QDEC_SHORTS_SAMPLERDY_STOP_Pos (1UL)
  #define QDEC_SHORTS_SAMPLERDY_STOP_Msk (0x1UL << QDEC_SHORTS_SAMPLERDY_STOP_Pos)
  #define QDEC_SHORTS_SAMPLERDY_STOP_Min (0x0UL)
  #define QDEC_SHORTS_SAMPLERDY_STOP_Max (0x1UL)
  #define QDEC_SHORTS_SAMPLERDY_STOP_Disabled (0x0UL)
  #define QDEC_SHORTS_SAMPLERDY_STOP_Enabled (0x1UL)

/* REPORTRDY_RDCLRACC @Bit 2 : Shortcut between event REPORTRDY and task RDCLRACC */
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Pos (2UL)
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Msk (0x1UL << QDEC_SHORTS_REPORTRDY_RDCLRACC_Pos) /*!< Bit mask of REPORTRDY_RDCLRACC
                                                                            field.*/
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Min (0x0UL)
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Max (0x1UL)
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Disabled (0x0UL)
  #define QDEC_SHORTS_REPORTRDY_RDCLRACC_Enabled (0x1UL)

/* REPORTRDY_STOP @Bit 3 : Shortcut between event REPORTRDY and task STOP */
  #define QDEC_SHORTS_REPORTRDY_STOP_Pos (3UL)
  #define QDEC_SHORTS_REPORTRDY_STOP_Msk (0x1UL << QDEC_SHORTS_REPORTRDY_STOP_Pos)
  #define QDEC_SHORTS_REPORTRDY_STOP_Min (0x0UL)
  #define QDEC_SHORTS_REPORTRDY_STOP_Max (0x1UL)
  #define QDEC_SHORTS_REPORTRDY_STOP_Disabled (0x0UL)
  #define QDEC_SHORTS_REPORTRDY_STOP_Enabled (0x1UL)

