pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DBLRDY_RDCLRDBL @Bit 4 : Shortcut between event DBLRDY and task RDCLRDBL */
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Pos (4UL)
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Msk (0x1UL << QDEC_SHORTS_DBLRDY_RDCLRDBL_Pos)
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Min (0x0UL)
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Max (0x1UL)
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Disabled (0x0UL)
  #define QDEC_SHORTS_DBLRDY_RDCLRDBL_Enabled (0x1UL)

/* DBLRDY_STOP @Bit 5 : Shortcut between event DBLRDY and task STOP */
  #define QDEC_SHORTS_DBLRDY_STOP_Pos (5UL)
  #define QDEC_SHORTS_DBLRDY_STOP_Msk (0x1UL << QDEC_SHORTS_DBLRDY_STOP_Pos)
  #define QDEC_SHORTS_DBLRDY_STOP_Min (0x0UL)
  #define QDEC_SHORTS_DBLRDY_STOP_Max (0x1UL)
  #define QDEC_SHORTS_DBLRDY_STOP_Disabled (0x0UL)
  #define QDEC_SHORTS_DBLRDY_STOP_Enabled (0x1UL)

/* SAMPLERDY_READCLRACC @Bit 6 : Shortcut between event SAMPLERDY and task READCLRACC */
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Pos (6UL)
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Msk (0x1UL << QDEC_SHORTS_SAMPLERDY_READCLRACC_Pos) /*!< Bit mask of
                                                                            SAMPLERDY_READCLRACC field.*/
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Min (0x0UL)
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Max (0x1UL)
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Disabled (0x0UL)
  #define QDEC_SHORTS_SAMPLERDY_READCLRACC_Enabled (0x1UL)


/* QDEC_INTENSET: Enable interrupt */
  #define QDEC_INTENSET_ResetValue (0x00000000UL)

/* SAMPLERDY @Bit 0 : Write '1' to enable interrupt for event SAMPLERDY */
  #define QDEC_INTENSET_SAMPLERDY_Pos (0UL)
  #define QDEC_INTENSET_SAMPLERDY_Msk (0x1UL << QDEC_INTENSET_SAMPLERDY_Pos)
  #define QDEC_INTENSET_SAMPLERDY_Min (0x0UL)
  #define QDEC_INTENSET_SAMPLERDY_Max (0x1UL)
  #define QDEC_INTENSET_SAMPLERDY_Set (0x1UL)
  #define QDEC_INTENSET_SAMPLERDY_Disabled (0x0UL)
  #define QDEC_INTENSET_SAMPLERDY_Enabled (0x1UL)

/* REPORTRDY @Bit 1 : Write '1' to enable interrupt for event REPORTRDY */
  #define QDEC_INTENSET_REPORTRDY_Pos (1UL)
  #define QDEC_INTENSET_REPORTRDY_Msk (0x1UL << QDEC_INTENSET_REPORTRDY_Pos)
  #define QDEC_INTENSET_REPORTRDY_Min (0x0UL)
  #define QDEC_INTENSET_REPORTRDY_Max (0x1UL)
  #define QDEC_INTENSET_REPORTRDY_Set (0x1UL)
  #define QDEC_INTENSET_REPORTRDY_Disabled (0x0UL)
  #define QDEC_INTENSET_REPORTRDY_Enabled (0x1UL)

/* ACCOF @Bit 2 : Write '1' to enable interrupt for event ACCOF */
  #define QDEC_INTENSET_ACCOF_Pos (2UL)
  #define QDEC_INTENSET_ACCOF_Msk (0x1UL << QDEC_INTENSET_ACCOF_Pos)
  #define QDEC_INTENSET_ACCOF_Min (0x0UL)
  #define QDEC_INTENSET_ACCOF_Max (0x1UL)
  #define QDEC_INTENSET_ACCOF_Set (0x1UL)
  #define QDEC_INTENSET_ACCOF_Disabled (0x0UL)
  #define QDEC_INTENSET_ACCOF_Enabled (0x1UL)

/* DBLRDY @Bit 3 : Write '1' to enable interrupt for event DBLRDY */
  #define QDEC_INTENSET_DBLRDY_Pos (3UL)
  #define QDEC_INTENSET_DBLRDY_Msk (0x1UL << QDEC_INTENSET_DBLRDY_Pos)
  #define QDEC_INTENSET_DBLRDY_Min (0x0UL)
  #define QDEC_INTENSET_DBLRDY_Max (0x1UL)
  #define QDEC_INTENSET_DBLRDY_Set (0x1UL)
  #define QDEC_INTENSET_DBLRDY_Disabled (0x0UL)
  #define QDEC_INTENSET_DBLRDY_Enabled (0x1UL)

/* STOPPED @Bit 4 : Write '1' to enable interrupt for event STOPPED */
  #define QDEC_INTENSET_STOPPED_Pos (4UL)
  #define QDEC_INTENSET_STOPPED_Msk (0x1UL << QDEC_INTENSET_STOPPED_Pos)
  #define QDEC_INTENSET_STOPPED_Min (0x0UL)
  #define QDEC_INTENSET_STOPPED_Max (0x1UL)
  #define QDEC_INTENSET_STOPPED_Set (0x1UL)
  #define QDEC_INTENSET_STOPPED_Disabled (0x0UL)
  #define QDEC_INTENSET_STOPPED_Enabled (0x1UL)


/* QDEC_INTENCLR: Disable interrupt */
  #define QDEC_INTENCLR_ResetValue (0x00000000UL)

/* SAMPLERDY @Bit 0 : Write '1' to disable interrupt for event SAMPLERDY */
  #define QDEC_INTENCLR_SAMPLERDY_Pos (0UL)
  #define QDEC_INTENCLR_SAMPLERDY_Msk (0x1UL << QDEC_INTENCLR_SAMPLERDY_Pos)
  #define QDEC_INTENCLR_SAMPLERDY_Min (0x0UL)
  #define QDEC_INTENCLR_SAMPLERDY_Max (0x1UL)
  #define QDEC_INTENCLR_SAMPLERDY_Clear (0x1UL)
  #define QDEC_INTENCLR_SAMPLERDY_Disabled (0x0UL)
  #define QDEC_INTENCLR_SAMPLERDY_Enabled (0x1UL)

/* REPORTRDY @Bit 1 : Write '1' to disable interrupt for event REPORTRDY */
  #define QDEC_INTENCLR_REPORTRDY_Pos (1UL)
  #define QDEC_INTENCLR_REPORTRDY_Msk (0x1UL << QDEC_INTENCLR_REPORTRDY_Pos)
  #define QDEC_INTENCLR_REPORTRDY_Min (0x0UL)
  #define QDEC_INTENCLR_REPORTRDY_Max (0x1UL)
  #define QDEC_INTENCLR_REPORTRDY_Clear (0x1UL)
  #define QDEC_INTENCLR_REPORTRDY_Disabled (0x0UL)
  #define QDEC_INTENCLR_REPORTRDY_Enabled (0x1UL)

/* ACCOF @Bit 2 : Write '1' to disable interrupt for event ACCOF */
  #define QDEC_INTENCLR_ACCOF_Pos (2UL)
  #define QDEC_INTENCLR_ACCOF_Msk (0x1UL << QDEC_INTENCLR_ACCOF_Pos)
  #define QDEC_INTENCLR_ACCOF_Min (0x0UL)
  #define QDEC_INTENCLR_ACCOF_Max (0x1UL)
  #define QDEC_INTENCLR_ACCOF_Clear (0x1UL)
  #define QDEC_INTENCLR_ACCOF_Disabled (0x0UL)
  #define QDEC_INTENCLR_ACCOF_Enabled (0x1UL)

/* DBLRDY @Bit 3 : Write '1' to disable interrupt for event DBLRDY */
  #define QDEC_INTENCLR_DBLRDY_Pos (3UL)
  #define QDEC_INTENCLR_DBLRDY_Msk (0x1UL << QDEC_INTENCLR_DBLRDY_Pos)
  #define QDEC_INTENCLR_DBLRDY_Min (0x0UL)
  #define QDEC_INTENCLR_DBLRDY_Max (0x1UL)
  #define QDEC_INTENCLR_DBLRDY_Clear (0x1UL)
  #define QDEC_INTENCLR_DBLRDY_Disabled (0x0UL)
  #define QDEC_INTENCLR_DBLRDY_Enabled (0x1UL)

/* STOPPED @Bit 4 : Write '1' to disable interrupt for event STOPPED */
  #define QDEC_INTENCLR_STOPPED_Pos (4UL)
  #define QDEC_INTENCLR_STOPPED_Msk (0x1UL << QDEC_INTENCLR_STOPPED_Pos)
  #define QDEC_INTENCLR_STOPPED_Min (0x0UL)
  #define QDEC_INTENCLR_STOPPED_Max (0x1UL)
  #define QDEC_INTENCLR_STOPPED_Clear (0x1UL)
  #define QDEC_INTENCLR_STOPPED_Disabled (0x0UL)
  #define QDEC_INTENCLR_STOPPED_Enabled (0x1UL)


/* QDEC_ENABLE: Enable the quadrature decoder */
  #define QDEC_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable or disable the quadrature decoder */
  #define QDEC_ENABLE_ENABLE_Pos (0UL)
  #define QDEC_ENABLE_ENABLE_Msk (0x1UL << QDEC_ENABLE_ENABLE_Pos)
  #define QDEC_ENABLE_ENABLE_Min (0x0UL)
  #define QDEC_ENABLE_ENABLE_Max (0x1UL)
  #define QDEC_ENABLE_ENABLE_Disabled (0x0UL)
  #define QDEC_ENABLE_ENABLE_Enabled (0x1UL)


/* QDEC_LEDPOL: LED output pin polarity */
  #define QDEC_LEDPOL_ResetValue (0x00000000UL)

