pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LEDPOL @Bit 0 : LED output pin polarity */
  #define QDEC_LEDPOL_LEDPOL_Pos (0UL)
  #define QDEC_LEDPOL_LEDPOL_Msk (0x1UL << QDEC_LEDPOL_LEDPOL_Pos)
  #define QDEC_LEDPOL_LEDPOL_Min (0x0UL)
  #define QDEC_LEDPOL_LEDPOL_Max (0x1UL)
  #define QDEC_LEDPOL_LEDPOL_ActiveLow (0x0UL)
  #define QDEC_LEDPOL_LEDPOL_ActiveHigh (0x1UL)


/* QDEC_SAMPLEPER: Sample period */
  #define QDEC_SAMPLEPER_ResetValue (0x00000000UL)

/* SAMPLEPER @Bits 0..3 : Sample period. The SAMPLE register will be updated for every new sample */
  #define QDEC_SAMPLEPER_SAMPLEPER_Pos (0UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_Msk (0xFUL << QDEC_SAMPLEPER_SAMPLEPER_Pos)
  #define QDEC_SAMPLEPER_SAMPLEPER_Min (0x0UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_Max (0xAUL)
  #define QDEC_SAMPLEPER_SAMPLEPER_128us (0x0UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_256us (0x1UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_512us (0x2UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_1024us (0x3UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_2048us (0x4UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_4096us (0x5UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_8192us (0x6UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_16384us (0x7UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_32ms (0x8UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_65ms (0x9UL)
  #define QDEC_SAMPLEPER_SAMPLEPER_131ms (0xAUL)


/* QDEC_SAMPLE: Motion sample value */
  #define QDEC_SAMPLE_ResetValue (0x00000000UL)

/* SAMPLE @Bits 0..31 : Last motion sample */
  #define QDEC_SAMPLE_SAMPLE_Pos (0UL)
  #define QDEC_SAMPLE_SAMPLE_Msk (0xFFFFFFFFUL << QDEC_SAMPLE_SAMPLE_Pos)
  #define QDEC_SAMPLE_SAMPLE_Min (0xFFFFFFFFUL)
  #define QDEC_SAMPLE_SAMPLE_Max (0x00000002UL)


/* QDEC_REPORTPER: Number of samples to be taken before REPORTRDY and DBLRDY events can be generated */
  #define QDEC_REPORTPER_ResetValue (0x00000000UL)

/* REPORTPER @Bits 0..3 : Specifies the number of samples to be accumulated in the ACC register before the REPORTRDY and DBLRDY
                          events can be generated. */

  #define QDEC_REPORTPER_REPORTPER_Pos (0UL)
  #define QDEC_REPORTPER_REPORTPER_Msk (0xFUL << QDEC_REPORTPER_REPORTPER_Pos)
  #define QDEC_REPORTPER_REPORTPER_Min (0x0UL)
  #define QDEC_REPORTPER_REPORTPER_Max (0x8UL)
  #define QDEC_REPORTPER_REPORTPER_10Smpl (0x0UL)
  #define QDEC_REPORTPER_REPORTPER_40Smpl (0x1UL)
  #define QDEC_REPORTPER_REPORTPER_80Smpl (0x2UL)
  #define QDEC_REPORTPER_REPORTPER_120Smpl (0x3UL)
  #define QDEC_REPORTPER_REPORTPER_160Smpl (0x4UL)
  #define QDEC_REPORTPER_REPORTPER_200Smpl (0x5UL)
  #define QDEC_REPORTPER_REPORTPER_240Smpl (0x6UL)
  #define QDEC_REPORTPER_REPORTPER_280Smpl (0x7UL)
  #define QDEC_REPORTPER_REPORTPER_1Smpl (0x8UL)


/* QDEC_ACC: Register accumulating the valid transitions */
  #define QDEC_ACC_ResetValue (0x00000000UL)

/* ACC @Bits 0..31 : Register accumulating all valid samples (not double transition) read from the SAMPLE register. */
  #define QDEC_ACC_ACC_Pos (0UL)
  #define QDEC_ACC_ACC_Msk (0xFFFFFFFFUL << QDEC_ACC_ACC_Pos)
  #define QDEC_ACC_ACC_Min (0xFFFFFC00UL)
  #define QDEC_ACC_ACC_Max (0x000003FFUL)


/* QDEC_ACCREAD: Snapshot of the ACC register, updated by the READCLRACC or RDCLRACC task */
  #define QDEC_ACCREAD_ResetValue (0x00000000UL)

/* ACCREAD @Bits 0..31 : Snapshot of the ACC register. */
  #define QDEC_ACCREAD_ACCREAD_Pos (0UL)
  #define QDEC_ACCREAD_ACCREAD_Msk (0xFFFFFFFFUL << QDEC_ACCREAD_ACCREAD_Pos)
  #define QDEC_ACCREAD_ACCREAD_Min (0xFFFFFC00UL)
  #define QDEC_ACCREAD_ACCREAD_Max (0x000003FFUL)


/* QDEC_DBFEN: Enable input debounce filters */
  #define QDEC_DBFEN_ResetValue (0x00000000UL)

/* DBFEN @Bit 0 : Enable input debounce filters */
  #define QDEC_DBFEN_DBFEN_Pos (0UL)
  #define QDEC_DBFEN_DBFEN_Msk (0x1UL << QDEC_DBFEN_DBFEN_Pos)
  #define QDEC_DBFEN_DBFEN_Min (0x0UL)
  #define QDEC_DBFEN_DBFEN_Max (0x1UL)
  #define QDEC_DBFEN_DBFEN_Disabled (0x0UL)
  #define QDEC_DBFEN_DBFEN_Enabled (0x1UL)


/* QDEC_LEDPRE: Time period the LED is switched ON prior to sampling */
  #define QDEC_LEDPRE_ResetValue (0x00000010UL)

/* LEDPRE @Bits 0..8 : Period in us the LED is switched on prior to sampling */
  #define QDEC_LEDPRE_LEDPRE_Pos (0UL)
  #define QDEC_LEDPRE_LEDPRE_Msk (0x1FFUL << QDEC_LEDPRE_LEDPRE_Pos)
  #define QDEC_LEDPRE_LEDPRE_Min (0x001UL)
  #define QDEC_LEDPRE_LEDPRE_Max (0x1FFUL)


/* QDEC_ACCDBL: Register accumulating the number of detected double transitions */
  #define QDEC_ACCDBL_ResetValue (0x00000000UL)

/* ACCDBL @Bits 0..3 : Register accumulating the number of detected double or illegal transitions. ( SAMPLE = 2 ). */
  #define QDEC_ACCDBL_ACCDBL_Pos (0UL)
  #define QDEC_ACCDBL_ACCDBL_Msk (0xFUL << QDEC_ACCDBL_ACCDBL_Pos)
  #define QDEC_ACCDBL_ACCDBL_Min (0x0UL)
  #define QDEC_ACCDBL_ACCDBL_Max (0xFUL)


/* QDEC_ACCDBLREAD: Snapshot of the ACCDBL, updated by the READCLRACC or RDCLRDBL task */
  #define QDEC_ACCDBLREAD_ResetValue (0x00000000UL)

/* ACCDBLREAD @Bits 0..3 : Snapshot of the ACCDBL register. This field is updated when the READCLRACC or RDCLRDBL task is
                           triggered. */

  #define QDEC_ACCDBLREAD_ACCDBLREAD_Pos (0UL)
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Msk (0xFUL << QDEC_ACCDBLREAD_ACCDBLREAD_Pos)
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Min (0x0UL)
  #define QDEC_ACCDBLREAD_ACCDBLREAD_Max (0xFUL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct RADIO_PSEL ==================================================== */
/**
  * @brief PSEL [RADIO_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DFEGPIO[8];
} NRF_RADIO_PSEL_Type;

/* RADIO_PSEL_DFEGPIO: Pin select for DFE pin n */
  #define RADIO_PSEL_DFEGPIO_MaxCount (8UL)
  #define RADIO_PSEL_DFEGPIO_MaxIndex (7UL)
  #define RADIO_PSEL_DFEGPIO_MinIndex (0UL)
  #define RADIO_PSEL_DFEGPIO_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define RADIO_PSEL_DFEGPIO_PIN_Pos (0UL)
  #define RADIO_PSEL_DFEGPIO_PIN_Msk (0x1FUL << RADIO_PSEL_DFEGPIO_PIN_Pos)
  #define RADIO_PSEL_DFEGPIO_PIN_Min (0x00UL)
  #define RADIO_PSEL_DFEGPIO_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define RADIO_PSEL_DFEGPIO_PORT_Pos (5UL)
  #define RADIO_PSEL_DFEGPIO_PORT_Msk (0xFUL << RADIO_PSEL_DFEGPIO_PORT_Pos)
  #define RADIO_PSEL_DFEGPIO_PORT_Min (0x0UL)
  #define RADIO_PSEL_DFEGPIO_PORT_Max (0x1UL)

/* CONNECT @Bit 31 : Connection */
  #define RADIO_PSEL_DFEGPIO_CONNECT_Pos (31UL)
  #define RADIO_PSEL_DFEGPIO_CONNECT_Msk (0x1UL << RADIO_PSEL_DFEGPIO_CONNECT_Pos)
  #define RADIO_PSEL_DFEGPIO_CONNECT_Min (0x0UL)
  #define RADIO_PSEL_DFEGPIO_CONNECT_Max (0x1UL)
  #define RADIO_PSEL_DFEGPIO_CONNECT_Disconnected (0x1UL)
  #define RADIO_PSEL_DFEGPIO_CONNECT_Connected (0x0UL)



/* ================================================= Struct RADIO_DFEPACKET ================================================== */
/**
  * @brief DFEPACKET [RADIO_DFEPACKET] DFE packet EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  AMOUNT;
  __IM  uint32_t  CURRENTAMOUNT;
  __IM  uint32_t  RESERVED[2];
} NRF_RADIO_DFEPACKET_Type;

/* RADIO_DFEPACKET_PTR: Data pointer */
  #define RADIO_DFEPACKET_PTR_ResetValue (0x01000000UL)

/* OFFSET @Bits 0..15 : Data pointer */
  #define RADIO_DFEPACKET_PTR_OFFSET_Pos (0UL)
  #define RADIO_DFEPACKET_PTR_OFFSET_Msk (0xFFFFUL << RADIO_DFEPACKET_PTR_OFFSET_Pos)

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_DFEPACKET_PTR_BASE_Pos (29UL)
  #define RADIO_DFEPACKET_PTR_BASE_Msk (0x1UL << RADIO_DFEPACKET_PTR_BASE_Pos)


/* RADIO_DFEPACKET_MAXCNT: Maximum number of bytes to transfer */
  #define RADIO_DFEPACKET_MAXCNT_ResetValue (0x00004000UL)

/* MAXCNT @Bits 0..15 : Maximum number of bytes to transfer */
  #define RADIO_DFEPACKET_MAXCNT_MAXCNT_Pos (0UL)
  #define RADIO_DFEPACKET_MAXCNT_MAXCNT_Msk (0xFFFFUL << RADIO_DFEPACKET_MAXCNT_MAXCNT_Pos)


/* RADIO_DFEPACKET_AMOUNT: Number of bytes transferred in the last transaction */
  #define RADIO_DFEPACKET_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction */
  #define RADIO_DFEPACKET_AMOUNT_AMOUNT_Pos (0UL)
  #define RADIO_DFEPACKET_AMOUNT_AMOUNT_Msk (0xFFFFUL << RADIO_DFEPACKET_AMOUNT_AMOUNT_Pos)


/* RADIO_DFEPACKET_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define RADIO_DFEPACKET_CURRENTAMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define RADIO_DFEPACKET_CURRENTAMOUNT_AMOUNT_Pos (0UL)
  #define RADIO_DFEPACKET_CURRENTAMOUNT_AMOUNT_Msk (0xFFFFUL << RADIO_DFEPACKET_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of
                                                                            AMOUNT field.*/


/* ====================================================== Struct RADIO ======================================================= */
/**
  * @brief 2.4 GHz radio
  */
  typedef struct {
    __OM uint32_t TASKS_TXEN;
    __OM uint32_t TASKS_RXEN;
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_DISABLE;
    __OM uint32_t TASKS_RSSISTART;                   /*!< (@ 0x00000014) Start the RSSI and take one single sample of the
                                                                         receive signal strength*/
    __OM uint32_t TASKS_BCSTART;
    __OM uint32_t TASKS_BCSTOP;
    __OM uint32_t TASKS_EDSTART;                     /*!< (@ 0x00000020) Start the energy detect measurement used in IEEE
                                                                         802.15.4 mode*/
    __OM uint32_t TASKS_EDSTOP;
    __OM uint32_t TASKS_CCASTART;                    /*!< (@ 0x00000028) Start the clear channel assessment used in IEEE
                                                                         802.15.4 mode*/
    __OM uint32_t TASKS_CCASTOP;
    __IM uint32_t RESERVED[52];
    __IOM uint32_t SUBSCRIBE_TXEN;
    __IOM uint32_t SUBSCRIBE_RXEN;
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_DISABLE;
    __IOM uint32_t SUBSCRIBE_RSSISTART;
    __IOM uint32_t SUBSCRIBE_BCSTART;
    __IOM uint32_t SUBSCRIBE_BCSTOP;
    __IOM uint32_t SUBSCRIBE_EDSTART;
    __IOM uint32_t SUBSCRIBE_EDSTOP;
    __IOM uint32_t SUBSCRIBE_CCASTART;
    __IOM uint32_t SUBSCRIBE_CCASTOP;
    __IM uint32_t RESERVED1[52];
    __IOM uint32_t EVENTS_READY;
    __IOM uint32_t EVENTS_TXREADY;
    __IOM uint32_t EVENTS_RXREADY;
    __IOM uint32_t EVENTS_ADDRESS;
    __IOM uint32_t EVENTS_FRAMESTART;
    __IOM uint32_t EVENTS_PAYLOAD;
    __IOM uint32_t EVENTS_END;
    __IOM uint32_t EVENTS_PHYEND;
    __IOM uint32_t EVENTS_DISABLED;
    __IOM uint32_t EVENTS_DEVMATCH;                  /*!< (@ 0x00000224) A device address match occurred on the last received
                                                                         packet*/
    __IOM uint32_t EVENTS_DEVMISS;                   /*!< (@ 0x00000228) No device address match occurred on the last received
                                                                         packet*/
    __IOM uint32_t EVENTS_CRCOK;
    __IOM uint32_t EVENTS_CRCERROR;
    __IM uint32_t RESERVED2;
    __IOM uint32_t EVENTS_BCMATCH;
    __IOM uint32_t EVENTS_EDEND;                     /*!< (@ 0x0000023C) Sampling of energy detection complete (a new ED sample
                                                                         is ready for readout from the RADIO.EDSAMPLE register)*/
    __IOM uint32_t EVENTS_EDSTOPPED;
    __IOM uint32_t EVENTS_CCAIDLE;
    __IOM uint32_t EVENTS_CCABUSY;
    __IOM uint32_t EVENTS_CCASTOPPED;
    __IOM uint32_t EVENTS_RATEBOOST;                 /*!< (@ 0x00000250) Ble_LR CI field received, receive mode is changed from
                                                                         Ble_LR125Kbit to Ble_LR500Kbit*/
    __IOM uint32_t EVENTS_MHRMATCH;
    __IOM uint32_t EVENTS_SYNC;
    __IOM uint32_t EVENTS_CTEPRESENT;
    __IM uint32_t RESERVED3[40];
    __IOM uint32_t PUBLISH_READY;
    __IOM uint32_t PUBLISH_TXREADY;
    __IOM uint32_t PUBLISH_RXREADY;
    __IOM uint32_t PUBLISH_ADDRESS;
    __IOM uint32_t PUBLISH_FRAMESTART;
    __IOM uint32_t PUBLISH_PAYLOAD;
    __IOM uint32_t PUBLISH_END;
    __IOM uint32_t PUBLISH_PHYEND;
    __IOM uint32_t PUBLISH_DISABLED;
    __IOM uint32_t PUBLISH_DEVMATCH;
    __IOM uint32_t PUBLISH_DEVMISS;
    __IOM uint32_t PUBLISH_CRCOK;
    __IOM uint32_t PUBLISH_CRCERROR;
    __IM uint32_t RESERVED4;
    __IOM uint32_t PUBLISH_BCMATCH;
    __IOM uint32_t PUBLISH_EDEND;
    __IOM uint32_t PUBLISH_EDSTOPPED;
    __IOM uint32_t PUBLISH_CCAIDLE;
    __IOM uint32_t PUBLISH_CCABUSY;
    __IOM uint32_t PUBLISH_CCASTOPPED;
    __IOM uint32_t PUBLISH_RATEBOOST;
    __IOM uint32_t PUBLISH_MHRMATCH;
    __IOM uint32_t PUBLISH_SYNC;
    __IOM uint32_t PUBLISH_CTEPRESENT;
    __IM uint32_t RESERVED5[40];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED6[33];
    __IOM uint32_t INTENSET00;
    __IM uint32_t RESERVED7;
    __IOM uint32_t INTENCLR00;
    __IM uint32_t RESERVED8[5];
    __IOM uint32_t INTENSET10;
    __IM uint32_t RESERVED9;
    __IOM uint32_t INTENCLR10;
    __IM uint32_t RESERVED10[19];
    __IOM uint32_t MODE;
    __IM uint32_t RESERVED11[7];
    __IM uint32_t STATE;
    __IM uint32_t RESERVED12[3];
    __IOM uint32_t EDCTRL;
    __IM uint32_t EDSAMPLE;
    __IOM uint32_t CCACTRL;
    __IM uint32_t RESERVED13;
    __IOM uint32_t DATAWHITEIV;
    __IM uint32_t RESERVED14[112];
    __IOM uint32_t TIMING;
    __IOM uint32_t FREQUENCY;
    __IM uint32_t RESERVED15;
    __IOM uint32_t TXPOWER;
    __IOM uint32_t TIFS;
    __IM uint32_t RSSISAMPLE;
    __IM uint32_t RESERVED16[377];
    __IOM uint32_t DFEMODE;                          /*!< (@ 0x00000D00) Whether to use Angle-of-Arrival (AOA) or
                                                                         Angle-of-Departure (AOD)*/
    __IM uint32_t DFESTATUS;
    __IM uint32_t RESERVED17[2];
    __IOM uint32_t DFECTRL1;
    __IOM uint32_t DFECTRL2;
    __IM uint32_t RESERVED18[4];
    __IOM uint32_t SWITCHPATTERN;
    __OM uint32_t CLEARPATTERN;
    __IOM NRF_RADIO_PSEL_Type PSEL;
    __IOM NRF_RADIO_DFEPACKET_Type DFEPACKET;
    __IM uint32_t RESERVED19[41];
    __IM uint32_t CRCSTATUS;
    __IM uint32_t RXMATCH;
    __IM uint32_t RXCRC;
    __IM uint32_t DAI;
    __IM uint32_t PDUSTAT;
    __IOM uint32_t PCNF0;
    __IM uint32_t RESERVED20;
    __IOM uint32_t PCNF1;
    __IOM uint32_t BASE0;
    __IOM uint32_t BASE1;
    __IOM uint32_t PREFIX0;
    __IOM uint32_t PREFIX1;
    __IOM uint32_t TXADDRESS;
    __IOM uint32_t RXADDRESSES;
    __IOM uint32_t CRCCNF;
    __IOM uint32_t CRCPOLY;
    __IOM uint32_t CRCINIT;
    __IOM uint32_t DAB[8];
    __IOM uint32_t DAP[8];
    __IOM uint32_t DACNF;
    __IOM uint32_t BCC;
    __IM uint32_t RESERVED21[3];
    __IM uint32_t CTESTATUS;
    __IM uint32_t RESERVED22[3];
    __IOM uint32_t MHRMATCHCONF;
    __IOM uint32_t MHRMATCHMASK;
    __IOM uint32_t SFD;
    __IOM uint32_t CTEINLINECONF;
    __IM uint32_t RESERVED23[3];
    __IOM uint32_t PACKETPTR;
    __IM uint32_t RESERVED24[74];
    __IOM uint32_t POWER;
  } NRF_RADIO_Type;

/* RADIO_TASKS_TXEN: Enable RADIO in TX mode */
  #define RADIO_TASKS_TXEN_ResetValue (0x00000000UL)

