pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS_TXEN @Bit 0 : Enable RADIO in TX mode */
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Pos (0UL)
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Msk (0x1UL << RADIO_TASKS_TXEN_TASKS_TXEN_Pos)
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Min (0x1UL)
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Max (0x1UL)
  #define RADIO_TASKS_TXEN_TASKS_TXEN_Trigger (0x1UL)


/* RADIO_TASKS_RXEN: Enable RADIO in RX mode */
  #define RADIO_TASKS_RXEN_ResetValue (0x00000000UL)

/* TASKS_RXEN @Bit 0 : Enable RADIO in RX mode */
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Pos (0UL)
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Msk (0x1UL << RADIO_TASKS_RXEN_TASKS_RXEN_Pos)
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Min (0x1UL)
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Max (0x1UL)
  #define RADIO_TASKS_RXEN_TASKS_RXEN_Trigger (0x1UL)


/* RADIO_TASKS_START: Start RADIO */
  #define RADIO_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start RADIO */
  #define RADIO_TASKS_START_TASKS_START_Pos (0UL)
  #define RADIO_TASKS_START_TASKS_START_Msk (0x1UL << RADIO_TASKS_START_TASKS_START_Pos)
  #define RADIO_TASKS_START_TASKS_START_Min (0x1UL)
  #define RADIO_TASKS_START_TASKS_START_Max (0x1UL)
  #define RADIO_TASKS_START_TASKS_START_Trigger (0x1UL)


/* RADIO_TASKS_STOP: Stop RADIO */
  #define RADIO_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop RADIO */
  #define RADIO_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define RADIO_TASKS_STOP_TASKS_STOP_Msk (0x1UL << RADIO_TASKS_STOP_TASKS_STOP_Pos)
  #define RADIO_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define RADIO_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define RADIO_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* RADIO_TASKS_DISABLE: Disable RADIO */
  #define RADIO_TASKS_DISABLE_ResetValue (0x00000000UL)

/* TASKS_DISABLE @Bit 0 : Disable RADIO */
  #define RADIO_TASKS_DISABLE_TASKS_DISABLE_Pos (0UL)
  #define RADIO_TASKS_DISABLE_TASKS_DISABLE_Msk (0x1UL << RADIO_TASKS_DISABLE_TASKS_DISABLE_Pos) /*!< Bit mask of TASKS_DISABLE
                                                                            field.*/
  #define RADIO_TASKS_DISABLE_TASKS_DISABLE_Min (0x1UL)
  #define RADIO_TASKS_DISABLE_TASKS_DISABLE_Max (0x1UL)
  #define RADIO_TASKS_DISABLE_TASKS_DISABLE_Trigger (0x1UL)


/* RADIO_TASKS_RSSISTART: Start the RSSI and take one single sample of the receive signal strength */
  #define RADIO_TASKS_RSSISTART_ResetValue (0x00000000UL)

/* TASKS_RSSISTART @Bit 0 : Start the RSSI and take one single sample of the receive signal strength */
  #define RADIO_TASKS_RSSISTART_TASKS_RSSISTART_Pos (0UL)
  #define RADIO_TASKS_RSSISTART_TASKS_RSSISTART_Msk (0x1UL << RADIO_TASKS_RSSISTART_TASKS_RSSISTART_Pos) /*!< Bit mask of
                                                                            TASKS_RSSISTART field.*/
  #define RADIO_TASKS_RSSISTART_TASKS_RSSISTART_Min (0x1UL)
  #define RADIO_TASKS_RSSISTART_TASKS_RSSISTART_Max (0x1UL)
  #define RADIO_TASKS_RSSISTART_TASKS_RSSISTART_Trigger (0x1UL)


/* RADIO_TASKS_BCSTART: Start the bit counter */
  #define RADIO_TASKS_BCSTART_ResetValue (0x00000000UL)

/* TASKS_BCSTART @Bit 0 : Start the bit counter */
  #define RADIO_TASKS_BCSTART_TASKS_BCSTART_Pos (0UL)
  #define RADIO_TASKS_BCSTART_TASKS_BCSTART_Msk (0x1UL << RADIO_TASKS_BCSTART_TASKS_BCSTART_Pos) /*!< Bit mask of TASKS_BCSTART
                                                                            field.*/
  #define RADIO_TASKS_BCSTART_TASKS_BCSTART_Min (0x1UL)
  #define RADIO_TASKS_BCSTART_TASKS_BCSTART_Max (0x1UL)
  #define RADIO_TASKS_BCSTART_TASKS_BCSTART_Trigger (0x1UL)


/* RADIO_TASKS_BCSTOP: Stop the bit counter */
  #define RADIO_TASKS_BCSTOP_ResetValue (0x00000000UL)

/* TASKS_BCSTOP @Bit 0 : Stop the bit counter */
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Pos (0UL)
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Msk (0x1UL << RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Pos) /*!< Bit mask of TASKS_BCSTOP
                                                                            field.*/
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Min (0x1UL)
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Max (0x1UL)
  #define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_Trigger (0x1UL)


/* RADIO_TASKS_EDSTART: Start the energy detect measurement used in IEEE 802.15.4 mode */
  #define RADIO_TASKS_EDSTART_ResetValue (0x00000000UL)

/* TASKS_EDSTART @Bit 0 : Start the energy detect measurement used in IEEE 802.15.4 mode */
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Pos (0UL)
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Msk (0x1UL << RADIO_TASKS_EDSTART_TASKS_EDSTART_Pos) /*!< Bit mask of TASKS_EDSTART
                                                                            field.*/
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Min (0x1UL)
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Max (0x1UL)
  #define RADIO_TASKS_EDSTART_TASKS_EDSTART_Trigger (0x1UL)


/* RADIO_TASKS_EDSTOP: Stop the energy detect measurement */
  #define RADIO_TASKS_EDSTOP_ResetValue (0x00000000UL)

/* TASKS_EDSTOP @Bit 0 : Stop the energy detect measurement */
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Pos (0UL)
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Msk (0x1UL << RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Pos) /*!< Bit mask of TASKS_EDSTOP
                                                                            field.*/
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Min (0x1UL)
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Max (0x1UL)
  #define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_Trigger (0x1UL)


/* RADIO_TASKS_CCASTART: Start the clear channel assessment used in IEEE 802.15.4 mode */
  #define RADIO_TASKS_CCASTART_ResetValue (0x00000000UL)

/* TASKS_CCASTART @Bit 0 : Start the clear channel assessment used in IEEE 802.15.4 mode */
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Pos (0UL)
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Msk (0x1UL << RADIO_TASKS_CCASTART_TASKS_CCASTART_Pos) /*!< Bit mask of
                                                                            TASKS_CCASTART field.*/
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Min (0x1UL)
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Max (0x1UL)
  #define RADIO_TASKS_CCASTART_TASKS_CCASTART_Trigger (0x1UL)


/* RADIO_TASKS_CCASTOP: Stop the clear channel assessment */
  #define RADIO_TASKS_CCASTOP_ResetValue (0x00000000UL)

/* TASKS_CCASTOP @Bit 0 : Stop the clear channel assessment */
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Pos (0UL)
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Msk (0x1UL << RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Pos) /*!< Bit mask of TASKS_CCASTOP
                                                                            field.*/
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Min (0x1UL)
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Max (0x1UL)
  #define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Trigger (0x1UL)


/* RADIO_SUBSCRIBE_TXEN: Subscribe configuration for task TXEN */
  #define RADIO_SUBSCRIBE_TXEN_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task TXEN will subscribe to */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_TXEN_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_TXEN_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_TXEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_TXEN_EN_Pos)
  #define RADIO_SUBSCRIBE_TXEN_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_TXEN_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_TXEN_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_TXEN_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_RXEN: Subscribe configuration for task RXEN */
  #define RADIO_SUBSCRIBE_RXEN_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RXEN will subscribe to */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_RXEN_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_RXEN_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_RXEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_RXEN_EN_Pos)
  #define RADIO_SUBSCRIBE_RXEN_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_RXEN_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_RXEN_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_RXEN_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_START: Subscribe configuration for task START */
  #define RADIO_SUBSCRIBE_START_ResetValue (0x00000000UL)

