pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define RADIO_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_START_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_START_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_START_EN_Msk (0x1UL << RADIO_SUBSCRIBE_START_EN_Pos)
  #define RADIO_SUBSCRIBE_START_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_START_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define RADIO_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define RADIO_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_STOP_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_STOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_STOP_EN_Pos)
  #define RADIO_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_DISABLE: Subscribe configuration for task DISABLE */
  #define RADIO_SUBSCRIBE_DISABLE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task DISABLE will subscribe to */
  #define RADIO_SUBSCRIBE_DISABLE_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_DISABLE_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DISABLE_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_DISABLE_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_DISABLE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_DISABLE_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_DISABLE_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DISABLE_EN_Pos)
  #define RADIO_SUBSCRIBE_DISABLE_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_DISABLE_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_DISABLE_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_DISABLE_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_RSSISTART: Subscribe configuration for task RSSISTART */
  #define RADIO_SUBSCRIBE_RSSISTART_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RSSISTART will subscribe to */
  #define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_RSSISTART_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_RSSISTART_EN_Pos)
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_RSSISTART_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_BCSTART: Subscribe configuration for task BCSTART */
  #define RADIO_SUBSCRIBE_BCSTART_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task BCSTART will subscribe to */
  #define RADIO_SUBSCRIBE_BCSTART_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_BCSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_BCSTART_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_BCSTART_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_BCSTART_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_BCSTART_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_BCSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_BCSTART_EN_Pos)
  #define RADIO_SUBSCRIBE_BCSTART_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_BCSTART_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_BCSTART_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_BCSTART_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_BCSTOP: Subscribe configuration for task BCSTOP */
  #define RADIO_SUBSCRIBE_BCSTOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task BCSTOP will subscribe to */
  #define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_BCSTOP_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_BCSTOP_EN_Pos)
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_BCSTOP_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_EDSTART: Subscribe configuration for task EDSTART */
  #define RADIO_SUBSCRIBE_EDSTART_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task EDSTART will subscribe to */
  #define RADIO_SUBSCRIBE_EDSTART_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_EDSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_EDSTART_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_EDSTART_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_EDSTART_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_EDSTART_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_EDSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_EDSTART_EN_Pos)
  #define RADIO_SUBSCRIBE_EDSTART_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_EDSTART_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_EDSTART_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_EDSTART_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_EDSTOP: Subscribe configuration for task EDSTOP */
  #define RADIO_SUBSCRIBE_EDSTOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task EDSTOP will subscribe to */
  #define RADIO_SUBSCRIBE_EDSTOP_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_EDSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_EDSTOP_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_EDSTOP_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_EDSTOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_EDSTOP_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_EDSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_EDSTOP_EN_Pos)
  #define RADIO_SUBSCRIBE_EDSTOP_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_EDSTOP_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_EDSTOP_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_EDSTOP_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_CCASTART: Subscribe configuration for task CCASTART */
  #define RADIO_SUBSCRIBE_CCASTART_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CCASTART will subscribe to */
  #define RADIO_SUBSCRIBE_CCASTART_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_CCASTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CCASTART_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_CCASTART_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_CCASTART_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CCASTART_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_CCASTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CCASTART_EN_Pos)
  #define RADIO_SUBSCRIBE_CCASTART_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_CCASTART_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_CCASTART_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_CCASTART_EN_Enabled (0x1UL)


/* RADIO_SUBSCRIBE_CCASTOP: Subscribe configuration for task CCASTOP */
  #define RADIO_SUBSCRIBE_CCASTOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CCASTOP will subscribe to */
  #define RADIO_SUBSCRIBE_CCASTOP_CHIDX_Pos (0UL)
  #define RADIO_SUBSCRIBE_CCASTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CCASTOP_CHIDX_Pos)
  #define RADIO_SUBSCRIBE_CCASTOP_CHIDX_Min (0x00UL)
  #define RADIO_SUBSCRIBE_CCASTOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CCASTOP_EN_Pos (31UL)
  #define RADIO_SUBSCRIBE_CCASTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CCASTOP_EN_Pos)
  #define RADIO_SUBSCRIBE_CCASTOP_EN_Min (0x0UL)
  #define RADIO_SUBSCRIBE_CCASTOP_EN_Max (0x1UL)
  #define RADIO_SUBSCRIBE_CCASTOP_EN_Disabled (0x0UL)
  #define RADIO_SUBSCRIBE_CCASTOP_EN_Enabled (0x1UL)


/* RADIO_EVENTS_READY: RADIO has ramped up and is ready to be started */
  #define RADIO_EVENTS_READY_ResetValue (0x00000000UL)

