pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RADIO_EVENTS_CTEPRESENT: CTEInfo byte is received */
  #define RADIO_EVENTS_CTEPRESENT_ResetValue (0x00000000UL)

/* EVENTS_CTEPRESENT @Bit 0 : CTEInfo byte is received */
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Pos (0UL)
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Msk (0x1UL << RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Pos) /*!< Bit mask
                                                                            of EVENTS_CTEPRESENT field.*/
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Min (0x0UL)
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Max (0x1UL)
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_NotGenerated (0x0UL)
  #define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Generated (0x1UL)


/* RADIO_PUBLISH_READY: Publish configuration for event READY */
  #define RADIO_PUBLISH_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define RADIO_PUBLISH_READY_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_READY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_READY_CHIDX_Pos)
  #define RADIO_PUBLISH_READY_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_READY_EN_Pos (31UL)
  #define RADIO_PUBLISH_READY_EN_Msk (0x1UL << RADIO_PUBLISH_READY_EN_Pos)
  #define RADIO_PUBLISH_READY_EN_Min (0x0UL)
  #define RADIO_PUBLISH_READY_EN_Max (0x1UL)
  #define RADIO_PUBLISH_READY_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_READY_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_TXREADY: Publish configuration for event TXREADY */
  #define RADIO_PUBLISH_TXREADY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event TXREADY will publish to */
  #define RADIO_PUBLISH_TXREADY_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_TXREADY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_TXREADY_CHIDX_Pos)
  #define RADIO_PUBLISH_TXREADY_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_TXREADY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_TXREADY_EN_Pos (31UL)
  #define RADIO_PUBLISH_TXREADY_EN_Msk (0x1UL << RADIO_PUBLISH_TXREADY_EN_Pos)
  #define RADIO_PUBLISH_TXREADY_EN_Min (0x0UL)
  #define RADIO_PUBLISH_TXREADY_EN_Max (0x1UL)
  #define RADIO_PUBLISH_TXREADY_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_TXREADY_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_RXREADY: Publish configuration for event RXREADY */
  #define RADIO_PUBLISH_RXREADY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event RXREADY will publish to */
  #define RADIO_PUBLISH_RXREADY_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_RXREADY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RXREADY_CHIDX_Pos)
  #define RADIO_PUBLISH_RXREADY_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_RXREADY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RXREADY_EN_Pos (31UL)
  #define RADIO_PUBLISH_RXREADY_EN_Msk (0x1UL << RADIO_PUBLISH_RXREADY_EN_Pos)
  #define RADIO_PUBLISH_RXREADY_EN_Min (0x0UL)
  #define RADIO_PUBLISH_RXREADY_EN_Max (0x1UL)
  #define RADIO_PUBLISH_RXREADY_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_RXREADY_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_ADDRESS: Publish configuration for event ADDRESS */
  #define RADIO_PUBLISH_ADDRESS_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event ADDRESS will publish to */
  #define RADIO_PUBLISH_ADDRESS_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_ADDRESS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_ADDRESS_CHIDX_Pos)
  #define RADIO_PUBLISH_ADDRESS_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_ADDRESS_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_ADDRESS_EN_Pos (31UL)
  #define RADIO_PUBLISH_ADDRESS_EN_Msk (0x1UL << RADIO_PUBLISH_ADDRESS_EN_Pos)
  #define RADIO_PUBLISH_ADDRESS_EN_Min (0x0UL)
  #define RADIO_PUBLISH_ADDRESS_EN_Max (0x1UL)
  #define RADIO_PUBLISH_ADDRESS_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_ADDRESS_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_FRAMESTART: Publish configuration for event FRAMESTART */
  #define RADIO_PUBLISH_FRAMESTART_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event FRAMESTART will publish to */
  #define RADIO_PUBLISH_FRAMESTART_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_FRAMESTART_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_FRAMESTART_CHIDX_Pos)
  #define RADIO_PUBLISH_FRAMESTART_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_FRAMESTART_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_FRAMESTART_EN_Pos (31UL)
  #define RADIO_PUBLISH_FRAMESTART_EN_Msk (0x1UL << RADIO_PUBLISH_FRAMESTART_EN_Pos)
  #define RADIO_PUBLISH_FRAMESTART_EN_Min (0x0UL)
  #define RADIO_PUBLISH_FRAMESTART_EN_Max (0x1UL)
  #define RADIO_PUBLISH_FRAMESTART_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_FRAMESTART_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_PAYLOAD: Publish configuration for event PAYLOAD */
  #define RADIO_PUBLISH_PAYLOAD_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event PAYLOAD will publish to */
  #define RADIO_PUBLISH_PAYLOAD_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_PAYLOAD_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_PAYLOAD_CHIDX_Pos)
  #define RADIO_PUBLISH_PAYLOAD_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_PAYLOAD_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_PAYLOAD_EN_Pos (31UL)
  #define RADIO_PUBLISH_PAYLOAD_EN_Msk (0x1UL << RADIO_PUBLISH_PAYLOAD_EN_Pos)
  #define RADIO_PUBLISH_PAYLOAD_EN_Min (0x0UL)
  #define RADIO_PUBLISH_PAYLOAD_EN_Max (0x1UL)
  #define RADIO_PUBLISH_PAYLOAD_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_PAYLOAD_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_END: Publish configuration for event END */
  #define RADIO_PUBLISH_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define RADIO_PUBLISH_END_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_END_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_END_CHIDX_Pos)
  #define RADIO_PUBLISH_END_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_END_EN_Pos (31UL)
  #define RADIO_PUBLISH_END_EN_Msk (0x1UL << RADIO_PUBLISH_END_EN_Pos)
  #define RADIO_PUBLISH_END_EN_Min (0x0UL)
  #define RADIO_PUBLISH_END_EN_Max (0x1UL)
  #define RADIO_PUBLISH_END_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_END_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_PHYEND: Publish configuration for event PHYEND */
  #define RADIO_PUBLISH_PHYEND_ResetValue (0x00000000UL)

