pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event PHYEND will publish to */
  #define RADIO_PUBLISH_PHYEND_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_PHYEND_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_PHYEND_CHIDX_Pos)
  #define RADIO_PUBLISH_PHYEND_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_PHYEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_PHYEND_EN_Pos (31UL)
  #define RADIO_PUBLISH_PHYEND_EN_Msk (0x1UL << RADIO_PUBLISH_PHYEND_EN_Pos)
  #define RADIO_PUBLISH_PHYEND_EN_Min (0x0UL)
  #define RADIO_PUBLISH_PHYEND_EN_Max (0x1UL)
  #define RADIO_PUBLISH_PHYEND_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_PHYEND_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_DISABLED: Publish configuration for event DISABLED */
  #define RADIO_PUBLISH_DISABLED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event DISABLED will publish to */
  #define RADIO_PUBLISH_DISABLED_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_DISABLED_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_DISABLED_CHIDX_Pos)
  #define RADIO_PUBLISH_DISABLED_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_DISABLED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_DISABLED_EN_Pos (31UL)
  #define RADIO_PUBLISH_DISABLED_EN_Msk (0x1UL << RADIO_PUBLISH_DISABLED_EN_Pos)
  #define RADIO_PUBLISH_DISABLED_EN_Min (0x0UL)
  #define RADIO_PUBLISH_DISABLED_EN_Max (0x1UL)
  #define RADIO_PUBLISH_DISABLED_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_DISABLED_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_DEVMATCH: Publish configuration for event DEVMATCH */
  #define RADIO_PUBLISH_DEVMATCH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event DEVMATCH will publish to */
  #define RADIO_PUBLISH_DEVMATCH_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_DEVMATCH_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_DEVMATCH_CHIDX_Pos)
  #define RADIO_PUBLISH_DEVMATCH_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_DEVMATCH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_DEVMATCH_EN_Pos (31UL)
  #define RADIO_PUBLISH_DEVMATCH_EN_Msk (0x1UL << RADIO_PUBLISH_DEVMATCH_EN_Pos)
  #define RADIO_PUBLISH_DEVMATCH_EN_Min (0x0UL)
  #define RADIO_PUBLISH_DEVMATCH_EN_Max (0x1UL)
  #define RADIO_PUBLISH_DEVMATCH_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_DEVMATCH_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_DEVMISS: Publish configuration for event DEVMISS */
  #define RADIO_PUBLISH_DEVMISS_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event DEVMISS will publish to */
  #define RADIO_PUBLISH_DEVMISS_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_DEVMISS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_DEVMISS_CHIDX_Pos)
  #define RADIO_PUBLISH_DEVMISS_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_DEVMISS_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_DEVMISS_EN_Pos (31UL)
  #define RADIO_PUBLISH_DEVMISS_EN_Msk (0x1UL << RADIO_PUBLISH_DEVMISS_EN_Pos)
  #define RADIO_PUBLISH_DEVMISS_EN_Min (0x0UL)
  #define RADIO_PUBLISH_DEVMISS_EN_Max (0x1UL)
  #define RADIO_PUBLISH_DEVMISS_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_DEVMISS_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_CRCOK: Publish configuration for event CRCOK */
  #define RADIO_PUBLISH_CRCOK_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CRCOK will publish to */
  #define RADIO_PUBLISH_CRCOK_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_CRCOK_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CRCOK_CHIDX_Pos)
  #define RADIO_PUBLISH_CRCOK_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_CRCOK_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CRCOK_EN_Pos (31UL)
  #define RADIO_PUBLISH_CRCOK_EN_Msk (0x1UL << RADIO_PUBLISH_CRCOK_EN_Pos)
  #define RADIO_PUBLISH_CRCOK_EN_Min (0x0UL)
  #define RADIO_PUBLISH_CRCOK_EN_Max (0x1UL)
  #define RADIO_PUBLISH_CRCOK_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_CRCOK_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_CRCERROR: Publish configuration for event CRCERROR */
  #define RADIO_PUBLISH_CRCERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CRCERROR will publish to */
  #define RADIO_PUBLISH_CRCERROR_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_CRCERROR_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CRCERROR_CHIDX_Pos)
  #define RADIO_PUBLISH_CRCERROR_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_CRCERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CRCERROR_EN_Pos (31UL)
  #define RADIO_PUBLISH_CRCERROR_EN_Msk (0x1UL << RADIO_PUBLISH_CRCERROR_EN_Pos)
  #define RADIO_PUBLISH_CRCERROR_EN_Min (0x0UL)
  #define RADIO_PUBLISH_CRCERROR_EN_Max (0x1UL)
  #define RADIO_PUBLISH_CRCERROR_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_CRCERROR_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_BCMATCH: Publish configuration for event BCMATCH */
  #define RADIO_PUBLISH_BCMATCH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BCMATCH will publish to */
  #define RADIO_PUBLISH_BCMATCH_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_BCMATCH_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_BCMATCH_CHIDX_Pos)
  #define RADIO_PUBLISH_BCMATCH_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_BCMATCH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_BCMATCH_EN_Pos (31UL)
  #define RADIO_PUBLISH_BCMATCH_EN_Msk (0x1UL << RADIO_PUBLISH_BCMATCH_EN_Pos)
  #define RADIO_PUBLISH_BCMATCH_EN_Min (0x0UL)
  #define RADIO_PUBLISH_BCMATCH_EN_Max (0x1UL)
  #define RADIO_PUBLISH_BCMATCH_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_BCMATCH_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_EDEND: Publish configuration for event EDEND */
  #define RADIO_PUBLISH_EDEND_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event EDEND will publish to */
  #define RADIO_PUBLISH_EDEND_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_EDEND_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_EDEND_CHIDX_Pos)
  #define RADIO_PUBLISH_EDEND_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_EDEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_EDEND_EN_Pos (31UL)
  #define RADIO_PUBLISH_EDEND_EN_Msk (0x1UL << RADIO_PUBLISH_EDEND_EN_Pos)
  #define RADIO_PUBLISH_EDEND_EN_Min (0x0UL)
  #define RADIO_PUBLISH_EDEND_EN_Max (0x1UL)
  #define RADIO_PUBLISH_EDEND_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_EDEND_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_EDSTOPPED: Publish configuration for event EDSTOPPED */
  #define RADIO_PUBLISH_EDSTOPPED_ResetValue (0x00000000UL)

