pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event EDSTOPPED will publish to */
  #define RADIO_PUBLISH_EDSTOPPED_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_EDSTOPPED_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_EDSTOPPED_CHIDX_Pos)
  #define RADIO_PUBLISH_EDSTOPPED_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_EDSTOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_EDSTOPPED_EN_Pos (31UL)
  #define RADIO_PUBLISH_EDSTOPPED_EN_Msk (0x1UL << RADIO_PUBLISH_EDSTOPPED_EN_Pos)
  #define RADIO_PUBLISH_EDSTOPPED_EN_Min (0x0UL)
  #define RADIO_PUBLISH_EDSTOPPED_EN_Max (0x1UL)
  #define RADIO_PUBLISH_EDSTOPPED_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_EDSTOPPED_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_CCAIDLE: Publish configuration for event CCAIDLE */
  #define RADIO_PUBLISH_CCAIDLE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CCAIDLE will publish to */
  #define RADIO_PUBLISH_CCAIDLE_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_CCAIDLE_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CCAIDLE_CHIDX_Pos)
  #define RADIO_PUBLISH_CCAIDLE_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_CCAIDLE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CCAIDLE_EN_Pos (31UL)
  #define RADIO_PUBLISH_CCAIDLE_EN_Msk (0x1UL << RADIO_PUBLISH_CCAIDLE_EN_Pos)
  #define RADIO_PUBLISH_CCAIDLE_EN_Min (0x0UL)
  #define RADIO_PUBLISH_CCAIDLE_EN_Max (0x1UL)
  #define RADIO_PUBLISH_CCAIDLE_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_CCAIDLE_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_CCABUSY: Publish configuration for event CCABUSY */
  #define RADIO_PUBLISH_CCABUSY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CCABUSY will publish to */
  #define RADIO_PUBLISH_CCABUSY_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_CCABUSY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CCABUSY_CHIDX_Pos)
  #define RADIO_PUBLISH_CCABUSY_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_CCABUSY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CCABUSY_EN_Pos (31UL)
  #define RADIO_PUBLISH_CCABUSY_EN_Msk (0x1UL << RADIO_PUBLISH_CCABUSY_EN_Pos)
  #define RADIO_PUBLISH_CCABUSY_EN_Min (0x0UL)
  #define RADIO_PUBLISH_CCABUSY_EN_Max (0x1UL)
  #define RADIO_PUBLISH_CCABUSY_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_CCABUSY_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_CCASTOPPED: Publish configuration for event CCASTOPPED */
  #define RADIO_PUBLISH_CCASTOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CCASTOPPED will publish to */
  #define RADIO_PUBLISH_CCASTOPPED_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_CCASTOPPED_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CCASTOPPED_CHIDX_Pos)
  #define RADIO_PUBLISH_CCASTOPPED_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_CCASTOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CCASTOPPED_EN_Pos (31UL)
  #define RADIO_PUBLISH_CCASTOPPED_EN_Msk (0x1UL << RADIO_PUBLISH_CCASTOPPED_EN_Pos)
  #define RADIO_PUBLISH_CCASTOPPED_EN_Min (0x0UL)
  #define RADIO_PUBLISH_CCASTOPPED_EN_Max (0x1UL)
  #define RADIO_PUBLISH_CCASTOPPED_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_CCASTOPPED_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_RATEBOOST: Publish configuration for event RATEBOOST */
  #define RADIO_PUBLISH_RATEBOOST_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event RATEBOOST will publish to */
  #define RADIO_PUBLISH_RATEBOOST_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_RATEBOOST_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RATEBOOST_CHIDX_Pos)
  #define RADIO_PUBLISH_RATEBOOST_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_RATEBOOST_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RATEBOOST_EN_Pos (31UL)
  #define RADIO_PUBLISH_RATEBOOST_EN_Msk (0x1UL << RADIO_PUBLISH_RATEBOOST_EN_Pos)
  #define RADIO_PUBLISH_RATEBOOST_EN_Min (0x0UL)
  #define RADIO_PUBLISH_RATEBOOST_EN_Max (0x1UL)
  #define RADIO_PUBLISH_RATEBOOST_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_RATEBOOST_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_MHRMATCH: Publish configuration for event MHRMATCH */
  #define RADIO_PUBLISH_MHRMATCH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event MHRMATCH will publish to */
  #define RADIO_PUBLISH_MHRMATCH_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_MHRMATCH_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_MHRMATCH_CHIDX_Pos)
  #define RADIO_PUBLISH_MHRMATCH_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_MHRMATCH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_MHRMATCH_EN_Pos (31UL)
  #define RADIO_PUBLISH_MHRMATCH_EN_Msk (0x1UL << RADIO_PUBLISH_MHRMATCH_EN_Pos)
  #define RADIO_PUBLISH_MHRMATCH_EN_Min (0x0UL)
  #define RADIO_PUBLISH_MHRMATCH_EN_Max (0x1UL)
  #define RADIO_PUBLISH_MHRMATCH_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_MHRMATCH_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_SYNC: Publish configuration for event SYNC */
  #define RADIO_PUBLISH_SYNC_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event SYNC will publish to */
  #define RADIO_PUBLISH_SYNC_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_SYNC_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_SYNC_CHIDX_Pos)
  #define RADIO_PUBLISH_SYNC_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_SYNC_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_SYNC_EN_Pos (31UL)
  #define RADIO_PUBLISH_SYNC_EN_Msk (0x1UL << RADIO_PUBLISH_SYNC_EN_Pos)
  #define RADIO_PUBLISH_SYNC_EN_Min (0x0UL)
  #define RADIO_PUBLISH_SYNC_EN_Max (0x1UL)
  #define RADIO_PUBLISH_SYNC_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_SYNC_EN_Enabled (0x1UL)


/* RADIO_PUBLISH_CTEPRESENT: Publish configuration for event CTEPRESENT */
  #define RADIO_PUBLISH_CTEPRESENT_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CTEPRESENT will publish to */
  #define RADIO_PUBLISH_CTEPRESENT_CHIDX_Pos (0UL)
  #define RADIO_PUBLISH_CTEPRESENT_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CTEPRESENT_CHIDX_Pos)
  #define RADIO_PUBLISH_CTEPRESENT_CHIDX_Min (0x00UL)
  #define RADIO_PUBLISH_CTEPRESENT_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CTEPRESENT_EN_Pos (31UL)
  #define RADIO_PUBLISH_CTEPRESENT_EN_Msk (0x1UL << RADIO_PUBLISH_CTEPRESENT_EN_Pos)
  #define RADIO_PUBLISH_CTEPRESENT_EN_Min (0x0UL)
  #define RADIO_PUBLISH_CTEPRESENT_EN_Max (0x1UL)
  #define RADIO_PUBLISH_CTEPRESENT_EN_Disabled (0x0UL)
  #define RADIO_PUBLISH_CTEPRESENT_EN_Enabled (0x1UL)


/* RADIO_SHORTS: Shortcuts between local events and tasks */
  #define RADIO_SHORTS_ResetValue (0x00000000UL)

/* READY_START @Bit 0 : Shortcut between event READY and task START */
  #define RADIO_SHORTS_READY_START_Pos (0UL)
  #define RADIO_SHORTS_READY_START_Msk (0x1UL << RADIO_SHORTS_READY_START_Pos)
  #define RADIO_SHORTS_READY_START_Min (0x0UL)
  #define RADIO_SHORTS_READY_START_Max (0x1UL)
  #define RADIO_SHORTS_READY_START_Disabled (0x0UL)
  #define RADIO_SHORTS_READY_START_Enabled (0x1UL)

