pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* END_DISABLE @Bit 1 : Shortcut between event END and task DISABLE */
  #define RADIO_SHORTS_END_DISABLE_Pos (1UL)
  #define RADIO_SHORTS_END_DISABLE_Msk (0x1UL << RADIO_SHORTS_END_DISABLE_Pos)
  #define RADIO_SHORTS_END_DISABLE_Min (0x0UL)
  #define RADIO_SHORTS_END_DISABLE_Max (0x1UL)
  #define RADIO_SHORTS_END_DISABLE_Disabled (0x0UL)
  #define RADIO_SHORTS_END_DISABLE_Enabled (0x1UL)

/* DISABLED_TXEN @Bit 2 : Shortcut between event DISABLED and task TXEN */
  #define RADIO_SHORTS_DISABLED_TXEN_Pos (2UL)
  #define RADIO_SHORTS_DISABLED_TXEN_Msk (0x1UL << RADIO_SHORTS_DISABLED_TXEN_Pos)
  #define RADIO_SHORTS_DISABLED_TXEN_Min (0x0UL)
  #define RADIO_SHORTS_DISABLED_TXEN_Max (0x1UL)
  #define RADIO_SHORTS_DISABLED_TXEN_Disabled (0x0UL)
  #define RADIO_SHORTS_DISABLED_TXEN_Enabled (0x1UL)

/* DISABLED_RXEN @Bit 3 : Shortcut between event DISABLED and task RXEN */
  #define RADIO_SHORTS_DISABLED_RXEN_Pos (3UL)
  #define RADIO_SHORTS_DISABLED_RXEN_Msk (0x1UL << RADIO_SHORTS_DISABLED_RXEN_Pos)
  #define RADIO_SHORTS_DISABLED_RXEN_Min (0x0UL)
  #define RADIO_SHORTS_DISABLED_RXEN_Max (0x1UL)
  #define RADIO_SHORTS_DISABLED_RXEN_Disabled (0x0UL)
  #define RADIO_SHORTS_DISABLED_RXEN_Enabled (0x1UL)

/* ADDRESS_RSSISTART @Bit 4 : Shortcut between event ADDRESS and task RSSISTART */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Pos (4UL)
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Msk (0x1UL << RADIO_SHORTS_ADDRESS_RSSISTART_Pos) /*!< Bit mask of ADDRESS_RSSISTART
                                                                            field.*/
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Min (0x0UL)
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Max (0x1UL)
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Disabled (0x0UL)
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Enabled (0x1UL)

/* END_START @Bit 5 : Shortcut between event END and task START */
  #define RADIO_SHORTS_END_START_Pos (5UL)
  #define RADIO_SHORTS_END_START_Msk (0x1UL << RADIO_SHORTS_END_START_Pos)
  #define RADIO_SHORTS_END_START_Min (0x0UL)
  #define RADIO_SHORTS_END_START_Max (0x1UL)
  #define RADIO_SHORTS_END_START_Disabled (0x0UL)
  #define RADIO_SHORTS_END_START_Enabled (0x1UL)

/* ADDRESS_BCSTART @Bit 6 : Shortcut between event ADDRESS and task BCSTART */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Pos (6UL)
  #define RADIO_SHORTS_ADDRESS_BCSTART_Msk (0x1UL << RADIO_SHORTS_ADDRESS_BCSTART_Pos)
  #define RADIO_SHORTS_ADDRESS_BCSTART_Min (0x0UL)
  #define RADIO_SHORTS_ADDRESS_BCSTART_Max (0x1UL)
  #define RADIO_SHORTS_ADDRESS_BCSTART_Disabled (0x0UL)
  #define RADIO_SHORTS_ADDRESS_BCSTART_Enabled (0x1UL)

/* RXREADY_CCASTART @Bit 10 : Shortcut between event RXREADY and task CCASTART */
  #define RADIO_SHORTS_RXREADY_CCASTART_Pos (10UL)
  #define RADIO_SHORTS_RXREADY_CCASTART_Msk (0x1UL << RADIO_SHORTS_RXREADY_CCASTART_Pos) /*!< Bit mask of RXREADY_CCASTART
                                                                            field.*/
  #define RADIO_SHORTS_RXREADY_CCASTART_Min (0x0UL)
  #define RADIO_SHORTS_RXREADY_CCASTART_Max (0x1UL)
  #define RADIO_SHORTS_RXREADY_CCASTART_Disabled (0x0UL)
  #define RADIO_SHORTS_RXREADY_CCASTART_Enabled (0x1UL)

/* CCAIDLE_TXEN @Bit 11 : Shortcut between event CCAIDLE and task TXEN */
  #define RADIO_SHORTS_CCAIDLE_TXEN_Pos (11UL)
  #define RADIO_SHORTS_CCAIDLE_TXEN_Msk (0x1UL << RADIO_SHORTS_CCAIDLE_TXEN_Pos)
  #define RADIO_SHORTS_CCAIDLE_TXEN_Min (0x0UL)
  #define RADIO_SHORTS_CCAIDLE_TXEN_Max (0x1UL)
  #define RADIO_SHORTS_CCAIDLE_TXEN_Disabled (0x0UL)
  #define RADIO_SHORTS_CCAIDLE_TXEN_Enabled (0x1UL)

/* CCABUSY_DISABLE @Bit 12 : Shortcut between event CCABUSY and task DISABLE */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Pos (12UL)
  #define RADIO_SHORTS_CCABUSY_DISABLE_Msk (0x1UL << RADIO_SHORTS_CCABUSY_DISABLE_Pos)
  #define RADIO_SHORTS_CCABUSY_DISABLE_Min (0x0UL)
  #define RADIO_SHORTS_CCABUSY_DISABLE_Max (0x1UL)
  #define RADIO_SHORTS_CCABUSY_DISABLE_Disabled (0x0UL)
  #define RADIO_SHORTS_CCABUSY_DISABLE_Enabled (0x1UL)

/* FRAMESTART_BCSTART @Bit 13 : Shortcut between event FRAMESTART and task BCSTART */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Pos (13UL)
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Msk (0x1UL << RADIO_SHORTS_FRAMESTART_BCSTART_Pos) /*!< Bit mask of FRAMESTART_BCSTART
                                                                            field.*/
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Min (0x0UL)
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Max (0x1UL)
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Disabled (0x0UL)
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Enabled (0x1UL)

/* READY_EDSTART @Bit 14 : Shortcut between event READY and task EDSTART */
  #define RADIO_SHORTS_READY_EDSTART_Pos (14UL)
  #define RADIO_SHORTS_READY_EDSTART_Msk (0x1UL << RADIO_SHORTS_READY_EDSTART_Pos)
  #define RADIO_SHORTS_READY_EDSTART_Min (0x0UL)
  #define RADIO_SHORTS_READY_EDSTART_Max (0x1UL)
  #define RADIO_SHORTS_READY_EDSTART_Disabled (0x0UL)
  #define RADIO_SHORTS_READY_EDSTART_Enabled (0x1UL)

/* EDEND_DISABLE @Bit 15 : Shortcut between event EDEND and task DISABLE */
  #define RADIO_SHORTS_EDEND_DISABLE_Pos (15UL)
  #define RADIO_SHORTS_EDEND_DISABLE_Msk (0x1UL << RADIO_SHORTS_EDEND_DISABLE_Pos)
  #define RADIO_SHORTS_EDEND_DISABLE_Min (0x0UL)
  #define RADIO_SHORTS_EDEND_DISABLE_Max (0x1UL)
  #define RADIO_SHORTS_EDEND_DISABLE_Disabled (0x0UL)
  #define RADIO_SHORTS_EDEND_DISABLE_Enabled (0x1UL)

/* CCAIDLE_STOP @Bit 16 : Shortcut between event CCAIDLE and task STOP */
  #define RADIO_SHORTS_CCAIDLE_STOP_Pos (16UL)
  #define RADIO_SHORTS_CCAIDLE_STOP_Msk (0x1UL << RADIO_SHORTS_CCAIDLE_STOP_Pos)
  #define RADIO_SHORTS_CCAIDLE_STOP_Min (0x0UL)
  #define RADIO_SHORTS_CCAIDLE_STOP_Max (0x1UL)
  #define RADIO_SHORTS_CCAIDLE_STOP_Disabled (0x0UL)
  #define RADIO_SHORTS_CCAIDLE_STOP_Enabled (0x1UL)

/* TXREADY_START @Bit 17 : Shortcut between event TXREADY and task START */
  #define RADIO_SHORTS_TXREADY_START_Pos (17UL)
  #define RADIO_SHORTS_TXREADY_START_Msk (0x1UL << RADIO_SHORTS_TXREADY_START_Pos)
  #define RADIO_SHORTS_TXREADY_START_Min (0x0UL)
  #define RADIO_SHORTS_TXREADY_START_Max (0x1UL)
  #define RADIO_SHORTS_TXREADY_START_Disabled (0x0UL)
  #define RADIO_SHORTS_TXREADY_START_Enabled (0x1UL)

/* RXREADY_START @Bit 18 : Shortcut between event RXREADY and task START */
  #define RADIO_SHORTS_RXREADY_START_Pos (18UL)
  #define RADIO_SHORTS_RXREADY_START_Msk (0x1UL << RADIO_SHORTS_RXREADY_START_Pos)
  #define RADIO_SHORTS_RXREADY_START_Min (0x0UL)
  #define RADIO_SHORTS_RXREADY_START_Max (0x1UL)
  #define RADIO_SHORTS_RXREADY_START_Disabled (0x0UL)
  #define RADIO_SHORTS_RXREADY_START_Enabled (0x1UL)

/* PHYEND_DISABLE @Bit 19 : Shortcut between event PHYEND and task DISABLE */
  #define RADIO_SHORTS_PHYEND_DISABLE_Pos (19UL)
  #define RADIO_SHORTS_PHYEND_DISABLE_Msk (0x1UL << RADIO_SHORTS_PHYEND_DISABLE_Pos)
  #define RADIO_SHORTS_PHYEND_DISABLE_Min (0x0UL)
  #define RADIO_SHORTS_PHYEND_DISABLE_Max (0x1UL)
  #define RADIO_SHORTS_PHYEND_DISABLE_Disabled (0x0UL)
  #define RADIO_SHORTS_PHYEND_DISABLE_Enabled (0x1UL)

