pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PHYEND_START @Bit 20 : Shortcut between event PHYEND and task START */
  #define RADIO_SHORTS_PHYEND_START_Pos (20UL)
  #define RADIO_SHORTS_PHYEND_START_Msk (0x1UL << RADIO_SHORTS_PHYEND_START_Pos)
  #define RADIO_SHORTS_PHYEND_START_Min (0x0UL)
  #define RADIO_SHORTS_PHYEND_START_Max (0x1UL)
  #define RADIO_SHORTS_PHYEND_START_Disabled (0x0UL)
  #define RADIO_SHORTS_PHYEND_START_Enabled (0x1UL)


/* RADIO_INTENSET00: Enable interrupt */
  #define RADIO_INTENSET00_ResetValue (0x00000000UL)

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define RADIO_INTENSET00_READY_Pos (0UL)
  #define RADIO_INTENSET00_READY_Msk (0x1UL << RADIO_INTENSET00_READY_Pos)
  #define RADIO_INTENSET00_READY_Min (0x0UL)
  #define RADIO_INTENSET00_READY_Max (0x1UL)
  #define RADIO_INTENSET00_READY_Set (0x1UL)
  #define RADIO_INTENSET00_READY_Disabled (0x0UL)
  #define RADIO_INTENSET00_READY_Enabled (0x1UL)

/* TXREADY @Bit 1 : Write '1' to enable interrupt for event TXREADY */
  #define RADIO_INTENSET00_TXREADY_Pos (1UL)
  #define RADIO_INTENSET00_TXREADY_Msk (0x1UL << RADIO_INTENSET00_TXREADY_Pos)
  #define RADIO_INTENSET00_TXREADY_Min (0x0UL)
  #define RADIO_INTENSET00_TXREADY_Max (0x1UL)
  #define RADIO_INTENSET00_TXREADY_Set (0x1UL)
  #define RADIO_INTENSET00_TXREADY_Disabled (0x0UL)
  #define RADIO_INTENSET00_TXREADY_Enabled (0x1UL)

/* RXREADY @Bit 2 : Write '1' to enable interrupt for event RXREADY */
  #define RADIO_INTENSET00_RXREADY_Pos (2UL)
  #define RADIO_INTENSET00_RXREADY_Msk (0x1UL << RADIO_INTENSET00_RXREADY_Pos)
  #define RADIO_INTENSET00_RXREADY_Min (0x0UL)
  #define RADIO_INTENSET00_RXREADY_Max (0x1UL)
  #define RADIO_INTENSET00_RXREADY_Set (0x1UL)
  #define RADIO_INTENSET00_RXREADY_Disabled (0x0UL)
  #define RADIO_INTENSET00_RXREADY_Enabled (0x1UL)

/* ADDRESS @Bit 3 : Write '1' to enable interrupt for event ADDRESS */
  #define RADIO_INTENSET00_ADDRESS_Pos (3UL)
  #define RADIO_INTENSET00_ADDRESS_Msk (0x1UL << RADIO_INTENSET00_ADDRESS_Pos)
  #define RADIO_INTENSET00_ADDRESS_Min (0x0UL)
  #define RADIO_INTENSET00_ADDRESS_Max (0x1UL)
  #define RADIO_INTENSET00_ADDRESS_Set (0x1UL)
  #define RADIO_INTENSET00_ADDRESS_Disabled (0x0UL)
  #define RADIO_INTENSET00_ADDRESS_Enabled (0x1UL)

/* FRAMESTART @Bit 4 : Write '1' to enable interrupt for event FRAMESTART */
  #define RADIO_INTENSET00_FRAMESTART_Pos (4UL)
  #define RADIO_INTENSET00_FRAMESTART_Msk (0x1UL << RADIO_INTENSET00_FRAMESTART_Pos)
  #define RADIO_INTENSET00_FRAMESTART_Min (0x0UL)
  #define RADIO_INTENSET00_FRAMESTART_Max (0x1UL)
  #define RADIO_INTENSET00_FRAMESTART_Set (0x1UL)
  #define RADIO_INTENSET00_FRAMESTART_Disabled (0x0UL)
  #define RADIO_INTENSET00_FRAMESTART_Enabled (0x1UL)

/* PAYLOAD @Bit 5 : Write '1' to enable interrupt for event PAYLOAD */
  #define RADIO_INTENSET00_PAYLOAD_Pos (5UL)
  #define RADIO_INTENSET00_PAYLOAD_Msk (0x1UL << RADIO_INTENSET00_PAYLOAD_Pos)
  #define RADIO_INTENSET00_PAYLOAD_Min (0x0UL)
  #define RADIO_INTENSET00_PAYLOAD_Max (0x1UL)
  #define RADIO_INTENSET00_PAYLOAD_Set (0x1UL)
  #define RADIO_INTENSET00_PAYLOAD_Disabled (0x0UL)
  #define RADIO_INTENSET00_PAYLOAD_Enabled (0x1UL)

/* END @Bit 6 : Write '1' to enable interrupt for event END */
  #define RADIO_INTENSET00_END_Pos (6UL)
  #define RADIO_INTENSET00_END_Msk (0x1UL << RADIO_INTENSET00_END_Pos)
  #define RADIO_INTENSET00_END_Min (0x0UL)
  #define RADIO_INTENSET00_END_Max (0x1UL)
  #define RADIO_INTENSET00_END_Set (0x1UL)
  #define RADIO_INTENSET00_END_Disabled (0x0UL)
  #define RADIO_INTENSET00_END_Enabled (0x1UL)

/* PHYEND @Bit 7 : Write '1' to enable interrupt for event PHYEND */
  #define RADIO_INTENSET00_PHYEND_Pos (7UL)
  #define RADIO_INTENSET00_PHYEND_Msk (0x1UL << RADIO_INTENSET00_PHYEND_Pos)
  #define RADIO_INTENSET00_PHYEND_Min (0x0UL)
  #define RADIO_INTENSET00_PHYEND_Max (0x1UL)
  #define RADIO_INTENSET00_PHYEND_Set (0x1UL)
  #define RADIO_INTENSET00_PHYEND_Disabled (0x0UL)
  #define RADIO_INTENSET00_PHYEND_Enabled (0x1UL)

/* DISABLED @Bit 8 : Write '1' to enable interrupt for event DISABLED */
  #define RADIO_INTENSET00_DISABLED_Pos (8UL)
  #define RADIO_INTENSET00_DISABLED_Msk (0x1UL << RADIO_INTENSET00_DISABLED_Pos)
  #define RADIO_INTENSET00_DISABLED_Min (0x0UL)
  #define RADIO_INTENSET00_DISABLED_Max (0x1UL)
  #define RADIO_INTENSET00_DISABLED_Set (0x1UL)
  #define RADIO_INTENSET00_DISABLED_Disabled (0x0UL)
  #define RADIO_INTENSET00_DISABLED_Enabled (0x1UL)

/* DEVMATCH @Bit 9 : Write '1' to enable interrupt for event DEVMATCH */
  #define RADIO_INTENSET00_DEVMATCH_Pos (9UL)
  #define RADIO_INTENSET00_DEVMATCH_Msk (0x1UL << RADIO_INTENSET00_DEVMATCH_Pos)
  #define RADIO_INTENSET00_DEVMATCH_Min (0x0UL)
  #define RADIO_INTENSET00_DEVMATCH_Max (0x1UL)
  #define RADIO_INTENSET00_DEVMATCH_Set (0x1UL)
  #define RADIO_INTENSET00_DEVMATCH_Disabled (0x0UL)
  #define RADIO_INTENSET00_DEVMATCH_Enabled (0x1UL)

/* DEVMISS @Bit 10 : Write '1' to enable interrupt for event DEVMISS */
  #define RADIO_INTENSET00_DEVMISS_Pos (10UL)
  #define RADIO_INTENSET00_DEVMISS_Msk (0x1UL << RADIO_INTENSET00_DEVMISS_Pos)
  #define RADIO_INTENSET00_DEVMISS_Min (0x0UL)
  #define RADIO_INTENSET00_DEVMISS_Max (0x1UL)
  #define RADIO_INTENSET00_DEVMISS_Set (0x1UL)
  #define RADIO_INTENSET00_DEVMISS_Disabled (0x0UL)
  #define RADIO_INTENSET00_DEVMISS_Enabled (0x1UL)

/* CRCOK @Bit 11 : Write '1' to enable interrupt for event CRCOK */
  #define RADIO_INTENSET00_CRCOK_Pos (11UL)
  #define RADIO_INTENSET00_CRCOK_Msk (0x1UL << RADIO_INTENSET00_CRCOK_Pos)
  #define RADIO_INTENSET00_CRCOK_Min (0x0UL)
  #define RADIO_INTENSET00_CRCOK_Max (0x1UL)
  #define RADIO_INTENSET00_CRCOK_Set (0x1UL)
  #define RADIO_INTENSET00_CRCOK_Disabled (0x0UL)
  #define RADIO_INTENSET00_CRCOK_Enabled (0x1UL)

/* CRCERROR @Bit 12 : Write '1' to enable interrupt for event CRCERROR */
  #define RADIO_INTENSET00_CRCERROR_Pos (12UL)
  #define RADIO_INTENSET00_CRCERROR_Msk (0x1UL << RADIO_INTENSET00_CRCERROR_Pos)
  #define RADIO_INTENSET00_CRCERROR_Min (0x0UL)
  #define RADIO_INTENSET00_CRCERROR_Max (0x1UL)
  #define RADIO_INTENSET00_CRCERROR_Set (0x1UL)
  #define RADIO_INTENSET00_CRCERROR_Disabled (0x0UL)
  #define RADIO_INTENSET00_CRCERROR_Enabled (0x1UL)

/* BCMATCH @Bit 14 : Write '1' to enable interrupt for event BCMATCH */
  #define RADIO_INTENSET00_BCMATCH_Pos (14UL)
  #define RADIO_INTENSET00_BCMATCH_Msk (0x1UL << RADIO_INTENSET00_BCMATCH_Pos)
  #define RADIO_INTENSET00_BCMATCH_Min (0x0UL)
  #define RADIO_INTENSET00_BCMATCH_Max (0x1UL)
  #define RADIO_INTENSET00_BCMATCH_Set (0x1UL)
  #define RADIO_INTENSET00_BCMATCH_Disabled (0x0UL)
  #define RADIO_INTENSET00_BCMATCH_Enabled (0x1UL)

/* EDEND @Bit 15 : Write '1' to enable interrupt for event EDEND */
  #define RADIO_INTENSET00_EDEND_Pos (15UL)
  #define RADIO_INTENSET00_EDEND_Msk (0x1UL << RADIO_INTENSET00_EDEND_Pos)
  #define RADIO_INTENSET00_EDEND_Min (0x0UL)
  #define RADIO_INTENSET00_EDEND_Max (0x1UL)
  #define RADIO_INTENSET00_EDEND_Set (0x1UL)
  #define RADIO_INTENSET00_EDEND_Disabled (0x0UL)
  #define RADIO_INTENSET00_EDEND_Enabled (0x1UL)

