pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EDSTOPPED @Bit 16 : Write '1' to enable interrupt for event EDSTOPPED */
  #define RADIO_INTENSET00_EDSTOPPED_Pos (16UL)
  #define RADIO_INTENSET00_EDSTOPPED_Msk (0x1UL << RADIO_INTENSET00_EDSTOPPED_Pos)
  #define RADIO_INTENSET00_EDSTOPPED_Min (0x0UL)
  #define RADIO_INTENSET00_EDSTOPPED_Max (0x1UL)
  #define RADIO_INTENSET00_EDSTOPPED_Set (0x1UL)
  #define RADIO_INTENSET00_EDSTOPPED_Disabled (0x0UL)
  #define RADIO_INTENSET00_EDSTOPPED_Enabled (0x1UL)

/* CCAIDLE @Bit 17 : Write '1' to enable interrupt for event CCAIDLE */
  #define RADIO_INTENSET00_CCAIDLE_Pos (17UL)
  #define RADIO_INTENSET00_CCAIDLE_Msk (0x1UL << RADIO_INTENSET00_CCAIDLE_Pos)
  #define RADIO_INTENSET00_CCAIDLE_Min (0x0UL)
  #define RADIO_INTENSET00_CCAIDLE_Max (0x1UL)
  #define RADIO_INTENSET00_CCAIDLE_Set (0x1UL)
  #define RADIO_INTENSET00_CCAIDLE_Disabled (0x0UL)
  #define RADIO_INTENSET00_CCAIDLE_Enabled (0x1UL)

/* CCABUSY @Bit 18 : Write '1' to enable interrupt for event CCABUSY */
  #define RADIO_INTENSET00_CCABUSY_Pos (18UL)
  #define RADIO_INTENSET00_CCABUSY_Msk (0x1UL << RADIO_INTENSET00_CCABUSY_Pos)
  #define RADIO_INTENSET00_CCABUSY_Min (0x0UL)
  #define RADIO_INTENSET00_CCABUSY_Max (0x1UL)
  #define RADIO_INTENSET00_CCABUSY_Set (0x1UL)
  #define RADIO_INTENSET00_CCABUSY_Disabled (0x0UL)
  #define RADIO_INTENSET00_CCABUSY_Enabled (0x1UL)

/* CCASTOPPED @Bit 19 : Write '1' to enable interrupt for event CCASTOPPED */
  #define RADIO_INTENSET00_CCASTOPPED_Pos (19UL)
  #define RADIO_INTENSET00_CCASTOPPED_Msk (0x1UL << RADIO_INTENSET00_CCASTOPPED_Pos)
  #define RADIO_INTENSET00_CCASTOPPED_Min (0x0UL)
  #define RADIO_INTENSET00_CCASTOPPED_Max (0x1UL)
  #define RADIO_INTENSET00_CCASTOPPED_Set (0x1UL)
  #define RADIO_INTENSET00_CCASTOPPED_Disabled (0x0UL)
  #define RADIO_INTENSET00_CCASTOPPED_Enabled (0x1UL)

/* RATEBOOST @Bit 20 : Write '1' to enable interrupt for event RATEBOOST */
  #define RADIO_INTENSET00_RATEBOOST_Pos (20UL)
  #define RADIO_INTENSET00_RATEBOOST_Msk (0x1UL << RADIO_INTENSET00_RATEBOOST_Pos)
  #define RADIO_INTENSET00_RATEBOOST_Min (0x0UL)
  #define RADIO_INTENSET00_RATEBOOST_Max (0x1UL)
  #define RADIO_INTENSET00_RATEBOOST_Set (0x1UL)
  #define RADIO_INTENSET00_RATEBOOST_Disabled (0x0UL)
  #define RADIO_INTENSET00_RATEBOOST_Enabled (0x1UL)

/* MHRMATCH @Bit 21 : Write '1' to enable interrupt for event MHRMATCH */
  #define RADIO_INTENSET00_MHRMATCH_Pos (21UL)
  #define RADIO_INTENSET00_MHRMATCH_Msk (0x1UL << RADIO_INTENSET00_MHRMATCH_Pos)
  #define RADIO_INTENSET00_MHRMATCH_Min (0x0UL)
  #define RADIO_INTENSET00_MHRMATCH_Max (0x1UL)
  #define RADIO_INTENSET00_MHRMATCH_Set (0x1UL)
  #define RADIO_INTENSET00_MHRMATCH_Disabled (0x0UL)
  #define RADIO_INTENSET00_MHRMATCH_Enabled (0x1UL)

/* SYNC @Bit 22 : Write '1' to enable interrupt for event SYNC */
  #define RADIO_INTENSET00_SYNC_Pos (22UL)
  #define RADIO_INTENSET00_SYNC_Msk (0x1UL << RADIO_INTENSET00_SYNC_Pos)
  #define RADIO_INTENSET00_SYNC_Min (0x0UL)
  #define RADIO_INTENSET00_SYNC_Max (0x1UL)
  #define RADIO_INTENSET00_SYNC_Set (0x1UL)
  #define RADIO_INTENSET00_SYNC_Disabled (0x0UL)
  #define RADIO_INTENSET00_SYNC_Enabled (0x1UL)

/* CTEPRESENT @Bit 23 : Write '1' to enable interrupt for event CTEPRESENT */
  #define RADIO_INTENSET00_CTEPRESENT_Pos (23UL)
  #define RADIO_INTENSET00_CTEPRESENT_Msk (0x1UL << RADIO_INTENSET00_CTEPRESENT_Pos)
  #define RADIO_INTENSET00_CTEPRESENT_Min (0x0UL)
  #define RADIO_INTENSET00_CTEPRESENT_Max (0x1UL)
  #define RADIO_INTENSET00_CTEPRESENT_Set (0x1UL)
  #define RADIO_INTENSET00_CTEPRESENT_Disabled (0x0UL)
  #define RADIO_INTENSET00_CTEPRESENT_Enabled (0x1UL)


/* RADIO_INTENCLR00: Disable interrupt */
  #define RADIO_INTENCLR00_ResetValue (0x00000000UL)

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define RADIO_INTENCLR00_READY_Pos (0UL)
  #define RADIO_INTENCLR00_READY_Msk (0x1UL << RADIO_INTENCLR00_READY_Pos)
  #define RADIO_INTENCLR00_READY_Min (0x0UL)
  #define RADIO_INTENCLR00_READY_Max (0x1UL)
  #define RADIO_INTENCLR00_READY_Clear (0x1UL)
  #define RADIO_INTENCLR00_READY_Disabled (0x0UL)
  #define RADIO_INTENCLR00_READY_Enabled (0x1UL)

/* TXREADY @Bit 1 : Write '1' to disable interrupt for event TXREADY */
  #define RADIO_INTENCLR00_TXREADY_Pos (1UL)
  #define RADIO_INTENCLR00_TXREADY_Msk (0x1UL << RADIO_INTENCLR00_TXREADY_Pos)
  #define RADIO_INTENCLR00_TXREADY_Min (0x0UL)
  #define RADIO_INTENCLR00_TXREADY_Max (0x1UL)
  #define RADIO_INTENCLR00_TXREADY_Clear (0x1UL)
  #define RADIO_INTENCLR00_TXREADY_Disabled (0x0UL)
  #define RADIO_INTENCLR00_TXREADY_Enabled (0x1UL)

/* RXREADY @Bit 2 : Write '1' to disable interrupt for event RXREADY */
  #define RADIO_INTENCLR00_RXREADY_Pos (2UL)
  #define RADIO_INTENCLR00_RXREADY_Msk (0x1UL << RADIO_INTENCLR00_RXREADY_Pos)
  #define RADIO_INTENCLR00_RXREADY_Min (0x0UL)
  #define RADIO_INTENCLR00_RXREADY_Max (0x1UL)
  #define RADIO_INTENCLR00_RXREADY_Clear (0x1UL)
  #define RADIO_INTENCLR00_RXREADY_Disabled (0x0UL)
  #define RADIO_INTENCLR00_RXREADY_Enabled (0x1UL)

/* ADDRESS @Bit 3 : Write '1' to disable interrupt for event ADDRESS */
  #define RADIO_INTENCLR00_ADDRESS_Pos (3UL)
  #define RADIO_INTENCLR00_ADDRESS_Msk (0x1UL << RADIO_INTENCLR00_ADDRESS_Pos)
  #define RADIO_INTENCLR00_ADDRESS_Min (0x0UL)
  #define RADIO_INTENCLR00_ADDRESS_Max (0x1UL)
  #define RADIO_INTENCLR00_ADDRESS_Clear (0x1UL)
  #define RADIO_INTENCLR00_ADDRESS_Disabled (0x0UL)
  #define RADIO_INTENCLR00_ADDRESS_Enabled (0x1UL)

/* FRAMESTART @Bit 4 : Write '1' to disable interrupt for event FRAMESTART */
  #define RADIO_INTENCLR00_FRAMESTART_Pos (4UL)
  #define RADIO_INTENCLR00_FRAMESTART_Msk (0x1UL << RADIO_INTENCLR00_FRAMESTART_Pos)
  #define RADIO_INTENCLR00_FRAMESTART_Min (0x0UL)
  #define RADIO_INTENCLR00_FRAMESTART_Max (0x1UL)
  #define RADIO_INTENCLR00_FRAMESTART_Clear (0x1UL)
  #define RADIO_INTENCLR00_FRAMESTART_Disabled (0x0UL)
  #define RADIO_INTENCLR00_FRAMESTART_Enabled (0x1UL)

/* PAYLOAD @Bit 5 : Write '1' to disable interrupt for event PAYLOAD */
  #define RADIO_INTENCLR00_PAYLOAD_Pos (5UL)
  #define RADIO_INTENCLR00_PAYLOAD_Msk (0x1UL << RADIO_INTENCLR00_PAYLOAD_Pos)
  #define RADIO_INTENCLR00_PAYLOAD_Min (0x0UL)
  #define RADIO_INTENCLR00_PAYLOAD_Max (0x1UL)
  #define RADIO_INTENCLR00_PAYLOAD_Clear (0x1UL)
  #define RADIO_INTENCLR00_PAYLOAD_Disabled (0x0UL)
  #define RADIO_INTENCLR00_PAYLOAD_Enabled (0x1UL)

/* END @Bit 6 : Write '1' to disable interrupt for event END */
  #define RADIO_INTENCLR00_END_Pos (6UL)
  #define RADIO_INTENCLR00_END_Msk (0x1UL << RADIO_INTENCLR00_END_Pos)
  #define RADIO_INTENCLR00_END_Min (0x0UL)
  #define RADIO_INTENCLR00_END_Max (0x1UL)
  #define RADIO_INTENCLR00_END_Clear (0x1UL)
  #define RADIO_INTENCLR00_END_Disabled (0x0UL)
  #define RADIO_INTENCLR00_END_Enabled (0x1UL)

/* PHYEND @Bit 7 : Write '1' to disable interrupt for event PHYEND */
  #define RADIO_INTENCLR00_PHYEND_Pos (7UL)
  #define RADIO_INTENCLR00_PHYEND_Msk (0x1UL << RADIO_INTENCLR00_PHYEND_Pos)
  #define RADIO_INTENCLR00_PHYEND_Min (0x0UL)
  #define RADIO_INTENCLR00_PHYEND_Max (0x1UL)
  #define RADIO_INTENCLR00_PHYEND_Clear (0x1UL)
  #define RADIO_INTENCLR00_PHYEND_Disabled (0x0UL)
  #define RADIO_INTENCLR00_PHYEND_Enabled (0x1UL)

/* DISABLED @Bit 8 : Write '1' to disable interrupt for event DISABLED */
  #define RADIO_INTENCLR00_DISABLED_Pos (8UL)
  #define RADIO_INTENCLR00_DISABLED_Msk (0x1UL << RADIO_INTENCLR00_DISABLED_Pos)
  #define RADIO_INTENCLR00_DISABLED_Min (0x0UL)
  #define RADIO_INTENCLR00_DISABLED_Max (0x1UL)
  #define RADIO_INTENCLR00_DISABLED_Clear (0x1UL)
  #define RADIO_INTENCLR00_DISABLED_Disabled (0x0UL)
  #define RADIO_INTENCLR00_DISABLED_Enabled (0x1UL)

/* DEVMATCH @Bit 9 : Write '1' to disable interrupt for event DEVMATCH */
  #define RADIO_INTENCLR00_DEVMATCH_Pos (9UL)
  #define RADIO_INTENCLR00_DEVMATCH_Msk (0x1UL << RADIO_INTENCLR00_DEVMATCH_Pos)
  #define RADIO_INTENCLR00_DEVMATCH_Min (0x0UL)
  #define RADIO_INTENCLR00_DEVMATCH_Max (0x1UL)
  #define RADIO_INTENCLR00_DEVMATCH_Clear (0x1UL)
  #define RADIO_INTENCLR00_DEVMATCH_Disabled (0x0UL)
  #define RADIO_INTENCLR00_DEVMATCH_Enabled (0x1UL)

/* DEVMISS @Bit 10 : Write '1' to disable interrupt for event DEVMISS */
  #define RADIO_INTENCLR00_DEVMISS_Pos (10UL)
  #define RADIO_INTENCLR00_DEVMISS_Msk (0x1UL << RADIO_INTENCLR00_DEVMISS_Pos)
  #define RADIO_INTENCLR00_DEVMISS_Min (0x0UL)
  #define RADIO_INTENCLR00_DEVMISS_Max (0x1UL)
  #define RADIO_INTENCLR00_DEVMISS_Clear (0x1UL)
  #define RADIO_INTENCLR00_DEVMISS_Disabled (0x0UL)
  #define RADIO_INTENCLR00_DEVMISS_Enabled (0x1UL)

/* CRCOK @Bit 11 : Write '1' to disable interrupt for event CRCOK */
  #define RADIO_INTENCLR00_CRCOK_Pos (11UL)
  #define RADIO_INTENCLR00_CRCOK_Msk (0x1UL << RADIO_INTENCLR00_CRCOK_Pos)
  #define RADIO_INTENCLR00_CRCOK_Min (0x0UL)
  #define RADIO_INTENCLR00_CRCOK_Max (0x1UL)
  #define RADIO_INTENCLR00_CRCOK_Clear (0x1UL)
  #define RADIO_INTENCLR00_CRCOK_Disabled (0x0UL)
  #define RADIO_INTENCLR00_CRCOK_Enabled (0x1UL)

/* CRCERROR @Bit 12 : Write '1' to disable interrupt for event CRCERROR */
  #define RADIO_INTENCLR00_CRCERROR_Pos (12UL)
  #define RADIO_INTENCLR00_CRCERROR_Msk (0x1UL << RADIO_INTENCLR00_CRCERROR_Pos)
  #define RADIO_INTENCLR00_CRCERROR_Min (0x0UL)
  #define RADIO_INTENCLR00_CRCERROR_Max (0x1UL)
  #define RADIO_INTENCLR00_CRCERROR_Clear (0x1UL)
  #define RADIO_INTENCLR00_CRCERROR_Disabled (0x0UL)
  #define RADIO_INTENCLR00_CRCERROR_Enabled (0x1UL)

/* BCMATCH @Bit 14 : Write '1' to disable interrupt for event BCMATCH */
  #define RADIO_INTENCLR00_BCMATCH_Pos (14UL)
  #define RADIO_INTENCLR00_BCMATCH_Msk (0x1UL << RADIO_INTENCLR00_BCMATCH_Pos)
  #define RADIO_INTENCLR00_BCMATCH_Min (0x0UL)
  #define RADIO_INTENCLR00_BCMATCH_Max (0x1UL)
  #define RADIO_INTENCLR00_BCMATCH_Clear (0x1UL)
  #define RADIO_INTENCLR00_BCMATCH_Disabled (0x0UL)
  #define RADIO_INTENCLR00_BCMATCH_Enabled (0x1UL)

