pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EDEND @Bit 15 : Write '1' to disable interrupt for event EDEND */
  #define RADIO_INTENCLR00_EDEND_Pos (15UL)
  #define RADIO_INTENCLR00_EDEND_Msk (0x1UL << RADIO_INTENCLR00_EDEND_Pos)
  #define RADIO_INTENCLR00_EDEND_Min (0x0UL)
  #define RADIO_INTENCLR00_EDEND_Max (0x1UL)
  #define RADIO_INTENCLR00_EDEND_Clear (0x1UL)
  #define RADIO_INTENCLR00_EDEND_Disabled (0x0UL)
  #define RADIO_INTENCLR00_EDEND_Enabled (0x1UL)

/* EDSTOPPED @Bit 16 : Write '1' to disable interrupt for event EDSTOPPED */
  #define RADIO_INTENCLR00_EDSTOPPED_Pos (16UL)
  #define RADIO_INTENCLR00_EDSTOPPED_Msk (0x1UL << RADIO_INTENCLR00_EDSTOPPED_Pos)
  #define RADIO_INTENCLR00_EDSTOPPED_Min (0x0UL)
  #define RADIO_INTENCLR00_EDSTOPPED_Max (0x1UL)
  #define RADIO_INTENCLR00_EDSTOPPED_Clear (0x1UL)
  #define RADIO_INTENCLR00_EDSTOPPED_Disabled (0x0UL)
  #define RADIO_INTENCLR00_EDSTOPPED_Enabled (0x1UL)

/* CCAIDLE @Bit 17 : Write '1' to disable interrupt for event CCAIDLE */
  #define RADIO_INTENCLR00_CCAIDLE_Pos (17UL)
  #define RADIO_INTENCLR00_CCAIDLE_Msk (0x1UL << RADIO_INTENCLR00_CCAIDLE_Pos)
  #define RADIO_INTENCLR00_CCAIDLE_Min (0x0UL)
  #define RADIO_INTENCLR00_CCAIDLE_Max (0x1UL)
  #define RADIO_INTENCLR00_CCAIDLE_Clear (0x1UL)
  #define RADIO_INTENCLR00_CCAIDLE_Disabled (0x0UL)
  #define RADIO_INTENCLR00_CCAIDLE_Enabled (0x1UL)

/* CCABUSY @Bit 18 : Write '1' to disable interrupt for event CCABUSY */
  #define RADIO_INTENCLR00_CCABUSY_Pos (18UL)
  #define RADIO_INTENCLR00_CCABUSY_Msk (0x1UL << RADIO_INTENCLR00_CCABUSY_Pos)
  #define RADIO_INTENCLR00_CCABUSY_Min (0x0UL)
  #define RADIO_INTENCLR00_CCABUSY_Max (0x1UL)
  #define RADIO_INTENCLR00_CCABUSY_Clear (0x1UL)
  #define RADIO_INTENCLR00_CCABUSY_Disabled (0x0UL)
  #define RADIO_INTENCLR00_CCABUSY_Enabled (0x1UL)

/* CCASTOPPED @Bit 19 : Write '1' to disable interrupt for event CCASTOPPED */
  #define RADIO_INTENCLR00_CCASTOPPED_Pos (19UL)
  #define RADIO_INTENCLR00_CCASTOPPED_Msk (0x1UL << RADIO_INTENCLR00_CCASTOPPED_Pos)
  #define RADIO_INTENCLR00_CCASTOPPED_Min (0x0UL)
  #define RADIO_INTENCLR00_CCASTOPPED_Max (0x1UL)
  #define RADIO_INTENCLR00_CCASTOPPED_Clear (0x1UL)
  #define RADIO_INTENCLR00_CCASTOPPED_Disabled (0x0UL)
  #define RADIO_INTENCLR00_CCASTOPPED_Enabled (0x1UL)

/* RATEBOOST @Bit 20 : Write '1' to disable interrupt for event RATEBOOST */
  #define RADIO_INTENCLR00_RATEBOOST_Pos (20UL)
  #define RADIO_INTENCLR00_RATEBOOST_Msk (0x1UL << RADIO_INTENCLR00_RATEBOOST_Pos)
  #define RADIO_INTENCLR00_RATEBOOST_Min (0x0UL)
  #define RADIO_INTENCLR00_RATEBOOST_Max (0x1UL)
  #define RADIO_INTENCLR00_RATEBOOST_Clear (0x1UL)
  #define RADIO_INTENCLR00_RATEBOOST_Disabled (0x0UL)
  #define RADIO_INTENCLR00_RATEBOOST_Enabled (0x1UL)

/* MHRMATCH @Bit 21 : Write '1' to disable interrupt for event MHRMATCH */
  #define RADIO_INTENCLR00_MHRMATCH_Pos (21UL)
  #define RADIO_INTENCLR00_MHRMATCH_Msk (0x1UL << RADIO_INTENCLR00_MHRMATCH_Pos)
  #define RADIO_INTENCLR00_MHRMATCH_Min (0x0UL)
  #define RADIO_INTENCLR00_MHRMATCH_Max (0x1UL)
  #define RADIO_INTENCLR00_MHRMATCH_Clear (0x1UL)
  #define RADIO_INTENCLR00_MHRMATCH_Disabled (0x0UL)
  #define RADIO_INTENCLR00_MHRMATCH_Enabled (0x1UL)

/* SYNC @Bit 22 : Write '1' to disable interrupt for event SYNC */
  #define RADIO_INTENCLR00_SYNC_Pos (22UL)
  #define RADIO_INTENCLR00_SYNC_Msk (0x1UL << RADIO_INTENCLR00_SYNC_Pos)
  #define RADIO_INTENCLR00_SYNC_Min (0x0UL)
  #define RADIO_INTENCLR00_SYNC_Max (0x1UL)
  #define RADIO_INTENCLR00_SYNC_Clear (0x1UL)
  #define RADIO_INTENCLR00_SYNC_Disabled (0x0UL)
  #define RADIO_INTENCLR00_SYNC_Enabled (0x1UL)

/* CTEPRESENT @Bit 23 : Write '1' to disable interrupt for event CTEPRESENT */
  #define RADIO_INTENCLR00_CTEPRESENT_Pos (23UL)
  #define RADIO_INTENCLR00_CTEPRESENT_Msk (0x1UL << RADIO_INTENCLR00_CTEPRESENT_Pos)
  #define RADIO_INTENCLR00_CTEPRESENT_Min (0x0UL)
  #define RADIO_INTENCLR00_CTEPRESENT_Max (0x1UL)
  #define RADIO_INTENCLR00_CTEPRESENT_Clear (0x1UL)
  #define RADIO_INTENCLR00_CTEPRESENT_Disabled (0x0UL)
  #define RADIO_INTENCLR00_CTEPRESENT_Enabled (0x1UL)


/* RADIO_INTENSET10: Enable interrupt */
  #define RADIO_INTENSET10_ResetValue (0x00000000UL)

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define RADIO_INTENSET10_READY_Pos (0UL)
  #define RADIO_INTENSET10_READY_Msk (0x1UL << RADIO_INTENSET10_READY_Pos)
  #define RADIO_INTENSET10_READY_Min (0x0UL)
  #define RADIO_INTENSET10_READY_Max (0x1UL)
  #define RADIO_INTENSET10_READY_Set (0x1UL)
  #define RADIO_INTENSET10_READY_Disabled (0x0UL)
  #define RADIO_INTENSET10_READY_Enabled (0x1UL)

/* TXREADY @Bit 1 : Write '1' to enable interrupt for event TXREADY */
  #define RADIO_INTENSET10_TXREADY_Pos (1UL)
  #define RADIO_INTENSET10_TXREADY_Msk (0x1UL << RADIO_INTENSET10_TXREADY_Pos)
  #define RADIO_INTENSET10_TXREADY_Min (0x0UL)
  #define RADIO_INTENSET10_TXREADY_Max (0x1UL)
  #define RADIO_INTENSET10_TXREADY_Set (0x1UL)
  #define RADIO_INTENSET10_TXREADY_Disabled (0x0UL)
  #define RADIO_INTENSET10_TXREADY_Enabled (0x1UL)

/* RXREADY @Bit 2 : Write '1' to enable interrupt for event RXREADY */
  #define RADIO_INTENSET10_RXREADY_Pos (2UL)
  #define RADIO_INTENSET10_RXREADY_Msk (0x1UL << RADIO_INTENSET10_RXREADY_Pos)
  #define RADIO_INTENSET10_RXREADY_Min (0x0UL)
  #define RADIO_INTENSET10_RXREADY_Max (0x1UL)
  #define RADIO_INTENSET10_RXREADY_Set (0x1UL)
  #define RADIO_INTENSET10_RXREADY_Disabled (0x0UL)
  #define RADIO_INTENSET10_RXREADY_Enabled (0x1UL)

/* ADDRESS @Bit 3 : Write '1' to enable interrupt for event ADDRESS */
  #define RADIO_INTENSET10_ADDRESS_Pos (3UL)
  #define RADIO_INTENSET10_ADDRESS_Msk (0x1UL << RADIO_INTENSET10_ADDRESS_Pos)
  #define RADIO_INTENSET10_ADDRESS_Min (0x0UL)
  #define RADIO_INTENSET10_ADDRESS_Max (0x1UL)
  #define RADIO_INTENSET10_ADDRESS_Set (0x1UL)
  #define RADIO_INTENSET10_ADDRESS_Disabled (0x0UL)
  #define RADIO_INTENSET10_ADDRESS_Enabled (0x1UL)

/* FRAMESTART @Bit 4 : Write '1' to enable interrupt for event FRAMESTART */
  #define RADIO_INTENSET10_FRAMESTART_Pos (4UL)
  #define RADIO_INTENSET10_FRAMESTART_Msk (0x1UL << RADIO_INTENSET10_FRAMESTART_Pos)
  #define RADIO_INTENSET10_FRAMESTART_Min (0x0UL)
  #define RADIO_INTENSET10_FRAMESTART_Max (0x1UL)
  #define RADIO_INTENSET10_FRAMESTART_Set (0x1UL)
  #define RADIO_INTENSET10_FRAMESTART_Disabled (0x0UL)
  #define RADIO_INTENSET10_FRAMESTART_Enabled (0x1UL)

/* PAYLOAD @Bit 5 : Write '1' to enable interrupt for event PAYLOAD */
  #define RADIO_INTENSET10_PAYLOAD_Pos (5UL)
  #define RADIO_INTENSET10_PAYLOAD_Msk (0x1UL << RADIO_INTENSET10_PAYLOAD_Pos)
  #define RADIO_INTENSET10_PAYLOAD_Min (0x0UL)
  #define RADIO_INTENSET10_PAYLOAD_Max (0x1UL)
  #define RADIO_INTENSET10_PAYLOAD_Set (0x1UL)
  #define RADIO_INTENSET10_PAYLOAD_Disabled (0x0UL)
  #define RADIO_INTENSET10_PAYLOAD_Enabled (0x1UL)

/* END @Bit 6 : Write '1' to enable interrupt for event END */
  #define RADIO_INTENSET10_END_Pos (6UL)
  #define RADIO_INTENSET10_END_Msk (0x1UL << RADIO_INTENSET10_END_Pos)
  #define RADIO_INTENSET10_END_Min (0x0UL)
  #define RADIO_INTENSET10_END_Max (0x1UL)
  #define RADIO_INTENSET10_END_Set (0x1UL)
  #define RADIO_INTENSET10_END_Disabled (0x0UL)
  #define RADIO_INTENSET10_END_Enabled (0x1UL)

