pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PHYEND @Bit 7 : Write '1' to enable interrupt for event PHYEND */
  #define RADIO_INTENSET10_PHYEND_Pos (7UL)
  #define RADIO_INTENSET10_PHYEND_Msk (0x1UL << RADIO_INTENSET10_PHYEND_Pos)
  #define RADIO_INTENSET10_PHYEND_Min (0x0UL)
  #define RADIO_INTENSET10_PHYEND_Max (0x1UL)
  #define RADIO_INTENSET10_PHYEND_Set (0x1UL)
  #define RADIO_INTENSET10_PHYEND_Disabled (0x0UL)
  #define RADIO_INTENSET10_PHYEND_Enabled (0x1UL)

/* DISABLED @Bit 8 : Write '1' to enable interrupt for event DISABLED */
  #define RADIO_INTENSET10_DISABLED_Pos (8UL)
  #define RADIO_INTENSET10_DISABLED_Msk (0x1UL << RADIO_INTENSET10_DISABLED_Pos)
  #define RADIO_INTENSET10_DISABLED_Min (0x0UL)
  #define RADIO_INTENSET10_DISABLED_Max (0x1UL)
  #define RADIO_INTENSET10_DISABLED_Set (0x1UL)
  #define RADIO_INTENSET10_DISABLED_Disabled (0x0UL)
  #define RADIO_INTENSET10_DISABLED_Enabled (0x1UL)

/* DEVMATCH @Bit 9 : Write '1' to enable interrupt for event DEVMATCH */
  #define RADIO_INTENSET10_DEVMATCH_Pos (9UL)
  #define RADIO_INTENSET10_DEVMATCH_Msk (0x1UL << RADIO_INTENSET10_DEVMATCH_Pos)
  #define RADIO_INTENSET10_DEVMATCH_Min (0x0UL)
  #define RADIO_INTENSET10_DEVMATCH_Max (0x1UL)
  #define RADIO_INTENSET10_DEVMATCH_Set (0x1UL)
  #define RADIO_INTENSET10_DEVMATCH_Disabled (0x0UL)
  #define RADIO_INTENSET10_DEVMATCH_Enabled (0x1UL)

/* DEVMISS @Bit 10 : Write '1' to enable interrupt for event DEVMISS */
  #define RADIO_INTENSET10_DEVMISS_Pos (10UL)
  #define RADIO_INTENSET10_DEVMISS_Msk (0x1UL << RADIO_INTENSET10_DEVMISS_Pos)
  #define RADIO_INTENSET10_DEVMISS_Min (0x0UL)
  #define RADIO_INTENSET10_DEVMISS_Max (0x1UL)
  #define RADIO_INTENSET10_DEVMISS_Set (0x1UL)
  #define RADIO_INTENSET10_DEVMISS_Disabled (0x0UL)
  #define RADIO_INTENSET10_DEVMISS_Enabled (0x1UL)

/* CRCOK @Bit 11 : Write '1' to enable interrupt for event CRCOK */
  #define RADIO_INTENSET10_CRCOK_Pos (11UL)
  #define RADIO_INTENSET10_CRCOK_Msk (0x1UL << RADIO_INTENSET10_CRCOK_Pos)
  #define RADIO_INTENSET10_CRCOK_Min (0x0UL)
  #define RADIO_INTENSET10_CRCOK_Max (0x1UL)
  #define RADIO_INTENSET10_CRCOK_Set (0x1UL)
  #define RADIO_INTENSET10_CRCOK_Disabled (0x0UL)
  #define RADIO_INTENSET10_CRCOK_Enabled (0x1UL)

/* CRCERROR @Bit 12 : Write '1' to enable interrupt for event CRCERROR */
  #define RADIO_INTENSET10_CRCERROR_Pos (12UL)
  #define RADIO_INTENSET10_CRCERROR_Msk (0x1UL << RADIO_INTENSET10_CRCERROR_Pos)
  #define RADIO_INTENSET10_CRCERROR_Min (0x0UL)
  #define RADIO_INTENSET10_CRCERROR_Max (0x1UL)
  #define RADIO_INTENSET10_CRCERROR_Set (0x1UL)
  #define RADIO_INTENSET10_CRCERROR_Disabled (0x0UL)
  #define RADIO_INTENSET10_CRCERROR_Enabled (0x1UL)

/* BCMATCH @Bit 14 : Write '1' to enable interrupt for event BCMATCH */
  #define RADIO_INTENSET10_BCMATCH_Pos (14UL)
  #define RADIO_INTENSET10_BCMATCH_Msk (0x1UL << RADIO_INTENSET10_BCMATCH_Pos)
  #define RADIO_INTENSET10_BCMATCH_Min (0x0UL)
  #define RADIO_INTENSET10_BCMATCH_Max (0x1UL)
  #define RADIO_INTENSET10_BCMATCH_Set (0x1UL)
  #define RADIO_INTENSET10_BCMATCH_Disabled (0x0UL)
  #define RADIO_INTENSET10_BCMATCH_Enabled (0x1UL)

/* EDEND @Bit 15 : Write '1' to enable interrupt for event EDEND */
  #define RADIO_INTENSET10_EDEND_Pos (15UL)
  #define RADIO_INTENSET10_EDEND_Msk (0x1UL << RADIO_INTENSET10_EDEND_Pos)
  #define RADIO_INTENSET10_EDEND_Min (0x0UL)
  #define RADIO_INTENSET10_EDEND_Max (0x1UL)
  #define RADIO_INTENSET10_EDEND_Set (0x1UL)
  #define RADIO_INTENSET10_EDEND_Disabled (0x0UL)
  #define RADIO_INTENSET10_EDEND_Enabled (0x1UL)

/* EDSTOPPED @Bit 16 : Write '1' to enable interrupt for event EDSTOPPED */
  #define RADIO_INTENSET10_EDSTOPPED_Pos (16UL)
  #define RADIO_INTENSET10_EDSTOPPED_Msk (0x1UL << RADIO_INTENSET10_EDSTOPPED_Pos)
  #define RADIO_INTENSET10_EDSTOPPED_Min (0x0UL)
  #define RADIO_INTENSET10_EDSTOPPED_Max (0x1UL)
  #define RADIO_INTENSET10_EDSTOPPED_Set (0x1UL)
  #define RADIO_INTENSET10_EDSTOPPED_Disabled (0x0UL)
  #define RADIO_INTENSET10_EDSTOPPED_Enabled (0x1UL)

/* CCAIDLE @Bit 17 : Write '1' to enable interrupt for event CCAIDLE */
  #define RADIO_INTENSET10_CCAIDLE_Pos (17UL)
  #define RADIO_INTENSET10_CCAIDLE_Msk (0x1UL << RADIO_INTENSET10_CCAIDLE_Pos)
  #define RADIO_INTENSET10_CCAIDLE_Min (0x0UL)
  #define RADIO_INTENSET10_CCAIDLE_Max (0x1UL)
  #define RADIO_INTENSET10_CCAIDLE_Set (0x1UL)
  #define RADIO_INTENSET10_CCAIDLE_Disabled (0x0UL)
  #define RADIO_INTENSET10_CCAIDLE_Enabled (0x1UL)

/* CCABUSY @Bit 18 : Write '1' to enable interrupt for event CCABUSY */
  #define RADIO_INTENSET10_CCABUSY_Pos (18UL)
  #define RADIO_INTENSET10_CCABUSY_Msk (0x1UL << RADIO_INTENSET10_CCABUSY_Pos)
  #define RADIO_INTENSET10_CCABUSY_Min (0x0UL)
  #define RADIO_INTENSET10_CCABUSY_Max (0x1UL)
  #define RADIO_INTENSET10_CCABUSY_Set (0x1UL)
  #define RADIO_INTENSET10_CCABUSY_Disabled (0x0UL)
  #define RADIO_INTENSET10_CCABUSY_Enabled (0x1UL)

/* CCASTOPPED @Bit 19 : Write '1' to enable interrupt for event CCASTOPPED */
  #define RADIO_INTENSET10_CCASTOPPED_Pos (19UL)
  #define RADIO_INTENSET10_CCASTOPPED_Msk (0x1UL << RADIO_INTENSET10_CCASTOPPED_Pos)
  #define RADIO_INTENSET10_CCASTOPPED_Min (0x0UL)
  #define RADIO_INTENSET10_CCASTOPPED_Max (0x1UL)
  #define RADIO_INTENSET10_CCASTOPPED_Set (0x1UL)
  #define RADIO_INTENSET10_CCASTOPPED_Disabled (0x0UL)
  #define RADIO_INTENSET10_CCASTOPPED_Enabled (0x1UL)

/* RATEBOOST @Bit 20 : Write '1' to enable interrupt for event RATEBOOST */
  #define RADIO_INTENSET10_RATEBOOST_Pos (20UL)
  #define RADIO_INTENSET10_RATEBOOST_Msk (0x1UL << RADIO_INTENSET10_RATEBOOST_Pos)
  #define RADIO_INTENSET10_RATEBOOST_Min (0x0UL)
  #define RADIO_INTENSET10_RATEBOOST_Max (0x1UL)
  #define RADIO_INTENSET10_RATEBOOST_Set (0x1UL)
  #define RADIO_INTENSET10_RATEBOOST_Disabled (0x0UL)
  #define RADIO_INTENSET10_RATEBOOST_Enabled (0x1UL)

/* MHRMATCH @Bit 21 : Write '1' to enable interrupt for event MHRMATCH */
  #define RADIO_INTENSET10_MHRMATCH_Pos (21UL)
  #define RADIO_INTENSET10_MHRMATCH_Msk (0x1UL << RADIO_INTENSET10_MHRMATCH_Pos)
  #define RADIO_INTENSET10_MHRMATCH_Min (0x0UL)
  #define RADIO_INTENSET10_MHRMATCH_Max (0x1UL)
  #define RADIO_INTENSET10_MHRMATCH_Set (0x1UL)
  #define RADIO_INTENSET10_MHRMATCH_Disabled (0x0UL)
  #define RADIO_INTENSET10_MHRMATCH_Enabled (0x1UL)

/* SYNC @Bit 22 : Write '1' to enable interrupt for event SYNC */
  #define RADIO_INTENSET10_SYNC_Pos (22UL)
  #define RADIO_INTENSET10_SYNC_Msk (0x1UL << RADIO_INTENSET10_SYNC_Pos)
  #define RADIO_INTENSET10_SYNC_Min (0x0UL)
  #define RADIO_INTENSET10_SYNC_Max (0x1UL)
  #define RADIO_INTENSET10_SYNC_Set (0x1UL)
  #define RADIO_INTENSET10_SYNC_Disabled (0x0UL)
  #define RADIO_INTENSET10_SYNC_Enabled (0x1UL)

/* CTEPRESENT @Bit 23 : Write '1' to enable interrupt for event CTEPRESENT */
  #define RADIO_INTENSET10_CTEPRESENT_Pos (23UL)
  #define RADIO_INTENSET10_CTEPRESENT_Msk (0x1UL << RADIO_INTENSET10_CTEPRESENT_Pos)
  #define RADIO_INTENSET10_CTEPRESENT_Min (0x0UL)
  #define RADIO_INTENSET10_CTEPRESENT_Max (0x1UL)
  #define RADIO_INTENSET10_CTEPRESENT_Set (0x1UL)
  #define RADIO_INTENSET10_CTEPRESENT_Disabled (0x0UL)
  #define RADIO_INTENSET10_CTEPRESENT_Enabled (0x1UL)


/* RADIO_INTENCLR10: Disable interrupt */
  #define RADIO_INTENCLR10_ResetValue (0x00000000UL)

/* READY @Bit 0 : Write '1' to disable interrupt for event READY */
  #define RADIO_INTENCLR10_READY_Pos (0UL)
  #define RADIO_INTENCLR10_READY_Msk (0x1UL << RADIO_INTENCLR10_READY_Pos)
  #define RADIO_INTENCLR10_READY_Min (0x0UL)
  #define RADIO_INTENCLR10_READY_Max (0x1UL)
  #define RADIO_INTENCLR10_READY_Clear (0x1UL)
  #define RADIO_INTENCLR10_READY_Disabled (0x0UL)
  #define RADIO_INTENCLR10_READY_Enabled (0x1UL)

/* TXREADY @Bit 1 : Write '1' to disable interrupt for event TXREADY */
  #define RADIO_INTENCLR10_TXREADY_Pos (1UL)
  #define RADIO_INTENCLR10_TXREADY_Msk (0x1UL << RADIO_INTENCLR10_TXREADY_Pos)
  #define RADIO_INTENCLR10_TXREADY_Min (0x0UL)
  #define RADIO_INTENCLR10_TXREADY_Max (0x1UL)
  #define RADIO_INTENCLR10_TXREADY_Clear (0x1UL)
  #define RADIO_INTENCLR10_TXREADY_Disabled (0x0UL)
  #define RADIO_INTENCLR10_TXREADY_Enabled (0x1UL)

