pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RXREADY @Bit 2 : Write '1' to disable interrupt for event RXREADY */
  #define RADIO_INTENCLR10_RXREADY_Pos (2UL)
  #define RADIO_INTENCLR10_RXREADY_Msk (0x1UL << RADIO_INTENCLR10_RXREADY_Pos)
  #define RADIO_INTENCLR10_RXREADY_Min (0x0UL)
  #define RADIO_INTENCLR10_RXREADY_Max (0x1UL)
  #define RADIO_INTENCLR10_RXREADY_Clear (0x1UL)
  #define RADIO_INTENCLR10_RXREADY_Disabled (0x0UL)
  #define RADIO_INTENCLR10_RXREADY_Enabled (0x1UL)

/* ADDRESS @Bit 3 : Write '1' to disable interrupt for event ADDRESS */
  #define RADIO_INTENCLR10_ADDRESS_Pos (3UL)
  #define RADIO_INTENCLR10_ADDRESS_Msk (0x1UL << RADIO_INTENCLR10_ADDRESS_Pos)
  #define RADIO_INTENCLR10_ADDRESS_Min (0x0UL)
  #define RADIO_INTENCLR10_ADDRESS_Max (0x1UL)
  #define RADIO_INTENCLR10_ADDRESS_Clear (0x1UL)
  #define RADIO_INTENCLR10_ADDRESS_Disabled (0x0UL)
  #define RADIO_INTENCLR10_ADDRESS_Enabled (0x1UL)

/* FRAMESTART @Bit 4 : Write '1' to disable interrupt for event FRAMESTART */
  #define RADIO_INTENCLR10_FRAMESTART_Pos (4UL)
  #define RADIO_INTENCLR10_FRAMESTART_Msk (0x1UL << RADIO_INTENCLR10_FRAMESTART_Pos)
  #define RADIO_INTENCLR10_FRAMESTART_Min (0x0UL)
  #define RADIO_INTENCLR10_FRAMESTART_Max (0x1UL)
  #define RADIO_INTENCLR10_FRAMESTART_Clear (0x1UL)
  #define RADIO_INTENCLR10_FRAMESTART_Disabled (0x0UL)
  #define RADIO_INTENCLR10_FRAMESTART_Enabled (0x1UL)

/* PAYLOAD @Bit 5 : Write '1' to disable interrupt for event PAYLOAD */
  #define RADIO_INTENCLR10_PAYLOAD_Pos (5UL)
  #define RADIO_INTENCLR10_PAYLOAD_Msk (0x1UL << RADIO_INTENCLR10_PAYLOAD_Pos)
  #define RADIO_INTENCLR10_PAYLOAD_Min (0x0UL)
  #define RADIO_INTENCLR10_PAYLOAD_Max (0x1UL)
  #define RADIO_INTENCLR10_PAYLOAD_Clear (0x1UL)
  #define RADIO_INTENCLR10_PAYLOAD_Disabled (0x0UL)
  #define RADIO_INTENCLR10_PAYLOAD_Enabled (0x1UL)

/* END @Bit 6 : Write '1' to disable interrupt for event END */
  #define RADIO_INTENCLR10_END_Pos (6UL)
  #define RADIO_INTENCLR10_END_Msk (0x1UL << RADIO_INTENCLR10_END_Pos)
  #define RADIO_INTENCLR10_END_Min (0x0UL)
  #define RADIO_INTENCLR10_END_Max (0x1UL)
  #define RADIO_INTENCLR10_END_Clear (0x1UL)
  #define RADIO_INTENCLR10_END_Disabled (0x0UL)
  #define RADIO_INTENCLR10_END_Enabled (0x1UL)

/* PHYEND @Bit 7 : Write '1' to disable interrupt for event PHYEND */
  #define RADIO_INTENCLR10_PHYEND_Pos (7UL)
  #define RADIO_INTENCLR10_PHYEND_Msk (0x1UL << RADIO_INTENCLR10_PHYEND_Pos)
  #define RADIO_INTENCLR10_PHYEND_Min (0x0UL)
  #define RADIO_INTENCLR10_PHYEND_Max (0x1UL)
  #define RADIO_INTENCLR10_PHYEND_Clear (0x1UL)
  #define RADIO_INTENCLR10_PHYEND_Disabled (0x0UL)
  #define RADIO_INTENCLR10_PHYEND_Enabled (0x1UL)

/* DISABLED @Bit 8 : Write '1' to disable interrupt for event DISABLED */
  #define RADIO_INTENCLR10_DISABLED_Pos (8UL)
  #define RADIO_INTENCLR10_DISABLED_Msk (0x1UL << RADIO_INTENCLR10_DISABLED_Pos)
  #define RADIO_INTENCLR10_DISABLED_Min (0x0UL)
  #define RADIO_INTENCLR10_DISABLED_Max (0x1UL)
  #define RADIO_INTENCLR10_DISABLED_Clear (0x1UL)
  #define RADIO_INTENCLR10_DISABLED_Disabled (0x0UL)
  #define RADIO_INTENCLR10_DISABLED_Enabled (0x1UL)

/* DEVMATCH @Bit 9 : Write '1' to disable interrupt for event DEVMATCH */
  #define RADIO_INTENCLR10_DEVMATCH_Pos (9UL)
  #define RADIO_INTENCLR10_DEVMATCH_Msk (0x1UL << RADIO_INTENCLR10_DEVMATCH_Pos)
  #define RADIO_INTENCLR10_DEVMATCH_Min (0x0UL)
  #define RADIO_INTENCLR10_DEVMATCH_Max (0x1UL)
  #define RADIO_INTENCLR10_DEVMATCH_Clear (0x1UL)
  #define RADIO_INTENCLR10_DEVMATCH_Disabled (0x0UL)
  #define RADIO_INTENCLR10_DEVMATCH_Enabled (0x1UL)

/* DEVMISS @Bit 10 : Write '1' to disable interrupt for event DEVMISS */
  #define RADIO_INTENCLR10_DEVMISS_Pos (10UL)
  #define RADIO_INTENCLR10_DEVMISS_Msk (0x1UL << RADIO_INTENCLR10_DEVMISS_Pos)
  #define RADIO_INTENCLR10_DEVMISS_Min (0x0UL)
  #define RADIO_INTENCLR10_DEVMISS_Max (0x1UL)
  #define RADIO_INTENCLR10_DEVMISS_Clear (0x1UL)
  #define RADIO_INTENCLR10_DEVMISS_Disabled (0x0UL)
  #define RADIO_INTENCLR10_DEVMISS_Enabled (0x1UL)

/* CRCOK @Bit 11 : Write '1' to disable interrupt for event CRCOK */
  #define RADIO_INTENCLR10_CRCOK_Pos (11UL)
  #define RADIO_INTENCLR10_CRCOK_Msk (0x1UL << RADIO_INTENCLR10_CRCOK_Pos)
  #define RADIO_INTENCLR10_CRCOK_Min (0x0UL)
  #define RADIO_INTENCLR10_CRCOK_Max (0x1UL)
  #define RADIO_INTENCLR10_CRCOK_Clear (0x1UL)
  #define RADIO_INTENCLR10_CRCOK_Disabled (0x0UL)
  #define RADIO_INTENCLR10_CRCOK_Enabled (0x1UL)

/* CRCERROR @Bit 12 : Write '1' to disable interrupt for event CRCERROR */
  #define RADIO_INTENCLR10_CRCERROR_Pos (12UL)
  #define RADIO_INTENCLR10_CRCERROR_Msk (0x1UL << RADIO_INTENCLR10_CRCERROR_Pos)
  #define RADIO_INTENCLR10_CRCERROR_Min (0x0UL)
  #define RADIO_INTENCLR10_CRCERROR_Max (0x1UL)
  #define RADIO_INTENCLR10_CRCERROR_Clear (0x1UL)
  #define RADIO_INTENCLR10_CRCERROR_Disabled (0x0UL)
  #define RADIO_INTENCLR10_CRCERROR_Enabled (0x1UL)

/* BCMATCH @Bit 14 : Write '1' to disable interrupt for event BCMATCH */
  #define RADIO_INTENCLR10_BCMATCH_Pos (14UL)
  #define RADIO_INTENCLR10_BCMATCH_Msk (0x1UL << RADIO_INTENCLR10_BCMATCH_Pos)
  #define RADIO_INTENCLR10_BCMATCH_Min (0x0UL)
  #define RADIO_INTENCLR10_BCMATCH_Max (0x1UL)
  #define RADIO_INTENCLR10_BCMATCH_Clear (0x1UL)
  #define RADIO_INTENCLR10_BCMATCH_Disabled (0x0UL)
  #define RADIO_INTENCLR10_BCMATCH_Enabled (0x1UL)

/* EDEND @Bit 15 : Write '1' to disable interrupt for event EDEND */
  #define RADIO_INTENCLR10_EDEND_Pos (15UL)
  #define RADIO_INTENCLR10_EDEND_Msk (0x1UL << RADIO_INTENCLR10_EDEND_Pos)
  #define RADIO_INTENCLR10_EDEND_Min (0x0UL)
  #define RADIO_INTENCLR10_EDEND_Max (0x1UL)
  #define RADIO_INTENCLR10_EDEND_Clear (0x1UL)
  #define RADIO_INTENCLR10_EDEND_Disabled (0x0UL)
  #define RADIO_INTENCLR10_EDEND_Enabled (0x1UL)

/* EDSTOPPED @Bit 16 : Write '1' to disable interrupt for event EDSTOPPED */
  #define RADIO_INTENCLR10_EDSTOPPED_Pos (16UL)
  #define RADIO_INTENCLR10_EDSTOPPED_Msk (0x1UL << RADIO_INTENCLR10_EDSTOPPED_Pos)
  #define RADIO_INTENCLR10_EDSTOPPED_Min (0x0UL)
  #define RADIO_INTENCLR10_EDSTOPPED_Max (0x1UL)
  #define RADIO_INTENCLR10_EDSTOPPED_Clear (0x1UL)
  #define RADIO_INTENCLR10_EDSTOPPED_Disabled (0x0UL)
  #define RADIO_INTENCLR10_EDSTOPPED_Enabled (0x1UL)

/* CCAIDLE @Bit 17 : Write '1' to disable interrupt for event CCAIDLE */
  #define RADIO_INTENCLR10_CCAIDLE_Pos (17UL)
  #define RADIO_INTENCLR10_CCAIDLE_Msk (0x1UL << RADIO_INTENCLR10_CCAIDLE_Pos)
  #define RADIO_INTENCLR10_CCAIDLE_Min (0x0UL)
  #define RADIO_INTENCLR10_CCAIDLE_Max (0x1UL)
  #define RADIO_INTENCLR10_CCAIDLE_Clear (0x1UL)
  #define RADIO_INTENCLR10_CCAIDLE_Disabled (0x0UL)
  #define RADIO_INTENCLR10_CCAIDLE_Enabled (0x1UL)

/* CCABUSY @Bit 18 : Write '1' to disable interrupt for event CCABUSY */
  #define RADIO_INTENCLR10_CCABUSY_Pos (18UL)
  #define RADIO_INTENCLR10_CCABUSY_Msk (0x1UL << RADIO_INTENCLR10_CCABUSY_Pos)
  #define RADIO_INTENCLR10_CCABUSY_Min (0x0UL)
  #define RADIO_INTENCLR10_CCABUSY_Max (0x1UL)
  #define RADIO_INTENCLR10_CCABUSY_Clear (0x1UL)
  #define RADIO_INTENCLR10_CCABUSY_Disabled (0x0UL)
  #define RADIO_INTENCLR10_CCABUSY_Enabled (0x1UL)

