pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CCASTOPPED @Bit 19 : Write '1' to disable interrupt for event CCASTOPPED */
  #define RADIO_INTENCLR10_CCASTOPPED_Pos (19UL)
  #define RADIO_INTENCLR10_CCASTOPPED_Msk (0x1UL << RADIO_INTENCLR10_CCASTOPPED_Pos)
  #define RADIO_INTENCLR10_CCASTOPPED_Min (0x0UL)
  #define RADIO_INTENCLR10_CCASTOPPED_Max (0x1UL)
  #define RADIO_INTENCLR10_CCASTOPPED_Clear (0x1UL)
  #define RADIO_INTENCLR10_CCASTOPPED_Disabled (0x0UL)
  #define RADIO_INTENCLR10_CCASTOPPED_Enabled (0x1UL)

/* RATEBOOST @Bit 20 : Write '1' to disable interrupt for event RATEBOOST */
  #define RADIO_INTENCLR10_RATEBOOST_Pos (20UL)
  #define RADIO_INTENCLR10_RATEBOOST_Msk (0x1UL << RADIO_INTENCLR10_RATEBOOST_Pos)
  #define RADIO_INTENCLR10_RATEBOOST_Min (0x0UL)
  #define RADIO_INTENCLR10_RATEBOOST_Max (0x1UL)
  #define RADIO_INTENCLR10_RATEBOOST_Clear (0x1UL)
  #define RADIO_INTENCLR10_RATEBOOST_Disabled (0x0UL)
  #define RADIO_INTENCLR10_RATEBOOST_Enabled (0x1UL)

/* MHRMATCH @Bit 21 : Write '1' to disable interrupt for event MHRMATCH */
  #define RADIO_INTENCLR10_MHRMATCH_Pos (21UL)
  #define RADIO_INTENCLR10_MHRMATCH_Msk (0x1UL << RADIO_INTENCLR10_MHRMATCH_Pos)
  #define RADIO_INTENCLR10_MHRMATCH_Min (0x0UL)
  #define RADIO_INTENCLR10_MHRMATCH_Max (0x1UL)
  #define RADIO_INTENCLR10_MHRMATCH_Clear (0x1UL)
  #define RADIO_INTENCLR10_MHRMATCH_Disabled (0x0UL)
  #define RADIO_INTENCLR10_MHRMATCH_Enabled (0x1UL)

/* SYNC @Bit 22 : Write '1' to disable interrupt for event SYNC */
  #define RADIO_INTENCLR10_SYNC_Pos (22UL)
  #define RADIO_INTENCLR10_SYNC_Msk (0x1UL << RADIO_INTENCLR10_SYNC_Pos)
  #define RADIO_INTENCLR10_SYNC_Min (0x0UL)
  #define RADIO_INTENCLR10_SYNC_Max (0x1UL)
  #define RADIO_INTENCLR10_SYNC_Clear (0x1UL)
  #define RADIO_INTENCLR10_SYNC_Disabled (0x0UL)
  #define RADIO_INTENCLR10_SYNC_Enabled (0x1UL)

/* CTEPRESENT @Bit 23 : Write '1' to disable interrupt for event CTEPRESENT */
  #define RADIO_INTENCLR10_CTEPRESENT_Pos (23UL)
  #define RADIO_INTENCLR10_CTEPRESENT_Msk (0x1UL << RADIO_INTENCLR10_CTEPRESENT_Pos)
  #define RADIO_INTENCLR10_CTEPRESENT_Min (0x0UL)
  #define RADIO_INTENCLR10_CTEPRESENT_Max (0x1UL)
  #define RADIO_INTENCLR10_CTEPRESENT_Clear (0x1UL)
  #define RADIO_INTENCLR10_CTEPRESENT_Disabled (0x0UL)
  #define RADIO_INTENCLR10_CTEPRESENT_Enabled (0x1UL)


/* RADIO_MODE: Data rate and modulation */
  #define RADIO_MODE_ResetValue (0x00000000UL)

/* MODE @Bits 0..3 : Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation. */
  #define RADIO_MODE_MODE_Pos (0UL)
  #define RADIO_MODE_MODE_Msk (0xFUL << RADIO_MODE_MODE_Pos)
  #define RADIO_MODE_MODE_Min (0x0UL)
  #define RADIO_MODE_MODE_Max (0xFUL)
  #define RADIO_MODE_MODE_Nrf_1Mbit (0x0UL)
  #define RADIO_MODE_MODE_Nrf_2Mbit (0x1UL)
  #define RADIO_MODE_MODE_Ble_1Mbit (0x3UL)
  #define RADIO_MODE_MODE_Ble_2Mbit (0x4UL)
  #define RADIO_MODE_MODE_Ble_LR125Kbit (0x5UL)
  #define RADIO_MODE_MODE_Ble_LR500Kbit (0x6UL)
  #define RADIO_MODE_MODE_Nrf_4Mbit0_5 (0x9UL)
  #define RADIO_MODE_MODE_Nrf_4Mbit0_25 (0xAUL)
  #define RADIO_MODE_MODE_Ieee802154_250Kbit (0xFUL)


/* RADIO_STATE: Current radio state */
  #define RADIO_STATE_ResetValue (0x00000000UL)

/* STATE @Bits 0..3 : Current radio state */
  #define RADIO_STATE_STATE_Pos (0UL)
  #define RADIO_STATE_STATE_Msk (0xFUL << RADIO_STATE_STATE_Pos)
  #define RADIO_STATE_STATE_Min (0x0UL)
  #define RADIO_STATE_STATE_Max (0xCUL)
  #define RADIO_STATE_STATE_Disabled (0x0UL)
  #define RADIO_STATE_STATE_RxRu (0x1UL)
  #define RADIO_STATE_STATE_RxIdle (0x2UL)
  #define RADIO_STATE_STATE_Rx (0x3UL)
  #define RADIO_STATE_STATE_RxDisable (0x4UL)
  #define RADIO_STATE_STATE_TxRu (0x9UL)
  #define RADIO_STATE_STATE_TxIdle (0xAUL)
  #define RADIO_STATE_STATE_Tx (0xBUL)
  #define RADIO_STATE_STATE_TxDisable (0xCUL)


/* RADIO_EDCTRL: IEEE 802.15.4 energy detect control */
  #define RADIO_EDCTRL_ResetValue (0x20000000UL)

/* EDCNT @Bits 0..20 : IEEE 802.15.4 energy detect loop count */
  #define RADIO_EDCTRL_EDCNT_Pos (0UL)
  #define RADIO_EDCTRL_EDCNT_Msk (0x1FFFFFUL << RADIO_EDCTRL_EDCNT_Pos)

/* EDPERIOD @Bits 24..29 : IEEE 802.15.4 energy detect/cca period, 4us resolution */
  #define RADIO_EDCTRL_EDPERIOD_Pos (24UL)
  #define RADIO_EDCTRL_EDPERIOD_Msk (0x3FUL << RADIO_EDCTRL_EDPERIOD_Pos)


/* RADIO_EDSAMPLE: IEEE 802.15.4 energy detect level */
  #define RADIO_EDSAMPLE_ResetValue (0x00000000UL)

/* EDLVL @Bits 0..7 : IEEE 802.15.4 energy detect level */
  #define RADIO_EDSAMPLE_EDLVL_Pos (0UL)
  #define RADIO_EDSAMPLE_EDLVL_Msk (0xFFUL << RADIO_EDSAMPLE_EDLVL_Pos)
  #define RADIO_EDSAMPLE_EDLVL_Min (0x00UL)
  #define RADIO_EDSAMPLE_EDLVL_Max (0x7FUL)


/* RADIO_CCACTRL: IEEE 802.15.4 clear channel assessment control */
  #define RADIO_CCACTRL_ResetValue (0x052D0000UL)

/* CCAMODE @Bits 0..2 : CCA mode of operation */
  #define RADIO_CCACTRL_CCAMODE_Pos (0UL)
  #define RADIO_CCACTRL_CCAMODE_Msk (0x7UL << RADIO_CCACTRL_CCAMODE_Pos)
  #define RADIO_CCACTRL_CCAMODE_Min (0x0UL)
  #define RADIO_CCACTRL_CCAMODE_Max (0x4UL)
  #define RADIO_CCACTRL_CCAMODE_EdMode (0x0UL)
  #define RADIO_CCACTRL_CCAMODE_CarrierMode (0x1UL)
  #define RADIO_CCACTRL_CCAMODE_CarrierAndEdMode (0x2UL)
  #define RADIO_CCACTRL_CCAMODE_CarrierOrEdMode (0x3UL)
  #define RADIO_CCACTRL_CCAMODE_EdModeTest1 (0x4UL)  /*!< Energy above threshold test mode that will abort when first ED
                                                          measurement over threshold is seen. No averaging.*/

/* CCAEDTHRES @Bits 8..15 : CCA energy busy threshold. Used in all the CCA modes except CarrierMode. */
  #define RADIO_CCACTRL_CCAEDTHRES_Pos (8UL)
  #define RADIO_CCACTRL_CCAEDTHRES_Msk (0xFFUL << RADIO_CCACTRL_CCAEDTHRES_Pos)

/* CCACORRTHRES @Bits 16..23 : CCA correlator busy threshold. Only relevant to CarrierMode, CarrierAndEdMode, and
                               CarrierOrEdMode. */

  #define RADIO_CCACTRL_CCACORRTHRES_Pos (16UL)
  #define RADIO_CCACTRL_CCACORRTHRES_Msk (0xFFUL << RADIO_CCACTRL_CCACORRTHRES_Pos)

/* CCACORRCNT @Bits 24..31 : Limit for occurances above CCACORRTHRES. When not equal to zero the corrolator based signal detect
                             is enabled. */

