pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define RADIO_CCACTRL_CCACORRCNT_Pos (24UL)
  #define RADIO_CCACTRL_CCACORRCNT_Msk (0xFFUL << RADIO_CCACTRL_CCACORRCNT_Pos)


/* RADIO_DATAWHITEIV: Data whitening initial value */
  #define RADIO_DATAWHITEIV_ResetValue (0x00000040UL)

/* DATAWHITEIV @Bits 0..5 : (unspecified) */
  #define RADIO_DATAWHITEIV_DATAWHITEIV_Pos (0UL)
  #define RADIO_DATAWHITEIV_DATAWHITEIV_Msk (0x3FUL << RADIO_DATAWHITEIV_DATAWHITEIV_Pos)


/* RADIO_TIMING: Timing */
  #define RADIO_TIMING_ResetValue (0x00000000UL)

/* RU @Bit 0 : 0: Default ramp-up time, compatible with 180nm radio. 1: Fast ramp-up. */
  #define RADIO_TIMING_RU_Pos (0UL)
  #define RADIO_TIMING_RU_Msk (0x1UL << RADIO_TIMING_RU_Pos)


/* RADIO_FREQUENCY: Frequency */
  #define RADIO_FREQUENCY_ResetValue (0x00000002UL)

/* FREQUENCY @Bits 0..6 : Radio channel frequency. Frequency = 2400 + FREQUENCY (MHz). */
  #define RADIO_FREQUENCY_FREQUENCY_Pos (0UL)
  #define RADIO_FREQUENCY_FREQUENCY_Msk (0x7FUL << RADIO_FREQUENCY_FREQUENCY_Pos)

/* MAP @Bit 8 : Channel map selection. 0: Channel map between 2400 MHZ to 2500 MHz, Frequency = 2400 + FREQUENCY (MHz). 1:
                Channel map between 2360 MHZ to 2460 MHz, Frequency = 2360 + FREQUENCY (MHz). */

  #define RADIO_FREQUENCY_MAP_Pos (8UL)
  #define RADIO_FREQUENCY_MAP_Msk (0x1UL << RADIO_FREQUENCY_MAP_Pos)


/* RADIO_TXPOWER: Output power */
  #define RADIO_TXPOWER_ResetValue (0x00000000UL)

/* TXPOWER @Bits 0..7 : RADIO output power */
  #define RADIO_TXPOWER_TXPOWER_Pos (0UL)
  #define RADIO_TXPOWER_TXPOWER_Msk (0xFFUL << RADIO_TXPOWER_TXPOWER_Pos)
  #define RADIO_TXPOWER_TXPOWER_Min (0x0UL)
  #define RADIO_TXPOWER_TXPOWER_Max (0xFFUL)
  #define RADIO_TXPOWER_TXPOWER_Pos10dBm (0x0AUL)
  #define RADIO_TXPOWER_TXPOWER_Pos9dBm (0x09UL)
  #define RADIO_TXPOWER_TXPOWER_Pos8dBm (0x08UL)
  #define RADIO_TXPOWER_TXPOWER_Pos7dBm (0x07UL)
  #define RADIO_TXPOWER_TXPOWER_Pos6dBm (0x06UL)
  #define RADIO_TXPOWER_TXPOWER_Pos5dBm (0x05UL)
  #define RADIO_TXPOWER_TXPOWER_Pos4dBm (0x04UL)
  #define RADIO_TXPOWER_TXPOWER_Pos3dBm (0x03UL)
  #define RADIO_TXPOWER_TXPOWER_Pos2dBm (0x02UL)
  #define RADIO_TXPOWER_TXPOWER_Pos1dBm (0x01UL)
  #define RADIO_TXPOWER_TXPOWER_0dBm (0x00UL)
  #define RADIO_TXPOWER_TXPOWER_Neg1dBm (0xFFUL)
  #define RADIO_TXPOWER_TXPOWER_Neg2dBm (0xFEUL)
  #define RADIO_TXPOWER_TXPOWER_Neg4dBm (0xFCUL)
  #define RADIO_TXPOWER_TXPOWER_Neg8dBm (0xF8UL)
  #define RADIO_TXPOWER_TXPOWER_Neg12dBm (0xF4UL)
  #define RADIO_TXPOWER_TXPOWER_Neg16dBm (0xF0UL)
  #define RADIO_TXPOWER_TXPOWER_Neg20dBm (0xECUL)
  #define RADIO_TXPOWER_TXPOWER_Neg30dBm (0xE2UL)
  #define RADIO_TXPOWER_TXPOWER_Neg40dBm (0xD8UL)
  #define RADIO_TXPOWER_TXPOWER_Neg70dBm (0xBAUL)


/* RADIO_TIFS: Interframe spacing in us */
  #define RADIO_TIFS_ResetValue (0x00000000UL)

/* TIFS @Bits 0..9 : Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is
                     defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of
                     the first bit of the subsequent packet. */

  #define RADIO_TIFS_TIFS_Pos (0UL)
  #define RADIO_TIFS_TIFS_Msk (0x3FFUL << RADIO_TIFS_TIFS_Pos)


/* RADIO_RSSISAMPLE: RSSI sample */
  #define RADIO_RSSISAMPLE_ResetValue (0x0000007FUL)

/* RSSISAMPLE @Bits 0..6 : RSSI sample result. The value of this register is read as a positive value while the actual received
                           signal strength is a negative value. Actual received signal strength is therefore as follows:
                           received signal strength = -A dBm. */

  #define RADIO_RSSISAMPLE_RSSISAMPLE_Pos (0UL)
  #define RADIO_RSSISAMPLE_RSSISAMPLE_Msk (0x7FUL << RADIO_RSSISAMPLE_RSSISAMPLE_Pos)


/* RADIO_DFEMODE: Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD) */
  #define RADIO_DFEMODE_ResetValue (0x00000000UL)

/* DFEOPMODE @Bits 0..1 : Direction finding operation mode */
  #define RADIO_DFEMODE_DFEOPMODE_Pos (0UL)
  #define RADIO_DFEMODE_DFEOPMODE_Msk (0x3UL << RADIO_DFEMODE_DFEOPMODE_Pos)
  #define RADIO_DFEMODE_DFEOPMODE_Min (0x0UL)
  #define RADIO_DFEMODE_DFEOPMODE_Max (0x3UL)
  #define RADIO_DFEMODE_DFEOPMODE_Disabled (0x0UL)
  #define RADIO_DFEMODE_DFEOPMODE_AoD (0x2UL)
  #define RADIO_DFEMODE_DFEOPMODE_AoA (0x3UL)


/* RADIO_DFESTATUS: DFE status information */
  #define RADIO_DFESTATUS_ResetValue (0x00000000UL)

/* SWITCHINGSTATE @Bits 0..2 : Internal state of switching state machine */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Pos (0UL)
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Msk (0x7UL << RADIO_DFESTATUS_SWITCHINGSTATE_Pos) /*!< Bit mask of SWITCHINGSTATE
                                                                            field.*/
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Min (0x0UL)
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Max (0x5UL)
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Idle (0x0UL)
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Offset (0x1UL)
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Guard (0x2UL)
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Ref (0x3UL)
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Switching (0x4UL)
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Ending (0x5UL)

/* SAMPLINGSTATE @Bit 4 : Internal state of sampling state machine */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Pos (4UL)
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Msk (0x1UL << RADIO_DFESTATUS_SAMPLINGSTATE_Pos)
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Min (0x0UL)
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Max (0x1UL)
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Idle (0x0UL)
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Sampling (0x1UL)


/* RADIO_DFECTRL1: Various configuration for Direction finding */
  #define RADIO_DFECTRL1_ResetValue (0x00023282UL)

/* NUMBEROF8US @Bits 0..5 : Length of the AoA/AoD procedure in number of 8 us units */
  #define RADIO_DFECTRL1_NUMBEROF8US_Pos (0UL)
  #define RADIO_DFECTRL1_NUMBEROF8US_Msk (0x3FUL << RADIO_DFECTRL1_NUMBEROF8US_Pos)

/* DFEINEXTENSION @Bit 7 : Add CTE extension and do antenna switching/sampling in this extension */
  #define RADIO_DFECTRL1_DFEINEXTENSION_Pos (7UL)
  #define RADIO_DFECTRL1_DFEINEXTENSION_Msk (0x1UL << RADIO_DFECTRL1_DFEINEXTENSION_Pos)
  #define RADIO_DFECTRL1_DFEINEXTENSION_Min (0x0UL)
  #define RADIO_DFECTRL1_DFEINEXTENSION_Max (0x1UL)
  #define RADIO_DFECTRL1_DFEINEXTENSION_CRC (0x1UL)
  #define RADIO_DFECTRL1_DFEINEXTENSION_Payload (0x0UL)

/* TSWITCHSPACING @Bits 8..10 : Interval between every time the antenna is changed in the SWITCHING state */
  #define RADIO_DFECTRL1_TSWITCHSPACING_Pos (8UL)
  #define RADIO_DFECTRL1_TSWITCHSPACING_Msk (0x7UL << RADIO_DFECTRL1_TSWITCHSPACING_Pos)
  #define RADIO_DFECTRL1_TSWITCHSPACING_Min (0x1UL)
  #define RADIO_DFECTRL1_TSWITCHSPACING_Max (0x3UL)
  #define RADIO_DFECTRL1_TSWITCHSPACING_4us (0x1UL)
  #define RADIO_DFECTRL1_TSWITCHSPACING_2us (0x2UL)
  #define RADIO_DFECTRL1_TSWITCHSPACING_1us (0x3UL)

/* TSAMPLESPACINGREF @Bits 12..14 : Interval between samples in the REFERENCE period */
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_Pos (12UL)
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_Msk (0x7UL << RADIO_DFECTRL1_TSAMPLESPACINGREF_Pos) /*!< Bit mask of
                                                                            TSAMPLESPACINGREF field.*/
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_Min (0x1UL)
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_Max (0x6UL)
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_4us (0x1UL)
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_2us (0x2UL)
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_1us (0x3UL)
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_500ns (0x4UL)
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_250ns (0x5UL)
  #define RADIO_DFECTRL1_TSAMPLESPACINGREF_125ns (0x6UL)

/* SAMPLETYPE @Bit 15 : Whether to sample I/Q or magnitude/phase */
  #define RADIO_DFECTRL1_SAMPLETYPE_Pos (15UL)
  #define RADIO_DFECTRL1_SAMPLETYPE_Msk (0x1UL << RADIO_DFECTRL1_SAMPLETYPE_Pos)
  #define RADIO_DFECTRL1_SAMPLETYPE_Min (0x0UL)
  #define RADIO_DFECTRL1_SAMPLETYPE_Max (0x1UL)
  #define RADIO_DFECTRL1_SAMPLETYPE_IQ (0x0UL)
  #define RADIO_DFECTRL1_SAMPLETYPE_MagPhase (0x1UL)

/* TSAMPLESPACING @Bits 16..18 : Interval between samples in the SWITCHING period when CTEINLINECTRLEN is 0 */
  #define RADIO_DFECTRL1_TSAMPLESPACING_Pos (16UL)
  #define RADIO_DFECTRL1_TSAMPLESPACING_Msk (0x7UL << RADIO_DFECTRL1_TSAMPLESPACING_Pos)
  #define RADIO_DFECTRL1_TSAMPLESPACING_Min (0x1UL)
  #define RADIO_DFECTRL1_TSAMPLESPACING_Max (0x6UL)
  #define RADIO_DFECTRL1_TSAMPLESPACING_4us (0x1UL)
  #define RADIO_DFECTRL1_TSAMPLESPACING_2us (0x2UL)
  #define RADIO_DFECTRL1_TSAMPLESPACING_1us (0x3UL)
  #define RADIO_DFECTRL1_TSAMPLESPACING_500ns (0x4UL)
  #define RADIO_DFECTRL1_TSAMPLESPACING_250ns (0x5UL)
  #define RADIO_DFECTRL1_TSAMPLESPACING_125ns (0x6UL)

/* REPEATPATTERN @Bits 20..23 : Repeat every antenna pattern N times. */
  #define RADIO_DFECTRL1_REPEATPATTERN_Pos (20UL)
  #define RADIO_DFECTRL1_REPEATPATTERN_Msk (0xFUL << RADIO_DFECTRL1_REPEATPATTERN_Pos)
  #define RADIO_DFECTRL1_REPEATPATTERN_Min (0x0UL)
  #define RADIO_DFECTRL1_REPEATPATTERN_Max (0x0UL)
  #define RADIO_DFECTRL1_REPEATPATTERN_NoRepeat (0x0UL)

/* AGCBACKOFFGAIN @Bits 24..27 : Gain will be lowered by the specified number of gain steps at the start of CTE */
  #define RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos (24UL)
  #define RADIO_DFECTRL1_AGCBACKOFFGAIN_Msk (0xFUL << RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos)


/* RADIO_DFECTRL2: Start offset for Direction finding */
  #define RADIO_DFECTRL2_ResetValue (0x00000000UL)

/* TSWITCHOFFSET @Bits 0..12 : Signed value offset after the end of the CRC before starting switching in number of 16M cycles */
  #define RADIO_DFECTRL2_TSWITCHOFFSET_Pos (0UL)
  #define RADIO_DFECTRL2_TSWITCHOFFSET_Msk (0x1FFFUL << RADIO_DFECTRL2_TSWITCHOFFSET_Pos)

