pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENDIAN @Bit 24 : On-air endianness of packet, this applies to the S0, LENGTH, S1, and the PAYLOAD fields. */
  #define RADIO_PCNF1_ENDIAN_Pos (24UL)
  #define RADIO_PCNF1_ENDIAN_Msk (0x1UL << RADIO_PCNF1_ENDIAN_Pos)
  #define RADIO_PCNF1_ENDIAN_Min (0x0UL)
  #define RADIO_PCNF1_ENDIAN_Max (0x1UL)
  #define RADIO_PCNF1_ENDIAN_Little (0x0UL)
  #define RADIO_PCNF1_ENDIAN_Big (0x1UL)

/* WHITEEN @Bit 25 : Enable or disable packet whitening */
  #define RADIO_PCNF1_WHITEEN_Pos (25UL)
  #define RADIO_PCNF1_WHITEEN_Msk (0x1UL << RADIO_PCNF1_WHITEEN_Pos)
  #define RADIO_PCNF1_WHITEEN_Min (0x0UL)
  #define RADIO_PCNF1_WHITEEN_Max (0x1UL)
  #define RADIO_PCNF1_WHITEEN_Disabled (0x0UL)
  #define RADIO_PCNF1_WHITEEN_Enabled (0x1UL)


/* RADIO_BASE0: Base address 0 */
  #define RADIO_BASE0_ResetValue (0x00000000UL)

/* BASE0 @Bits 0..31 : Base address 0 */
  #define RADIO_BASE0_BASE0_Pos (0UL)
  #define RADIO_BASE0_BASE0_Msk (0xFFFFFFFFUL << RADIO_BASE0_BASE0_Pos)


/* RADIO_BASE1: Base address 1 */
  #define RADIO_BASE1_ResetValue (0x00000000UL)

/* BASE1 @Bits 0..31 : Base address 1 */
  #define RADIO_BASE1_BASE1_Pos (0UL)
  #define RADIO_BASE1_BASE1_Msk (0xFFFFFFFFUL << RADIO_BASE1_BASE1_Pos)


/* RADIO_PREFIX0: Prefixes bytes for logical addresses 0-3 */
  #define RADIO_PREFIX0_ResetValue (0x00000000UL)

/* AP0 @Bits 0..7 : Address prefix 0 */
  #define RADIO_PREFIX0_AP0_Pos (0UL)
  #define RADIO_PREFIX0_AP0_Msk (0xFFUL << RADIO_PREFIX0_AP0_Pos)

/* AP1 @Bits 8..15 : Address prefix 1 */
  #define RADIO_PREFIX0_AP1_Pos (8UL)
  #define RADIO_PREFIX0_AP1_Msk (0xFFUL << RADIO_PREFIX0_AP1_Pos)

/* AP2 @Bits 16..23 : Address prefix 2 */
  #define RADIO_PREFIX0_AP2_Pos (16UL)
  #define RADIO_PREFIX0_AP2_Msk (0xFFUL << RADIO_PREFIX0_AP2_Pos)

/* AP3 @Bits 24..31 : Address prefix 3 */
  #define RADIO_PREFIX0_AP3_Pos (24UL)
  #define RADIO_PREFIX0_AP3_Msk (0xFFUL << RADIO_PREFIX0_AP3_Pos)


/* RADIO_PREFIX1: Prefixes bytes for logical addresses 4-7 */
  #define RADIO_PREFIX1_ResetValue (0x00000000UL)

/* AP4 @Bits 0..7 : Address prefix 4 */
  #define RADIO_PREFIX1_AP4_Pos (0UL)
  #define RADIO_PREFIX1_AP4_Msk (0xFFUL << RADIO_PREFIX1_AP4_Pos)

/* AP5 @Bits 8..15 : Address prefix 5 */
  #define RADIO_PREFIX1_AP5_Pos (8UL)
  #define RADIO_PREFIX1_AP5_Msk (0xFFUL << RADIO_PREFIX1_AP5_Pos)

/* AP6 @Bits 16..23 : Address prefix 6 */
  #define RADIO_PREFIX1_AP6_Pos (16UL)
  #define RADIO_PREFIX1_AP6_Msk (0xFFUL << RADIO_PREFIX1_AP6_Pos)

/* AP7 @Bits 24..31 : Address prefix 7 */
  #define RADIO_PREFIX1_AP7_Pos (24UL)
  #define RADIO_PREFIX1_AP7_Msk (0xFFUL << RADIO_PREFIX1_AP7_Pos)


/* RADIO_TXADDRESS: Transmit address select */
  #define RADIO_TXADDRESS_ResetValue (0x00000000UL)

/* TXADDRESS @Bits 0..2 : Transmit address select */
  #define RADIO_TXADDRESS_TXADDRESS_Pos (0UL)
  #define RADIO_TXADDRESS_TXADDRESS_Msk (0x7UL << RADIO_TXADDRESS_TXADDRESS_Pos)


/* RADIO_RXADDRESSES: Receive address select */
  #define RADIO_RXADDRESSES_ResetValue (0x00000000UL)

/* ADDR0 @Bit 0 : Enable or disable reception on logical address 0 */
  #define RADIO_RXADDRESSES_ADDR0_Pos (0UL)
  #define RADIO_RXADDRESSES_ADDR0_Msk (0x1UL << RADIO_RXADDRESSES_ADDR0_Pos)
  #define RADIO_RXADDRESSES_ADDR0_Min (0x0UL)
  #define RADIO_RXADDRESSES_ADDR0_Max (0x1UL)
  #define RADIO_RXADDRESSES_ADDR0_Disabled (0x0UL)
  #define RADIO_RXADDRESSES_ADDR0_Enabled (0x1UL)

/* ADDR1 @Bit 1 : Enable or disable reception on logical address 1 */
  #define RADIO_RXADDRESSES_ADDR1_Pos (1UL)
  #define RADIO_RXADDRESSES_ADDR1_Msk (0x1UL << RADIO_RXADDRESSES_ADDR1_Pos)
  #define RADIO_RXADDRESSES_ADDR1_Min (0x0UL)
  #define RADIO_RXADDRESSES_ADDR1_Max (0x1UL)
  #define RADIO_RXADDRESSES_ADDR1_Disabled (0x0UL)
  #define RADIO_RXADDRESSES_ADDR1_Enabled (0x1UL)

/* ADDR2 @Bit 2 : Enable or disable reception on logical address 2 */
  #define RADIO_RXADDRESSES_ADDR2_Pos (2UL)
  #define RADIO_RXADDRESSES_ADDR2_Msk (0x1UL << RADIO_RXADDRESSES_ADDR2_Pos)
  #define RADIO_RXADDRESSES_ADDR2_Min (0x0UL)
  #define RADIO_RXADDRESSES_ADDR2_Max (0x1UL)
  #define RADIO_RXADDRESSES_ADDR2_Disabled (0x0UL)
  #define RADIO_RXADDRESSES_ADDR2_Enabled (0x1UL)

/* ADDR3 @Bit 3 : Enable or disable reception on logical address 3 */
  #define RADIO_RXADDRESSES_ADDR3_Pos (3UL)
  #define RADIO_RXADDRESSES_ADDR3_Msk (0x1UL << RADIO_RXADDRESSES_ADDR3_Pos)
  #define RADIO_RXADDRESSES_ADDR3_Min (0x0UL)
  #define RADIO_RXADDRESSES_ADDR3_Max (0x1UL)
  #define RADIO_RXADDRESSES_ADDR3_Disabled (0x0UL)
  #define RADIO_RXADDRESSES_ADDR3_Enabled (0x1UL)

/* ADDR4 @Bit 4 : Enable or disable reception on logical address 4 */
  #define RADIO_RXADDRESSES_ADDR4_Pos (4UL)
  #define RADIO_RXADDRESSES_ADDR4_Msk (0x1UL << RADIO_RXADDRESSES_ADDR4_Pos)
  #define RADIO_RXADDRESSES_ADDR4_Min (0x0UL)
  #define RADIO_RXADDRESSES_ADDR4_Max (0x1UL)
  #define RADIO_RXADDRESSES_ADDR4_Disabled (0x0UL)
  #define RADIO_RXADDRESSES_ADDR4_Enabled (0x1UL)

/* ADDR5 @Bit 5 : Enable or disable reception on logical address 5 */
  #define RADIO_RXADDRESSES_ADDR5_Pos (5UL)
  #define RADIO_RXADDRESSES_ADDR5_Msk (0x1UL << RADIO_RXADDRESSES_ADDR5_Pos)
  #define RADIO_RXADDRESSES_ADDR5_Min (0x0UL)
  #define RADIO_RXADDRESSES_ADDR5_Max (0x1UL)
  #define RADIO_RXADDRESSES_ADDR5_Disabled (0x0UL)
  #define RADIO_RXADDRESSES_ADDR5_Enabled (0x1UL)

/* ADDR6 @Bit 6 : Enable or disable reception on logical address 6 */
  #define RADIO_RXADDRESSES_ADDR6_Pos (6UL)
  #define RADIO_RXADDRESSES_ADDR6_Msk (0x1UL << RADIO_RXADDRESSES_ADDR6_Pos)
  #define RADIO_RXADDRESSES_ADDR6_Min (0x0UL)
  #define RADIO_RXADDRESSES_ADDR6_Max (0x1UL)
  #define RADIO_RXADDRESSES_ADDR6_Disabled (0x0UL)
  #define RADIO_RXADDRESSES_ADDR6_Enabled (0x1UL)

/* ADDR7 @Bit 7 : Enable or disable reception on logical address 7 */
  #define RADIO_RXADDRESSES_ADDR7_Pos (7UL)
  #define RADIO_RXADDRESSES_ADDR7_Msk (0x1UL << RADIO_RXADDRESSES_ADDR7_Pos)
  #define RADIO_RXADDRESSES_ADDR7_Min (0x0UL)
  #define RADIO_RXADDRESSES_ADDR7_Max (0x1UL)
  #define RADIO_RXADDRESSES_ADDR7_Disabled (0x0UL)
  #define RADIO_RXADDRESSES_ADDR7_Enabled (0x1UL)


/* RADIO_CRCCNF: CRC configuration */
  #define RADIO_CRCCNF_ResetValue (0x00000000UL)

/* LEN @Bits 0..1 : CRC length in number of bytes. */
  #define RADIO_CRCCNF_LEN_Pos (0UL)
  #define RADIO_CRCCNF_LEN_Msk (0x3UL << RADIO_CRCCNF_LEN_Pos)
  #define RADIO_CRCCNF_LEN_Min (0x1UL)
  #define RADIO_CRCCNF_LEN_Max (0x3UL)
  #define RADIO_CRCCNF_LEN_Disabled (0x0UL)
  #define RADIO_CRCCNF_LEN_One (0x1UL)
  #define RADIO_CRCCNF_LEN_Two (0x2UL)
  #define RADIO_CRCCNF_LEN_Three (0x3UL)

/* SKIPADDR @Bits 8..9 : Include or exclude packet address field out of CRC calculation. */
  #define RADIO_CRCCNF_SKIPADDR_Pos (8UL)
  #define RADIO_CRCCNF_SKIPADDR_Msk (0x3UL << RADIO_CRCCNF_SKIPADDR_Pos)
  #define RADIO_CRCCNF_SKIPADDR_Min (0x0UL)
  #define RADIO_CRCCNF_SKIPADDR_Max (0x2UL)
  #define RADIO_CRCCNF_SKIPADDR_Include (0x0UL)
  #define RADIO_CRCCNF_SKIPADDR_Skip (0x1UL)         /*!< CRC calculation does not include address field. The CRC calculation
                                                          will start at the first byte after the address.*/
  #define RADIO_CRCCNF_SKIPADDR_Ieee802154 (0x2UL)   /*!< CRC calculation as per 802.15.4 standard. Starting at first byte after
                                                          length field.*/


/* RADIO_CRCPOLY: CRC polynomial */
  #define RADIO_CRCPOLY_ResetValue (0x00000000UL)

/* CRCPOLY @Bits 0..23 : CRC polynomial */
  #define RADIO_CRCPOLY_CRCPOLY_Pos (0UL)
  #define RADIO_CRCPOLY_CRCPOLY_Msk (0xFFFFFFUL << RADIO_CRCPOLY_CRCPOLY_Pos)


/* RADIO_CRCINIT: CRC initial value */
  #define RADIO_CRCINIT_ResetValue (0x00000000UL)

/* CRCINIT @Bits 0..23 : CRC initial value */
  #define RADIO_CRCINIT_CRCINIT_Pos (0UL)
  #define RADIO_CRCINIT_CRCINIT_Msk (0xFFFFFFUL << RADIO_CRCINIT_CRCINIT_Pos)


/* RADIO_DAB: Device address base segment n */
  #define RADIO_DAB_MaxCount (8UL)
  #define RADIO_DAB_MaxIndex (7UL)
  #define RADIO_DAB_MinIndex (0UL)
  #define RADIO_DAB_ResetValue (0x00000000UL)

/* DAB @Bits 0..31 : Device address base segment n */
  #define RADIO_DAB_DAB_Pos (0UL)
  #define RADIO_DAB_DAB_Msk (0xFFFFFFFFUL << RADIO_DAB_DAB_Pos)


