pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RADIO_DAP: Device address prefix n */
  #define RADIO_DAP_MaxCount (8UL)
  #define RADIO_DAP_MaxIndex (7UL)
  #define RADIO_DAP_MinIndex (0UL)
  #define RADIO_DAP_ResetValue (0x00000000UL)

/* DAP @Bits 0..15 : Device address prefix n */
  #define RADIO_DAP_DAP_Pos (0UL)
  #define RADIO_DAP_DAP_Msk (0xFFFFUL << RADIO_DAP_DAP_Pos)


/* RADIO_DACNF: Device address match configuration */
  #define RADIO_DACNF_ResetValue (0x00000000UL)

/* ENA0 @Bit 0 : Enable or disable device address matching using device address 0 */
  #define RADIO_DACNF_ENA0_Pos (0UL)
  #define RADIO_DACNF_ENA0_Msk (0x1UL << RADIO_DACNF_ENA0_Pos)
  #define RADIO_DACNF_ENA0_Min (0x0UL)
  #define RADIO_DACNF_ENA0_Max (0x1UL)
  #define RADIO_DACNF_ENA0_Disabled (0x0UL)
  #define RADIO_DACNF_ENA0_Enabled (0x1UL)

/* ENA1 @Bit 1 : Enable or disable device address matching using device address 1 */
  #define RADIO_DACNF_ENA1_Pos (1UL)
  #define RADIO_DACNF_ENA1_Msk (0x1UL << RADIO_DACNF_ENA1_Pos)
  #define RADIO_DACNF_ENA1_Min (0x0UL)
  #define RADIO_DACNF_ENA1_Max (0x1UL)
  #define RADIO_DACNF_ENA1_Disabled (0x0UL)
  #define RADIO_DACNF_ENA1_Enabled (0x1UL)

/* ENA2 @Bit 2 : Enable or disable device address matching using device address 2 */
  #define RADIO_DACNF_ENA2_Pos (2UL)
  #define RADIO_DACNF_ENA2_Msk (0x1UL << RADIO_DACNF_ENA2_Pos)
  #define RADIO_DACNF_ENA2_Min (0x0UL)
  #define RADIO_DACNF_ENA2_Max (0x1UL)
  #define RADIO_DACNF_ENA2_Disabled (0x0UL)
  #define RADIO_DACNF_ENA2_Enabled (0x1UL)

/* ENA3 @Bit 3 : Enable or disable device address matching using device address 3 */
  #define RADIO_DACNF_ENA3_Pos (3UL)
  #define RADIO_DACNF_ENA3_Msk (0x1UL << RADIO_DACNF_ENA3_Pos)
  #define RADIO_DACNF_ENA3_Min (0x0UL)
  #define RADIO_DACNF_ENA3_Max (0x1UL)
  #define RADIO_DACNF_ENA3_Disabled (0x0UL)
  #define RADIO_DACNF_ENA3_Enabled (0x1UL)

/* ENA4 @Bit 4 : Enable or disable device address matching using device address 4 */
  #define RADIO_DACNF_ENA4_Pos (4UL)
  #define RADIO_DACNF_ENA4_Msk (0x1UL << RADIO_DACNF_ENA4_Pos)
  #define RADIO_DACNF_ENA4_Min (0x0UL)
  #define RADIO_DACNF_ENA4_Max (0x1UL)
  #define RADIO_DACNF_ENA4_Disabled (0x0UL)
  #define RADIO_DACNF_ENA4_Enabled (0x1UL)

/* ENA5 @Bit 5 : Enable or disable device address matching using device address 5 */
  #define RADIO_DACNF_ENA5_Pos (5UL)
  #define RADIO_DACNF_ENA5_Msk (0x1UL << RADIO_DACNF_ENA5_Pos)
  #define RADIO_DACNF_ENA5_Min (0x0UL)
  #define RADIO_DACNF_ENA5_Max (0x1UL)
  #define RADIO_DACNF_ENA5_Disabled (0x0UL)
  #define RADIO_DACNF_ENA5_Enabled (0x1UL)

/* ENA6 @Bit 6 : Enable or disable device address matching using device address 6 */
  #define RADIO_DACNF_ENA6_Pos (6UL)
  #define RADIO_DACNF_ENA6_Msk (0x1UL << RADIO_DACNF_ENA6_Pos)
  #define RADIO_DACNF_ENA6_Min (0x0UL)
  #define RADIO_DACNF_ENA6_Max (0x1UL)
  #define RADIO_DACNF_ENA6_Disabled (0x0UL)
  #define RADIO_DACNF_ENA6_Enabled (0x1UL)

/* ENA7 @Bit 7 : Enable or disable device address matching using device address 7 */
  #define RADIO_DACNF_ENA7_Pos (7UL)
  #define RADIO_DACNF_ENA7_Msk (0x1UL << RADIO_DACNF_ENA7_Pos)
  #define RADIO_DACNF_ENA7_Min (0x0UL)
  #define RADIO_DACNF_ENA7_Max (0x1UL)
  #define RADIO_DACNF_ENA7_Disabled (0x0UL)
  #define RADIO_DACNF_ENA7_Enabled (0x1UL)

/* TXADD0 @Bit 8 : TxAdd for device address 0 */
  #define RADIO_DACNF_TXADD0_Pos (8UL)
  #define RADIO_DACNF_TXADD0_Msk (0x1UL << RADIO_DACNF_TXADD0_Pos)

/* TXADD1 @Bit 9 : TxAdd for device address 1 */
  #define RADIO_DACNF_TXADD1_Pos (9UL)
  #define RADIO_DACNF_TXADD1_Msk (0x1UL << RADIO_DACNF_TXADD1_Pos)

/* TXADD2 @Bit 10 : TxAdd for device address 2 */
  #define RADIO_DACNF_TXADD2_Pos (10UL)
  #define RADIO_DACNF_TXADD2_Msk (0x1UL << RADIO_DACNF_TXADD2_Pos)

/* TXADD3 @Bit 11 : TxAdd for device address 3 */
  #define RADIO_DACNF_TXADD3_Pos (11UL)
  #define RADIO_DACNF_TXADD3_Msk (0x1UL << RADIO_DACNF_TXADD3_Pos)

/* TXADD4 @Bit 12 : TxAdd for device address 4 */
  #define RADIO_DACNF_TXADD4_Pos (12UL)
  #define RADIO_DACNF_TXADD4_Msk (0x1UL << RADIO_DACNF_TXADD4_Pos)

/* TXADD5 @Bit 13 : TxAdd for device address 5 */
  #define RADIO_DACNF_TXADD5_Pos (13UL)
  #define RADIO_DACNF_TXADD5_Msk (0x1UL << RADIO_DACNF_TXADD5_Pos)

/* TXADD6 @Bit 14 : TxAdd for device address 6 */
  #define RADIO_DACNF_TXADD6_Pos (14UL)
  #define RADIO_DACNF_TXADD6_Msk (0x1UL << RADIO_DACNF_TXADD6_Pos)

/* TXADD7 @Bit 15 : TxAdd for device address 7 */
  #define RADIO_DACNF_TXADD7_Pos (15UL)
  #define RADIO_DACNF_TXADD7_Msk (0x1UL << RADIO_DACNF_TXADD7_Pos)


/* RADIO_BCC: Bit counter compare */
  #define RADIO_BCC_ResetValue (0x00000000UL)

/* BCC @Bits 0..31 : Bit counter compare */
  #define RADIO_BCC_BCC_Pos (0UL)
  #define RADIO_BCC_BCC_Msk (0xFFFFFFFFUL << RADIO_BCC_BCC_Pos)


/* RADIO_CTESTATUS: CTEInfo parsed from received packet */
  #define RADIO_CTESTATUS_ResetValue (0x00000000UL)

/* CTETIME @Bits 0..4 : CTETime parsed from packet */
  #define RADIO_CTESTATUS_CTETIME_Pos (0UL)
  #define RADIO_CTESTATUS_CTETIME_Msk (0x1FUL << RADIO_CTESTATUS_CTETIME_Pos)

/* RFU @Bit 5 : RFU parsed from packet */
  #define RADIO_CTESTATUS_RFU_Pos (5UL)
  #define RADIO_CTESTATUS_RFU_Msk (0x1UL << RADIO_CTESTATUS_RFU_Pos)

/* CTETYPE @Bits 6..7 : CTEType parsed from packet */
  #define RADIO_CTESTATUS_CTETYPE_Pos (6UL)
  #define RADIO_CTESTATUS_CTETYPE_Msk (0x3UL << RADIO_CTESTATUS_CTETYPE_Pos)


/* RADIO_MHRMATCHCONF: Search pattern configuration */
  #define RADIO_MHRMATCHCONF_ResetValue (0x00000000UL)

/* MHRMATCHCONF @Bits 0..31 : Search pattern configuration */
  #define RADIO_MHRMATCHCONF_MHRMATCHCONF_Pos (0UL)
  #define RADIO_MHRMATCHCONF_MHRMATCHCONF_Msk (0xFFFFFFFFUL << RADIO_MHRMATCHCONF_MHRMATCHCONF_Pos) /*!< Bit mask of
                                                                            MHRMATCHCONF field.*/


/* RADIO_MHRMATCHMASK: Pattern mask */
  #define RADIO_MHRMATCHMASK_ResetValue (0x00000000UL)

/* MHRMATCHMASK @Bits 0..31 : Pattern mask */
  #define RADIO_MHRMATCHMASK_MHRMATCHMASK_Pos (0UL)
  #define RADIO_MHRMATCHMASK_MHRMATCHMASK_Msk (0xFFFFFFFFUL << RADIO_MHRMATCHMASK_MHRMATCHMASK_Pos) /*!< Bit mask of
                                                                            MHRMATCHMASK field.*/


/* RADIO_SFD: IEEE 802.15.4 start of frame delimiter */
  #define RADIO_SFD_ResetValue (0x000000A7UL)

/* SFD @Bits 0..7 : IEEE 802.15.4 start of frame delimiter */
  #define RADIO_SFD_SFD_Pos (0UL)
  #define RADIO_SFD_SFD_Msk (0xFFUL << RADIO_SFD_SFD_Pos)


/* RADIO_CTEINLINECONF: Configuration for CTE inline mode */
  #define RADIO_CTEINLINECONF_ResetValue (0x00002800UL)

/* CTEINLINECTRLEN @Bit 0 : Enable parsing of CTEInfo from received packet in BLE modes */
  #define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Pos (0UL)
  #define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Msk (0x1UL << RADIO_CTEINLINECONF_CTEINLINECTRLEN_Pos) /*!< Bit mask of
                                                                            CTEINLINECTRLEN field.*/
  #define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Min (0x0UL)
  #define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Max (0x1UL)
  #define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Enabled (0x1UL)
  #define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Disabled (0x0UL)

/* CTEINFOINS1 @Bit 3 : CTEInfo is S1 byte or not */
  #define RADIO_CTEINLINECONF_CTEINFOINS1_Pos (3UL)
  #define RADIO_CTEINLINECONF_CTEINFOINS1_Msk (0x1UL << RADIO_CTEINLINECONF_CTEINFOINS1_Pos) /*!< Bit mask of CTEINFOINS1
                                                                            field.*/
  #define RADIO_CTEINLINECONF_CTEINFOINS1_Min (0x0UL)
  #define RADIO_CTEINLINECONF_CTEINFOINS1_Max (0x1UL)
  #define RADIO_CTEINLINECONF_CTEINFOINS1_InS1 (0x1UL)
  #define RADIO_CTEINLINECONF_CTEINFOINS1_NotInS1 (0x0UL)

/* CTEERRORHANDLING @Bit 4 : Sampling/switching if CRC is not OK */
  #define RADIO_CTEINLINECONF_CTEERRORHANDLING_Pos (4UL)
  #define RADIO_CTEINLINECONF_CTEERRORHANDLING_Msk (0x1UL << RADIO_CTEINLINECONF_CTEERRORHANDLING_Pos) /*!< Bit mask of
                                                                            CTEERRORHANDLING field.*/
  #define RADIO_CTEINLINECONF_CTEERRORHANDLING_Min (0x0UL)
  #define RADIO_CTEINLINECONF_CTEERRORHANDLING_Max (0x1UL)
  #define RADIO_CTEINLINECONF_CTEERRORHANDLING_Yes (0x1UL)
  #define RADIO_CTEINLINECONF_CTEERRORHANDLING_No (0x0UL)

/* CTETIMEVALIDRANGE @Bits 6..7 : Max range of CTETime */
  #define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Pos (6UL)
  #define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Msk (0x3UL << RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Pos) /*!< Bit mask of
                                                                            CTETIMEVALIDRANGE field.*/
  #define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Min (0x0UL)
  #define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Max (0x2UL)
  #define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_20 (0x0UL) /*!< 20 in 8us unit (default) Set to 20 if parsed CTETime is larger
                                                                han 20*/
  #define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_31 (0x1UL)
  #define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_63 (0x2UL)

/* CTEINLINERXMODE1US @Bits 10..12 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Pos (10UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Msk (0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Pos) /*!< Bit mask of
                                                                            CTEINLINERXMODE1US field.*/
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Min (0x1UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Max (0x6UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_4us (0x1UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_2us (0x2UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_1us (0x3UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_500ns (0x4UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_250ns (0x5UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_125ns (0x6UL)

