pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CTEINLINERXMODE2US @Bits 13..15 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set */
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos (13UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Msk (0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos) /*!< Bit mask of
                                                                            CTEINLINERXMODE2US field.*/
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Min (0x1UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Max (0x6UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_4us (0x1UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_2us (0x2UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_1us (0x3UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_500ns (0x4UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_250ns (0x5UL)
  #define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_125ns (0x6UL)

/* S0CONF @Bits 16..23 : S0 bit pattern to match */
  #define RADIO_CTEINLINECONF_S0CONF_Pos (16UL)
  #define RADIO_CTEINLINECONF_S0CONF_Msk (0xFFUL << RADIO_CTEINLINECONF_S0CONF_Pos)

/* S0MASK @Bits 24..31 : S0 bit mask to set which bit to match */
  #define RADIO_CTEINLINECONF_S0MASK_Pos (24UL)
  #define RADIO_CTEINLINECONF_S0MASK_Msk (0xFFUL << RADIO_CTEINLINECONF_S0MASK_Pos)


/* RADIO_PACKETPTR: (unspecified) */
  #define RADIO_PACKETPTR_ResetValue (0x00000000UL)

/* OFFSET @Bits 0..15 : (unspecified) */
  #define RADIO_PACKETPTR_OFFSET_Pos (0UL)
  #define RADIO_PACKETPTR_OFFSET_Msk (0xFFFFUL << RADIO_PACKETPTR_OFFSET_Pos)

/* BASE @Bit 29 : (unspecified) */
  #define RADIO_PACKETPTR_BASE_Pos (29UL)
  #define RADIO_PACKETPTR_BASE_Msk (0x1UL << RADIO_PACKETPTR_BASE_Pos)


/* RADIO_POWER: Peripheral power control */
  #define RADIO_POWER_ResetValue (0x00000001UL)

/* POWER @Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the
                  peripheral off and then back on again. */

  #define RADIO_POWER_POWER_Pos (0UL)
  #define RADIO_POWER_POWER_Msk (0x1UL << RADIO_POWER_POWER_Pos)
  #define RADIO_POWER_POWER_Min (0x0UL)
  #define RADIO_POWER_POWER_Max (0x1UL)
  #define RADIO_POWER_POWER_Disabled (0x0UL)
  #define RADIO_POWER_POWER_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RAMC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct RAMC ======================================================= */
/**
  * @brief RAM Controller
  */
  typedef struct {
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_ERRORFIX;                  /*!< (@ 0x00000100) ECC detected fixable (one bit) error in read data from
                                                                         RAM.*/
    __IOM uint32_t EVENTS_ERRORNONFIX;               /*!< (@ 0x00000104) ECC detected non-fixable (multiple bits) error in read
                                                                         data from RAM.*/
    __IM uint32_t RESERVED1[254];
    __IOM uint32_t WAITSTATES;
    __IM uint32_t RESERVED2[63];
    __IOM uint32_t SECBASE;
    __IOM uint32_t SECENABLE;
  } NRF_RAMC_Type;

/* RAMC_EVENTS_ERRORFIX: ECC detected fixable (one bit) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORFIX_ResetValue (0x00000000UL)

/* EVENTS_ERRORFIX @Bit 0 : ECC detected fixable (one bit) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Pos (0UL)
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Msk (0x1UL << RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Pos) /*!< Bit mask of
                                                                            EVENTS_ERRORFIX field.*/
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Min (0x0UL)
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Max (0x1UL)
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_NotGenerated (0x0UL)
  #define RAMC_EVENTS_ERRORFIX_EVENTS_ERRORFIX_Generated (0x1UL)


/* RAMC_EVENTS_ERRORNONFIX: ECC detected non-fixable (multiple bits) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORNONFIX_ResetValue (0x00000000UL)

/* EVENTS_ERRORNONFIX @Bit 0 : ECC detected non-fixable (multiple bits) error in read data from RAM. */
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Pos (0UL)
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Msk (0x1UL << RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Pos) /*!< Bit mask
                                                                            of EVENTS_ERRORNONFIX field.*/
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Min (0x0UL)
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Max (0x1UL)
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_NotGenerated (0x0UL)
  #define RAMC_EVENTS_ERRORNONFIX_EVENTS_ERRORNONFIX_Generated (0x1UL)


/* RAMC_WAITSTATES: Waitstates for read operations. */
  #define RAMC_WAITSTATES_ResetValue (0x00000000UL)

/* WAITSTATES @Bit 0 : Number of waitstates for a read from the RAM. */
  #define RAMC_WAITSTATES_WAITSTATES_Pos (0UL)
  #define RAMC_WAITSTATES_WAITSTATES_Msk (0x1UL << RAMC_WAITSTATES_WAITSTATES_Pos)
  #define RAMC_WAITSTATES_WAITSTATES_Min (0x0UL)
  #define RAMC_WAITSTATES_WAITSTATES_Max (0x1UL)


/* RAMC_SECBASE: Base address for secure access area. */
  #define RAMC_SECBASE_ResetValue (0x00000000UL)

/* ADDR @Bits 0..31 : Base address */
  #define RAMC_SECBASE_ADDR_Pos (0UL)
  #define RAMC_SECBASE_ADDR_Msk (0xFFFFFFFFUL << RAMC_SECBASE_ADDR_Pos)


/* RAMC_SECENABLE: Enable secure access restrictions. */
  #define RAMC_SECENABLE_ResetValue (0x00000000UL)

