pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE @Bit 0 : Enable secure access restrictions */
  #define RAMC_SECENABLE_ENABLE_Pos (0UL)
  #define RAMC_SECENABLE_ENABLE_Msk (0x1UL << RAMC_SECENABLE_ENABLE_Pos)
  #define RAMC_SECENABLE_ENABLE_Min (0x0UL)
  #define RAMC_SECENABLE_ENABLE_Max (0x1UL)
  #define RAMC_SECENABLE_ENABLE_Disable (0x0UL)
  #define RAMC_SECENABLE_ENABLE_Enable (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         RESETINFO                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =============================================== Struct RESETINFO_RESETREAS ================================================ */
/**
  * @brief RESETREAS [RESETINFO_RESETREAS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  GLOBAL;
  __IOM uint32_t  LOCAL;
} NRF_RESETINFO_RESETREAS_Type;

/* RESETINFO_RESETREAS_GLOBAL: Global reset reason. */
  #define RESETINFO_RESETREAS_GLOBAL_ResetValue (0x00000000UL)

/* RESETPORONLY @Bit 0 : Reset from power on reset (reset reason POR or BOR). */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Pos (0UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Pos) /*!< Bit mask of
                                                                            RESETPORONLY field.*/
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPORONLY_Detected (0x1UL)

/* RESETPIN @Bit 1 : Reset from pin reset detected. */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Pos (1UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPIN_Pos) /*!< Bit mask of RESETPIN
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPIN_Detected (0x1UL)

/* DOG @Bit 2 : Reset from the SysCtrl watchdog timer detected. */
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Pos (2UL)
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_DOG_Pos)
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_DOG_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_DOG_Detected (0x1UL)

/* CTRLAP @Bit 3 : Reset from CTRL-AP detected. */
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Pos (3UL)
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_CTRLAP_Pos)
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_CTRLAP_Detected (0x1UL)

/* SECSREQ @Bit 4 : Reset due to secure domain system reset request. */
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Pos (4UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECSREQ_Pos) /*!< Bit mask of SECSREQ
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECSREQ_Detected (0x1UL)

/* SECWDT0 @Bit 5 : Reset due to the first instance of watchdog timer in secure domain detected. */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Pos (5UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECWDT0_Pos) /*!< Bit mask of SECWDT0
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT0_Detected (0x1UL)

/* SECWDT1 @Bit 6 : Reset due to the second instance of watchdog timer in secure domain detected. */
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Pos (6UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECWDT1_Pos) /*!< Bit mask of SECWDT1
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECWDT1_Detected (0x1UL)

/* SECLOCKUP @Bit 7 : Reset due to secure domain lockup. */
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Pos (7UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Pos) /*!< Bit mask of
                                                                            SECLOCKUP field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECLOCKUP_Detected (0x1UL)

/* SECTAMPER @Bit 8 : Reset due to secure domain tamper detected */
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Pos (8UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Pos) /*!< Bit mask of
                                                                            SECTAMPER field.*/
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_SECTAMPER_Detected (0x1UL)

/* RESETPOR @Bit 9 : Reset from power on reset (reset reason other than POR or BOR). */
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Pos (9UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_RESETPOR_Pos) /*!< Bit mask of RESETPOR
                                                                            field.*/
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_RESETPOR_Detected (0x1UL)

/* OFF @Bit 16 : Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO. */
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Pos (16UL)
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_OFF_Pos)
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_OFF_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_OFF_Detected (0x1UL)

