pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LPCOMP @Bit 17 : Reset due to wakeup from System OFF mode when wakeup is triggered by LPCOMP (Low Power Comparator). */
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Pos (17UL)
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_LPCOMP_Pos)
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_LPCOMP_Detected (0x1UL)

/* DIF @Bit 18 : Reset due to wakeup from System OFF mode when wakeup is triggered by entering the debug interface mode. */
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Pos (18UL)
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_DIF_Pos)
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_DIF_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_DIF_Detected (0x1UL)

/* GRTC @Bit 19 : Reset due to wakeup from System OFF mode when wakeup is triggered by GRTC interrupt. */
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Pos (19UL)
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_GRTC_Pos)
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_GRTC_Detected (0x1UL)

/* NFC @Bit 20 : Reset due to wakeup from System OFF mode when wakeup is triggered by NFC field detection in sense mode. */
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Pos (20UL)
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_NFC_Pos)
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_NFC_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_NFC_Detected (0x1UL)

/* VUSB @Bit 21 : Reset after wakeup from System OFF mode due to VBUS rising into valid range. */
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Pos (21UL)
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Msk (0x1UL << RESETINFO_RESETREAS_GLOBAL_VUSB_Pos)
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Min (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Max (0x1UL)
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_GLOBAL_VUSB_Detected (0x1UL)


/* RESETINFO_RESETREAS_LOCAL: Local reset reason. */
  #define RESETINFO_RESETREAS_LOCAL_ResetValue (0x00000000UL)

/* DOG @Bit 0 : Reset from the local watchdog timer detected */
  #define RESETINFO_RESETREAS_LOCAL_DOG_Pos (0UL)
  #define RESETINFO_RESETREAS_LOCAL_DOG_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_DOG_Pos)
  #define RESETINFO_RESETREAS_LOCAL_DOG_Min (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_DOG_Max (0x1UL)
  #define RESETINFO_RESETREAS_LOCAL_DOG_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_DOG_Detected (0x1UL)

/* DOGNS @Bit 1 : Reset from the local non-secure watchdog timer detected */
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Pos (1UL)
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_DOGNS_Pos)
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Min (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Max (0x1UL)
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_DOGNS_Detected (0x1UL)

/* SREQ @Bit 2 : Reset from the local soft reset request detected. */
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Pos (2UL)
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_SREQ_Pos)
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Min (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Max (0x1UL)
  #define RESETINFO_RESETREAS_LOCAL_SREQ_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_SREQ_Detected (0x1UL)

/* LOCKUP @Bit 3 : Reset from local CPU lockup detected */
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Pos (3UL)
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_LOCKUP_Pos)
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Min (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Max (0x1UL)
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_LOCKUP_Detected (0x1UL)

/* CROSSDOMAIN @Bit 4 : Reset due to cross domain reset source. */
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Pos (4UL)
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Pos) /*!< Bit mask of
                                                                            CROSSDOMAIN field.*/
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Min (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Max (0x1UL)
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_NotDetected (0x0UL)
  #define RESETINFO_RESETREAS_LOCAL_CROSSDOMAIN_Detected (0x1UL)

/* UNRETAINEDWAKE @Bit 5 : Reset due to wake from unretained state. */
  #define RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Pos (5UL)
  #define RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Msk (0x1UL << RESETINFO_RESETREAS_LOCAL_UNRETAINEDWAKE_Pos) /*!< Bit mask of
                                                                            UNRETAINEDWAKE field.*/



/* ================================================= Struct RESETINFO_ERROR ================================================== */
/**
  * @brief ERROR [RESETINFO_ERROR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  STATUS;
  __IOM uint32_t  ADDRESS;
} NRF_RESETINFO_ERROR_Type;

/* RESETINFO_ERROR_STATUS: Reset error status. */
  #define RESETINFO_ERROR_STATUS_ResetValue (0x00000000UL)

/* ERRORSTATUS @Bits 0..3 : Error status */
  #define RESETINFO_ERROR_STATUS_ERRORSTATUS_Pos (0UL)
  #define RESETINFO_ERROR_STATUS_ERRORSTATUS_Msk (0xFUL << RESETINFO_ERROR_STATUS_ERRORSTATUS_Pos) /*!< Bit mask of ERRORSTATUS
                                                                            field.*/


/* RESETINFO_ERROR_ADDRESS: Reset error address. */
  #define RESETINFO_ERROR_ADDRESS_ResetValue (0x00000000UL)

