pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ERRORADDRESS @Bits 0..31 : Error address */
  #define RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Pos (0UL)
  #define RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Msk (0xFFFFFFFFUL << RESETINFO_ERROR_ADDRESS_ERRORADDRESS_Pos) /*!< Bit mask of
                                                                            ERRORADDRESS field.*/


/* ==================================================== Struct RESETINFO ===================================================== */
/**
  * @brief RESETINFO
  */
  typedef struct {
    __IM uint32_t RESERVED[296];
    __IOM NRF_RESETINFO_RESETREAS_Type RESETREAS;
    __IOM NRF_RESETINFO_ERROR_Type ERROR;
    __IM uint32_t RESERVED1[4];
    __IOM uint32_t RESTOREVALID;
  } NRF_RESETINFO_Type;

/* RESETINFO_RESTOREVALID: Valid restore image is present in RAM. */
  #define RESETINFO_RESTOREVALID_ResetValue (0x00000000UL)

/* RESTOREVALID @Bit 0 : Valid restore image is present in RAM. */
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Pos (0UL)
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Msk (0x1UL << RESETINFO_RESTOREVALID_RESTOREVALID_Pos) /*!< Bit mask of
                                                                            RESTOREVALID field.*/
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Min (0x0UL)
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Max (0x1UL)
  #define RESETINFO_RESTOREVALID_RESTOREVALID_NotPreset (0x0UL)
  #define RESETINFO_RESTOREVALID_RESTOREVALID_Present (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct RTC ======================================================== */
/**
  * @brief Real-time counter
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_CLEAR;
    __OM uint32_t TASKS_TRIGOVRFLW;
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_CAPTURE[8];
    __IM uint32_t RESERVED1[8];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_CLEAR;
    __IOM uint32_t SUBSCRIBE_TRIGOVRFLW;
    __IM uint32_t RESERVED2[12];
    __IOM uint32_t SUBSCRIBE_CAPTURE[8];
    __IM uint32_t RESERVED3[8];
    __IOM uint32_t EVENTS_TICK;
    __IOM uint32_t EVENTS_OVRFLW;
    __IM uint32_t RESERVED4[14];
    __IOM uint32_t EVENTS_COMPARE[8];
    __IM uint32_t RESERVED5[8];
    __IOM uint32_t PUBLISH_TICK;
    __IOM uint32_t PUBLISH_OVRFLW;
    __IM uint32_t RESERVED6[14];
    __IOM uint32_t PUBLISH_COMPARE[8];
    __IM uint32_t RESERVED7[8];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED8[64];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED9[13];
    __IOM uint32_t EVTEN;
    __IOM uint32_t EVTENSET;
    __IOM uint32_t EVTENCLR;
    __IM uint32_t RESERVED10[110];
    __IM uint32_t COUNTER;
    __IOM uint32_t PRESCALER;                        /*!< (@ 0x00000508) 12-bit prescaler for counter frequency (32768 /
                                                                         (PRESCALER + 1)). Must be written when RTC is stopped.*/
    __IM uint32_t RESERVED11[13];
    __IOM uint32_t CC[8];
  } NRF_RTC_Type;

/* RTC_TASKS_START: Start RTC counter */
  #define RTC_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start RTC counter */
  #define RTC_TASKS_START_TASKS_START_Pos (0UL)
  #define RTC_TASKS_START_TASKS_START_Msk (0x1UL << RTC_TASKS_START_TASKS_START_Pos)
  #define RTC_TASKS_START_TASKS_START_Min (0x1UL)
  #define RTC_TASKS_START_TASKS_START_Max (0x1UL)
  #define RTC_TASKS_START_TASKS_START_Trigger (0x1UL)


/* RTC_TASKS_STOP: Stop RTC counter */
  #define RTC_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop RTC counter */
  #define RTC_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define RTC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << RTC_TASKS_STOP_TASKS_STOP_Pos)
  #define RTC_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define RTC_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define RTC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* RTC_TASKS_CLEAR: Clear RTC counter */
  #define RTC_TASKS_CLEAR_ResetValue (0x00000000UL)

/* TASKS_CLEAR @Bit 0 : Clear RTC counter */
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Pos (0UL)
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Msk (0x1UL << RTC_TASKS_CLEAR_TASKS_CLEAR_Pos)
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Min (0x1UL)
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Max (0x1UL)
  #define RTC_TASKS_CLEAR_TASKS_CLEAR_Trigger (0x1UL)


/* RTC_TASKS_TRIGOVRFLW: Set counter to 0xFFFFF0 */
  #define RTC_TASKS_TRIGOVRFLW_ResetValue (0x00000000UL)

/* TASKS_TRIGOVRFLW @Bit 0 : Set counter to 0xFFFFF0 */
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos (0UL)
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Msk (0x1UL << RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGOVRFLW field.*/
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Min (0x1UL)
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Max (0x1UL)
  #define RTC_TASKS_TRIGOVRFLW_TASKS_TRIGOVRFLW_Trigger (0x1UL)


/* RTC_TASKS_CAPTURE: Capture RTC counter to CC[n] register */
  #define RTC_TASKS_CAPTURE_MaxCount (8UL)
  #define RTC_TASKS_CAPTURE_MaxIndex (7UL)
  #define RTC_TASKS_CAPTURE_MinIndex (0UL)
  #define RTC_TASKS_CAPTURE_ResetValue (0x00000000UL)

/* TASKS_CAPTURE @Bit 0 : Capture RTC counter to CC[n] register */
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos (0UL)
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Msk (0x1UL << RTC_TASKS_CAPTURE_TASKS_CAPTURE_Pos) /*!< Bit mask of TASKS_CAPTURE
                                                                            field.*/
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Min (0x1UL)
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Max (0x1UL)
  #define RTC_TASKS_CAPTURE_TASKS_CAPTURE_Trigger (0x1UL)


/* RTC_SUBSCRIBE_START: Subscribe configuration for task START */
  #define RTC_SUBSCRIBE_START_ResetValue (0x00000000UL)

