pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define RTC_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define RTC_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_START_CHIDX_Pos)
  #define RTC_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define RTC_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_START_EN_Pos (31UL)
  #define RTC_SUBSCRIBE_START_EN_Msk (0x1UL << RTC_SUBSCRIBE_START_EN_Pos)
  #define RTC_SUBSCRIBE_START_EN_Min (0x0UL)
  #define RTC_SUBSCRIBE_START_EN_Max (0x1UL)
  #define RTC_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define RTC_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* RTC_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define RTC_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define RTC_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define RTC_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_STOP_CHIDX_Pos)
  #define RTC_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define RTC_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define RTC_SUBSCRIBE_STOP_EN_Msk (0x1UL << RTC_SUBSCRIBE_STOP_EN_Pos)
  #define RTC_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define RTC_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define RTC_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define RTC_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* RTC_SUBSCRIBE_CLEAR: Subscribe configuration for task CLEAR */
  #define RTC_SUBSCRIBE_CLEAR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CLEAR will subscribe to */
  #define RTC_SUBSCRIBE_CLEAR_CHIDX_Pos (0UL)
  #define RTC_SUBSCRIBE_CLEAR_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_CLEAR_CHIDX_Pos)
  #define RTC_SUBSCRIBE_CLEAR_CHIDX_Min (0x00UL)
  #define RTC_SUBSCRIBE_CLEAR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_CLEAR_EN_Pos (31UL)
  #define RTC_SUBSCRIBE_CLEAR_EN_Msk (0x1UL << RTC_SUBSCRIBE_CLEAR_EN_Pos)
  #define RTC_SUBSCRIBE_CLEAR_EN_Min (0x0UL)
  #define RTC_SUBSCRIBE_CLEAR_EN_Max (0x1UL)
  #define RTC_SUBSCRIBE_CLEAR_EN_Disabled (0x0UL)
  #define RTC_SUBSCRIBE_CLEAR_EN_Enabled (0x1UL)


/* RTC_SUBSCRIBE_TRIGOVRFLW: Subscribe configuration for task TRIGOVRFLW */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task TRIGOVRFLW will subscribe to */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Pos (0UL)
  #define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Pos)
  #define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Min (0x00UL)
  #define RTC_SUBSCRIBE_TRIGOVRFLW_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Pos (31UL)
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Msk (0x1UL << RTC_SUBSCRIBE_TRIGOVRFLW_EN_Pos)
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Min (0x0UL)
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Max (0x1UL)
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Disabled (0x0UL)
  #define RTC_SUBSCRIBE_TRIGOVRFLW_EN_Enabled (0x1UL)


/* RTC_SUBSCRIBE_CAPTURE: Subscribe configuration for task CAPTURE[n] */
  #define RTC_SUBSCRIBE_CAPTURE_MaxCount (8UL)
  #define RTC_SUBSCRIBE_CAPTURE_MaxIndex (7UL)
  #define RTC_SUBSCRIBE_CAPTURE_MinIndex (0UL)
  #define RTC_SUBSCRIBE_CAPTURE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CAPTURE[n] will subscribe to */
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Pos (0UL)
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Msk (0xFFUL << RTC_SUBSCRIBE_CAPTURE_CHIDX_Pos)
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Min (0x00UL)
  #define RTC_SUBSCRIBE_CAPTURE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RTC_SUBSCRIBE_CAPTURE_EN_Pos (31UL)
  #define RTC_SUBSCRIBE_CAPTURE_EN_Msk (0x1UL << RTC_SUBSCRIBE_CAPTURE_EN_Pos)
  #define RTC_SUBSCRIBE_CAPTURE_EN_Min (0x0UL)
  #define RTC_SUBSCRIBE_CAPTURE_EN_Max (0x1UL)
  #define RTC_SUBSCRIBE_CAPTURE_EN_Disabled (0x0UL)
  #define RTC_SUBSCRIBE_CAPTURE_EN_Enabled (0x1UL)


/* RTC_EVENTS_TICK: Event on counter increment */
  #define RTC_EVENTS_TICK_ResetValue (0x00000000UL)

/* EVENTS_TICK @Bit 0 : Event on counter increment */
  #define RTC_EVENTS_TICK_EVENTS_TICK_Pos (0UL)
  #define RTC_EVENTS_TICK_EVENTS_TICK_Msk (0x1UL << RTC_EVENTS_TICK_EVENTS_TICK_Pos)
  #define RTC_EVENTS_TICK_EVENTS_TICK_Min (0x0UL)
  #define RTC_EVENTS_TICK_EVENTS_TICK_Max (0x1UL)
  #define RTC_EVENTS_TICK_EVENTS_TICK_NotGenerated (0x0UL)
  #define RTC_EVENTS_TICK_EVENTS_TICK_Generated (0x1UL)


/* RTC_EVENTS_OVRFLW: Event on counter overflow */
  #define RTC_EVENTS_OVRFLW_ResetValue (0x00000000UL)

/* EVENTS_OVRFLW @Bit 0 : Event on counter overflow */
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos (0UL)
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Msk (0x1UL << RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos) /*!< Bit mask of EVENTS_OVRFLW
                                                                            field.*/
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Min (0x0UL)
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Max (0x1UL)
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_NotGenerated (0x0UL)
  #define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Generated (0x1UL)


/* RTC_EVENTS_COMPARE: Compare event on CC[n] match */
  #define RTC_EVENTS_COMPARE_MaxCount (8UL)
  #define RTC_EVENTS_COMPARE_MaxIndex (7UL)
  #define RTC_EVENTS_COMPARE_MinIndex (0UL)
  #define RTC_EVENTS_COMPARE_ResetValue (0x00000000UL)

/* EVENTS_COMPARE @Bit 0 : Compare event on CC[n] match */
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL)
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of EVENTS_COMPARE
                                                                            field.*/
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Min (0x0UL)
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Max (0x1UL)
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0x0UL)
  #define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Generated (0x1UL)


/* RTC_PUBLISH_TICK: Publish configuration for event TICK */
  #define RTC_PUBLISH_TICK_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event TICK will publish to */
  #define RTC_PUBLISH_TICK_CHIDX_Pos (0UL)
  #define RTC_PUBLISH_TICK_CHIDX_Msk (0xFFUL << RTC_PUBLISH_TICK_CHIDX_Pos)
  #define RTC_PUBLISH_TICK_CHIDX_Min (0x00UL)
  #define RTC_PUBLISH_TICK_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_TICK_EN_Pos (31UL)
  #define RTC_PUBLISH_TICK_EN_Msk (0x1UL << RTC_PUBLISH_TICK_EN_Pos)
  #define RTC_PUBLISH_TICK_EN_Min (0x0UL)
  #define RTC_PUBLISH_TICK_EN_Max (0x1UL)
  #define RTC_PUBLISH_TICK_EN_Disabled (0x0UL)
  #define RTC_PUBLISH_TICK_EN_Enabled (0x1UL)


/* RTC_PUBLISH_OVRFLW: Publish configuration for event OVRFLW */
  #define RTC_PUBLISH_OVRFLW_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event OVRFLW will publish to */
  #define RTC_PUBLISH_OVRFLW_CHIDX_Pos (0UL)
  #define RTC_PUBLISH_OVRFLW_CHIDX_Msk (0xFFUL << RTC_PUBLISH_OVRFLW_CHIDX_Pos)
  #define RTC_PUBLISH_OVRFLW_CHIDX_Min (0x00UL)
  #define RTC_PUBLISH_OVRFLW_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_OVRFLW_EN_Pos (31UL)
  #define RTC_PUBLISH_OVRFLW_EN_Msk (0x1UL << RTC_PUBLISH_OVRFLW_EN_Pos)
  #define RTC_PUBLISH_OVRFLW_EN_Min (0x0UL)
  #define RTC_PUBLISH_OVRFLW_EN_Max (0x1UL)
  #define RTC_PUBLISH_OVRFLW_EN_Disabled (0x0UL)
  #define RTC_PUBLISH_OVRFLW_EN_Enabled (0x1UL)


/* RTC_PUBLISH_COMPARE: Publish configuration for event COMPARE[n] */
  #define RTC_PUBLISH_COMPARE_MaxCount (8UL)
  #define RTC_PUBLISH_COMPARE_MaxIndex (7UL)
  #define RTC_PUBLISH_COMPARE_MinIndex (0UL)
  #define RTC_PUBLISH_COMPARE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event COMPARE[n] will publish to */
  #define RTC_PUBLISH_COMPARE_CHIDX_Pos (0UL)
  #define RTC_PUBLISH_COMPARE_CHIDX_Msk (0xFFUL << RTC_PUBLISH_COMPARE_CHIDX_Pos)
  #define RTC_PUBLISH_COMPARE_CHIDX_Min (0x00UL)
  #define RTC_PUBLISH_COMPARE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define RTC_PUBLISH_COMPARE_EN_Pos (31UL)
  #define RTC_PUBLISH_COMPARE_EN_Msk (0x1UL << RTC_PUBLISH_COMPARE_EN_Pos)
  #define RTC_PUBLISH_COMPARE_EN_Min (0x0UL)
  #define RTC_PUBLISH_COMPARE_EN_Max (0x1UL)
  #define RTC_PUBLISH_COMPARE_EN_Disabled (0x0UL)
  #define RTC_PUBLISH_COMPARE_EN_Enabled (0x1UL)


/* RTC_SHORTS: Shortcuts between local events and tasks */
  #define RTC_SHORTS_ResetValue (0x00000000UL)

/* COMPARE0_CLEAR @Bit 0 : Shortcut between event COMPARE[0] and task CLEAR */
  #define RTC_SHORTS_COMPARE0_CLEAR_Pos (0UL)
  #define RTC_SHORTS_COMPARE0_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE0_CLEAR_Pos)
  #define RTC_SHORTS_COMPARE0_CLEAR_Min (0x0UL)
  #define RTC_SHORTS_COMPARE0_CLEAR_Max (0x1UL)
  #define RTC_SHORTS_COMPARE0_CLEAR_Disabled (0x0UL)
  #define RTC_SHORTS_COMPARE0_CLEAR_Enabled (0x1UL)

/* COMPARE1_CLEAR @Bit 1 : Shortcut between event COMPARE[1] and task CLEAR */
  #define RTC_SHORTS_COMPARE1_CLEAR_Pos (1UL)
  #define RTC_SHORTS_COMPARE1_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE1_CLEAR_Pos)
  #define RTC_SHORTS_COMPARE1_CLEAR_Min (0x0UL)
  #define RTC_SHORTS_COMPARE1_CLEAR_Max (0x1UL)
  #define RTC_SHORTS_COMPARE1_CLEAR_Disabled (0x0UL)
  #define RTC_SHORTS_COMPARE1_CLEAR_Enabled (0x1UL)

/* COMPARE2_CLEAR @Bit 2 : Shortcut between event COMPARE[2] and task CLEAR */
  #define RTC_SHORTS_COMPARE2_CLEAR_Pos (2UL)
  #define RTC_SHORTS_COMPARE2_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE2_CLEAR_Pos)
  #define RTC_SHORTS_COMPARE2_CLEAR_Min (0x0UL)
  #define RTC_SHORTS_COMPARE2_CLEAR_Max (0x1UL)
  #define RTC_SHORTS_COMPARE2_CLEAR_Disabled (0x0UL)
  #define RTC_SHORTS_COMPARE2_CLEAR_Enabled (0x1UL)

/* COMPARE3_CLEAR @Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
  #define RTC_SHORTS_COMPARE3_CLEAR_Pos (3UL)
  #define RTC_SHORTS_COMPARE3_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE3_CLEAR_Pos)
  #define RTC_SHORTS_COMPARE3_CLEAR_Min (0x0UL)
  #define RTC_SHORTS_COMPARE3_CLEAR_Max (0x1UL)
  #define RTC_SHORTS_COMPARE3_CLEAR_Disabled (0x0UL)
  #define RTC_SHORTS_COMPARE3_CLEAR_Enabled (0x1UL)

/* COMPARE4_CLEAR @Bit 4 : Shortcut between event COMPARE[4] and task CLEAR */
  #define RTC_SHORTS_COMPARE4_CLEAR_Pos (4UL)
  #define RTC_SHORTS_COMPARE4_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE4_CLEAR_Pos)
  #define RTC_SHORTS_COMPARE4_CLEAR_Min (0x0UL)
  #define RTC_SHORTS_COMPARE4_CLEAR_Max (0x1UL)
  #define RTC_SHORTS_COMPARE4_CLEAR_Disabled (0x0UL)
  #define RTC_SHORTS_COMPARE4_CLEAR_Enabled (0x1UL)

/* COMPARE5_CLEAR @Bit 5 : Shortcut between event COMPARE[5] and task CLEAR */
  #define RTC_SHORTS_COMPARE5_CLEAR_Pos (5UL)
  #define RTC_SHORTS_COMPARE5_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE5_CLEAR_Pos)
  #define RTC_SHORTS_COMPARE5_CLEAR_Min (0x0UL)
  #define RTC_SHORTS_COMPARE5_CLEAR_Max (0x1UL)
  #define RTC_SHORTS_COMPARE5_CLEAR_Disabled (0x0UL)
  #define RTC_SHORTS_COMPARE5_CLEAR_Enabled (0x1UL)

/* COMPARE6_CLEAR @Bit 6 : Shortcut between event COMPARE[6] and task CLEAR */
  #define RTC_SHORTS_COMPARE6_CLEAR_Pos (6UL)
  #define RTC_SHORTS_COMPARE6_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE6_CLEAR_Pos)
  #define RTC_SHORTS_COMPARE6_CLEAR_Min (0x0UL)
  #define RTC_SHORTS_COMPARE6_CLEAR_Max (0x1UL)
  #define RTC_SHORTS_COMPARE6_CLEAR_Disabled (0x0UL)
  #define RTC_SHORTS_COMPARE6_CLEAR_Enabled (0x1UL)

/* COMPARE7_CLEAR @Bit 7 : Shortcut between event COMPARE[7] and task CLEAR */
  #define RTC_SHORTS_COMPARE7_CLEAR_Pos (7UL)
  #define RTC_SHORTS_COMPARE7_CLEAR_Msk (0x1UL << RTC_SHORTS_COMPARE7_CLEAR_Pos)
  #define RTC_SHORTS_COMPARE7_CLEAR_Min (0x0UL)
  #define RTC_SHORTS_COMPARE7_CLEAR_Max (0x1UL)
  #define RTC_SHORTS_COMPARE7_CLEAR_Disabled (0x0UL)
  #define RTC_SHORTS_COMPARE7_CLEAR_Enabled (0x1UL)


/* RTC_INTENSET: Enable interrupt */
  #define RTC_INTENSET_ResetValue (0x00000000UL)

/* TICK @Bit 0 : Write '1' to enable interrupt for event TICK */
  #define RTC_INTENSET_TICK_Pos (0UL)
  #define RTC_INTENSET_TICK_Msk (0x1UL << RTC_INTENSET_TICK_Pos)
  #define RTC_INTENSET_TICK_Min (0x0UL)
  #define RTC_INTENSET_TICK_Max (0x1UL)
  #define RTC_INTENSET_TICK_Set (0x1UL)
  #define RTC_INTENSET_TICK_Disabled (0x0UL)
  #define RTC_INTENSET_TICK_Enabled (0x1UL)

