pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* OVRFLW @Bit 1 : Write '1' to enable interrupt for event OVRFLW */
  #define RTC_INTENSET_OVRFLW_Pos (1UL)
  #define RTC_INTENSET_OVRFLW_Msk (0x1UL << RTC_INTENSET_OVRFLW_Pos)
  #define RTC_INTENSET_OVRFLW_Min (0x0UL)
  #define RTC_INTENSET_OVRFLW_Max (0x1UL)
  #define RTC_INTENSET_OVRFLW_Set (0x1UL)
  #define RTC_INTENSET_OVRFLW_Disabled (0x0UL)
  #define RTC_INTENSET_OVRFLW_Enabled (0x1UL)

/* COMPARE0 @Bit 16 : Write '1' to enable interrupt for event COMPARE[0] */
  #define RTC_INTENSET_COMPARE0_Pos (16UL)
  #define RTC_INTENSET_COMPARE0_Msk (0x1UL << RTC_INTENSET_COMPARE0_Pos)
  #define RTC_INTENSET_COMPARE0_Min (0x0UL)
  #define RTC_INTENSET_COMPARE0_Max (0x1UL)
  #define RTC_INTENSET_COMPARE0_Set (0x1UL)
  #define RTC_INTENSET_COMPARE0_Disabled (0x0UL)
  #define RTC_INTENSET_COMPARE0_Enabled (0x1UL)

/* COMPARE1 @Bit 17 : Write '1' to enable interrupt for event COMPARE[1] */
  #define RTC_INTENSET_COMPARE1_Pos (17UL)
  #define RTC_INTENSET_COMPARE1_Msk (0x1UL << RTC_INTENSET_COMPARE1_Pos)
  #define RTC_INTENSET_COMPARE1_Min (0x0UL)
  #define RTC_INTENSET_COMPARE1_Max (0x1UL)
  #define RTC_INTENSET_COMPARE1_Set (0x1UL)
  #define RTC_INTENSET_COMPARE1_Disabled (0x0UL)
  #define RTC_INTENSET_COMPARE1_Enabled (0x1UL)

/* COMPARE2 @Bit 18 : Write '1' to enable interrupt for event COMPARE[2] */
  #define RTC_INTENSET_COMPARE2_Pos (18UL)
  #define RTC_INTENSET_COMPARE2_Msk (0x1UL << RTC_INTENSET_COMPARE2_Pos)
  #define RTC_INTENSET_COMPARE2_Min (0x0UL)
  #define RTC_INTENSET_COMPARE2_Max (0x1UL)
  #define RTC_INTENSET_COMPARE2_Set (0x1UL)
  #define RTC_INTENSET_COMPARE2_Disabled (0x0UL)
  #define RTC_INTENSET_COMPARE2_Enabled (0x1UL)

/* COMPARE3 @Bit 19 : Write '1' to enable interrupt for event COMPARE[3] */
  #define RTC_INTENSET_COMPARE3_Pos (19UL)
  #define RTC_INTENSET_COMPARE3_Msk (0x1UL << RTC_INTENSET_COMPARE3_Pos)
  #define RTC_INTENSET_COMPARE3_Min (0x0UL)
  #define RTC_INTENSET_COMPARE3_Max (0x1UL)
  #define RTC_INTENSET_COMPARE3_Set (0x1UL)
  #define RTC_INTENSET_COMPARE3_Disabled (0x0UL)
  #define RTC_INTENSET_COMPARE3_Enabled (0x1UL)

/* COMPARE4 @Bit 20 : Write '1' to enable interrupt for event COMPARE[4] */
  #define RTC_INTENSET_COMPARE4_Pos (20UL)
  #define RTC_INTENSET_COMPARE4_Msk (0x1UL << RTC_INTENSET_COMPARE4_Pos)
  #define RTC_INTENSET_COMPARE4_Min (0x0UL)
  #define RTC_INTENSET_COMPARE4_Max (0x1UL)
  #define RTC_INTENSET_COMPARE4_Set (0x1UL)
  #define RTC_INTENSET_COMPARE4_Disabled (0x0UL)
  #define RTC_INTENSET_COMPARE4_Enabled (0x1UL)

/* COMPARE5 @Bit 21 : Write '1' to enable interrupt for event COMPARE[5] */
  #define RTC_INTENSET_COMPARE5_Pos (21UL)
  #define RTC_INTENSET_COMPARE5_Msk (0x1UL << RTC_INTENSET_COMPARE5_Pos)
  #define RTC_INTENSET_COMPARE5_Min (0x0UL)
  #define RTC_INTENSET_COMPARE5_Max (0x1UL)
  #define RTC_INTENSET_COMPARE5_Set (0x1UL)
  #define RTC_INTENSET_COMPARE5_Disabled (0x0UL)
  #define RTC_INTENSET_COMPARE5_Enabled (0x1UL)

/* COMPARE6 @Bit 22 : Write '1' to enable interrupt for event COMPARE[6] */
  #define RTC_INTENSET_COMPARE6_Pos (22UL)
  #define RTC_INTENSET_COMPARE6_Msk (0x1UL << RTC_INTENSET_COMPARE6_Pos)
  #define RTC_INTENSET_COMPARE6_Min (0x0UL)
  #define RTC_INTENSET_COMPARE6_Max (0x1UL)
  #define RTC_INTENSET_COMPARE6_Set (0x1UL)
  #define RTC_INTENSET_COMPARE6_Disabled (0x0UL)
  #define RTC_INTENSET_COMPARE6_Enabled (0x1UL)

/* COMPARE7 @Bit 23 : Write '1' to enable interrupt for event COMPARE[7] */
  #define RTC_INTENSET_COMPARE7_Pos (23UL)
  #define RTC_INTENSET_COMPARE7_Msk (0x1UL << RTC_INTENSET_COMPARE7_Pos)
  #define RTC_INTENSET_COMPARE7_Min (0x0UL)
  #define RTC_INTENSET_COMPARE7_Max (0x1UL)
  #define RTC_INTENSET_COMPARE7_Set (0x1UL)
  #define RTC_INTENSET_COMPARE7_Disabled (0x0UL)
  #define RTC_INTENSET_COMPARE7_Enabled (0x1UL)


/* RTC_INTENCLR: Disable interrupt */
  #define RTC_INTENCLR_ResetValue (0x00000000UL)

/* TICK @Bit 0 : Write '1' to disable interrupt for event TICK */
  #define RTC_INTENCLR_TICK_Pos (0UL)
  #define RTC_INTENCLR_TICK_Msk (0x1UL << RTC_INTENCLR_TICK_Pos)
  #define RTC_INTENCLR_TICK_Min (0x0UL)
  #define RTC_INTENCLR_TICK_Max (0x1UL)
  #define RTC_INTENCLR_TICK_Clear (0x1UL)
  #define RTC_INTENCLR_TICK_Disabled (0x0UL)
  #define RTC_INTENCLR_TICK_Enabled (0x1UL)

/* OVRFLW @Bit 1 : Write '1' to disable interrupt for event OVRFLW */
  #define RTC_INTENCLR_OVRFLW_Pos (1UL)
  #define RTC_INTENCLR_OVRFLW_Msk (0x1UL << RTC_INTENCLR_OVRFLW_Pos)
  #define RTC_INTENCLR_OVRFLW_Min (0x0UL)
  #define RTC_INTENCLR_OVRFLW_Max (0x1UL)
  #define RTC_INTENCLR_OVRFLW_Clear (0x1UL)
  #define RTC_INTENCLR_OVRFLW_Disabled (0x0UL)
  #define RTC_INTENCLR_OVRFLW_Enabled (0x1UL)

/* COMPARE0 @Bit 16 : Write '1' to disable interrupt for event COMPARE[0] */
  #define RTC_INTENCLR_COMPARE0_Pos (16UL)
  #define RTC_INTENCLR_COMPARE0_Msk (0x1UL << RTC_INTENCLR_COMPARE0_Pos)
  #define RTC_INTENCLR_COMPARE0_Min (0x0UL)
  #define RTC_INTENCLR_COMPARE0_Max (0x1UL)
  #define RTC_INTENCLR_COMPARE0_Clear (0x1UL)
  #define RTC_INTENCLR_COMPARE0_Disabled (0x0UL)
  #define RTC_INTENCLR_COMPARE0_Enabled (0x1UL)

/* COMPARE1 @Bit 17 : Write '1' to disable interrupt for event COMPARE[1] */
  #define RTC_INTENCLR_COMPARE1_Pos (17UL)
  #define RTC_INTENCLR_COMPARE1_Msk (0x1UL << RTC_INTENCLR_COMPARE1_Pos)
  #define RTC_INTENCLR_COMPARE1_Min (0x0UL)
  #define RTC_INTENCLR_COMPARE1_Max (0x1UL)
  #define RTC_INTENCLR_COMPARE1_Clear (0x1UL)
  #define RTC_INTENCLR_COMPARE1_Disabled (0x0UL)
  #define RTC_INTENCLR_COMPARE1_Enabled (0x1UL)

/* COMPARE2 @Bit 18 : Write '1' to disable interrupt for event COMPARE[2] */
  #define RTC_INTENCLR_COMPARE2_Pos (18UL)
  #define RTC_INTENCLR_COMPARE2_Msk (0x1UL << RTC_INTENCLR_COMPARE2_Pos)
  #define RTC_INTENCLR_COMPARE2_Min (0x0UL)
  #define RTC_INTENCLR_COMPARE2_Max (0x1UL)
  #define RTC_INTENCLR_COMPARE2_Clear (0x1UL)
  #define RTC_INTENCLR_COMPARE2_Disabled (0x0UL)
  #define RTC_INTENCLR_COMPARE2_Enabled (0x1UL)

/* COMPARE3 @Bit 19 : Write '1' to disable interrupt for event COMPARE[3] */
  #define RTC_INTENCLR_COMPARE3_Pos (19UL)
  #define RTC_INTENCLR_COMPARE3_Msk (0x1UL << RTC_INTENCLR_COMPARE3_Pos)
  #define RTC_INTENCLR_COMPARE3_Min (0x0UL)
  #define RTC_INTENCLR_COMPARE3_Max (0x1UL)
  #define RTC_INTENCLR_COMPARE3_Clear (0x1UL)
  #define RTC_INTENCLR_COMPARE3_Disabled (0x0UL)
  #define RTC_INTENCLR_COMPARE3_Enabled (0x1UL)

