pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPARE1 @Bit 17 : Write '1' to disable event routing for event COMPARE[1] */
  #define RTC_EVTENCLR_COMPARE1_Pos (17UL)
  #define RTC_EVTENCLR_COMPARE1_Msk (0x1UL << RTC_EVTENCLR_COMPARE1_Pos)
  #define RTC_EVTENCLR_COMPARE1_Min (0x0UL)
  #define RTC_EVTENCLR_COMPARE1_Max (0x1UL)
  #define RTC_EVTENCLR_COMPARE1_Disabled (0x0UL)
  #define RTC_EVTENCLR_COMPARE1_Enabled (0x1UL)
  #define RTC_EVTENCLR_COMPARE1_Clear (0x1UL)

/* COMPARE2 @Bit 18 : Write '1' to disable event routing for event COMPARE[2] */
  #define RTC_EVTENCLR_COMPARE2_Pos (18UL)
  #define RTC_EVTENCLR_COMPARE2_Msk (0x1UL << RTC_EVTENCLR_COMPARE2_Pos)
  #define RTC_EVTENCLR_COMPARE2_Min (0x0UL)
  #define RTC_EVTENCLR_COMPARE2_Max (0x1UL)
  #define RTC_EVTENCLR_COMPARE2_Disabled (0x0UL)
  #define RTC_EVTENCLR_COMPARE2_Enabled (0x1UL)
  #define RTC_EVTENCLR_COMPARE2_Clear (0x1UL)

/* COMPARE3 @Bit 19 : Write '1' to disable event routing for event COMPARE[3] */
  #define RTC_EVTENCLR_COMPARE3_Pos (19UL)
  #define RTC_EVTENCLR_COMPARE3_Msk (0x1UL << RTC_EVTENCLR_COMPARE3_Pos)
  #define RTC_EVTENCLR_COMPARE3_Min (0x0UL)
  #define RTC_EVTENCLR_COMPARE3_Max (0x1UL)
  #define RTC_EVTENCLR_COMPARE3_Disabled (0x0UL)
  #define RTC_EVTENCLR_COMPARE3_Enabled (0x1UL)
  #define RTC_EVTENCLR_COMPARE3_Clear (0x1UL)

/* COMPARE4 @Bit 20 : Write '1' to disable event routing for event COMPARE[4] */
  #define RTC_EVTENCLR_COMPARE4_Pos (20UL)
  #define RTC_EVTENCLR_COMPARE4_Msk (0x1UL << RTC_EVTENCLR_COMPARE4_Pos)
  #define RTC_EVTENCLR_COMPARE4_Min (0x0UL)
  #define RTC_EVTENCLR_COMPARE4_Max (0x1UL)
  #define RTC_EVTENCLR_COMPARE4_Disabled (0x0UL)
  #define RTC_EVTENCLR_COMPARE4_Enabled (0x1UL)
  #define RTC_EVTENCLR_COMPARE4_Clear (0x1UL)

/* COMPARE5 @Bit 21 : Write '1' to disable event routing for event COMPARE[5] */
  #define RTC_EVTENCLR_COMPARE5_Pos (21UL)
  #define RTC_EVTENCLR_COMPARE5_Msk (0x1UL << RTC_EVTENCLR_COMPARE5_Pos)
  #define RTC_EVTENCLR_COMPARE5_Min (0x0UL)
  #define RTC_EVTENCLR_COMPARE5_Max (0x1UL)
  #define RTC_EVTENCLR_COMPARE5_Disabled (0x0UL)
  #define RTC_EVTENCLR_COMPARE5_Enabled (0x1UL)
  #define RTC_EVTENCLR_COMPARE5_Clear (0x1UL)

/* COMPARE6 @Bit 22 : Write '1' to disable event routing for event COMPARE[6] */
  #define RTC_EVTENCLR_COMPARE6_Pos (22UL)
  #define RTC_EVTENCLR_COMPARE6_Msk (0x1UL << RTC_EVTENCLR_COMPARE6_Pos)
  #define RTC_EVTENCLR_COMPARE6_Min (0x0UL)
  #define RTC_EVTENCLR_COMPARE6_Max (0x1UL)
  #define RTC_EVTENCLR_COMPARE6_Disabled (0x0UL)
  #define RTC_EVTENCLR_COMPARE6_Enabled (0x1UL)
  #define RTC_EVTENCLR_COMPARE6_Clear (0x1UL)

/* COMPARE7 @Bit 23 : Write '1' to disable event routing for event COMPARE[7] */
  #define RTC_EVTENCLR_COMPARE7_Pos (23UL)
  #define RTC_EVTENCLR_COMPARE7_Msk (0x1UL << RTC_EVTENCLR_COMPARE7_Pos)
  #define RTC_EVTENCLR_COMPARE7_Min (0x0UL)
  #define RTC_EVTENCLR_COMPARE7_Max (0x1UL)
  #define RTC_EVTENCLR_COMPARE7_Disabled (0x0UL)
  #define RTC_EVTENCLR_COMPARE7_Enabled (0x1UL)
  #define RTC_EVTENCLR_COMPARE7_Clear (0x1UL)


/* RTC_COUNTER: Current counter value */
  #define RTC_COUNTER_ResetValue (0x00000000UL)

/* COUNTER @Bits 0..23 : Counter value */
  #define RTC_COUNTER_COUNTER_Pos (0UL)
  #define RTC_COUNTER_COUNTER_Msk (0xFFFFFFUL << RTC_COUNTER_COUNTER_Pos)


/* RTC_PRESCALER: 12-bit prescaler for counter frequency (32768 / (PRESCALER + 1)). Must be written when RTC is stopped. */
  #define RTC_PRESCALER_ResetValue (0x00000000UL)

/* PRESCALER @Bits 0..11 : Prescaler value */
  #define RTC_PRESCALER_PRESCALER_Pos (0UL)
  #define RTC_PRESCALER_PRESCALER_Msk (0xFFFUL << RTC_PRESCALER_PRESCALER_Pos)


/* RTC_CC: Compare register n */
  #define RTC_CC_MaxCount (8UL)
  #define RTC_CC_MaxIndex (7UL)
  #define RTC_CC_MinIndex (0UL)
  #define RTC_CC_ResetValue (0x00000000UL)

/* COMPARE @Bits 0..31 : Compare value */
  #define RTC_CC_COMPARE_Pos (0UL)
  #define RTC_CC_COMPARE_Msk (0xFFFFFFFFUL << RTC_CC_COMPARE_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SAADC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct SAADC_EVENTS_CH ================================================== */
/**
  * @brief EVENTS_CH [SAADC_EVENTS_CH] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  LIMITH;
  __IOM uint32_t  LIMITL;
} NRF_SAADC_EVENTS_CH_Type;
  #define SAADC_EVENTS_CH_MaxCount (8UL)
  #define SAADC_EVENTS_CH_MaxIndex (7UL)
  #define SAADC_EVENTS_CH_MinIndex (0UL)

/* SAADC_EVENTS_CH_LIMITH: Last results is equal or above CH[n].LIMIT.HIGH */
  #define SAADC_EVENTS_CH_LIMITH_ResetValue (0x00000000UL)

/* LIMITH @Bit 0 : Last results is equal or above CH[n].LIMIT.HIGH */
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Pos (0UL)
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Msk (0x1UL << SAADC_EVENTS_CH_LIMITH_LIMITH_Pos)
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Min (0x0UL)
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Max (0x1UL)
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_NotGenerated (0x0UL)
  #define SAADC_EVENTS_CH_LIMITH_LIMITH_Generated (0x1UL)


/* SAADC_EVENTS_CH_LIMITL: Last results is equal or below CH[n].LIMIT.LOW */
  #define SAADC_EVENTS_CH_LIMITL_ResetValue (0x00000000UL)

/* LIMITL @Bit 0 : Last results is equal or below CH[n].LIMIT.LOW */
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Pos (0UL)
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Msk (0x1UL << SAADC_EVENTS_CH_LIMITL_LIMITL_Pos)
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Min (0x0UL)
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Max (0x1UL)
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_NotGenerated (0x0UL)
  #define SAADC_EVENTS_CH_LIMITL_LIMITL_Generated (0x1UL)



