pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ================================================= Struct SAADC_PUBLISH_CH ================================================= */
/**
  * @brief PUBLISH_CH [SAADC_PUBLISH_CH] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  LIMITH;
  __IOM uint32_t  LIMITL;
} NRF_SAADC_PUBLISH_CH_Type;
  #define SAADC_PUBLISH_CH_MaxCount (8UL)
  #define SAADC_PUBLISH_CH_MaxIndex (7UL)
  #define SAADC_PUBLISH_CH_MinIndex (0UL)

/* SAADC_PUBLISH_CH_LIMITH: Publish configuration for event CH[n].LIMITH */
  #define SAADC_PUBLISH_CH_LIMITH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CH[n].LIMITH will publish to */
  #define SAADC_PUBLISH_CH_LIMITH_CHIDX_Pos (0UL)
  #define SAADC_PUBLISH_CH_LIMITH_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_CH_LIMITH_CHIDX_Pos)
  #define SAADC_PUBLISH_CH_LIMITH_CHIDX_Min (0x00UL)
  #define SAADC_PUBLISH_CH_LIMITH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_CH_LIMITH_EN_Pos (31UL)
  #define SAADC_PUBLISH_CH_LIMITH_EN_Msk (0x1UL << SAADC_PUBLISH_CH_LIMITH_EN_Pos)
  #define SAADC_PUBLISH_CH_LIMITH_EN_Min (0x0UL)
  #define SAADC_PUBLISH_CH_LIMITH_EN_Max (0x1UL)
  #define SAADC_PUBLISH_CH_LIMITH_EN_Disabled (0x0UL)
  #define SAADC_PUBLISH_CH_LIMITH_EN_Enabled (0x1UL)


/* SAADC_PUBLISH_CH_LIMITL: Publish configuration for event CH[n].LIMITL */
  #define SAADC_PUBLISH_CH_LIMITL_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CH[n].LIMITL will publish to */
  #define SAADC_PUBLISH_CH_LIMITL_CHIDX_Pos (0UL)
  #define SAADC_PUBLISH_CH_LIMITL_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_CH_LIMITL_CHIDX_Pos)
  #define SAADC_PUBLISH_CH_LIMITL_CHIDX_Min (0x00UL)
  #define SAADC_PUBLISH_CH_LIMITL_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_CH_LIMITL_EN_Pos (31UL)
  #define SAADC_PUBLISH_CH_LIMITL_EN_Msk (0x1UL << SAADC_PUBLISH_CH_LIMITL_EN_Pos)
  #define SAADC_PUBLISH_CH_LIMITL_EN_Min (0x0UL)
  #define SAADC_PUBLISH_CH_LIMITL_EN_Max (0x1UL)
  #define SAADC_PUBLISH_CH_LIMITL_EN_Disabled (0x0UL)
  #define SAADC_PUBLISH_CH_LIMITL_EN_Enabled (0x1UL)



/* ==================================================== Struct SAADC_TRIM ==================================================== */
/**
  * @brief TRIM [SAADC_TRIM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LINCALCOEFF[6];
} NRF_SAADC_TRIM_Type;

/* SAADC_TRIM_LINCALCOEFF: Linearity calibration coefficient */
  #define SAADC_TRIM_LINCALCOEFF_MaxCount (6UL)
  #define SAADC_TRIM_LINCALCOEFF_MaxIndex (5UL)
  #define SAADC_TRIM_LINCALCOEFF_MinIndex (0UL)
  #define SAADC_TRIM_LINCALCOEFF_ResetValue (0x00000000UL)

/* VAL @Bits 0..15 : value */
  #define SAADC_TRIM_LINCALCOEFF_VAL_Pos (0UL)
  #define SAADC_TRIM_LINCALCOEFF_VAL_Msk (0xFFFFUL << SAADC_TRIM_LINCALCOEFF_VAL_Pos)
  #define SAADC_TRIM_LINCALCOEFF_VAL_Min (0x0000UL)
  #define SAADC_TRIM_LINCALCOEFF_VAL_Max (0xFFFFUL)



/* ===================================================== Struct SAADC_CH ===================================================== */
/**
  * @brief CH [SAADC_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PSELP;
  __IOM uint32_t  PSELN;
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  LIMIT;
} NRF_SAADC_CH_Type;
  #define SAADC_CH_MaxCount (8UL)
  #define SAADC_CH_MaxIndex (7UL)
  #define SAADC_CH_MinIndex (0UL)

/* SAADC_CH_PSELP: Input positive pin selection for CH[n] */
  #define SAADC_CH_PSELP_ResetValue (0x00000000UL)

/* PIN @Bits 0..4 : Analog positive input pin select */
  #define SAADC_CH_PSELP_PIN_Pos (0UL)
  #define SAADC_CH_PSELP_PIN_Msk (0x1FUL << SAADC_CH_PSELP_PIN_Pos)

/* PORT @Bits 8..11 : GPIO Port selection */
  #define SAADC_CH_PSELP_PORT_Pos (8UL)
  #define SAADC_CH_PSELP_PORT_Msk (0xFUL << SAADC_CH_PSELP_PORT_Pos)

/* CONNECT @Bits 30..31 : Connection */
  #define SAADC_CH_PSELP_CONNECT_Pos (30UL)
  #define SAADC_CH_PSELP_CONNECT_Msk (0x3UL << SAADC_CH_PSELP_CONNECT_Pos)
  #define SAADC_CH_PSELP_CONNECT_Min (0x0UL)
  #define SAADC_CH_PSELP_CONNECT_Max (0x1UL)
  #define SAADC_CH_PSELP_CONNECT_NC (0x0UL)
  #define SAADC_CH_PSELP_CONNECT_AnalogInput (0x1UL)


/* SAADC_CH_PSELN: Input negative pin selection for CH[n] */
  #define SAADC_CH_PSELN_ResetValue (0x00000000UL)

/* PIN @Bits 0..4 : Analog negative input pin select */
  #define SAADC_CH_PSELN_PIN_Pos (0UL)
  #define SAADC_CH_PSELN_PIN_Msk (0x1FUL << SAADC_CH_PSELN_PIN_Pos)

/* PORT @Bits 8..11 : GPIO Port selection */
  #define SAADC_CH_PSELN_PORT_Pos (8UL)
  #define SAADC_CH_PSELN_PORT_Msk (0xFUL << SAADC_CH_PSELN_PORT_Pos)

/* CONNECT @Bits 30..31 : Connection */
  #define SAADC_CH_PSELN_CONNECT_Pos (30UL)
  #define SAADC_CH_PSELN_CONNECT_Msk (0x3UL << SAADC_CH_PSELN_CONNECT_Pos)
  #define SAADC_CH_PSELN_CONNECT_Min (0x0UL)
  #define SAADC_CH_PSELN_CONNECT_Max (0x1UL)
  #define SAADC_CH_PSELN_CONNECT_NC (0x0UL)
  #define SAADC_CH_PSELN_CONNECT_AnalogInput (0x1UL)


/* SAADC_CH_CONFIG: Input configuration for CH[n] */
  #define SAADC_CH_CONFIG_ResetValue (0x00020000UL)

/* RESP @Bits 0..1 : Positive channel resistor control */
  #define SAADC_CH_CONFIG_RESP_Pos (0UL)
  #define SAADC_CH_CONFIG_RESP_Msk (0x3UL << SAADC_CH_CONFIG_RESP_Pos)
  #define SAADC_CH_CONFIG_RESP_Min (0x0UL)
  #define SAADC_CH_CONFIG_RESP_Max (0x3UL)
  #define SAADC_CH_CONFIG_RESP_Bypass (0x0UL)
  #define SAADC_CH_CONFIG_RESP_Pulldown (0x1UL)
  #define SAADC_CH_CONFIG_RESP_Pullup (0x2UL)
  #define SAADC_CH_CONFIG_RESP_VDDAO1V8div2 (0x3UL)

/* RESN @Bits 4..5 : Negative channel resistor control */
  #define SAADC_CH_CONFIG_RESN_Pos (4UL)
  #define SAADC_CH_CONFIG_RESN_Msk (0x3UL << SAADC_CH_CONFIG_RESN_Pos)
  #define SAADC_CH_CONFIG_RESN_Min (0x0UL)
  #define SAADC_CH_CONFIG_RESN_Max (0x3UL)
  #define SAADC_CH_CONFIG_RESN_Bypass (0x0UL)
  #define SAADC_CH_CONFIG_RESN_Pulldown (0x1UL)
  #define SAADC_CH_CONFIG_RESN_Pullup (0x2UL)
  #define SAADC_CH_CONFIG_RESN_VDDAO1V8div2 (0x3UL)

/* GAIN @Bits 8..9 : Gain control */
  #define SAADC_CH_CONFIG_GAIN_Pos (8UL)
  #define SAADC_CH_CONFIG_GAIN_Msk (0x3UL << SAADC_CH_CONFIG_GAIN_Pos)
  #define SAADC_CH_CONFIG_GAIN_Min (0x0UL)
  #define SAADC_CH_CONFIG_GAIN_Max (0x3UL)
  #define SAADC_CH_CONFIG_GAIN_Gain2_3 (0x0UL)
  #define SAADC_CH_CONFIG_GAIN_Gain1 (0x1UL)
  #define SAADC_CH_CONFIG_GAIN_Gain2 (0x2UL)
  #define SAADC_CH_CONFIG_GAIN_Gain4 (0x3UL)

/* BURST @Bit 11 : Enable burst mode */
  #define SAADC_CH_CONFIG_BURST_Pos (11UL)
  #define SAADC_CH_CONFIG_BURST_Msk (0x1UL << SAADC_CH_CONFIG_BURST_Pos)
  #define SAADC_CH_CONFIG_BURST_Min (0x0UL)
  #define SAADC_CH_CONFIG_BURST_Max (0x1UL)
  #define SAADC_CH_CONFIG_BURST_Disabled (0x0UL)
  #define SAADC_CH_CONFIG_BURST_Enabled (0x1UL)      /*!< Burst mode is enabled. SAADC takes 2^OVERSAMPLE number of samples as
                                                          fast as it can, and sends the average to Data RAM.*/

/* REFSEL @Bit 12 : Reference control */
  #define SAADC_CH_CONFIG_REFSEL_Pos (12UL)
  #define SAADC_CH_CONFIG_REFSEL_Msk (0x1UL << SAADC_CH_CONFIG_REFSEL_Pos)
  #define SAADC_CH_CONFIG_REFSEL_Min (0x0UL)
  #define SAADC_CH_CONFIG_REFSEL_Max (0x1UL)
  #define SAADC_CH_CONFIG_REFSEL_Internal (0x0UL)
  #define SAADC_CH_CONFIG_REFSEL_External (0x1UL)

/* MODE @Bit 15 : Enable differential mode */
  #define SAADC_CH_CONFIG_MODE_Pos (15UL)
  #define SAADC_CH_CONFIG_MODE_Msk (0x1UL << SAADC_CH_CONFIG_MODE_Pos)
  #define SAADC_CH_CONFIG_MODE_Min (0x0UL)
  #define SAADC_CH_CONFIG_MODE_Max (0x1UL)
  #define SAADC_CH_CONFIG_MODE_SE (0x0UL)            /*!< Single ended, PSELN will be ignored, negative input to ADC shorted to
                                                          GND*/
  #define SAADC_CH_CONFIG_MODE_Diff (0x1UL)

/* TACQ @Bits 16..24 : Acquisition time, the time the ADC uses to sample the input voltage. Resulting acquistion time is
                       ((TACQ+1) x 125 ns) */

  #define SAADC_CH_CONFIG_TACQ_Pos (16UL)
  #define SAADC_CH_CONFIG_TACQ_Msk (0x1FFUL << SAADC_CH_CONFIG_TACQ_Pos)
  #define SAADC_CH_CONFIG_TACQ_Min (0x000UL)
  #define SAADC_CH_CONFIG_TACQ_Max (0x13FUL)

/* TCONV @Bits 28..30 : Conversion time. Resulting conversion time is ((TCONV+1) x 250 ns) */
  #define SAADC_CH_CONFIG_TCONV_Pos (28UL)
  #define SAADC_CH_CONFIG_TCONV_Msk (0x7UL << SAADC_CH_CONFIG_TCONV_Pos)
  #define SAADC_CH_CONFIG_TCONV_Min (0x0UL)
  #define SAADC_CH_CONFIG_TCONV_Max (0x7UL)


/* SAADC_CH_LIMIT: High/low limits for event monitoring a channel */
  #define SAADC_CH_LIMIT_ResetValue (0x7FFF8000UL)

/* LOW @Bits 0..15 : Low level limit */
  #define SAADC_CH_LIMIT_LOW_Pos (0UL)
  #define SAADC_CH_LIMIT_LOW_Msk (0xFFFFUL << SAADC_CH_LIMIT_LOW_Pos)

