pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* HIGH @Bits 16..31 : High level limit */
  #define SAADC_CH_LIMIT_HIGH_Pos (16UL)
  #define SAADC_CH_LIMIT_HIGH_Msk (0xFFFFUL << SAADC_CH_LIMIT_HIGH_Pos)



/* =================================================== Struct SAADC_RESULT =================================================== */
/**
  * @brief RESULT [SAADC_RESULT] RESULT EasyDMA channel
  */
typedef struct {
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  AMOUNT;
  __IM  uint32_t  RESERVED;
} NRF_SAADC_RESULT_Type;

/* SAADC_RESULT_PTR: Data pointer */
  #define SAADC_RESULT_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : Data pointer */
  #define SAADC_RESULT_PTR_PTR_Pos (0UL)
  #define SAADC_RESULT_PTR_PTR_Msk (0xFFFFFFFFUL << SAADC_RESULT_PTR_PTR_Pos)


/* SAADC_RESULT_MAXCNT: Maximum number of buffer bytes to transfer */
  #define SAADC_RESULT_MAXCNT_ResetValue (0x00000000UL)

/* MAXCNT @Bits 0..14 : Maximum number of buffer bytes to transfer */
  #define SAADC_RESULT_MAXCNT_MAXCNT_Pos (0UL)
  #define SAADC_RESULT_MAXCNT_MAXCNT_Msk (0x7FFFUL << SAADC_RESULT_MAXCNT_MAXCNT_Pos)


/* SAADC_RESULT_AMOUNT: Number of buffer bytes transferred since last START */
  #define SAADC_RESULT_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of buffer bytes transferred since last START. This register can be read after an END or STOPPED
                        event. */

  #define SAADC_RESULT_AMOUNT_AMOUNT_Pos (0UL)
  #define SAADC_RESULT_AMOUNT_AMOUNT_Msk (0x7FFFUL << SAADC_RESULT_AMOUNT_AMOUNT_Pos)


/* ====================================================== Struct SAADC ======================================================= */
/**
  * @brief Analog to Digital Converter
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000004) Take one ADC sample, if scan is enabled all channels
                                                                         are sampled*/
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_CALIBRATEOFFSET;
    __IM uint32_t RESERVED[28];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_SAMPLE;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_CALIBRATEOFFSET;
    __IM uint32_t RESERVED1[28];
    __IOM uint32_t EVENTS_STARTED;
    __IOM uint32_t EVENTS_END;
    __IOM uint32_t EVENTS_DONE;                      /*!< (@ 0x00000108) A conversion task has been completed. Depending on the
                                                                         mode, multiple conversions might be needed for a result
                                                                         to be transferred to RAM.*/
    __IOM uint32_t EVENTS_RESULTDONE;
    __IOM uint32_t EVENTS_CALIBRATEDONE;
    __IOM uint32_t EVENTS_STOPPED;
    __IOM NRF_SAADC_EVENTS_CH_Type EVENTS_CH[8];
    __IM uint32_t RESERVED2[10];
    __IOM uint32_t PUBLISH_STARTED;
    __IOM uint32_t PUBLISH_END;
    __IOM uint32_t PUBLISH_DONE;
    __IOM uint32_t PUBLISH_RESULTDONE;
    __IOM uint32_t PUBLISH_CALIBRATEDONE;
    __IOM uint32_t PUBLISH_STOPPED;
    __IOM NRF_SAADC_PUBLISH_CH_Type PUBLISH_CH[8];
    __IM uint32_t RESERVED3[74];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED4[61];
    __IM uint32_t STATUS;
    __IM uint32_t RESERVED5[15];
    __IOM NRF_SAADC_TRIM_Type TRIM;
    __IM uint32_t RESERVED6[42];
    __IOM uint32_t ENABLE;
    __IM uint32_t RESERVED7[3];
    __IOM NRF_SAADC_CH_Type CH[8];
    __IM uint32_t RESERVED8[24];
    __IOM uint32_t RESOLUTION;
    __IOM uint32_t OVERSAMPLE;                       /*!< (@ 0x000005F4) Oversampling configuration. OVERSAMPLE should not be
                                                                         combined with SCAN. The RESOLUTION is applied before
                                                                         averaging, thus for high OVERSAMPLE a higher RESOLUTION
                                                                         should be used.*/
    __IOM uint32_t SAMPLERATE;
    __IM uint32_t RESERVED9[12];
    __IOM NRF_SAADC_RESULT_Type RESULT;
  } NRF_SAADC_Type;

/* SAADC_TASKS_START: Start the ADC and prepare the result buffer in RAM */
  #define SAADC_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start the ADC and prepare the result buffer in RAM */
  #define SAADC_TASKS_START_TASKS_START_Pos (0UL)
  #define SAADC_TASKS_START_TASKS_START_Msk (0x1UL << SAADC_TASKS_START_TASKS_START_Pos)
  #define SAADC_TASKS_START_TASKS_START_Min (0x1UL)
  #define SAADC_TASKS_START_TASKS_START_Max (0x1UL)
  #define SAADC_TASKS_START_TASKS_START_Trigger (0x1UL)


/* SAADC_TASKS_SAMPLE: Take one ADC sample, if scan is enabled all channels are sampled */
  #define SAADC_TASKS_SAMPLE_ResetValue (0x00000000UL)

/* TASKS_SAMPLE @Bit 0 : Take one ADC sample, if scan is enabled all channels are sampled */
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Pos (0UL)
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Msk (0x1UL << SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Pos) /*!< Bit mask of TASKS_SAMPLE
                                                                            field.*/
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Min (0x1UL)
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Max (0x1UL)
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Trigger (0x1UL)


/* SAADC_TASKS_STOP: Stop the ADC and terminate any on-going conversion */
  #define SAADC_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop the ADC and terminate any on-going conversion */
  #define SAADC_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define SAADC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << SAADC_TASKS_STOP_TASKS_STOP_Pos)
  #define SAADC_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define SAADC_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define SAADC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* SAADC_TASKS_CALIBRATEOFFSET: Starts offset auto-calibration */
  #define SAADC_TASKS_CALIBRATEOFFSET_ResetValue (0x00000000UL)

/* TASKS_CALIBRATEOFFSET @Bit 0 : Starts offset auto-calibration */
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Pos (0UL)
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Msk (0x1UL << SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Pos)
                                                                            /*!< Bit mask of TASKS_CALIBRATEOFFSET field.*/
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Min (0x1UL) /*!< Min enumerator value of TASKS_CALIBRATEOFFSET
                                                                            field.*/
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Max (0x1UL) /*!< Max enumerator value of TASKS_CALIBRATEOFFSET
                                                                            field.*/
  #define SAADC_TASKS_CALIBRATEOFFSET_TASKS_CALIBRATEOFFSET_Trigger (0x1UL)


/* SAADC_SUBSCRIBE_START: Subscribe configuration for task START */
  #define SAADC_SUBSCRIBE_START_ResetValue (0x00000000UL)

