pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define SAADC_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define SAADC_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_START_CHIDX_Pos)
  #define SAADC_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define SAADC_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_START_EN_Pos (31UL)
  #define SAADC_SUBSCRIBE_START_EN_Msk (0x1UL << SAADC_SUBSCRIBE_START_EN_Pos)
  #define SAADC_SUBSCRIBE_START_EN_Min (0x0UL)
  #define SAADC_SUBSCRIBE_START_EN_Max (0x1UL)
  #define SAADC_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define SAADC_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* SAADC_SUBSCRIBE_SAMPLE: Subscribe configuration for task SAMPLE */
  #define SAADC_SUBSCRIBE_SAMPLE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SAMPLE will subscribe to */
  #define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Pos (0UL)
  #define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_SAMPLE_CHIDX_Pos)
  #define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Min (0x00UL)
  #define SAADC_SUBSCRIBE_SAMPLE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Pos (31UL)
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Msk (0x1UL << SAADC_SUBSCRIBE_SAMPLE_EN_Pos)
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Min (0x0UL)
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Max (0x1UL)
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Disabled (0x0UL)
  #define SAADC_SUBSCRIBE_SAMPLE_EN_Enabled (0x1UL)


/* SAADC_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define SAADC_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define SAADC_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define SAADC_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_STOP_CHIDX_Pos)
  #define SAADC_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define SAADC_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define SAADC_SUBSCRIBE_STOP_EN_Msk (0x1UL << SAADC_SUBSCRIBE_STOP_EN_Pos)
  #define SAADC_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define SAADC_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define SAADC_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define SAADC_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* SAADC_SUBSCRIBE_CALIBRATEOFFSET: Subscribe configuration for task CALIBRATEOFFSET */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CALIBRATEOFFSET will subscribe to */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Pos (0UL)
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Msk (0xFFUL << SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Min (0x00UL)
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Pos (31UL)
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Msk (0x1UL << SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Pos)
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Min (0x0UL)
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Max (0x1UL)
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Disabled (0x0UL)
  #define SAADC_SUBSCRIBE_CALIBRATEOFFSET_EN_Enabled (0x1UL)


/* SAADC_EVENTS_STARTED: The ADC has started */
  #define SAADC_EVENTS_STARTED_ResetValue (0x00000000UL)

/* EVENTS_STARTED @Bit 0 : The ADC has started */
  #define SAADC_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL)
  #define SAADC_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << SAADC_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define SAADC_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL)
  #define SAADC_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL)
  #define SAADC_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL)
  #define SAADC_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL)


/* SAADC_EVENTS_END: The ADC has filled up the Result buffer */
  #define SAADC_EVENTS_END_ResetValue (0x00000000UL)

/* EVENTS_END @Bit 0 : The ADC has filled up the Result buffer */
  #define SAADC_EVENTS_END_EVENTS_END_Pos (0UL)
  #define SAADC_EVENTS_END_EVENTS_END_Msk (0x1UL << SAADC_EVENTS_END_EVENTS_END_Pos)
  #define SAADC_EVENTS_END_EVENTS_END_Min (0x0UL)
  #define SAADC_EVENTS_END_EVENTS_END_Max (0x1UL)
  #define SAADC_EVENTS_END_EVENTS_END_NotGenerated (0x0UL)
  #define SAADC_EVENTS_END_EVENTS_END_Generated (0x1UL)


/* SAADC_EVENTS_DONE: A conversion task has been completed. Depending on the mode, multiple conversions might be needed for a
                       result to be transferred to RAM. */

  #define SAADC_EVENTS_DONE_ResetValue (0x00000000UL)

/* EVENTS_DONE @Bit 0 : A conversion task has been completed. Depending on the mode, multiple conversions might be needed for a
                        result to be transferred to RAM. */

  #define SAADC_EVENTS_DONE_EVENTS_DONE_Pos (0UL)
  #define SAADC_EVENTS_DONE_EVENTS_DONE_Msk (0x1UL << SAADC_EVENTS_DONE_EVENTS_DONE_Pos)
  #define SAADC_EVENTS_DONE_EVENTS_DONE_Min (0x0UL)
  #define SAADC_EVENTS_DONE_EVENTS_DONE_Max (0x1UL)
  #define SAADC_EVENTS_DONE_EVENTS_DONE_NotGenerated (0x0UL)
  #define SAADC_EVENTS_DONE_EVENTS_DONE_Generated (0x1UL)


/* SAADC_EVENTS_RESULTDONE: A result is ready to get transferred to RAM. */
  #define SAADC_EVENTS_RESULTDONE_ResetValue (0x00000000UL)

/* EVENTS_RESULTDONE @Bit 0 : A result is ready to get transferred to RAM. */
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Pos (0UL)
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Msk (0x1UL << SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Pos) /*!< Bit mask
                                                                            of EVENTS_RESULTDONE field.*/
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Min (0x0UL)
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Max (0x1UL)
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_NotGenerated (0x0UL)
  #define SAADC_EVENTS_RESULTDONE_EVENTS_RESULTDONE_Generated (0x1UL)


/* SAADC_EVENTS_CALIBRATEDONE: Calibration is complete */
  #define SAADC_EVENTS_CALIBRATEDONE_ResetValue (0x00000000UL)

/* EVENTS_CALIBRATEDONE @Bit 0 : Calibration is complete */
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Pos (0UL)
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Msk (0x1UL << SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Pos)
                                                                            /*!< Bit mask of EVENTS_CALIBRATEDONE field.*/
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Min (0x0UL)
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Max (0x1UL)
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_NotGenerated (0x0UL)
  #define SAADC_EVENTS_CALIBRATEDONE_EVENTS_CALIBRATEDONE_Generated (0x1UL)


/* SAADC_EVENTS_STOPPED: The ADC has stopped */
  #define SAADC_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : The ADC has stopped */
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define SAADC_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* SAADC_PUBLISH_STARTED: Publish configuration for event STARTED */
  #define SAADC_PUBLISH_STARTED_ResetValue (0x00000000UL)

