pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define SAADC_PUBLISH_STARTED_CHIDX_Pos (0UL)
  #define SAADC_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_STARTED_CHIDX_Pos)
  #define SAADC_PUBLISH_STARTED_CHIDX_Min (0x00UL)
  #define SAADC_PUBLISH_STARTED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_STARTED_EN_Pos (31UL)
  #define SAADC_PUBLISH_STARTED_EN_Msk (0x1UL << SAADC_PUBLISH_STARTED_EN_Pos)
  #define SAADC_PUBLISH_STARTED_EN_Min (0x0UL)
  #define SAADC_PUBLISH_STARTED_EN_Max (0x1UL)
  #define SAADC_PUBLISH_STARTED_EN_Disabled (0x0UL)
  #define SAADC_PUBLISH_STARTED_EN_Enabled (0x1UL)


/* SAADC_PUBLISH_END: Publish configuration for event END */
  #define SAADC_PUBLISH_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define SAADC_PUBLISH_END_CHIDX_Pos (0UL)
  #define SAADC_PUBLISH_END_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_END_CHIDX_Pos)
  #define SAADC_PUBLISH_END_CHIDX_Min (0x00UL)
  #define SAADC_PUBLISH_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_END_EN_Pos (31UL)
  #define SAADC_PUBLISH_END_EN_Msk (0x1UL << SAADC_PUBLISH_END_EN_Pos)
  #define SAADC_PUBLISH_END_EN_Min (0x0UL)
  #define SAADC_PUBLISH_END_EN_Max (0x1UL)
  #define SAADC_PUBLISH_END_EN_Disabled (0x0UL)
  #define SAADC_PUBLISH_END_EN_Enabled (0x1UL)


/* SAADC_PUBLISH_DONE: Publish configuration for event DONE */
  #define SAADC_PUBLISH_DONE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event DONE will publish to */
  #define SAADC_PUBLISH_DONE_CHIDX_Pos (0UL)
  #define SAADC_PUBLISH_DONE_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_DONE_CHIDX_Pos)
  #define SAADC_PUBLISH_DONE_CHIDX_Min (0x00UL)
  #define SAADC_PUBLISH_DONE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_DONE_EN_Pos (31UL)
  #define SAADC_PUBLISH_DONE_EN_Msk (0x1UL << SAADC_PUBLISH_DONE_EN_Pos)
  #define SAADC_PUBLISH_DONE_EN_Min (0x0UL)
  #define SAADC_PUBLISH_DONE_EN_Max (0x1UL)
  #define SAADC_PUBLISH_DONE_EN_Disabled (0x0UL)
  #define SAADC_PUBLISH_DONE_EN_Enabled (0x1UL)


/* SAADC_PUBLISH_RESULTDONE: Publish configuration for event RESULTDONE */
  #define SAADC_PUBLISH_RESULTDONE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event RESULTDONE will publish to */
  #define SAADC_PUBLISH_RESULTDONE_CHIDX_Pos (0UL)
  #define SAADC_PUBLISH_RESULTDONE_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_RESULTDONE_CHIDX_Pos)
  #define SAADC_PUBLISH_RESULTDONE_CHIDX_Min (0x00UL)
  #define SAADC_PUBLISH_RESULTDONE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_RESULTDONE_EN_Pos (31UL)
  #define SAADC_PUBLISH_RESULTDONE_EN_Msk (0x1UL << SAADC_PUBLISH_RESULTDONE_EN_Pos)
  #define SAADC_PUBLISH_RESULTDONE_EN_Min (0x0UL)
  #define SAADC_PUBLISH_RESULTDONE_EN_Max (0x1UL)
  #define SAADC_PUBLISH_RESULTDONE_EN_Disabled (0x0UL)
  #define SAADC_PUBLISH_RESULTDONE_EN_Enabled (0x1UL)


/* SAADC_PUBLISH_CALIBRATEDONE: Publish configuration for event CALIBRATEDONE */
  #define SAADC_PUBLISH_CALIBRATEDONE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CALIBRATEDONE will publish to */
  #define SAADC_PUBLISH_CALIBRATEDONE_CHIDX_Pos (0UL)
  #define SAADC_PUBLISH_CALIBRATEDONE_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_CALIBRATEDONE_CHIDX_Pos)
  #define SAADC_PUBLISH_CALIBRATEDONE_CHIDX_Min (0x00UL)
  #define SAADC_PUBLISH_CALIBRATEDONE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_CALIBRATEDONE_EN_Pos (31UL)
  #define SAADC_PUBLISH_CALIBRATEDONE_EN_Msk (0x1UL << SAADC_PUBLISH_CALIBRATEDONE_EN_Pos)
  #define SAADC_PUBLISH_CALIBRATEDONE_EN_Min (0x0UL)
  #define SAADC_PUBLISH_CALIBRATEDONE_EN_Max (0x1UL)
  #define SAADC_PUBLISH_CALIBRATEDONE_EN_Disabled (0x0UL)
  #define SAADC_PUBLISH_CALIBRATEDONE_EN_Enabled (0x1UL)


/* SAADC_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define SAADC_PUBLISH_STOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define SAADC_PUBLISH_STOPPED_CHIDX_Pos (0UL)
  #define SAADC_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << SAADC_PUBLISH_STOPPED_CHIDX_Pos)
  #define SAADC_PUBLISH_STOPPED_CHIDX_Min (0x00UL)
  #define SAADC_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SAADC_PUBLISH_STOPPED_EN_Pos (31UL)
  #define SAADC_PUBLISH_STOPPED_EN_Msk (0x1UL << SAADC_PUBLISH_STOPPED_EN_Pos)
  #define SAADC_PUBLISH_STOPPED_EN_Min (0x0UL)
  #define SAADC_PUBLISH_STOPPED_EN_Max (0x1UL)
  #define SAADC_PUBLISH_STOPPED_EN_Disabled (0x0UL)
  #define SAADC_PUBLISH_STOPPED_EN_Enabled (0x1UL)


/* SAADC_INTEN: Enable or disable interrupt */
  #define SAADC_INTEN_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define SAADC_INTEN_STARTED_Pos (0UL)
  #define SAADC_INTEN_STARTED_Msk (0x1UL << SAADC_INTEN_STARTED_Pos)
  #define SAADC_INTEN_STARTED_Min (0x0UL)
  #define SAADC_INTEN_STARTED_Max (0x1UL)
  #define SAADC_INTEN_STARTED_Disabled (0x0UL)
  #define SAADC_INTEN_STARTED_Enabled (0x1UL)

/* END @Bit 1 : Enable or disable interrupt for event END */
  #define SAADC_INTEN_END_Pos (1UL)
  #define SAADC_INTEN_END_Msk (0x1UL << SAADC_INTEN_END_Pos)
  #define SAADC_INTEN_END_Min (0x0UL)
  #define SAADC_INTEN_END_Max (0x1UL)
  #define SAADC_INTEN_END_Disabled (0x0UL)
  #define SAADC_INTEN_END_Enabled (0x1UL)

/* DONE @Bit 2 : Enable or disable interrupt for event DONE */
  #define SAADC_INTEN_DONE_Pos (2UL)
  #define SAADC_INTEN_DONE_Msk (0x1UL << SAADC_INTEN_DONE_Pos)
  #define SAADC_INTEN_DONE_Min (0x0UL)
  #define SAADC_INTEN_DONE_Max (0x1UL)
  #define SAADC_INTEN_DONE_Disabled (0x0UL)
  #define SAADC_INTEN_DONE_Enabled (0x1UL)

/* RESULTDONE @Bit 3 : Enable or disable interrupt for event RESULTDONE */
  #define SAADC_INTEN_RESULTDONE_Pos (3UL)
  #define SAADC_INTEN_RESULTDONE_Msk (0x1UL << SAADC_INTEN_RESULTDONE_Pos)
  #define SAADC_INTEN_RESULTDONE_Min (0x0UL)
  #define SAADC_INTEN_RESULTDONE_Max (0x1UL)
  #define SAADC_INTEN_RESULTDONE_Disabled (0x0UL)
  #define SAADC_INTEN_RESULTDONE_Enabled (0x1UL)

/* CALIBRATEDONE @Bit 4 : Enable or disable interrupt for event CALIBRATEDONE */
  #define SAADC_INTEN_CALIBRATEDONE_Pos (4UL)
  #define SAADC_INTEN_CALIBRATEDONE_Msk (0x1UL << SAADC_INTEN_CALIBRATEDONE_Pos)
  #define SAADC_INTEN_CALIBRATEDONE_Min (0x0UL)
  #define SAADC_INTEN_CALIBRATEDONE_Max (0x1UL)
  #define SAADC_INTEN_CALIBRATEDONE_Disabled (0x0UL)
  #define SAADC_INTEN_CALIBRATEDONE_Enabled (0x1UL)

/* STOPPED @Bit 5 : Enable or disable interrupt for event STOPPED */
  #define SAADC_INTEN_STOPPED_Pos (5UL)
  #define SAADC_INTEN_STOPPED_Msk (0x1UL << SAADC_INTEN_STOPPED_Pos)
  #define SAADC_INTEN_STOPPED_Min (0x0UL)
  #define SAADC_INTEN_STOPPED_Max (0x1UL)
  #define SAADC_INTEN_STOPPED_Disabled (0x0UL)
  #define SAADC_INTEN_STOPPED_Enabled (0x1UL)

/* CH0LIMITH @Bit 6 : Enable or disable interrupt for event CH0LIMITH */
  #define SAADC_INTEN_CH0LIMITH_Pos (6UL)
  #define SAADC_INTEN_CH0LIMITH_Msk (0x1UL << SAADC_INTEN_CH0LIMITH_Pos)
  #define SAADC_INTEN_CH0LIMITH_Min (0x0UL)
  #define SAADC_INTEN_CH0LIMITH_Max (0x1UL)
  #define SAADC_INTEN_CH0LIMITH_Disabled (0x0UL)
  #define SAADC_INTEN_CH0LIMITH_Enabled (0x1UL)

/* CH0LIMITL @Bit 7 : Enable or disable interrupt for event CH0LIMITL */
  #define SAADC_INTEN_CH0LIMITL_Pos (7UL)
  #define SAADC_INTEN_CH0LIMITL_Msk (0x1UL << SAADC_INTEN_CH0LIMITL_Pos)
  #define SAADC_INTEN_CH0LIMITL_Min (0x0UL)
  #define SAADC_INTEN_CH0LIMITL_Max (0x1UL)
  #define SAADC_INTEN_CH0LIMITL_Disabled (0x0UL)
  #define SAADC_INTEN_CH0LIMITL_Enabled (0x1UL)

