pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH1LIMITH @Bit 8 : Enable or disable interrupt for event CH1LIMITH */
  #define SAADC_INTEN_CH1LIMITH_Pos (8UL)
  #define SAADC_INTEN_CH1LIMITH_Msk (0x1UL << SAADC_INTEN_CH1LIMITH_Pos)
  #define SAADC_INTEN_CH1LIMITH_Min (0x0UL)
  #define SAADC_INTEN_CH1LIMITH_Max (0x1UL)
  #define SAADC_INTEN_CH1LIMITH_Disabled (0x0UL)
  #define SAADC_INTEN_CH1LIMITH_Enabled (0x1UL)

/* CH1LIMITL @Bit 9 : Enable or disable interrupt for event CH1LIMITL */
  #define SAADC_INTEN_CH1LIMITL_Pos (9UL)
  #define SAADC_INTEN_CH1LIMITL_Msk (0x1UL << SAADC_INTEN_CH1LIMITL_Pos)
  #define SAADC_INTEN_CH1LIMITL_Min (0x0UL)
  #define SAADC_INTEN_CH1LIMITL_Max (0x1UL)
  #define SAADC_INTEN_CH1LIMITL_Disabled (0x0UL)
  #define SAADC_INTEN_CH1LIMITL_Enabled (0x1UL)

/* CH2LIMITH @Bit 10 : Enable or disable interrupt for event CH2LIMITH */
  #define SAADC_INTEN_CH2LIMITH_Pos (10UL)
  #define SAADC_INTEN_CH2LIMITH_Msk (0x1UL << SAADC_INTEN_CH2LIMITH_Pos)
  #define SAADC_INTEN_CH2LIMITH_Min (0x0UL)
  #define SAADC_INTEN_CH2LIMITH_Max (0x1UL)
  #define SAADC_INTEN_CH2LIMITH_Disabled (0x0UL)
  #define SAADC_INTEN_CH2LIMITH_Enabled (0x1UL)

/* CH2LIMITL @Bit 11 : Enable or disable interrupt for event CH2LIMITL */
  #define SAADC_INTEN_CH2LIMITL_Pos (11UL)
  #define SAADC_INTEN_CH2LIMITL_Msk (0x1UL << SAADC_INTEN_CH2LIMITL_Pos)
  #define SAADC_INTEN_CH2LIMITL_Min (0x0UL)
  #define SAADC_INTEN_CH2LIMITL_Max (0x1UL)
  #define SAADC_INTEN_CH2LIMITL_Disabled (0x0UL)
  #define SAADC_INTEN_CH2LIMITL_Enabled (0x1UL)

/* CH3LIMITH @Bit 12 : Enable or disable interrupt for event CH3LIMITH */
  #define SAADC_INTEN_CH3LIMITH_Pos (12UL)
  #define SAADC_INTEN_CH3LIMITH_Msk (0x1UL << SAADC_INTEN_CH3LIMITH_Pos)
  #define SAADC_INTEN_CH3LIMITH_Min (0x0UL)
  #define SAADC_INTEN_CH3LIMITH_Max (0x1UL)
  #define SAADC_INTEN_CH3LIMITH_Disabled (0x0UL)
  #define SAADC_INTEN_CH3LIMITH_Enabled (0x1UL)

/* CH3LIMITL @Bit 13 : Enable or disable interrupt for event CH3LIMITL */
  #define SAADC_INTEN_CH3LIMITL_Pos (13UL)
  #define SAADC_INTEN_CH3LIMITL_Msk (0x1UL << SAADC_INTEN_CH3LIMITL_Pos)
  #define SAADC_INTEN_CH3LIMITL_Min (0x0UL)
  #define SAADC_INTEN_CH3LIMITL_Max (0x1UL)
  #define SAADC_INTEN_CH3LIMITL_Disabled (0x0UL)
  #define SAADC_INTEN_CH3LIMITL_Enabled (0x1UL)

/* CH4LIMITH @Bit 14 : Enable or disable interrupt for event CH4LIMITH */
  #define SAADC_INTEN_CH4LIMITH_Pos (14UL)
  #define SAADC_INTEN_CH4LIMITH_Msk (0x1UL << SAADC_INTEN_CH4LIMITH_Pos)
  #define SAADC_INTEN_CH4LIMITH_Min (0x0UL)
  #define SAADC_INTEN_CH4LIMITH_Max (0x1UL)
  #define SAADC_INTEN_CH4LIMITH_Disabled (0x0UL)
  #define SAADC_INTEN_CH4LIMITH_Enabled (0x1UL)

/* CH4LIMITL @Bit 15 : Enable or disable interrupt for event CH4LIMITL */
  #define SAADC_INTEN_CH4LIMITL_Pos (15UL)
  #define SAADC_INTEN_CH4LIMITL_Msk (0x1UL << SAADC_INTEN_CH4LIMITL_Pos)
  #define SAADC_INTEN_CH4LIMITL_Min (0x0UL)
  #define SAADC_INTEN_CH4LIMITL_Max (0x1UL)
  #define SAADC_INTEN_CH4LIMITL_Disabled (0x0UL)
  #define SAADC_INTEN_CH4LIMITL_Enabled (0x1UL)

/* CH5LIMITH @Bit 16 : Enable or disable interrupt for event CH5LIMITH */
  #define SAADC_INTEN_CH5LIMITH_Pos (16UL)
  #define SAADC_INTEN_CH5LIMITH_Msk (0x1UL << SAADC_INTEN_CH5LIMITH_Pos)
  #define SAADC_INTEN_CH5LIMITH_Min (0x0UL)
  #define SAADC_INTEN_CH5LIMITH_Max (0x1UL)
  #define SAADC_INTEN_CH5LIMITH_Disabled (0x0UL)
  #define SAADC_INTEN_CH5LIMITH_Enabled (0x1UL)

/* CH5LIMITL @Bit 17 : Enable or disable interrupt for event CH5LIMITL */
  #define SAADC_INTEN_CH5LIMITL_Pos (17UL)
  #define SAADC_INTEN_CH5LIMITL_Msk (0x1UL << SAADC_INTEN_CH5LIMITL_Pos)
  #define SAADC_INTEN_CH5LIMITL_Min (0x0UL)
  #define SAADC_INTEN_CH5LIMITL_Max (0x1UL)
  #define SAADC_INTEN_CH5LIMITL_Disabled (0x0UL)
  #define SAADC_INTEN_CH5LIMITL_Enabled (0x1UL)

/* CH6LIMITH @Bit 18 : Enable or disable interrupt for event CH6LIMITH */
  #define SAADC_INTEN_CH6LIMITH_Pos (18UL)
  #define SAADC_INTEN_CH6LIMITH_Msk (0x1UL << SAADC_INTEN_CH6LIMITH_Pos)
  #define SAADC_INTEN_CH6LIMITH_Min (0x0UL)
  #define SAADC_INTEN_CH6LIMITH_Max (0x1UL)
  #define SAADC_INTEN_CH6LIMITH_Disabled (0x0UL)
  #define SAADC_INTEN_CH6LIMITH_Enabled (0x1UL)

/* CH6LIMITL @Bit 19 : Enable or disable interrupt for event CH6LIMITL */
  #define SAADC_INTEN_CH6LIMITL_Pos (19UL)
  #define SAADC_INTEN_CH6LIMITL_Msk (0x1UL << SAADC_INTEN_CH6LIMITL_Pos)
  #define SAADC_INTEN_CH6LIMITL_Min (0x0UL)
  #define SAADC_INTEN_CH6LIMITL_Max (0x1UL)
  #define SAADC_INTEN_CH6LIMITL_Disabled (0x0UL)
  #define SAADC_INTEN_CH6LIMITL_Enabled (0x1UL)

/* CH7LIMITH @Bit 20 : Enable or disable interrupt for event CH7LIMITH */
  #define SAADC_INTEN_CH7LIMITH_Pos (20UL)
  #define SAADC_INTEN_CH7LIMITH_Msk (0x1UL << SAADC_INTEN_CH7LIMITH_Pos)
  #define SAADC_INTEN_CH7LIMITH_Min (0x0UL)
  #define SAADC_INTEN_CH7LIMITH_Max (0x1UL)
  #define SAADC_INTEN_CH7LIMITH_Disabled (0x0UL)
  #define SAADC_INTEN_CH7LIMITH_Enabled (0x1UL)

/* CH7LIMITL @Bit 21 : Enable or disable interrupt for event CH7LIMITL */
  #define SAADC_INTEN_CH7LIMITL_Pos (21UL)
  #define SAADC_INTEN_CH7LIMITL_Msk (0x1UL << SAADC_INTEN_CH7LIMITL_Pos)
  #define SAADC_INTEN_CH7LIMITL_Min (0x0UL)
  #define SAADC_INTEN_CH7LIMITL_Max (0x1UL)
  #define SAADC_INTEN_CH7LIMITL_Disabled (0x0UL)
  #define SAADC_INTEN_CH7LIMITL_Enabled (0x1UL)


/* SAADC_INTENSET: Enable interrupt */
  #define SAADC_INTENSET_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Write '1' to enable interrupt for event STARTED */
  #define SAADC_INTENSET_STARTED_Pos (0UL)
  #define SAADC_INTENSET_STARTED_Msk (0x1UL << SAADC_INTENSET_STARTED_Pos)
  #define SAADC_INTENSET_STARTED_Min (0x0UL)
  #define SAADC_INTENSET_STARTED_Max (0x1UL)
  #define SAADC_INTENSET_STARTED_Set (0x1UL)
  #define SAADC_INTENSET_STARTED_Disabled (0x0UL)
  #define SAADC_INTENSET_STARTED_Enabled (0x1UL)

/* END @Bit 1 : Write '1' to enable interrupt for event END */
  #define SAADC_INTENSET_END_Pos (1UL)
  #define SAADC_INTENSET_END_Msk (0x1UL << SAADC_INTENSET_END_Pos)
  #define SAADC_INTENSET_END_Min (0x0UL)
  #define SAADC_INTENSET_END_Max (0x1UL)
  #define SAADC_INTENSET_END_Set (0x1UL)
  #define SAADC_INTENSET_END_Disabled (0x0UL)
  #define SAADC_INTENSET_END_Enabled (0x1UL)

