pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DONE @Bit 2 : Write '1' to enable interrupt for event DONE */
  #define SAADC_INTENSET_DONE_Pos (2UL)
  #define SAADC_INTENSET_DONE_Msk (0x1UL << SAADC_INTENSET_DONE_Pos)
  #define SAADC_INTENSET_DONE_Min (0x0UL)
  #define SAADC_INTENSET_DONE_Max (0x1UL)
  #define SAADC_INTENSET_DONE_Set (0x1UL)
  #define SAADC_INTENSET_DONE_Disabled (0x0UL)
  #define SAADC_INTENSET_DONE_Enabled (0x1UL)

/* RESULTDONE @Bit 3 : Write '1' to enable interrupt for event RESULTDONE */
  #define SAADC_INTENSET_RESULTDONE_Pos (3UL)
  #define SAADC_INTENSET_RESULTDONE_Msk (0x1UL << SAADC_INTENSET_RESULTDONE_Pos)
  #define SAADC_INTENSET_RESULTDONE_Min (0x0UL)
  #define SAADC_INTENSET_RESULTDONE_Max (0x1UL)
  #define SAADC_INTENSET_RESULTDONE_Set (0x1UL)
  #define SAADC_INTENSET_RESULTDONE_Disabled (0x0UL)
  #define SAADC_INTENSET_RESULTDONE_Enabled (0x1UL)

/* CALIBRATEDONE @Bit 4 : Write '1' to enable interrupt for event CALIBRATEDONE */
  #define SAADC_INTENSET_CALIBRATEDONE_Pos (4UL)
  #define SAADC_INTENSET_CALIBRATEDONE_Msk (0x1UL << SAADC_INTENSET_CALIBRATEDONE_Pos)
  #define SAADC_INTENSET_CALIBRATEDONE_Min (0x0UL)
  #define SAADC_INTENSET_CALIBRATEDONE_Max (0x1UL)
  #define SAADC_INTENSET_CALIBRATEDONE_Set (0x1UL)
  #define SAADC_INTENSET_CALIBRATEDONE_Disabled (0x0UL)
  #define SAADC_INTENSET_CALIBRATEDONE_Enabled (0x1UL)

/* STOPPED @Bit 5 : Write '1' to enable interrupt for event STOPPED */
  #define SAADC_INTENSET_STOPPED_Pos (5UL)
  #define SAADC_INTENSET_STOPPED_Msk (0x1UL << SAADC_INTENSET_STOPPED_Pos)
  #define SAADC_INTENSET_STOPPED_Min (0x0UL)
  #define SAADC_INTENSET_STOPPED_Max (0x1UL)
  #define SAADC_INTENSET_STOPPED_Set (0x1UL)
  #define SAADC_INTENSET_STOPPED_Disabled (0x0UL)
  #define SAADC_INTENSET_STOPPED_Enabled (0x1UL)

/* CH0LIMITH @Bit 6 : Write '1' to enable interrupt for event CH0LIMITH */
  #define SAADC_INTENSET_CH0LIMITH_Pos (6UL)
  #define SAADC_INTENSET_CH0LIMITH_Msk (0x1UL << SAADC_INTENSET_CH0LIMITH_Pos)
  #define SAADC_INTENSET_CH0LIMITH_Min (0x0UL)
  #define SAADC_INTENSET_CH0LIMITH_Max (0x1UL)
  #define SAADC_INTENSET_CH0LIMITH_Set (0x1UL)
  #define SAADC_INTENSET_CH0LIMITH_Disabled (0x0UL)
  #define SAADC_INTENSET_CH0LIMITH_Enabled (0x1UL)

/* CH0LIMITL @Bit 7 : Write '1' to enable interrupt for event CH0LIMITL */
  #define SAADC_INTENSET_CH0LIMITL_Pos (7UL)
  #define SAADC_INTENSET_CH0LIMITL_Msk (0x1UL << SAADC_INTENSET_CH0LIMITL_Pos)
  #define SAADC_INTENSET_CH0LIMITL_Min (0x0UL)
  #define SAADC_INTENSET_CH0LIMITL_Max (0x1UL)
  #define SAADC_INTENSET_CH0LIMITL_Set (0x1UL)
  #define SAADC_INTENSET_CH0LIMITL_Disabled (0x0UL)
  #define SAADC_INTENSET_CH0LIMITL_Enabled (0x1UL)

/* CH1LIMITH @Bit 8 : Write '1' to enable interrupt for event CH1LIMITH */
  #define SAADC_INTENSET_CH1LIMITH_Pos (8UL)
  #define SAADC_INTENSET_CH1LIMITH_Msk (0x1UL << SAADC_INTENSET_CH1LIMITH_Pos)
  #define SAADC_INTENSET_CH1LIMITH_Min (0x0UL)
  #define SAADC_INTENSET_CH1LIMITH_Max (0x1UL)
  #define SAADC_INTENSET_CH1LIMITH_Set (0x1UL)
  #define SAADC_INTENSET_CH1LIMITH_Disabled (0x0UL)
  #define SAADC_INTENSET_CH1LIMITH_Enabled (0x1UL)

/* CH1LIMITL @Bit 9 : Write '1' to enable interrupt for event CH1LIMITL */
  #define SAADC_INTENSET_CH1LIMITL_Pos (9UL)
  #define SAADC_INTENSET_CH1LIMITL_Msk (0x1UL << SAADC_INTENSET_CH1LIMITL_Pos)
  #define SAADC_INTENSET_CH1LIMITL_Min (0x0UL)
  #define SAADC_INTENSET_CH1LIMITL_Max (0x1UL)
  #define SAADC_INTENSET_CH1LIMITL_Set (0x1UL)
  #define SAADC_INTENSET_CH1LIMITL_Disabled (0x0UL)
  #define SAADC_INTENSET_CH1LIMITL_Enabled (0x1UL)

/* CH2LIMITH @Bit 10 : Write '1' to enable interrupt for event CH2LIMITH */
  #define SAADC_INTENSET_CH2LIMITH_Pos (10UL)
  #define SAADC_INTENSET_CH2LIMITH_Msk (0x1UL << SAADC_INTENSET_CH2LIMITH_Pos)
  #define SAADC_INTENSET_CH2LIMITH_Min (0x0UL)
  #define SAADC_INTENSET_CH2LIMITH_Max (0x1UL)
  #define SAADC_INTENSET_CH2LIMITH_Set (0x1UL)
  #define SAADC_INTENSET_CH2LIMITH_Disabled (0x0UL)
  #define SAADC_INTENSET_CH2LIMITH_Enabled (0x1UL)

/* CH2LIMITL @Bit 11 : Write '1' to enable interrupt for event CH2LIMITL */
  #define SAADC_INTENSET_CH2LIMITL_Pos (11UL)
  #define SAADC_INTENSET_CH2LIMITL_Msk (0x1UL << SAADC_INTENSET_CH2LIMITL_Pos)
  #define SAADC_INTENSET_CH2LIMITL_Min (0x0UL)
  #define SAADC_INTENSET_CH2LIMITL_Max (0x1UL)
  #define SAADC_INTENSET_CH2LIMITL_Set (0x1UL)
  #define SAADC_INTENSET_CH2LIMITL_Disabled (0x0UL)
  #define SAADC_INTENSET_CH2LIMITL_Enabled (0x1UL)

/* CH3LIMITH @Bit 12 : Write '1' to enable interrupt for event CH3LIMITH */
  #define SAADC_INTENSET_CH3LIMITH_Pos (12UL)
  #define SAADC_INTENSET_CH3LIMITH_Msk (0x1UL << SAADC_INTENSET_CH3LIMITH_Pos)
  #define SAADC_INTENSET_CH3LIMITH_Min (0x0UL)
  #define SAADC_INTENSET_CH3LIMITH_Max (0x1UL)
  #define SAADC_INTENSET_CH3LIMITH_Set (0x1UL)
  #define SAADC_INTENSET_CH3LIMITH_Disabled (0x0UL)
  #define SAADC_INTENSET_CH3LIMITH_Enabled (0x1UL)

/* CH3LIMITL @Bit 13 : Write '1' to enable interrupt for event CH3LIMITL */
  #define SAADC_INTENSET_CH3LIMITL_Pos (13UL)
  #define SAADC_INTENSET_CH3LIMITL_Msk (0x1UL << SAADC_INTENSET_CH3LIMITL_Pos)
  #define SAADC_INTENSET_CH3LIMITL_Min (0x0UL)
  #define SAADC_INTENSET_CH3LIMITL_Max (0x1UL)
  #define SAADC_INTENSET_CH3LIMITL_Set (0x1UL)
  #define SAADC_INTENSET_CH3LIMITL_Disabled (0x0UL)
  #define SAADC_INTENSET_CH3LIMITL_Enabled (0x1UL)

/* CH4LIMITH @Bit 14 : Write '1' to enable interrupt for event CH4LIMITH */
  #define SAADC_INTENSET_CH4LIMITH_Pos (14UL)
  #define SAADC_INTENSET_CH4LIMITH_Msk (0x1UL << SAADC_INTENSET_CH4LIMITH_Pos)
  #define SAADC_INTENSET_CH4LIMITH_Min (0x0UL)
  #define SAADC_INTENSET_CH4LIMITH_Max (0x1UL)
  #define SAADC_INTENSET_CH4LIMITH_Set (0x1UL)
  #define SAADC_INTENSET_CH4LIMITH_Disabled (0x0UL)
  #define SAADC_INTENSET_CH4LIMITH_Enabled (0x1UL)

/* CH4LIMITL @Bit 15 : Write '1' to enable interrupt for event CH4LIMITL */
  #define SAADC_INTENSET_CH4LIMITL_Pos (15UL)
  #define SAADC_INTENSET_CH4LIMITL_Msk (0x1UL << SAADC_INTENSET_CH4LIMITL_Pos)
  #define SAADC_INTENSET_CH4LIMITL_Min (0x0UL)
  #define SAADC_INTENSET_CH4LIMITL_Max (0x1UL)
  #define SAADC_INTENSET_CH4LIMITL_Set (0x1UL)
  #define SAADC_INTENSET_CH4LIMITL_Disabled (0x0UL)
  #define SAADC_INTENSET_CH4LIMITL_Enabled (0x1UL)

/* CH5LIMITH @Bit 16 : Write '1' to enable interrupt for event CH5LIMITH */
  #define SAADC_INTENSET_CH5LIMITH_Pos (16UL)
  #define SAADC_INTENSET_CH5LIMITH_Msk (0x1UL << SAADC_INTENSET_CH5LIMITH_Pos)
  #define SAADC_INTENSET_CH5LIMITH_Min (0x0UL)
  #define SAADC_INTENSET_CH5LIMITH_Max (0x1UL)
  #define SAADC_INTENSET_CH5LIMITH_Set (0x1UL)
  #define SAADC_INTENSET_CH5LIMITH_Disabled (0x0UL)
  #define SAADC_INTENSET_CH5LIMITH_Enabled (0x1UL)

/* CH5LIMITL @Bit 17 : Write '1' to enable interrupt for event CH5LIMITL */
  #define SAADC_INTENSET_CH5LIMITL_Pos (17UL)
  #define SAADC_INTENSET_CH5LIMITL_Msk (0x1UL << SAADC_INTENSET_CH5LIMITL_Pos)
  #define SAADC_INTENSET_CH5LIMITL_Min (0x0UL)
  #define SAADC_INTENSET_CH5LIMITL_Max (0x1UL)
  #define SAADC_INTENSET_CH5LIMITL_Set (0x1UL)
  #define SAADC_INTENSET_CH5LIMITL_Disabled (0x0UL)
  #define SAADC_INTENSET_CH5LIMITL_Enabled (0x1UL)

/* CH6LIMITH @Bit 18 : Write '1' to enable interrupt for event CH6LIMITH */
  #define SAADC_INTENSET_CH6LIMITH_Pos (18UL)
  #define SAADC_INTENSET_CH6LIMITH_Msk (0x1UL << SAADC_INTENSET_CH6LIMITH_Pos)
  #define SAADC_INTENSET_CH6LIMITH_Min (0x0UL)
  #define SAADC_INTENSET_CH6LIMITH_Max (0x1UL)
  #define SAADC_INTENSET_CH6LIMITH_Set (0x1UL)
  #define SAADC_INTENSET_CH6LIMITH_Disabled (0x0UL)
  #define SAADC_INTENSET_CH6LIMITH_Enabled (0x1UL)

/* CH6LIMITL @Bit 19 : Write '1' to enable interrupt for event CH6LIMITL */
  #define SAADC_INTENSET_CH6LIMITL_Pos (19UL)
  #define SAADC_INTENSET_CH6LIMITL_Msk (0x1UL << SAADC_INTENSET_CH6LIMITL_Pos)
  #define SAADC_INTENSET_CH6LIMITL_Min (0x0UL)
  #define SAADC_INTENSET_CH6LIMITL_Max (0x1UL)
  #define SAADC_INTENSET_CH6LIMITL_Set (0x1UL)
  #define SAADC_INTENSET_CH6LIMITL_Disabled (0x0UL)
  #define SAADC_INTENSET_CH6LIMITL_Enabled (0x1UL)

