pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH7LIMITH @Bit 20 : Write '1' to enable interrupt for event CH7LIMITH */
  #define SAADC_INTENSET_CH7LIMITH_Pos (20UL)
  #define SAADC_INTENSET_CH7LIMITH_Msk (0x1UL << SAADC_INTENSET_CH7LIMITH_Pos)
  #define SAADC_INTENSET_CH7LIMITH_Min (0x0UL)
  #define SAADC_INTENSET_CH7LIMITH_Max (0x1UL)
  #define SAADC_INTENSET_CH7LIMITH_Set (0x1UL)
  #define SAADC_INTENSET_CH7LIMITH_Disabled (0x0UL)
  #define SAADC_INTENSET_CH7LIMITH_Enabled (0x1UL)

/* CH7LIMITL @Bit 21 : Write '1' to enable interrupt for event CH7LIMITL */
  #define SAADC_INTENSET_CH7LIMITL_Pos (21UL)
  #define SAADC_INTENSET_CH7LIMITL_Msk (0x1UL << SAADC_INTENSET_CH7LIMITL_Pos)
  #define SAADC_INTENSET_CH7LIMITL_Min (0x0UL)
  #define SAADC_INTENSET_CH7LIMITL_Max (0x1UL)
  #define SAADC_INTENSET_CH7LIMITL_Set (0x1UL)
  #define SAADC_INTENSET_CH7LIMITL_Disabled (0x0UL)
  #define SAADC_INTENSET_CH7LIMITL_Enabled (0x1UL)


/* SAADC_INTENCLR: Disable interrupt */
  #define SAADC_INTENCLR_ResetValue (0x00000000UL)

/* STARTED @Bit 0 : Write '1' to disable interrupt for event STARTED */
  #define SAADC_INTENCLR_STARTED_Pos (0UL)
  #define SAADC_INTENCLR_STARTED_Msk (0x1UL << SAADC_INTENCLR_STARTED_Pos)
  #define SAADC_INTENCLR_STARTED_Min (0x0UL)
  #define SAADC_INTENCLR_STARTED_Max (0x1UL)
  #define SAADC_INTENCLR_STARTED_Clear (0x1UL)
  #define SAADC_INTENCLR_STARTED_Disabled (0x0UL)
  #define SAADC_INTENCLR_STARTED_Enabled (0x1UL)

/* END @Bit 1 : Write '1' to disable interrupt for event END */
  #define SAADC_INTENCLR_END_Pos (1UL)
  #define SAADC_INTENCLR_END_Msk (0x1UL << SAADC_INTENCLR_END_Pos)
  #define SAADC_INTENCLR_END_Min (0x0UL)
  #define SAADC_INTENCLR_END_Max (0x1UL)
  #define SAADC_INTENCLR_END_Clear (0x1UL)
  #define SAADC_INTENCLR_END_Disabled (0x0UL)
  #define SAADC_INTENCLR_END_Enabled (0x1UL)

/* DONE @Bit 2 : Write '1' to disable interrupt for event DONE */
  #define SAADC_INTENCLR_DONE_Pos (2UL)
  #define SAADC_INTENCLR_DONE_Msk (0x1UL << SAADC_INTENCLR_DONE_Pos)
  #define SAADC_INTENCLR_DONE_Min (0x0UL)
  #define SAADC_INTENCLR_DONE_Max (0x1UL)
  #define SAADC_INTENCLR_DONE_Clear (0x1UL)
  #define SAADC_INTENCLR_DONE_Disabled (0x0UL)
  #define SAADC_INTENCLR_DONE_Enabled (0x1UL)

/* RESULTDONE @Bit 3 : Write '1' to disable interrupt for event RESULTDONE */
  #define SAADC_INTENCLR_RESULTDONE_Pos (3UL)
  #define SAADC_INTENCLR_RESULTDONE_Msk (0x1UL << SAADC_INTENCLR_RESULTDONE_Pos)
  #define SAADC_INTENCLR_RESULTDONE_Min (0x0UL)
  #define SAADC_INTENCLR_RESULTDONE_Max (0x1UL)
  #define SAADC_INTENCLR_RESULTDONE_Clear (0x1UL)
  #define SAADC_INTENCLR_RESULTDONE_Disabled (0x0UL)
  #define SAADC_INTENCLR_RESULTDONE_Enabled (0x1UL)

/* CALIBRATEDONE @Bit 4 : Write '1' to disable interrupt for event CALIBRATEDONE */
  #define SAADC_INTENCLR_CALIBRATEDONE_Pos (4UL)
  #define SAADC_INTENCLR_CALIBRATEDONE_Msk (0x1UL << SAADC_INTENCLR_CALIBRATEDONE_Pos)
  #define SAADC_INTENCLR_CALIBRATEDONE_Min (0x0UL)
  #define SAADC_INTENCLR_CALIBRATEDONE_Max (0x1UL)
  #define SAADC_INTENCLR_CALIBRATEDONE_Clear (0x1UL)
  #define SAADC_INTENCLR_CALIBRATEDONE_Disabled (0x0UL)
  #define SAADC_INTENCLR_CALIBRATEDONE_Enabled (0x1UL)

/* STOPPED @Bit 5 : Write '1' to disable interrupt for event STOPPED */
  #define SAADC_INTENCLR_STOPPED_Pos (5UL)
  #define SAADC_INTENCLR_STOPPED_Msk (0x1UL << SAADC_INTENCLR_STOPPED_Pos)
  #define SAADC_INTENCLR_STOPPED_Min (0x0UL)
  #define SAADC_INTENCLR_STOPPED_Max (0x1UL)
  #define SAADC_INTENCLR_STOPPED_Clear (0x1UL)
  #define SAADC_INTENCLR_STOPPED_Disabled (0x0UL)
  #define SAADC_INTENCLR_STOPPED_Enabled (0x1UL)

/* CH0LIMITH @Bit 6 : Write '1' to disable interrupt for event CH0LIMITH */
  #define SAADC_INTENCLR_CH0LIMITH_Pos (6UL)
  #define SAADC_INTENCLR_CH0LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH0LIMITH_Pos)
  #define SAADC_INTENCLR_CH0LIMITH_Min (0x0UL)
  #define SAADC_INTENCLR_CH0LIMITH_Max (0x1UL)
  #define SAADC_INTENCLR_CH0LIMITH_Clear (0x1UL)
  #define SAADC_INTENCLR_CH0LIMITH_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH0LIMITH_Enabled (0x1UL)

/* CH0LIMITL @Bit 7 : Write '1' to disable interrupt for event CH0LIMITL */
  #define SAADC_INTENCLR_CH0LIMITL_Pos (7UL)
  #define SAADC_INTENCLR_CH0LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH0LIMITL_Pos)
  #define SAADC_INTENCLR_CH0LIMITL_Min (0x0UL)
  #define SAADC_INTENCLR_CH0LIMITL_Max (0x1UL)
  #define SAADC_INTENCLR_CH0LIMITL_Clear (0x1UL)
  #define SAADC_INTENCLR_CH0LIMITL_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH0LIMITL_Enabled (0x1UL)

/* CH1LIMITH @Bit 8 : Write '1' to disable interrupt for event CH1LIMITH */
  #define SAADC_INTENCLR_CH1LIMITH_Pos (8UL)
  #define SAADC_INTENCLR_CH1LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH1LIMITH_Pos)
  #define SAADC_INTENCLR_CH1LIMITH_Min (0x0UL)
  #define SAADC_INTENCLR_CH1LIMITH_Max (0x1UL)
  #define SAADC_INTENCLR_CH1LIMITH_Clear (0x1UL)
  #define SAADC_INTENCLR_CH1LIMITH_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH1LIMITH_Enabled (0x1UL)

/* CH1LIMITL @Bit 9 : Write '1' to disable interrupt for event CH1LIMITL */
  #define SAADC_INTENCLR_CH1LIMITL_Pos (9UL)
  #define SAADC_INTENCLR_CH1LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH1LIMITL_Pos)
  #define SAADC_INTENCLR_CH1LIMITL_Min (0x0UL)
  #define SAADC_INTENCLR_CH1LIMITL_Max (0x1UL)
  #define SAADC_INTENCLR_CH1LIMITL_Clear (0x1UL)
  #define SAADC_INTENCLR_CH1LIMITL_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH1LIMITL_Enabled (0x1UL)

/* CH2LIMITH @Bit 10 : Write '1' to disable interrupt for event CH2LIMITH */
  #define SAADC_INTENCLR_CH2LIMITH_Pos (10UL)
  #define SAADC_INTENCLR_CH2LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH2LIMITH_Pos)
  #define SAADC_INTENCLR_CH2LIMITH_Min (0x0UL)
  #define SAADC_INTENCLR_CH2LIMITH_Max (0x1UL)
  #define SAADC_INTENCLR_CH2LIMITH_Clear (0x1UL)
  #define SAADC_INTENCLR_CH2LIMITH_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH2LIMITH_Enabled (0x1UL)

/* CH2LIMITL @Bit 11 : Write '1' to disable interrupt for event CH2LIMITL */
  #define SAADC_INTENCLR_CH2LIMITL_Pos (11UL)
  #define SAADC_INTENCLR_CH2LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH2LIMITL_Pos)
  #define SAADC_INTENCLR_CH2LIMITL_Min (0x0UL)
  #define SAADC_INTENCLR_CH2LIMITL_Max (0x1UL)
  #define SAADC_INTENCLR_CH2LIMITL_Clear (0x1UL)
  #define SAADC_INTENCLR_CH2LIMITL_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH2LIMITL_Enabled (0x1UL)

/* CH3LIMITH @Bit 12 : Write '1' to disable interrupt for event CH3LIMITH */
  #define SAADC_INTENCLR_CH3LIMITH_Pos (12UL)
  #define SAADC_INTENCLR_CH3LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH3LIMITH_Pos)
  #define SAADC_INTENCLR_CH3LIMITH_Min (0x0UL)
  #define SAADC_INTENCLR_CH3LIMITH_Max (0x1UL)
  #define SAADC_INTENCLR_CH3LIMITH_Clear (0x1UL)
  #define SAADC_INTENCLR_CH3LIMITH_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH3LIMITH_Enabled (0x1UL)

/* CH3LIMITL @Bit 13 : Write '1' to disable interrupt for event CH3LIMITL */
  #define SAADC_INTENCLR_CH3LIMITL_Pos (13UL)
  #define SAADC_INTENCLR_CH3LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH3LIMITL_Pos)
  #define SAADC_INTENCLR_CH3LIMITL_Min (0x0UL)
  #define SAADC_INTENCLR_CH3LIMITL_Max (0x1UL)
  #define SAADC_INTENCLR_CH3LIMITL_Clear (0x1UL)
  #define SAADC_INTENCLR_CH3LIMITL_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH3LIMITL_Enabled (0x1UL)

