pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH4LIMITH @Bit 14 : Write '1' to disable interrupt for event CH4LIMITH */
  #define SAADC_INTENCLR_CH4LIMITH_Pos (14UL)
  #define SAADC_INTENCLR_CH4LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH4LIMITH_Pos)
  #define SAADC_INTENCLR_CH4LIMITH_Min (0x0UL)
  #define SAADC_INTENCLR_CH4LIMITH_Max (0x1UL)
  #define SAADC_INTENCLR_CH4LIMITH_Clear (0x1UL)
  #define SAADC_INTENCLR_CH4LIMITH_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH4LIMITH_Enabled (0x1UL)

/* CH4LIMITL @Bit 15 : Write '1' to disable interrupt for event CH4LIMITL */
  #define SAADC_INTENCLR_CH4LIMITL_Pos (15UL)
  #define SAADC_INTENCLR_CH4LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH4LIMITL_Pos)
  #define SAADC_INTENCLR_CH4LIMITL_Min (0x0UL)
  #define SAADC_INTENCLR_CH4LIMITL_Max (0x1UL)
  #define SAADC_INTENCLR_CH4LIMITL_Clear (0x1UL)
  #define SAADC_INTENCLR_CH4LIMITL_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH4LIMITL_Enabled (0x1UL)

/* CH5LIMITH @Bit 16 : Write '1' to disable interrupt for event CH5LIMITH */
  #define SAADC_INTENCLR_CH5LIMITH_Pos (16UL)
  #define SAADC_INTENCLR_CH5LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH5LIMITH_Pos)
  #define SAADC_INTENCLR_CH5LIMITH_Min (0x0UL)
  #define SAADC_INTENCLR_CH5LIMITH_Max (0x1UL)
  #define SAADC_INTENCLR_CH5LIMITH_Clear (0x1UL)
  #define SAADC_INTENCLR_CH5LIMITH_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH5LIMITH_Enabled (0x1UL)

/* CH5LIMITL @Bit 17 : Write '1' to disable interrupt for event CH5LIMITL */
  #define SAADC_INTENCLR_CH5LIMITL_Pos (17UL)
  #define SAADC_INTENCLR_CH5LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH5LIMITL_Pos)
  #define SAADC_INTENCLR_CH5LIMITL_Min (0x0UL)
  #define SAADC_INTENCLR_CH5LIMITL_Max (0x1UL)
  #define SAADC_INTENCLR_CH5LIMITL_Clear (0x1UL)
  #define SAADC_INTENCLR_CH5LIMITL_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH5LIMITL_Enabled (0x1UL)

/* CH6LIMITH @Bit 18 : Write '1' to disable interrupt for event CH6LIMITH */
  #define SAADC_INTENCLR_CH6LIMITH_Pos (18UL)
  #define SAADC_INTENCLR_CH6LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH6LIMITH_Pos)
  #define SAADC_INTENCLR_CH6LIMITH_Min (0x0UL)
  #define SAADC_INTENCLR_CH6LIMITH_Max (0x1UL)
  #define SAADC_INTENCLR_CH6LIMITH_Clear (0x1UL)
  #define SAADC_INTENCLR_CH6LIMITH_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH6LIMITH_Enabled (0x1UL)

/* CH6LIMITL @Bit 19 : Write '1' to disable interrupt for event CH6LIMITL */
  #define SAADC_INTENCLR_CH6LIMITL_Pos (19UL)
  #define SAADC_INTENCLR_CH6LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH6LIMITL_Pos)
  #define SAADC_INTENCLR_CH6LIMITL_Min (0x0UL)
  #define SAADC_INTENCLR_CH6LIMITL_Max (0x1UL)
  #define SAADC_INTENCLR_CH6LIMITL_Clear (0x1UL)
  #define SAADC_INTENCLR_CH6LIMITL_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH6LIMITL_Enabled (0x1UL)

/* CH7LIMITH @Bit 20 : Write '1' to disable interrupt for event CH7LIMITH */
  #define SAADC_INTENCLR_CH7LIMITH_Pos (20UL)
  #define SAADC_INTENCLR_CH7LIMITH_Msk (0x1UL << SAADC_INTENCLR_CH7LIMITH_Pos)
  #define SAADC_INTENCLR_CH7LIMITH_Min (0x0UL)
  #define SAADC_INTENCLR_CH7LIMITH_Max (0x1UL)
  #define SAADC_INTENCLR_CH7LIMITH_Clear (0x1UL)
  #define SAADC_INTENCLR_CH7LIMITH_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH7LIMITH_Enabled (0x1UL)

/* CH7LIMITL @Bit 21 : Write '1' to disable interrupt for event CH7LIMITL */
  #define SAADC_INTENCLR_CH7LIMITL_Pos (21UL)
  #define SAADC_INTENCLR_CH7LIMITL_Msk (0x1UL << SAADC_INTENCLR_CH7LIMITL_Pos)
  #define SAADC_INTENCLR_CH7LIMITL_Min (0x0UL)
  #define SAADC_INTENCLR_CH7LIMITL_Max (0x1UL)
  #define SAADC_INTENCLR_CH7LIMITL_Clear (0x1UL)
  #define SAADC_INTENCLR_CH7LIMITL_Disabled (0x0UL)
  #define SAADC_INTENCLR_CH7LIMITL_Enabled (0x1UL)


/* SAADC_STATUS: Status */
  #define SAADC_STATUS_ResetValue (0x00000000UL)

/* STATUS @Bit 0 : Status */
  #define SAADC_STATUS_STATUS_Pos (0UL)
  #define SAADC_STATUS_STATUS_Msk (0x1UL << SAADC_STATUS_STATUS_Pos)
  #define SAADC_STATUS_STATUS_Min (0x0UL)
  #define SAADC_STATUS_STATUS_Max (0x1UL)
  #define SAADC_STATUS_STATUS_Ready (0x0UL)
  #define SAADC_STATUS_STATUS_Busy (0x1UL)


/* SAADC_ENABLE: Enable or disable ADC */
  #define SAADC_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : Enable or disable ADC */
  #define SAADC_ENABLE_ENABLE_Pos (0UL)
  #define SAADC_ENABLE_ENABLE_Msk (0x1UL << SAADC_ENABLE_ENABLE_Pos)
  #define SAADC_ENABLE_ENABLE_Min (0x0UL)
  #define SAADC_ENABLE_ENABLE_Max (0x1UL)
  #define SAADC_ENABLE_ENABLE_Disabled (0x0UL)
  #define SAADC_ENABLE_ENABLE_Enabled (0x1UL)


/* SAADC_RESOLUTION: Resolution configuration */
  #define SAADC_RESOLUTION_ResetValue (0x00000001UL)

/* VAL @Bits 0..2 : Set the resolution */
  #define SAADC_RESOLUTION_VAL_Pos (0UL)
  #define SAADC_RESOLUTION_VAL_Msk (0x7UL << SAADC_RESOLUTION_VAL_Pos)
  #define SAADC_RESOLUTION_VAL_Min (0x0UL)
  #define SAADC_RESOLUTION_VAL_Max (0x3UL)
  #define SAADC_RESOLUTION_VAL_8bit (0x0UL)
  #define SAADC_RESOLUTION_VAL_10bit (0x1UL)
  #define SAADC_RESOLUTION_VAL_12bit (0x2UL)
  #define SAADC_RESOLUTION_VAL_14bit (0x3UL)


/* SAADC_OVERSAMPLE: Oversampling configuration. OVERSAMPLE should not be combined with SCAN. The RESOLUTION is applied before
                      averaging, thus for high OVERSAMPLE a higher RESOLUTION should be used. */

  #define SAADC_OVERSAMPLE_ResetValue (0x00000000UL)

/* OVERSAMPLE @Bits 0..3 : Oversample control */
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Pos (0UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Msk (0xFUL << SAADC_OVERSAMPLE_OVERSAMPLE_Pos)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Min (0x0UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Max (0x8UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Bypass (0x0UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over2x (0x1UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over4x (0x2UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over8x (0x3UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over16x (0x4UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over32x (0x5UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over64x (0x6UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over128x (0x7UL)
  #define SAADC_OVERSAMPLE_OVERSAMPLE_Over256x (0x8UL)


/* SAADC_SAMPLERATE: Controls normal or continuous sample rate */
  #define SAADC_SAMPLERATE_ResetValue (0x00000000UL)

/* CC @Bits 0..10 : Capture and compare value. Sample rate is 16 MHz/CC */
  #define SAADC_SAMPLERATE_CC_Pos (0UL)
  #define SAADC_SAMPLERATE_CC_Msk (0x7FFUL << SAADC_SAMPLERATE_CC_Pos)
  #define SAADC_SAMPLERATE_CC_Min (0x004UL)
  #define SAADC_SAMPLERATE_CC_Max (0x7FFUL)

/* MODE @Bit 12 : Select mode for sample rate control */
  #define SAADC_SAMPLERATE_MODE_Pos (12UL)
  #define SAADC_SAMPLERATE_MODE_Msk (0x1UL << SAADC_SAMPLERATE_MODE_Pos)
  #define SAADC_SAMPLERATE_MODE_Min (0x0UL)
  #define SAADC_SAMPLERATE_MODE_Max (0x1UL)
  #define SAADC_SAMPLERATE_MODE_Task (0x0UL)
  #define SAADC_SAMPLERATE_MODE_Timers (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           SPIM                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct SPIM_TASKS_DMA_RX ================================================= */
/**
  * @brief RX [SPIM_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000000) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000010) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/
} NRF_SPIM_TASKS_DMA_RX_Type;

/* SPIM_TASKS_DMA_RX_ENABLEMATCH: Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register. */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_MaxCount (4UL)
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_MaxIndex (3UL)
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_MinIndex (0UL)
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ResetValue (0x00000000UL)

/* ENABLEMATCH @Bit 0 : Enables the MATCH[n] event by setting the ENABLE[n] bit in the CONFIG register. */
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Pos (0UL)
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Msk (0x1UL << SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Pos) /*!< Bit mask
                                                                            of ENABLEMATCH field.*/
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Min (0x1UL)
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Max (0x1UL)
  #define SPIM_TASKS_DMA_RX_ENABLEMATCH_ENABLEMATCH_Trigger (0x1UL)


