pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SPIM_PUBLISH_DMA_RX_READY: Publish configuration for event READY */
  #define SPIM_PUBLISH_DMA_RX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define SPIM_PUBLISH_DMA_RX_READY_CHIDX_Pos (0UL)
  #define SPIM_PUBLISH_DMA_RX_READY_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_DMA_RX_READY_CHIDX_Pos)
  #define SPIM_PUBLISH_DMA_RX_READY_CHIDX_Min (0x00UL)
  #define SPIM_PUBLISH_DMA_RX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_DMA_RX_READY_EN_Pos (31UL)
  #define SPIM_PUBLISH_DMA_RX_READY_EN_Msk (0x1UL << SPIM_PUBLISH_DMA_RX_READY_EN_Pos)
  #define SPIM_PUBLISH_DMA_RX_READY_EN_Min (0x0UL)
  #define SPIM_PUBLISH_DMA_RX_READY_EN_Max (0x1UL)
  #define SPIM_PUBLISH_DMA_RX_READY_EN_Disabled (0x0UL)
  #define SPIM_PUBLISH_DMA_RX_READY_EN_Enabled (0x1UL)


/* SPIM_PUBLISH_DMA_RX_BUSERROR: Publish configuration for event BUSERROR */
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos (0UL)
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_CHIDX_Min (0x00UL)
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_EN_Pos (31UL)
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_EN_Msk (0x1UL << SPIM_PUBLISH_DMA_RX_BUSERROR_EN_Pos)
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_EN_Min (0x0UL)
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_EN_Max (0x1UL)
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_EN_Disabled (0x0UL)
  #define SPIM_PUBLISH_DMA_RX_BUSERROR_EN_Enabled (0x1UL)


/* SPIM_PUBLISH_DMA_RX_MATCH: Publish configuration for event MATCH[n] */
  #define SPIM_PUBLISH_DMA_RX_MATCH_MaxCount (4UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_MaxIndex (3UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_MinIndex (0UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event MATCH[n] will publish to */
  #define SPIM_PUBLISH_DMA_RX_MATCH_CHIDX_Pos (0UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_DMA_RX_MATCH_CHIDX_Pos)
  #define SPIM_PUBLISH_DMA_RX_MATCH_CHIDX_Min (0x00UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_DMA_RX_MATCH_EN_Pos (31UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_EN_Msk (0x1UL << SPIM_PUBLISH_DMA_RX_MATCH_EN_Pos)
  #define SPIM_PUBLISH_DMA_RX_MATCH_EN_Min (0x0UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_EN_Max (0x1UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_EN_Disabled (0x0UL)
  #define SPIM_PUBLISH_DMA_RX_MATCH_EN_Enabled (0x1UL)



/* =============================================== Struct SPIM_PUBLISH_DMA_TX ================================================ */
/**
  * @brief TX [SPIM_PUBLISH_DMA_TX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;
  __IOM uint32_t  BUSERROR;
} NRF_SPIM_PUBLISH_DMA_TX_Type;

/* SPIM_PUBLISH_DMA_TX_END: Publish configuration for event END */
  #define SPIM_PUBLISH_DMA_TX_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define SPIM_PUBLISH_DMA_TX_END_CHIDX_Pos (0UL)
  #define SPIM_PUBLISH_DMA_TX_END_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_DMA_TX_END_CHIDX_Pos)
  #define SPIM_PUBLISH_DMA_TX_END_CHIDX_Min (0x00UL)
  #define SPIM_PUBLISH_DMA_TX_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_DMA_TX_END_EN_Pos (31UL)
  #define SPIM_PUBLISH_DMA_TX_END_EN_Msk (0x1UL << SPIM_PUBLISH_DMA_TX_END_EN_Pos)
  #define SPIM_PUBLISH_DMA_TX_END_EN_Min (0x0UL)
  #define SPIM_PUBLISH_DMA_TX_END_EN_Max (0x1UL)
  #define SPIM_PUBLISH_DMA_TX_END_EN_Disabled (0x0UL)
  #define SPIM_PUBLISH_DMA_TX_END_EN_Enabled (0x1UL)


/* SPIM_PUBLISH_DMA_TX_READY: Publish configuration for event READY */
  #define SPIM_PUBLISH_DMA_TX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define SPIM_PUBLISH_DMA_TX_READY_CHIDX_Pos (0UL)
  #define SPIM_PUBLISH_DMA_TX_READY_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_DMA_TX_READY_CHIDX_Pos)
  #define SPIM_PUBLISH_DMA_TX_READY_CHIDX_Min (0x00UL)
  #define SPIM_PUBLISH_DMA_TX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_DMA_TX_READY_EN_Pos (31UL)
  #define SPIM_PUBLISH_DMA_TX_READY_EN_Msk (0x1UL << SPIM_PUBLISH_DMA_TX_READY_EN_Pos)
  #define SPIM_PUBLISH_DMA_TX_READY_EN_Min (0x0UL)
  #define SPIM_PUBLISH_DMA_TX_READY_EN_Max (0x1UL)
  #define SPIM_PUBLISH_DMA_TX_READY_EN_Disabled (0x0UL)
  #define SPIM_PUBLISH_DMA_TX_READY_EN_Enabled (0x1UL)


/* SPIM_PUBLISH_DMA_TX_BUSERROR: Publish configuration for event BUSERROR */
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos (0UL)
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Msk (0xFFUL << SPIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Min (0x00UL)
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_EN_Pos (31UL)
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_EN_Msk (0x1UL << SPIM_PUBLISH_DMA_TX_BUSERROR_EN_Pos)
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_EN_Min (0x0UL)
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_EN_Max (0x1UL)
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_EN_Disabled (0x0UL)
  #define SPIM_PUBLISH_DMA_TX_BUSERROR_EN_Enabled (0x1UL)



/* ================================================= Struct SPIM_PUBLISH_DMA ================================================= */
/**
  * @brief PUBLISH_DMA [SPIM_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM NRF_SPIM_PUBLISH_DMA_RX_Type RX;
  __IOM NRF_SPIM_PUBLISH_DMA_TX_Type TX;
} NRF_SPIM_PUBLISH_DMA_Type;


/* ================================================== Struct SPIM_IFTIMING =================================================== */
/**
  * @brief IFTIMING [SPIM_IFTIMING] (unspecified)
  */
typedef struct {
  __IOM uint32_t  RXDELAY;
  __IOM uint32_t  CSNDUR;                            /*!< (@ 0x00000004) Minimum duration between edge of CSN and edge of SCK.
                                                                         When SHORTS.END_START is used, this is also the minimum
                                                                         duration CSN must stay high between transactions.*/
} NRF_SPIM_IFTIMING_Type;

/* SPIM_IFTIMING_RXDELAY: Sample delay for input serial data on MISO */
  #define SPIM_IFTIMING_RXDELAY_ResetValue (0x00000002UL)

