pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RXDELAY @Bits 0..2 : Sample delay for input serial data on MISO. The value specifies the number of SPIM core clock cycles
                        delay from the the sampling edge of SCK (leading edge for CONFIG.CPHA = 0, trailing edge for CONFIG.CPHA
                        = 1) until the input serial data is sampled. As en example, if RXDELAY = 0 and CONFIG.CPHA = 0, the
                        input serial data is sampled on the rising edge of SCK. */

  #define SPIM_IFTIMING_RXDELAY_RXDELAY_Pos (0UL)
  #define SPIM_IFTIMING_RXDELAY_RXDELAY_Msk (0x7UL << SPIM_IFTIMING_RXDELAY_RXDELAY_Pos)
  #define SPIM_IFTIMING_RXDELAY_RXDELAY_Min (0x0UL)
  #define SPIM_IFTIMING_RXDELAY_RXDELAY_Max (0x7UL)


/* SPIM_IFTIMING_CSNDUR: Minimum duration between edge of CSN and edge of SCK. When SHORTS.END_START is used, this is also the
                          minimum duration CSN must stay high between transactions. */

  #define SPIM_IFTIMING_CSNDUR_ResetValue (0x00000002UL)

/* CSNDUR @Bits 0..7 : Minimum duration between edge of CSN and edge of SCK. When SHORTS.END_START is used, this is the minimum
                       duration CSN must stay high between transactions. The value is specified in number of SPIM core clock
                       cycles. */

  #define SPIM_IFTIMING_CSNDUR_CSNDUR_Pos (0UL)
  #define SPIM_IFTIMING_CSNDUR_CSNDUR_Msk (0xFFUL << SPIM_IFTIMING_CSNDUR_CSNDUR_Pos)
  #define SPIM_IFTIMING_CSNDUR_CSNDUR_Min (0x00UL)
  #define SPIM_IFTIMING_CSNDUR_CSNDUR_Max (0xFFUL)



/* ==================================================== Struct SPIM_PSEL ===================================================== */
/**
  * @brief PSEL [SPIM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCK;
  __IOM uint32_t  MOSI;
  __IOM uint32_t  MISO;
  __IOM uint32_t  DCX;
  __IOM uint32_t  CSN[1];
} NRF_SPIM_PSEL_Type;

/* SPIM_PSEL_SCK: Pin select for SCK */
  #define SPIM_PSEL_SCK_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_SCK_PIN_Pos (0UL)
  #define SPIM_PSEL_SCK_PIN_Msk (0x1FUL << SPIM_PSEL_SCK_PIN_Pos)
  #define SPIM_PSEL_SCK_PIN_Min (0x00UL)
  #define SPIM_PSEL_SCK_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_SCK_PORT_Pos (5UL)
  #define SPIM_PSEL_SCK_PORT_Msk (0xFUL << SPIM_PSEL_SCK_PORT_Pos)
  #define SPIM_PSEL_SCK_PORT_Min (0x0UL)
  #define SPIM_PSEL_SCK_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_SCK_CONNECT_Pos (31UL)
  #define SPIM_PSEL_SCK_CONNECT_Msk (0x1UL << SPIM_PSEL_SCK_CONNECT_Pos)
  #define SPIM_PSEL_SCK_CONNECT_Min (0x0UL)
  #define SPIM_PSEL_SCK_CONNECT_Max (0x1UL)
  #define SPIM_PSEL_SCK_CONNECT_Disconnected (0x1UL)
  #define SPIM_PSEL_SCK_CONNECT_Connected (0x0UL)


/* SPIM_PSEL_MOSI: Pin select for MOSI signal */
  #define SPIM_PSEL_MOSI_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_MOSI_PIN_Pos (0UL)
  #define SPIM_PSEL_MOSI_PIN_Msk (0x1FUL << SPIM_PSEL_MOSI_PIN_Pos)
  #define SPIM_PSEL_MOSI_PIN_Min (0x00UL)
  #define SPIM_PSEL_MOSI_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_MOSI_PORT_Pos (5UL)
  #define SPIM_PSEL_MOSI_PORT_Msk (0xFUL << SPIM_PSEL_MOSI_PORT_Pos)
  #define SPIM_PSEL_MOSI_PORT_Min (0x0UL)
  #define SPIM_PSEL_MOSI_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_MOSI_CONNECT_Pos (31UL)
  #define SPIM_PSEL_MOSI_CONNECT_Msk (0x1UL << SPIM_PSEL_MOSI_CONNECT_Pos)
  #define SPIM_PSEL_MOSI_CONNECT_Min (0x0UL)
  #define SPIM_PSEL_MOSI_CONNECT_Max (0x1UL)
  #define SPIM_PSEL_MOSI_CONNECT_Disconnected (0x1UL)
  #define SPIM_PSEL_MOSI_CONNECT_Connected (0x0UL)


/* SPIM_PSEL_MISO: Pin select for MISO signal */
  #define SPIM_PSEL_MISO_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_MISO_PIN_Pos (0UL)
  #define SPIM_PSEL_MISO_PIN_Msk (0x1FUL << SPIM_PSEL_MISO_PIN_Pos)
  #define SPIM_PSEL_MISO_PIN_Min (0x00UL)
  #define SPIM_PSEL_MISO_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_MISO_PORT_Pos (5UL)
  #define SPIM_PSEL_MISO_PORT_Msk (0xFUL << SPIM_PSEL_MISO_PORT_Pos)
  #define SPIM_PSEL_MISO_PORT_Min (0x0UL)
  #define SPIM_PSEL_MISO_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_MISO_CONNECT_Pos (31UL)
  #define SPIM_PSEL_MISO_CONNECT_Msk (0x1UL << SPIM_PSEL_MISO_CONNECT_Pos)
  #define SPIM_PSEL_MISO_CONNECT_Min (0x0UL)
  #define SPIM_PSEL_MISO_CONNECT_Max (0x1UL)
  #define SPIM_PSEL_MISO_CONNECT_Disconnected (0x1UL)
  #define SPIM_PSEL_MISO_CONNECT_Connected (0x0UL)


/* SPIM_PSEL_DCX: Pin select for DCX signal */
  #define SPIM_PSEL_DCX_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_DCX_PIN_Pos (0UL)
  #define SPIM_PSEL_DCX_PIN_Msk (0x1FUL << SPIM_PSEL_DCX_PIN_Pos)
  #define SPIM_PSEL_DCX_PIN_Min (0x00UL)
  #define SPIM_PSEL_DCX_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_DCX_PORT_Pos (5UL)
  #define SPIM_PSEL_DCX_PORT_Msk (0xFUL << SPIM_PSEL_DCX_PORT_Pos)
  #define SPIM_PSEL_DCX_PORT_Min (0x0UL)
  #define SPIM_PSEL_DCX_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_DCX_CONNECT_Pos (31UL)
  #define SPIM_PSEL_DCX_CONNECT_Msk (0x1UL << SPIM_PSEL_DCX_CONNECT_Pos)
  #define SPIM_PSEL_DCX_CONNECT_Min (0x0UL)
  #define SPIM_PSEL_DCX_CONNECT_Max (0x1UL)
  #define SPIM_PSEL_DCX_CONNECT_Disconnected (0x1UL)
  #define SPIM_PSEL_DCX_CONNECT_Connected (0x0UL)


/* SPIM_PSEL_CSN: Pin select for CSN */
  #define SPIM_PSEL_CSN_MaxCount (1UL)
  #define SPIM_PSEL_CSN_MaxIndex (0UL)
  #define SPIM_PSEL_CSN_MinIndex (0UL)
  #define SPIM_PSEL_CSN_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIM_PSEL_CSN_PIN_Pos (0UL)
  #define SPIM_PSEL_CSN_PIN_Msk (0x1FUL << SPIM_PSEL_CSN_PIN_Pos)
  #define SPIM_PSEL_CSN_PIN_Min (0x00UL)
  #define SPIM_PSEL_CSN_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIM_PSEL_CSN_PORT_Pos (5UL)
  #define SPIM_PSEL_CSN_PORT_Msk (0xFUL << SPIM_PSEL_CSN_PORT_Pos)
  #define SPIM_PSEL_CSN_PORT_Min (0x0UL)
  #define SPIM_PSEL_CSN_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIM_PSEL_CSN_CONNECT_Pos (31UL)
  #define SPIM_PSEL_CSN_CONNECT_Msk (0x1UL << SPIM_PSEL_CSN_CONNECT_Pos)
  #define SPIM_PSEL_CSN_CONNECT_Min (0x0UL)
  #define SPIM_PSEL_CSN_CONNECT_Max (0x1UL)
  #define SPIM_PSEL_CSN_CONNECT_Disconnected (0x1UL)
  #define SPIM_PSEL_CSN_CONNECT_Connected (0x0UL)



/* ================================================ Struct SPIM_DMA_RX_MATCH ================================================= */
/**
  * @brief MATCH [SPIM_DMA_RX_MATCH] Registers to control the behavior of the pattern matcher engine
  */
typedef struct {
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  CANDIDATE[4];                      /*!< (@ 0x00000004) The data to look for - any match will trigger the
                                                                         MATCH[n] event, if enabled.*/
} NRF_SPIM_DMA_RX_MATCH_Type;

/* SPIM_DMA_RX_MATCH_CONFIG: Configure individual match events */
  #define SPIM_DMA_RX_MATCH_CONFIG_ResetValue (0x00000000UL)

