pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ===================================================== Struct SPIM_DMA ===================================================== */
/**
  * @brief DMA [SPIM_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_SPIM_DMA_RX_Type RX;
  __IOM NRF_SPIM_DMA_TX_Type TX;
} NRF_SPIM_DMA_Type;

/* ======================================================= Struct SPIM ======================================================= */
/**
  * @brief Serial Peripheral Interface Master with EasyDMA
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED;
    __OM uint32_t TASKS_SUSPEND;
    __OM uint32_t TASKS_RESUME;
    __IM uint32_t RESERVED1[5];
    __OM NRF_SPIM_TASKS_DMA_Type TASKS_DMA;
    __IM uint32_t RESERVED2[12];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED3;
    __IOM uint32_t SUBSCRIBE_SUSPEND;
    __IOM uint32_t SUBSCRIBE_RESUME;
    __IM uint32_t RESERVED4[5];
    __IOM NRF_SPIM_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA;
    __IM uint32_t RESERVED5[12];
    __IOM uint32_t EVENTS_STARTED;
    __IOM uint32_t EVENTS_STOPPED;
    __IOM uint32_t EVENTS_END;
    __IM uint32_t RESERVED6[16];
    __IOM NRF_SPIM_EVENTS_DMA_Type EVENTS_DMA;
    __IM uint32_t RESERVED7[3];
    __IOM uint32_t PUBLISH_STARTED;
    __IOM uint32_t PUBLISH_STOPPED;
    __IOM uint32_t PUBLISH_END;
    __IM uint32_t RESERVED8[16];
    __IOM NRF_SPIM_PUBLISH_DMA_Type PUBLISH_DMA;
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED10[64];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED11[125];
    __IOM uint32_t ENABLE;
    __IM uint32_t RESERVED12[10];
    __IOM uint32_t PRESCALER;
    __IM uint32_t RESERVED13[9];
    __IOM uint32_t CONFIG;
    __IM uint32_t RESERVED14[21];
    __IOM NRF_SPIM_IFTIMING_Type IFTIMING;
    __IOM uint32_t DCXCNT;
    __IOM uint32_t CSNPOL;
    __IOM uint32_t CSNCONTROL;                       /*!< (@ 0x000005BC) Selects which CSN is used, only one CSN can be active
                                                                         at one time. This register can be safely written during
                                                                         an ongoing SPI transaction.*/
    __IOM uint32_t ORC;                              /*!< (@ 0x000005C0) Byte transmitted after TXD.MAXCNT bytes have been
                                                                         transmitted in the case when RXD.MAXCNT is greater than
                                                                         TXD.MAXCNT*/
    __IM uint32_t RESERVED15[15];
    __IOM NRF_SPIM_PSEL_Type PSEL;
    __IM uint32_t RESERVED16[59];
    __IOM NRF_SPIM_DMA_Type DMA;
  } NRF_SPIM_Type;

/* SPIM_TASKS_START: Start SPI transaction */
  #define SPIM_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start SPI transaction */
  #define SPIM_TASKS_START_TASKS_START_Pos (0UL)
  #define SPIM_TASKS_START_TASKS_START_Msk (0x1UL << SPIM_TASKS_START_TASKS_START_Pos)
  #define SPIM_TASKS_START_TASKS_START_Min (0x1UL)
  #define SPIM_TASKS_START_TASKS_START_Max (0x1UL)
  #define SPIM_TASKS_START_TASKS_START_Trigger (0x1UL)


/* SPIM_TASKS_STOP: Stop SPI transaction */
  #define SPIM_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop SPI transaction */
  #define SPIM_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define SPIM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << SPIM_TASKS_STOP_TASKS_STOP_Pos)
  #define SPIM_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define SPIM_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define SPIM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* SPIM_TASKS_SUSPEND: Suspend SPI transaction */
  #define SPIM_TASKS_SUSPEND_ResetValue (0x00000000UL)

/* TASKS_SUSPEND @Bit 0 : Suspend SPI transaction */
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL)
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND
                                                                            field.*/
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Min (0x1UL)
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Max (0x1UL)
  #define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL)


/* SPIM_TASKS_RESUME: Resume SPI transaction */
  #define SPIM_TASKS_RESUME_ResetValue (0x00000000UL)

/* TASKS_RESUME @Bit 0 : Resume SPI transaction */
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Pos (0UL)
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Msk (0x1UL << SPIM_TASKS_RESUME_TASKS_RESUME_Pos)
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Min (0x1UL)
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Max (0x1UL)
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Trigger (0x1UL)


/* SPIM_SUBSCRIBE_START: Subscribe configuration for task START */
  #define SPIM_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define SPIM_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define SPIM_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << SPIM_SUBSCRIBE_START_CHIDX_Pos)
  #define SPIM_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define SPIM_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_SUBSCRIBE_START_EN_Pos (31UL)
  #define SPIM_SUBSCRIBE_START_EN_Msk (0x1UL << SPIM_SUBSCRIBE_START_EN_Pos)
  #define SPIM_SUBSCRIBE_START_EN_Min (0x0UL)
  #define SPIM_SUBSCRIBE_START_EN_Max (0x1UL)
  #define SPIM_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define SPIM_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* SPIM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define SPIM_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define SPIM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define SPIM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << SPIM_SUBSCRIBE_STOP_CHIDX_Pos)
  #define SPIM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define SPIM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define SPIM_SUBSCRIBE_STOP_EN_Msk (0x1UL << SPIM_SUBSCRIBE_STOP_EN_Pos)
  #define SPIM_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define SPIM_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define SPIM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define SPIM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* SPIM_SUBSCRIBE_SUSPEND: Subscribe configuration for task SUSPEND */
  #define SPIM_SUBSCRIBE_SUSPEND_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SUSPEND will subscribe to */
  #define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Pos (0UL)
  #define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Msk (0xFFUL << SPIM_SUBSCRIBE_SUSPEND_CHIDX_Pos)
  #define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Min (0x00UL)
  #define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Pos (31UL)
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Msk (0x1UL << SPIM_SUBSCRIBE_SUSPEND_EN_Pos)
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Min (0x0UL)
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Max (0x1UL)
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Disabled (0x0UL)
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Enabled (0x1UL)


/* SPIM_SUBSCRIBE_RESUME: Subscribe configuration for task RESUME */
  #define SPIM_SUBSCRIBE_RESUME_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RESUME will subscribe to */
  #define SPIM_SUBSCRIBE_RESUME_CHIDX_Pos (0UL)
  #define SPIM_SUBSCRIBE_RESUME_CHIDX_Msk (0xFFUL << SPIM_SUBSCRIBE_RESUME_CHIDX_Pos)
  #define SPIM_SUBSCRIBE_RESUME_CHIDX_Min (0x00UL)
  #define SPIM_SUBSCRIBE_RESUME_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIM_SUBSCRIBE_RESUME_EN_Pos (31UL)
  #define SPIM_SUBSCRIBE_RESUME_EN_Msk (0x1UL << SPIM_SUBSCRIBE_RESUME_EN_Pos)
  #define SPIM_SUBSCRIBE_RESUME_EN_Min (0x0UL)
  #define SPIM_SUBSCRIBE_RESUME_EN_Max (0x1UL)
  #define SPIM_SUBSCRIBE_RESUME_EN_Disabled (0x0UL)
  #define SPIM_SUBSCRIBE_RESUME_EN_Enabled (0x1UL)


/* SPIM_EVENTS_STARTED: SPI transaction has started */
  #define SPIM_EVENTS_STARTED_ResetValue (0x00000000UL)

/* EVENTS_STARTED @Bit 0 : SPI transaction has started */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL)
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << SPIM_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL)
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL)
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL)
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL)


/* SPIM_EVENTS_STOPPED: SPI transaction has stopped */
  #define SPIM_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : SPI transaction has stopped */
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* SPIM_EVENTS_END: End of RXD buffer and TXD buffer reached */
  #define SPIM_EVENTS_END_ResetValue (0x00000000UL)

