pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define SPIM_INTENCLR_DMARXREADY_Pos (20UL)
  #define SPIM_INTENCLR_DMARXREADY_Msk (0x1UL << SPIM_INTENCLR_DMARXREADY_Pos)
  #define SPIM_INTENCLR_DMARXREADY_Min (0x0UL)
  #define SPIM_INTENCLR_DMARXREADY_Max (0x1UL)
  #define SPIM_INTENCLR_DMARXREADY_Clear (0x1UL)
  #define SPIM_INTENCLR_DMARXREADY_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Write '1' to disable interrupt for event DMARXBUSERROR */
  #define SPIM_INTENCLR_DMARXBUSERROR_Pos (21UL)
  #define SPIM_INTENCLR_DMARXBUSERROR_Msk (0x1UL << SPIM_INTENCLR_DMARXBUSERROR_Pos)
  #define SPIM_INTENCLR_DMARXBUSERROR_Min (0x0UL)
  #define SPIM_INTENCLR_DMARXBUSERROR_Max (0x1UL)
  #define SPIM_INTENCLR_DMARXBUSERROR_Clear (0x1UL)
  #define SPIM_INTENCLR_DMARXBUSERROR_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Write '1' to disable interrupt for event DMARXMATCH[0] */
  #define SPIM_INTENCLR_DMARXMATCH0_Pos (22UL)
  #define SPIM_INTENCLR_DMARXMATCH0_Msk (0x1UL << SPIM_INTENCLR_DMARXMATCH0_Pos)
  #define SPIM_INTENCLR_DMARXMATCH0_Min (0x0UL)
  #define SPIM_INTENCLR_DMARXMATCH0_Max (0x1UL)
  #define SPIM_INTENCLR_DMARXMATCH0_Clear (0x1UL)
  #define SPIM_INTENCLR_DMARXMATCH0_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Write '1' to disable interrupt for event DMARXMATCH[1] */
  #define SPIM_INTENCLR_DMARXMATCH1_Pos (23UL)
  #define SPIM_INTENCLR_DMARXMATCH1_Msk (0x1UL << SPIM_INTENCLR_DMARXMATCH1_Pos)
  #define SPIM_INTENCLR_DMARXMATCH1_Min (0x0UL)
  #define SPIM_INTENCLR_DMARXMATCH1_Max (0x1UL)
  #define SPIM_INTENCLR_DMARXMATCH1_Clear (0x1UL)
  #define SPIM_INTENCLR_DMARXMATCH1_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Write '1' to disable interrupt for event DMARXMATCH[2] */
  #define SPIM_INTENCLR_DMARXMATCH2_Pos (24UL)
  #define SPIM_INTENCLR_DMARXMATCH2_Msk (0x1UL << SPIM_INTENCLR_DMARXMATCH2_Pos)
  #define SPIM_INTENCLR_DMARXMATCH2_Min (0x0UL)
  #define SPIM_INTENCLR_DMARXMATCH2_Max (0x1UL)
  #define SPIM_INTENCLR_DMARXMATCH2_Clear (0x1UL)
  #define SPIM_INTENCLR_DMARXMATCH2_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Write '1' to disable interrupt for event DMARXMATCH[3] */
  #define SPIM_INTENCLR_DMARXMATCH3_Pos (25UL)
  #define SPIM_INTENCLR_DMARXMATCH3_Msk (0x1UL << SPIM_INTENCLR_DMARXMATCH3_Pos)
  #define SPIM_INTENCLR_DMARXMATCH3_Min (0x0UL)
  #define SPIM_INTENCLR_DMARXMATCH3_Max (0x1UL)
  #define SPIM_INTENCLR_DMARXMATCH3_Clear (0x1UL)
  #define SPIM_INTENCLR_DMARXMATCH3_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Write '1' to disable interrupt for event DMATXEND */
  #define SPIM_INTENCLR_DMATXEND_Pos (26UL)
  #define SPIM_INTENCLR_DMATXEND_Msk (0x1UL << SPIM_INTENCLR_DMATXEND_Pos)
  #define SPIM_INTENCLR_DMATXEND_Min (0x0UL)
  #define SPIM_INTENCLR_DMATXEND_Max (0x1UL)
  #define SPIM_INTENCLR_DMATXEND_Clear (0x1UL)
  #define SPIM_INTENCLR_DMATXEND_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Write '1' to disable interrupt for event DMATXREADY */
  #define SPIM_INTENCLR_DMATXREADY_Pos (27UL)
  #define SPIM_INTENCLR_DMATXREADY_Msk (0x1UL << SPIM_INTENCLR_DMATXREADY_Pos)
  #define SPIM_INTENCLR_DMATXREADY_Min (0x0UL)
  #define SPIM_INTENCLR_DMATXREADY_Max (0x1UL)
  #define SPIM_INTENCLR_DMATXREADY_Clear (0x1UL)
  #define SPIM_INTENCLR_DMATXREADY_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Write '1' to disable interrupt for event DMATXBUSERROR */
  #define SPIM_INTENCLR_DMATXBUSERROR_Pos (28UL)
  #define SPIM_INTENCLR_DMATXBUSERROR_Msk (0x1UL << SPIM_INTENCLR_DMATXBUSERROR_Pos)
  #define SPIM_INTENCLR_DMATXBUSERROR_Min (0x0UL)
  #define SPIM_INTENCLR_DMATXBUSERROR_Max (0x1UL)
  #define SPIM_INTENCLR_DMATXBUSERROR_Clear (0x1UL)
  #define SPIM_INTENCLR_DMATXBUSERROR_Disabled (0x0UL)
  #define SPIM_INTENCLR_DMATXBUSERROR_Enabled (0x1UL)


/* SPIM_ENABLE: Enable SPIM */
  #define SPIM_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bits 0..3 : Enable or disable SPIM */
  #define SPIM_ENABLE_ENABLE_Pos (0UL)
  #define SPIM_ENABLE_ENABLE_Msk (0xFUL << SPIM_ENABLE_ENABLE_Pos)
  #define SPIM_ENABLE_ENABLE_Min (0x0UL)
  #define SPIM_ENABLE_ENABLE_Max (0x7UL)
  #define SPIM_ENABLE_ENABLE_Disabled (0x0UL)
  #define SPIM_ENABLE_ENABLE_Enabled (0x7UL)


/* SPIM_PRESCALER: The prescaler is used to set the SPI frequency. */
  #define SPIM_PRESCALER_ResetValue (0x00000040UL)

/* DIVISOR @Bits 0..6 : Core clock to SCK divisor */
  #define SPIM_PRESCALER_DIVISOR_Pos (0UL)
  #define SPIM_PRESCALER_DIVISOR_Msk (0x7FUL << SPIM_PRESCALER_DIVISOR_Pos)
  #define SPIM_PRESCALER_DIVISOR_Min (0x02UL)
  #define SPIM_PRESCALER_DIVISOR_Max (0x7EUL)


/* SPIM_CONFIG: Configuration register */
  #define SPIM_CONFIG_ResetValue (0x00000000UL)

/* ORDER @Bit 0 : Bit order */
  #define SPIM_CONFIG_ORDER_Pos (0UL)
  #define SPIM_CONFIG_ORDER_Msk (0x1UL << SPIM_CONFIG_ORDER_Pos)
  #define SPIM_CONFIG_ORDER_Min (0x0UL)
  #define SPIM_CONFIG_ORDER_Max (0x1UL)
  #define SPIM_CONFIG_ORDER_MsbFirst (0x0UL)
  #define SPIM_CONFIG_ORDER_LsbFirst (0x1UL)

/* CPHA @Bit 1 : Serial clock (SCK) phase */
  #define SPIM_CONFIG_CPHA_Pos (1UL)
  #define SPIM_CONFIG_CPHA_Msk (0x1UL << SPIM_CONFIG_CPHA_Pos)
  #define SPIM_CONFIG_CPHA_Min (0x0UL)
  #define SPIM_CONFIG_CPHA_Max (0x1UL)
  #define SPIM_CONFIG_CPHA_Leading (0x0UL)
  #define SPIM_CONFIG_CPHA_Trailing (0x1UL)

/* CPOL @Bit 2 : Serial clock (SCK) polarity */
  #define SPIM_CONFIG_CPOL_Pos (2UL)
  #define SPIM_CONFIG_CPOL_Msk (0x1UL << SPIM_CONFIG_CPOL_Pos)
  #define SPIM_CONFIG_CPOL_Min (0x0UL)
  #define SPIM_CONFIG_CPOL_Max (0x1UL)
  #define SPIM_CONFIG_CPOL_ActiveHigh (0x0UL)
  #define SPIM_CONFIG_CPOL_ActiveLow (0x1UL)


/* SPIM_DCXCNT: DCX configuration */
  #define SPIM_DCXCNT_ResetValue (0x00000000UL)

/* DCXCNT @Bits 0..3 : This register specifies the number of command bytes preceding the data bytes. The PSEL.DCX line will be
                       low during transmission of command bytes and high during transmission of data bytes. Value 0xF indicates
                       that all bytes are command bytes. */

  #define SPIM_DCXCNT_DCXCNT_Pos (0UL)
  #define SPIM_DCXCNT_DCXCNT_Msk (0xFUL << SPIM_DCXCNT_DCXCNT_Pos)
  #define SPIM_DCXCNT_DCXCNT_Min (0x0UL)
  #define SPIM_DCXCNT_DCXCNT_Max (0xFUL)


/* SPIM_CSNPOL: Polarity of CSN output */
  #define SPIM_CSNPOL_ResetValue (0x00000000UL)

/* CSNPOL0 @Bit 0 : Polarity of CSN output */
  #define SPIM_CSNPOL_CSNPOL0_Pos (0UL)
  #define SPIM_CSNPOL_CSNPOL0_Msk (0x1UL << SPIM_CSNPOL_CSNPOL0_Pos)
  #define SPIM_CSNPOL_CSNPOL0_Min (0x0UL)
  #define SPIM_CSNPOL_CSNPOL0_Max (0x1UL)
  #define SPIM_CSNPOL_CSNPOL0_LOW (0x0UL)
  #define SPIM_CSNPOL_CSNPOL0_HIGH (0x1UL)


/* SPIM_CSNCONTROL: Selects which CSN is used, only one CSN can be active at one time. This register can be safely written
                     during an ongoing SPI transaction. */

  #define SPIM_CSNCONTROL_ResetValue (0x00000000UL)

/* CSN @Bit 0 : CSN Number. */
  #define SPIM_CSNCONTROL_CSN_Pos (0UL)
  #define SPIM_CSNCONTROL_CSN_Msk (0x1UL << SPIM_CSNCONTROL_CSN_Pos)


