pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define SPIS_PUBLISH_DMA_RX_END_CHIDX_Pos (0UL)
  #define SPIS_PUBLISH_DMA_RX_END_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_DMA_RX_END_CHIDX_Pos)
  #define SPIS_PUBLISH_DMA_RX_END_CHIDX_Min (0x00UL)
  #define SPIS_PUBLISH_DMA_RX_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_DMA_RX_END_EN_Pos (31UL)
  #define SPIS_PUBLISH_DMA_RX_END_EN_Msk (0x1UL << SPIS_PUBLISH_DMA_RX_END_EN_Pos)
  #define SPIS_PUBLISH_DMA_RX_END_EN_Min (0x0UL)
  #define SPIS_PUBLISH_DMA_RX_END_EN_Max (0x1UL)
  #define SPIS_PUBLISH_DMA_RX_END_EN_Disabled (0x0UL)
  #define SPIS_PUBLISH_DMA_RX_END_EN_Enabled (0x1UL)


/* SPIS_PUBLISH_DMA_RX_READY: Publish configuration for event READY */
  #define SPIS_PUBLISH_DMA_RX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define SPIS_PUBLISH_DMA_RX_READY_CHIDX_Pos (0UL)
  #define SPIS_PUBLISH_DMA_RX_READY_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_DMA_RX_READY_CHIDX_Pos)
  #define SPIS_PUBLISH_DMA_RX_READY_CHIDX_Min (0x00UL)
  #define SPIS_PUBLISH_DMA_RX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_DMA_RX_READY_EN_Pos (31UL)
  #define SPIS_PUBLISH_DMA_RX_READY_EN_Msk (0x1UL << SPIS_PUBLISH_DMA_RX_READY_EN_Pos)
  #define SPIS_PUBLISH_DMA_RX_READY_EN_Min (0x0UL)
  #define SPIS_PUBLISH_DMA_RX_READY_EN_Max (0x1UL)
  #define SPIS_PUBLISH_DMA_RX_READY_EN_Disabled (0x0UL)
  #define SPIS_PUBLISH_DMA_RX_READY_EN_Enabled (0x1UL)


/* SPIS_PUBLISH_DMA_RX_BUSERROR: Publish configuration for event BUSERROR */
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos (0UL)
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Min (0x00UL)
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_EN_Pos (31UL)
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_EN_Msk (0x1UL << SPIS_PUBLISH_DMA_RX_BUSERROR_EN_Pos)
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_EN_Min (0x0UL)
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_EN_Max (0x1UL)
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_EN_Disabled (0x0UL)
  #define SPIS_PUBLISH_DMA_RX_BUSERROR_EN_Enabled (0x1UL)


/* SPIS_PUBLISH_DMA_RX_MATCH: Publish configuration for event MATCH[n] */
  #define SPIS_PUBLISH_DMA_RX_MATCH_MaxCount (4UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_MaxIndex (3UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_MinIndex (0UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event MATCH[n] will publish to */
  #define SPIS_PUBLISH_DMA_RX_MATCH_CHIDX_Pos (0UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_DMA_RX_MATCH_CHIDX_Pos)
  #define SPIS_PUBLISH_DMA_RX_MATCH_CHIDX_Min (0x00UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_DMA_RX_MATCH_EN_Pos (31UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_EN_Msk (0x1UL << SPIS_PUBLISH_DMA_RX_MATCH_EN_Pos)
  #define SPIS_PUBLISH_DMA_RX_MATCH_EN_Min (0x0UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_EN_Max (0x1UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_EN_Disabled (0x0UL)
  #define SPIS_PUBLISH_DMA_RX_MATCH_EN_Enabled (0x1UL)



/* =============================================== Struct SPIS_PUBLISH_DMA_TX ================================================ */
/**
  * @brief TX [SPIS_PUBLISH_DMA_TX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;
  __IOM uint32_t  BUSERROR;
} NRF_SPIS_PUBLISH_DMA_TX_Type;

/* SPIS_PUBLISH_DMA_TX_END: Publish configuration for event END */
  #define SPIS_PUBLISH_DMA_TX_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define SPIS_PUBLISH_DMA_TX_END_CHIDX_Pos (0UL)
  #define SPIS_PUBLISH_DMA_TX_END_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_DMA_TX_END_CHIDX_Pos)
  #define SPIS_PUBLISH_DMA_TX_END_CHIDX_Min (0x00UL)
  #define SPIS_PUBLISH_DMA_TX_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_DMA_TX_END_EN_Pos (31UL)
  #define SPIS_PUBLISH_DMA_TX_END_EN_Msk (0x1UL << SPIS_PUBLISH_DMA_TX_END_EN_Pos)
  #define SPIS_PUBLISH_DMA_TX_END_EN_Min (0x0UL)
  #define SPIS_PUBLISH_DMA_TX_END_EN_Max (0x1UL)
  #define SPIS_PUBLISH_DMA_TX_END_EN_Disabled (0x0UL)
  #define SPIS_PUBLISH_DMA_TX_END_EN_Enabled (0x1UL)


/* SPIS_PUBLISH_DMA_TX_READY: Publish configuration for event READY */
  #define SPIS_PUBLISH_DMA_TX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define SPIS_PUBLISH_DMA_TX_READY_CHIDX_Pos (0UL)
  #define SPIS_PUBLISH_DMA_TX_READY_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_DMA_TX_READY_CHIDX_Pos)
  #define SPIS_PUBLISH_DMA_TX_READY_CHIDX_Min (0x00UL)
  #define SPIS_PUBLISH_DMA_TX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_DMA_TX_READY_EN_Pos (31UL)
  #define SPIS_PUBLISH_DMA_TX_READY_EN_Msk (0x1UL << SPIS_PUBLISH_DMA_TX_READY_EN_Pos)
  #define SPIS_PUBLISH_DMA_TX_READY_EN_Min (0x0UL)
  #define SPIS_PUBLISH_DMA_TX_READY_EN_Max (0x1UL)
  #define SPIS_PUBLISH_DMA_TX_READY_EN_Disabled (0x0UL)
  #define SPIS_PUBLISH_DMA_TX_READY_EN_Enabled (0x1UL)


/* SPIS_PUBLISH_DMA_TX_BUSERROR: Publish configuration for event BUSERROR */
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos (0UL)
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Msk (0xFFUL << SPIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Min (0x00UL)
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_EN_Pos (31UL)
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_EN_Msk (0x1UL << SPIS_PUBLISH_DMA_TX_BUSERROR_EN_Pos)
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_EN_Min (0x0UL)
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_EN_Max (0x1UL)
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_EN_Disabled (0x0UL)
  #define SPIS_PUBLISH_DMA_TX_BUSERROR_EN_Enabled (0x1UL)



/* ================================================= Struct SPIS_PUBLISH_DMA ================================================= */
/**
  * @brief PUBLISH_DMA [SPIS_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM NRF_SPIS_PUBLISH_DMA_RX_Type RX;
  __IOM NRF_SPIS_PUBLISH_DMA_TX_Type TX;
} NRF_SPIS_PUBLISH_DMA_Type;


/* ==================================================== Struct SPIS_PSEL ===================================================== */
/**
  * @brief PSEL [SPIS_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCK;
  __IOM uint32_t  MISO;
  __IOM uint32_t  MOSI;
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CSN;
} NRF_SPIS_PSEL_Type;

/* SPIS_PSEL_SCK: Pin select for SCK */
  #define SPIS_PSEL_SCK_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_SCK_PIN_Pos (0UL)
  #define SPIS_PSEL_SCK_PIN_Msk (0x1FUL << SPIS_PSEL_SCK_PIN_Pos)
  #define SPIS_PSEL_SCK_PIN_Min (0x00UL)
  #define SPIS_PSEL_SCK_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIS_PSEL_SCK_PORT_Pos (5UL)
  #define SPIS_PSEL_SCK_PORT_Msk (0xFUL << SPIS_PSEL_SCK_PORT_Pos)
  #define SPIS_PSEL_SCK_PORT_Min (0x0UL)
  #define SPIS_PSEL_SCK_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_SCK_CONNECT_Pos (31UL)
  #define SPIS_PSEL_SCK_CONNECT_Msk (0x1UL << SPIS_PSEL_SCK_CONNECT_Pos)
  #define SPIS_PSEL_SCK_CONNECT_Min (0x0UL)
  #define SPIS_PSEL_SCK_CONNECT_Max (0x1UL)
  #define SPIS_PSEL_SCK_CONNECT_Disconnected (0x1UL)
  #define SPIS_PSEL_SCK_CONNECT_Connected (0x0UL)


/* SPIS_PSEL_MISO: Pin select for MISO signal */
  #define SPIS_PSEL_MISO_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_MISO_PIN_Pos (0UL)
  #define SPIS_PSEL_MISO_PIN_Msk (0x1FUL << SPIS_PSEL_MISO_PIN_Pos)
  #define SPIS_PSEL_MISO_PIN_Min (0x00UL)
  #define SPIS_PSEL_MISO_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIS_PSEL_MISO_PORT_Pos (5UL)
  #define SPIS_PSEL_MISO_PORT_Msk (0xFUL << SPIS_PSEL_MISO_PORT_Pos)
  #define SPIS_PSEL_MISO_PORT_Min (0x0UL)
  #define SPIS_PSEL_MISO_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_MISO_CONNECT_Pos (31UL)
  #define SPIS_PSEL_MISO_CONNECT_Msk (0x1UL << SPIS_PSEL_MISO_CONNECT_Pos)
  #define SPIS_PSEL_MISO_CONNECT_Min (0x0UL)
  #define SPIS_PSEL_MISO_CONNECT_Max (0x1UL)
  #define SPIS_PSEL_MISO_CONNECT_Disconnected (0x1UL)
  #define SPIS_PSEL_MISO_CONNECT_Connected (0x0UL)


/* SPIS_PSEL_MOSI: Pin select for MOSI signal */
  #define SPIS_PSEL_MOSI_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_MOSI_PIN_Pos (0UL)
  #define SPIS_PSEL_MOSI_PIN_Msk (0x1FUL << SPIS_PSEL_MOSI_PIN_Pos)
  #define SPIS_PSEL_MOSI_PIN_Min (0x00UL)
  #define SPIS_PSEL_MOSI_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIS_PSEL_MOSI_PORT_Pos (5UL)
  #define SPIS_PSEL_MOSI_PORT_Msk (0xFUL << SPIS_PSEL_MOSI_PORT_Pos)
  #define SPIS_PSEL_MOSI_PORT_Min (0x0UL)
  #define SPIS_PSEL_MOSI_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_MOSI_CONNECT_Pos (31UL)
  #define SPIS_PSEL_MOSI_CONNECT_Msk (0x1UL << SPIS_PSEL_MOSI_CONNECT_Pos)
  #define SPIS_PSEL_MOSI_CONNECT_Min (0x0UL)
  #define SPIS_PSEL_MOSI_CONNECT_Max (0x1UL)
  #define SPIS_PSEL_MOSI_CONNECT_Disconnected (0x1UL)
  #define SPIS_PSEL_MOSI_CONNECT_Connected (0x0UL)


