pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SPIS_PSEL_CSN: Pin select for CSN signal */
  #define SPIS_PSEL_CSN_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define SPIS_PSEL_CSN_PIN_Pos (0UL)
  #define SPIS_PSEL_CSN_PIN_Msk (0x1FUL << SPIS_PSEL_CSN_PIN_Pos)
  #define SPIS_PSEL_CSN_PIN_Min (0x00UL)
  #define SPIS_PSEL_CSN_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define SPIS_PSEL_CSN_PORT_Pos (5UL)
  #define SPIS_PSEL_CSN_PORT_Msk (0xFUL << SPIS_PSEL_CSN_PORT_Pos)
  #define SPIS_PSEL_CSN_PORT_Min (0x0UL)
  #define SPIS_PSEL_CSN_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define SPIS_PSEL_CSN_CONNECT_Pos (31UL)
  #define SPIS_PSEL_CSN_CONNECT_Msk (0x1UL << SPIS_PSEL_CSN_CONNECT_Pos)
  #define SPIS_PSEL_CSN_CONNECT_Min (0x0UL)
  #define SPIS_PSEL_CSN_CONNECT_Max (0x1UL)
  #define SPIS_PSEL_CSN_CONNECT_Disconnected (0x1UL)
  #define SPIS_PSEL_CSN_CONNECT_Connected (0x0UL)



/* ================================================ Struct SPIS_DMA_RX_MATCH ================================================= */
/**
  * @brief MATCH [SPIS_DMA_RX_MATCH] Registers to control the behavior of the pattern matcher engine
  */
typedef struct {
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  CANDIDATE[4];                      /*!< (@ 0x00000004) The data to look for - any match will trigger the
                                                                         MATCH[n] event, if enabled.*/
} NRF_SPIS_DMA_RX_MATCH_Type;

/* SPIS_DMA_RX_MATCH_CONFIG: Configure individual match events */
  #define SPIS_DMA_RX_MATCH_CONFIG_ResetValue (0x00000000UL)

/* ENABLE0 @Bit 0 : Enable match filter 0 */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Pos (0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Pos)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Min (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Max (0x1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Disabled (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE0_Enabled (0x1UL)

/* ENABLE1 @Bit 1 : Enable match filter 1 */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Pos (1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Pos)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Min (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Max (0x1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Disabled (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE1_Enabled (0x1UL)

/* ENABLE2 @Bit 2 : Enable match filter 2 */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE2_Pos (2UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE2_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ENABLE2_Pos)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE2_Min (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE2_Max (0x1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE2_Disabled (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE2_Enabled (0x1UL)

/* ENABLE3 @Bit 3 : Enable match filter 3 */
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE3_Pos (3UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE3_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ENABLE3_Pos)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE3_Min (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE3_Max (0x1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE3_Disabled (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ENABLE3_Enabled (0x1UL)

/* ONESHOT0 @Bit 16 : Configure match filter 0 as one-shot or sticky */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Pos (16UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Pos) /*!< Bit mask of ONESHOT0
                                                                            field.*/
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Min (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Max (0x1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Continuous (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Oneshot (0x1UL)

/* ONESHOT1 @Bit 17 : Configure match filter 1 as one-shot or sticky */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Pos (17UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Pos) /*!< Bit mask of ONESHOT1
                                                                            field.*/
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Min (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Max (0x1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Continuous (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Oneshot (0x1UL)

/* ONESHOT2 @Bit 18 : Configure match filter 2 as one-shot or sticky */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Pos (18UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Pos) /*!< Bit mask of ONESHOT2
                                                                            field.*/
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Min (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Max (0x1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Continuous (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Oneshot (0x1UL)

/* ONESHOT3 @Bit 19 : Configure match filter 3 as one-shot or sticky */
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Pos (19UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Msk (0x1UL << SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Pos) /*!< Bit mask of ONESHOT3
                                                                            field.*/
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Min (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Max (0x1UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Continuous (0x0UL)
  #define SPIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Oneshot (0x1UL)


/* SPIS_DMA_RX_MATCH_CANDIDATE: The data to look for - any match will trigger the MATCH[n] event, if enabled. */
  #define SPIS_DMA_RX_MATCH_CANDIDATE_MaxCount (4UL)
  #define SPIS_DMA_RX_MATCH_CANDIDATE_MaxIndex (3UL)
  #define SPIS_DMA_RX_MATCH_CANDIDATE_MinIndex (0UL)
  #define SPIS_DMA_RX_MATCH_CANDIDATE_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Data to look for */
  #define SPIS_DMA_RX_MATCH_CANDIDATE_DATA_Pos (0UL)
  #define SPIS_DMA_RX_MATCH_CANDIDATE_DATA_Msk (0xFFFFFFFFUL << SPIS_DMA_RX_MATCH_CANDIDATE_DATA_Pos) /*!< Bit mask of DATA
                                                                            field.*/



/* =================================================== Struct SPIS_DMA_RX ==================================================== */
/**
  * @brief RX [SPIS_DMA_RX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/
  __IM  uint32_t  CURRENTAMOUNT;
  __IOM uint32_t  LIST;
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
  __IOM NRF_SPIS_DMA_RX_MATCH_Type MATCH;            /*!< (@ 0x00000024) Registers to control the behavior of the pattern
                                                                         matcher engine*/
} NRF_SPIS_DMA_RX_Type;

/* SPIS_DMA_RX_PTR: RAM buffer start address */
  #define SPIS_DMA_RX_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define SPIS_DMA_RX_PTR_PTR_Pos (0UL)
  #define SPIS_DMA_RX_PTR_PTR_Msk (0xFFFFFFFFUL << SPIS_DMA_RX_PTR_PTR_Pos)


/* SPIS_DMA_RX_MAXCNT: Maximum number of bytes in channel buffer */
  #define SPIS_DMA_RX_MAXCNT_ResetValue (0x00000000UL)

/* MAXCNT @Bits 0..14 : Maximum number of bytes in channel buffer */
  #define SPIS_DMA_RX_MAXCNT_MAXCNT_Pos (0UL)
  #define SPIS_DMA_RX_MAXCNT_MAXCNT_Msk (0x7FFFUL << SPIS_DMA_RX_MAXCNT_MAXCNT_Pos)
  #define SPIS_DMA_RX_MAXCNT_MAXCNT_Min (0x0001UL)
  #define SPIS_DMA_RX_MAXCNT_MAXCNT_Max (0x7FFFUL)


/* SPIS_DMA_RX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after each
                        MATCH event. */

  #define SPIS_DMA_RX_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define SPIS_DMA_RX_AMOUNT_AMOUNT_Pos (0UL)
  #define SPIS_DMA_RX_AMOUNT_AMOUNT_Msk (0x7FFFUL << SPIS_DMA_RX_AMOUNT_AMOUNT_Pos)
  #define SPIS_DMA_RX_AMOUNT_AMOUNT_Min (0x0001UL)
  #define SPIS_DMA_RX_AMOUNT_AMOUNT_Max (0x7FFFUL)


/* SPIS_DMA_RX_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define SPIS_DMA_RX_CURRENTAMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define SPIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Pos (0UL)
  #define SPIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Msk (0x7FFFUL << SPIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/
  #define SPIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Min (0x0001UL)
  #define SPIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Max (0x7FFFUL)


