pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SPIS_DMA_RX_LIST: EasyDMA list type */
  #define SPIS_DMA_RX_LIST_ResetValue (0x00000000UL)

/* TYPE @Bits 0..2 : List type */
  #define SPIS_DMA_RX_LIST_TYPE_Pos (0UL)
  #define SPIS_DMA_RX_LIST_TYPE_Msk (0x7UL << SPIS_DMA_RX_LIST_TYPE_Pos)
  #define SPIS_DMA_RX_LIST_TYPE_Min (0x0UL)
  #define SPIS_DMA_RX_LIST_TYPE_Max (0x1UL)
  #define SPIS_DMA_RX_LIST_TYPE_Disabled (0x0UL)
  #define SPIS_DMA_RX_LIST_TYPE_ArrayList (0x1UL)


/* SPIS_DMA_RX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define SPIS_DMA_RX_TERMINATEONBUSERROR_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : (unspecified) */
  #define SPIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos (0UL)
  #define SPIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << SPIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define SPIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL)
  #define SPIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL)
  #define SPIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL)
  #define SPIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL)


/* SPIS_DMA_RX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define SPIS_DMA_RX_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define SPIS_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define SPIS_DMA_RX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << SPIS_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* =================================================== Struct SPIS_DMA_TX ==================================================== */
/**
  * @brief TX [SPIS_DMA_TX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/
  __IM  uint32_t  CURRENTAMOUNT;
  __IOM uint32_t  LIST;
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_SPIS_DMA_TX_Type;

/* SPIS_DMA_TX_PTR: RAM buffer start address */
  #define SPIS_DMA_TX_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define SPIS_DMA_TX_PTR_PTR_Pos (0UL)
  #define SPIS_DMA_TX_PTR_PTR_Msk (0xFFFFFFFFUL << SPIS_DMA_TX_PTR_PTR_Pos)


/* SPIS_DMA_TX_MAXCNT: Maximum number of bytes in channel buffer */
  #define SPIS_DMA_TX_MAXCNT_ResetValue (0x00000000UL)

/* MAXCNT @Bits 0..14 : Maximum number of bytes in channel buffer */
  #define SPIS_DMA_TX_MAXCNT_MAXCNT_Pos (0UL)
  #define SPIS_DMA_TX_MAXCNT_MAXCNT_Msk (0x7FFFUL << SPIS_DMA_TX_MAXCNT_MAXCNT_Pos)
  #define SPIS_DMA_TX_MAXCNT_MAXCNT_Min (0x0001UL)
  #define SPIS_DMA_TX_MAXCNT_MAXCNT_Max (0x7FFFUL)


/* SPIS_DMA_TX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after each
                        MATCH event. */

  #define SPIS_DMA_TX_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define SPIS_DMA_TX_AMOUNT_AMOUNT_Pos (0UL)
  #define SPIS_DMA_TX_AMOUNT_AMOUNT_Msk (0x7FFFUL << SPIS_DMA_TX_AMOUNT_AMOUNT_Pos)
  #define SPIS_DMA_TX_AMOUNT_AMOUNT_Min (0x0001UL)
  #define SPIS_DMA_TX_AMOUNT_AMOUNT_Max (0x7FFFUL)


/* SPIS_DMA_TX_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define SPIS_DMA_TX_CURRENTAMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define SPIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Pos (0UL)
  #define SPIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Msk (0x7FFFUL << SPIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/
  #define SPIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Min (0x0001UL)
  #define SPIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Max (0x7FFFUL)


/* SPIS_DMA_TX_LIST: EasyDMA list type */
  #define SPIS_DMA_TX_LIST_ResetValue (0x00000000UL)

/* TYPE @Bits 0..2 : List type */
  #define SPIS_DMA_TX_LIST_TYPE_Pos (0UL)
  #define SPIS_DMA_TX_LIST_TYPE_Msk (0x7UL << SPIS_DMA_TX_LIST_TYPE_Pos)
  #define SPIS_DMA_TX_LIST_TYPE_Min (0x0UL)
  #define SPIS_DMA_TX_LIST_TYPE_Max (0x1UL)
  #define SPIS_DMA_TX_LIST_TYPE_Disabled (0x0UL)
  #define SPIS_DMA_TX_LIST_TYPE_ArrayList (0x1UL)


/* SPIS_DMA_TX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define SPIS_DMA_TX_TERMINATEONBUSERROR_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : (unspecified) */
  #define SPIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos (0UL)
  #define SPIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << SPIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define SPIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL)
  #define SPIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL)
  #define SPIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL)
  #define SPIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL)


/* SPIS_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define SPIS_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define SPIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define SPIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << SPIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ===================================================== Struct SPIS_DMA ===================================================== */
/**
  * @brief DMA [SPIS_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_SPIS_DMA_RX_Type RX;
  __IOM NRF_SPIS_DMA_TX_Type TX;
} NRF_SPIS_DMA_Type;

