pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ======================================================= Struct SPIS ======================================================= */
/**
  * @brief SPI Slave
  */
  typedef struct {
    __IM uint32_t RESERVED[5];
    __OM uint32_t TASKS_ACQUIRE;
    __OM uint32_t TASKS_RELEASE;                     /*!< (@ 0x00000018) Release SPI semaphore, enabling the SPI slave to
                                                                         acquire it*/
    __IM uint32_t RESERVED1[3];
    __OM NRF_SPIS_TASKS_DMA_Type TASKS_DMA;
    __IM uint32_t RESERVED2[17];
    __IOM uint32_t SUBSCRIBE_ACQUIRE;
    __IOM uint32_t SUBSCRIBE_RELEASE;
    __IM uint32_t RESERVED3[3];
    __IOM NRF_SPIS_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA;
    __IM uint32_t RESERVED4[13];
    __IOM uint32_t EVENTS_END;
    __IM uint32_t RESERVED5[4];
    __IOM uint32_t EVENTS_ACQUIRED;
    __IM uint32_t RESERVED6[12];
    __IOM NRF_SPIS_EVENTS_DMA_Type EVENTS_DMA;
    __IM uint32_t RESERVED7[4];
    __IOM uint32_t PUBLISH_END;
    __IM uint32_t RESERVED8[4];
    __IOM uint32_t PUBLISH_ACQUIRED;
    __IM uint32_t RESERVED9[12];
    __IOM NRF_SPIS_PUBLISH_DMA_Type PUBLISH_DMA;
    __IM uint32_t RESERVED10[3];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED11[64];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED12[61];
    __IM uint32_t SEMSTAT;
    __IM uint32_t RESERVED13[15];
    __IOM uint32_t STATUS;
    __IM uint32_t RESERVED14[47];
    __IOM uint32_t ENABLE;
    __IM uint32_t RESERVED15[20];
    __IOM uint32_t CONFIG;
    __IM uint32_t RESERVED16;
    __IOM uint32_t DEF;                              /*!< (@ 0x0000055C) Default character. Character clocked out in case of an
                                                                         ignored transaction.*/
    __IM uint32_t RESERVED17[24];
    __IOM uint32_t ORC;
    __IM uint32_t RESERVED18[15];
    __IOM NRF_SPIS_PSEL_Type PSEL;
    __IM uint32_t RESERVED19[59];
    __IOM NRF_SPIS_DMA_Type DMA;
  } NRF_SPIS_Type;

/* SPIS_TASKS_ACQUIRE: Acquire SPI semaphore */
  #define SPIS_TASKS_ACQUIRE_ResetValue (0x00000000UL)

/* TASKS_ACQUIRE @Bit 0 : Acquire SPI semaphore */
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos (0UL)
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Msk (0x1UL << SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Pos) /*!< Bit mask of TASKS_ACQUIRE
                                                                            field.*/
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Min (0x1UL)
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Max (0x1UL)
  #define SPIS_TASKS_ACQUIRE_TASKS_ACQUIRE_Trigger (0x1UL)


/* SPIS_TASKS_RELEASE: Release SPI semaphore, enabling the SPI slave to acquire it */
  #define SPIS_TASKS_RELEASE_ResetValue (0x00000000UL)

/* TASKS_RELEASE @Bit 0 : Release SPI semaphore, enabling the SPI slave to acquire it */
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos (0UL)
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Msk (0x1UL << SPIS_TASKS_RELEASE_TASKS_RELEASE_Pos) /*!< Bit mask of TASKS_RELEASE
                                                                            field.*/
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Min (0x1UL)
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Max (0x1UL)
  #define SPIS_TASKS_RELEASE_TASKS_RELEASE_Trigger (0x1UL)


/* SPIS_SUBSCRIBE_ACQUIRE: Subscribe configuration for task ACQUIRE */
  #define SPIS_SUBSCRIBE_ACQUIRE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task ACQUIRE will subscribe to */
  #define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Pos (0UL)
  #define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Msk (0xFFUL << SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Pos)
  #define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Min (0x00UL)
  #define SPIS_SUBSCRIBE_ACQUIRE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Pos (31UL)
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Msk (0x1UL << SPIS_SUBSCRIBE_ACQUIRE_EN_Pos)
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Min (0x0UL)
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Max (0x1UL)
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Disabled (0x0UL)
  #define SPIS_SUBSCRIBE_ACQUIRE_EN_Enabled (0x1UL)


/* SPIS_SUBSCRIBE_RELEASE: Subscribe configuration for task RELEASE */
  #define SPIS_SUBSCRIBE_RELEASE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RELEASE will subscribe to */
  #define SPIS_SUBSCRIBE_RELEASE_CHIDX_Pos (0UL)
  #define SPIS_SUBSCRIBE_RELEASE_CHIDX_Msk (0xFFUL << SPIS_SUBSCRIBE_RELEASE_CHIDX_Pos)
  #define SPIS_SUBSCRIBE_RELEASE_CHIDX_Min (0x00UL)
  #define SPIS_SUBSCRIBE_RELEASE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define SPIS_SUBSCRIBE_RELEASE_EN_Pos (31UL)
  #define SPIS_SUBSCRIBE_RELEASE_EN_Msk (0x1UL << SPIS_SUBSCRIBE_RELEASE_EN_Pos)
  #define SPIS_SUBSCRIBE_RELEASE_EN_Min (0x0UL)
  #define SPIS_SUBSCRIBE_RELEASE_EN_Max (0x1UL)
  #define SPIS_SUBSCRIBE_RELEASE_EN_Disabled (0x0UL)
  #define SPIS_SUBSCRIBE_RELEASE_EN_Enabled (0x1UL)


/* SPIS_EVENTS_END: Granted transaction completed */
  #define SPIS_EVENTS_END_ResetValue (0x00000000UL)

/* EVENTS_END @Bit 0 : Granted transaction completed */
  #define SPIS_EVENTS_END_EVENTS_END_Pos (0UL)
  #define SPIS_EVENTS_END_EVENTS_END_Msk (0x1UL << SPIS_EVENTS_END_EVENTS_END_Pos)
  #define SPIS_EVENTS_END_EVENTS_END_Min (0x0UL)
  #define SPIS_EVENTS_END_EVENTS_END_Max (0x1UL)
  #define SPIS_EVENTS_END_EVENTS_END_NotGenerated (0x0UL)
  #define SPIS_EVENTS_END_EVENTS_END_Generated (0x1UL)


/* SPIS_EVENTS_ACQUIRED: Semaphore acquired */
  #define SPIS_EVENTS_ACQUIRED_ResetValue (0x00000000UL)

/* EVENTS_ACQUIRED @Bit 0 : Semaphore acquired */
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos (0UL)
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Msk (0x1UL << SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Pos) /*!< Bit mask of
                                                                            EVENTS_ACQUIRED field.*/
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Min (0x0UL)
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Max (0x1UL)
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_NotGenerated (0x0UL)
  #define SPIS_EVENTS_ACQUIRED_EVENTS_ACQUIRED_Generated (0x1UL)


/* SPIS_PUBLISH_END: Publish configuration for event END */
  #define SPIS_PUBLISH_END_ResetValue (0x00000000UL)

