pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DMARXEND @Bit 19 : Write '1' to enable interrupt for event DMARXEND */
  #define SPIS_INTENSET_DMARXEND_Pos (19UL)
  #define SPIS_INTENSET_DMARXEND_Msk (0x1UL << SPIS_INTENSET_DMARXEND_Pos)
  #define SPIS_INTENSET_DMARXEND_Min (0x0UL)
  #define SPIS_INTENSET_DMARXEND_Max (0x1UL)
  #define SPIS_INTENSET_DMARXEND_Set (0x1UL)
  #define SPIS_INTENSET_DMARXEND_Disabled (0x0UL)
  #define SPIS_INTENSET_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Write '1' to enable interrupt for event DMARXREADY */
  #define SPIS_INTENSET_DMARXREADY_Pos (20UL)
  #define SPIS_INTENSET_DMARXREADY_Msk (0x1UL << SPIS_INTENSET_DMARXREADY_Pos)
  #define SPIS_INTENSET_DMARXREADY_Min (0x0UL)
  #define SPIS_INTENSET_DMARXREADY_Max (0x1UL)
  #define SPIS_INTENSET_DMARXREADY_Set (0x1UL)
  #define SPIS_INTENSET_DMARXREADY_Disabled (0x0UL)
  #define SPIS_INTENSET_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Write '1' to enable interrupt for event DMARXBUSERROR */
  #define SPIS_INTENSET_DMARXBUSERROR_Pos (21UL)
  #define SPIS_INTENSET_DMARXBUSERROR_Msk (0x1UL << SPIS_INTENSET_DMARXBUSERROR_Pos)
  #define SPIS_INTENSET_DMARXBUSERROR_Min (0x0UL)
  #define SPIS_INTENSET_DMARXBUSERROR_Max (0x1UL)
  #define SPIS_INTENSET_DMARXBUSERROR_Set (0x1UL)
  #define SPIS_INTENSET_DMARXBUSERROR_Disabled (0x0UL)
  #define SPIS_INTENSET_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Write '1' to enable interrupt for event DMARXMATCH[0] */
  #define SPIS_INTENSET_DMARXMATCH0_Pos (22UL)
  #define SPIS_INTENSET_DMARXMATCH0_Msk (0x1UL << SPIS_INTENSET_DMARXMATCH0_Pos)
  #define SPIS_INTENSET_DMARXMATCH0_Min (0x0UL)
  #define SPIS_INTENSET_DMARXMATCH0_Max (0x1UL)
  #define SPIS_INTENSET_DMARXMATCH0_Set (0x1UL)
  #define SPIS_INTENSET_DMARXMATCH0_Disabled (0x0UL)
  #define SPIS_INTENSET_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Write '1' to enable interrupt for event DMARXMATCH[1] */
  #define SPIS_INTENSET_DMARXMATCH1_Pos (23UL)
  #define SPIS_INTENSET_DMARXMATCH1_Msk (0x1UL << SPIS_INTENSET_DMARXMATCH1_Pos)
  #define SPIS_INTENSET_DMARXMATCH1_Min (0x0UL)
  #define SPIS_INTENSET_DMARXMATCH1_Max (0x1UL)
  #define SPIS_INTENSET_DMARXMATCH1_Set (0x1UL)
  #define SPIS_INTENSET_DMARXMATCH1_Disabled (0x0UL)
  #define SPIS_INTENSET_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Write '1' to enable interrupt for event DMARXMATCH[2] */
  #define SPIS_INTENSET_DMARXMATCH2_Pos (24UL)
  #define SPIS_INTENSET_DMARXMATCH2_Msk (0x1UL << SPIS_INTENSET_DMARXMATCH2_Pos)
  #define SPIS_INTENSET_DMARXMATCH2_Min (0x0UL)
  #define SPIS_INTENSET_DMARXMATCH2_Max (0x1UL)
  #define SPIS_INTENSET_DMARXMATCH2_Set (0x1UL)
  #define SPIS_INTENSET_DMARXMATCH2_Disabled (0x0UL)
  #define SPIS_INTENSET_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Write '1' to enable interrupt for event DMARXMATCH[3] */
  #define SPIS_INTENSET_DMARXMATCH3_Pos (25UL)
  #define SPIS_INTENSET_DMARXMATCH3_Msk (0x1UL << SPIS_INTENSET_DMARXMATCH3_Pos)
  #define SPIS_INTENSET_DMARXMATCH3_Min (0x0UL)
  #define SPIS_INTENSET_DMARXMATCH3_Max (0x1UL)
  #define SPIS_INTENSET_DMARXMATCH3_Set (0x1UL)
  #define SPIS_INTENSET_DMARXMATCH3_Disabled (0x0UL)
  #define SPIS_INTENSET_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Write '1' to enable interrupt for event DMATXEND */
  #define SPIS_INTENSET_DMATXEND_Pos (26UL)
  #define SPIS_INTENSET_DMATXEND_Msk (0x1UL << SPIS_INTENSET_DMATXEND_Pos)
  #define SPIS_INTENSET_DMATXEND_Min (0x0UL)
  #define SPIS_INTENSET_DMATXEND_Max (0x1UL)
  #define SPIS_INTENSET_DMATXEND_Set (0x1UL)
  #define SPIS_INTENSET_DMATXEND_Disabled (0x0UL)
  #define SPIS_INTENSET_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Write '1' to enable interrupt for event DMATXREADY */
  #define SPIS_INTENSET_DMATXREADY_Pos (27UL)
  #define SPIS_INTENSET_DMATXREADY_Msk (0x1UL << SPIS_INTENSET_DMATXREADY_Pos)
  #define SPIS_INTENSET_DMATXREADY_Min (0x0UL)
  #define SPIS_INTENSET_DMATXREADY_Max (0x1UL)
  #define SPIS_INTENSET_DMATXREADY_Set (0x1UL)
  #define SPIS_INTENSET_DMATXREADY_Disabled (0x0UL)
  #define SPIS_INTENSET_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Write '1' to enable interrupt for event DMATXBUSERROR */
  #define SPIS_INTENSET_DMATXBUSERROR_Pos (28UL)
  #define SPIS_INTENSET_DMATXBUSERROR_Msk (0x1UL << SPIS_INTENSET_DMATXBUSERROR_Pos)
  #define SPIS_INTENSET_DMATXBUSERROR_Min (0x0UL)
  #define SPIS_INTENSET_DMATXBUSERROR_Max (0x1UL)
  #define SPIS_INTENSET_DMATXBUSERROR_Set (0x1UL)
  #define SPIS_INTENSET_DMATXBUSERROR_Disabled (0x0UL)
  #define SPIS_INTENSET_DMATXBUSERROR_Enabled (0x1UL)


/* SPIS_INTENCLR: Disable interrupt */
  #define SPIS_INTENCLR_ResetValue (0x00000000UL)

/* END @Bit 1 : Write '1' to disable interrupt for event END */
  #define SPIS_INTENCLR_END_Pos (1UL)
  #define SPIS_INTENCLR_END_Msk (0x1UL << SPIS_INTENCLR_END_Pos)
  #define SPIS_INTENCLR_END_Min (0x0UL)
  #define SPIS_INTENCLR_END_Max (0x1UL)
  #define SPIS_INTENCLR_END_Clear (0x1UL)
  #define SPIS_INTENCLR_END_Disabled (0x0UL)
  #define SPIS_INTENCLR_END_Enabled (0x1UL)

/* ACQUIRED @Bit 6 : Write '1' to disable interrupt for event ACQUIRED */
  #define SPIS_INTENCLR_ACQUIRED_Pos (6UL)
  #define SPIS_INTENCLR_ACQUIRED_Msk (0x1UL << SPIS_INTENCLR_ACQUIRED_Pos)
  #define SPIS_INTENCLR_ACQUIRED_Min (0x0UL)
  #define SPIS_INTENCLR_ACQUIRED_Max (0x1UL)
  #define SPIS_INTENCLR_ACQUIRED_Clear (0x1UL)
  #define SPIS_INTENCLR_ACQUIRED_Disabled (0x0UL)
  #define SPIS_INTENCLR_ACQUIRED_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Write '1' to disable interrupt for event DMARXEND */
  #define SPIS_INTENCLR_DMARXEND_Pos (19UL)
  #define SPIS_INTENCLR_DMARXEND_Msk (0x1UL << SPIS_INTENCLR_DMARXEND_Pos)
  #define SPIS_INTENCLR_DMARXEND_Min (0x0UL)
  #define SPIS_INTENCLR_DMARXEND_Max (0x1UL)
  #define SPIS_INTENCLR_DMARXEND_Clear (0x1UL)
  #define SPIS_INTENCLR_DMARXEND_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define SPIS_INTENCLR_DMARXREADY_Pos (20UL)
  #define SPIS_INTENCLR_DMARXREADY_Msk (0x1UL << SPIS_INTENCLR_DMARXREADY_Pos)
  #define SPIS_INTENCLR_DMARXREADY_Min (0x0UL)
  #define SPIS_INTENCLR_DMARXREADY_Max (0x1UL)
  #define SPIS_INTENCLR_DMARXREADY_Clear (0x1UL)
  #define SPIS_INTENCLR_DMARXREADY_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMARXREADY_Enabled (0x1UL)

