pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DMARXBUSERROR @Bit 21 : Write '1' to disable interrupt for event DMARXBUSERROR */
  #define SPIS_INTENCLR_DMARXBUSERROR_Pos (21UL)
  #define SPIS_INTENCLR_DMARXBUSERROR_Msk (0x1UL << SPIS_INTENCLR_DMARXBUSERROR_Pos)
  #define SPIS_INTENCLR_DMARXBUSERROR_Min (0x0UL)
  #define SPIS_INTENCLR_DMARXBUSERROR_Max (0x1UL)
  #define SPIS_INTENCLR_DMARXBUSERROR_Clear (0x1UL)
  #define SPIS_INTENCLR_DMARXBUSERROR_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Write '1' to disable interrupt for event DMARXMATCH[0] */
  #define SPIS_INTENCLR_DMARXMATCH0_Pos (22UL)
  #define SPIS_INTENCLR_DMARXMATCH0_Msk (0x1UL << SPIS_INTENCLR_DMARXMATCH0_Pos)
  #define SPIS_INTENCLR_DMARXMATCH0_Min (0x0UL)
  #define SPIS_INTENCLR_DMARXMATCH0_Max (0x1UL)
  #define SPIS_INTENCLR_DMARXMATCH0_Clear (0x1UL)
  #define SPIS_INTENCLR_DMARXMATCH0_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Write '1' to disable interrupt for event DMARXMATCH[1] */
  #define SPIS_INTENCLR_DMARXMATCH1_Pos (23UL)
  #define SPIS_INTENCLR_DMARXMATCH1_Msk (0x1UL << SPIS_INTENCLR_DMARXMATCH1_Pos)
  #define SPIS_INTENCLR_DMARXMATCH1_Min (0x0UL)
  #define SPIS_INTENCLR_DMARXMATCH1_Max (0x1UL)
  #define SPIS_INTENCLR_DMARXMATCH1_Clear (0x1UL)
  #define SPIS_INTENCLR_DMARXMATCH1_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Write '1' to disable interrupt for event DMARXMATCH[2] */
  #define SPIS_INTENCLR_DMARXMATCH2_Pos (24UL)
  #define SPIS_INTENCLR_DMARXMATCH2_Msk (0x1UL << SPIS_INTENCLR_DMARXMATCH2_Pos)
  #define SPIS_INTENCLR_DMARXMATCH2_Min (0x0UL)
  #define SPIS_INTENCLR_DMARXMATCH2_Max (0x1UL)
  #define SPIS_INTENCLR_DMARXMATCH2_Clear (0x1UL)
  #define SPIS_INTENCLR_DMARXMATCH2_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Write '1' to disable interrupt for event DMARXMATCH[3] */
  #define SPIS_INTENCLR_DMARXMATCH3_Pos (25UL)
  #define SPIS_INTENCLR_DMARXMATCH3_Msk (0x1UL << SPIS_INTENCLR_DMARXMATCH3_Pos)
  #define SPIS_INTENCLR_DMARXMATCH3_Min (0x0UL)
  #define SPIS_INTENCLR_DMARXMATCH3_Max (0x1UL)
  #define SPIS_INTENCLR_DMARXMATCH3_Clear (0x1UL)
  #define SPIS_INTENCLR_DMARXMATCH3_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Write '1' to disable interrupt for event DMATXEND */
  #define SPIS_INTENCLR_DMATXEND_Pos (26UL)
  #define SPIS_INTENCLR_DMATXEND_Msk (0x1UL << SPIS_INTENCLR_DMATXEND_Pos)
  #define SPIS_INTENCLR_DMATXEND_Min (0x0UL)
  #define SPIS_INTENCLR_DMATXEND_Max (0x1UL)
  #define SPIS_INTENCLR_DMATXEND_Clear (0x1UL)
  #define SPIS_INTENCLR_DMATXEND_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Write '1' to disable interrupt for event DMATXREADY */
  #define SPIS_INTENCLR_DMATXREADY_Pos (27UL)
  #define SPIS_INTENCLR_DMATXREADY_Msk (0x1UL << SPIS_INTENCLR_DMATXREADY_Pos)
  #define SPIS_INTENCLR_DMATXREADY_Min (0x0UL)
  #define SPIS_INTENCLR_DMATXREADY_Max (0x1UL)
  #define SPIS_INTENCLR_DMATXREADY_Clear (0x1UL)
  #define SPIS_INTENCLR_DMATXREADY_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Write '1' to disable interrupt for event DMATXBUSERROR */
  #define SPIS_INTENCLR_DMATXBUSERROR_Pos (28UL)
  #define SPIS_INTENCLR_DMATXBUSERROR_Msk (0x1UL << SPIS_INTENCLR_DMATXBUSERROR_Pos)
  #define SPIS_INTENCLR_DMATXBUSERROR_Min (0x0UL)
  #define SPIS_INTENCLR_DMATXBUSERROR_Max (0x1UL)
  #define SPIS_INTENCLR_DMATXBUSERROR_Clear (0x1UL)
  #define SPIS_INTENCLR_DMATXBUSERROR_Disabled (0x0UL)
  #define SPIS_INTENCLR_DMATXBUSERROR_Enabled (0x1UL)


/* SPIS_SEMSTAT: Semaphore status register */
  #define SPIS_SEMSTAT_ResetValue (0x00000001UL)

/* SEMSTAT @Bits 0..1 : Semaphore status */
  #define SPIS_SEMSTAT_SEMSTAT_Pos (0UL)
  #define SPIS_SEMSTAT_SEMSTAT_Msk (0x3UL << SPIS_SEMSTAT_SEMSTAT_Pos)
  #define SPIS_SEMSTAT_SEMSTAT_Min (0x0UL)
  #define SPIS_SEMSTAT_SEMSTAT_Max (0x3UL)
  #define SPIS_SEMSTAT_SEMSTAT_Free (0x0UL)
  #define SPIS_SEMSTAT_SEMSTAT_CPU (0x1UL)
  #define SPIS_SEMSTAT_SEMSTAT_SPIS (0x2UL)
  #define SPIS_SEMSTAT_SEMSTAT_CPUPending (0x3UL)


/* SPIS_STATUS: Status from last transaction */
  #define SPIS_STATUS_ResetValue (0x00000000UL)

/* OVERREAD @Bit 0 : TX buffer over-read detected, and prevented */
  #define SPIS_STATUS_OVERREAD_Pos (0UL)
  #define SPIS_STATUS_OVERREAD_Msk (0x1UL << SPIS_STATUS_OVERREAD_Pos)
  #define SPIS_STATUS_OVERREAD_Min (0x0UL)
  #define SPIS_STATUS_OVERREAD_Max (0x1UL)
  #define SPIS_STATUS_OVERREAD_NotPresent (0x0UL)
  #define SPIS_STATUS_OVERREAD_Present (0x1UL)
  #define SPIS_STATUS_OVERREAD_Clear (0x1UL)

/* OVERFLOW @Bit 1 : RX buffer overflow detected, and prevented */
  #define SPIS_STATUS_OVERFLOW_Pos (1UL)
  #define SPIS_STATUS_OVERFLOW_Msk (0x1UL << SPIS_STATUS_OVERFLOW_Pos)
  #define SPIS_STATUS_OVERFLOW_Min (0x0UL)
  #define SPIS_STATUS_OVERFLOW_Max (0x1UL)
  #define SPIS_STATUS_OVERFLOW_NotPresent (0x0UL)
  #define SPIS_STATUS_OVERFLOW_Present (0x1UL)
  #define SPIS_STATUS_OVERFLOW_Clear (0x1UL)


/* SPIS_ENABLE: Enable SPI slave */
  #define SPIS_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bits 0..3 : Enable or disable SPI slave */
  #define SPIS_ENABLE_ENABLE_Pos (0UL)
  #define SPIS_ENABLE_ENABLE_Msk (0xFUL << SPIS_ENABLE_ENABLE_Pos)
  #define SPIS_ENABLE_ENABLE_Min (0x0UL)
  #define SPIS_ENABLE_ENABLE_Max (0x2UL)
  #define SPIS_ENABLE_ENABLE_Disabled (0x0UL)
  #define SPIS_ENABLE_ENABLE_Enabled (0x2UL)


/* SPIS_CONFIG: Configuration register */
  #define SPIS_CONFIG_ResetValue (0x00000000UL)

/* ORDER @Bit 0 : Bit order */
  #define SPIS_CONFIG_ORDER_Pos (0UL)
  #define SPIS_CONFIG_ORDER_Msk (0x1UL << SPIS_CONFIG_ORDER_Pos)
  #define SPIS_CONFIG_ORDER_Min (0x0UL)
  #define SPIS_CONFIG_ORDER_Max (0x1UL)
  #define SPIS_CONFIG_ORDER_MsbFirst (0x0UL)
  #define SPIS_CONFIG_ORDER_LsbFirst (0x1UL)

/* CPHA @Bit 1 : Serial clock (SCK) phase */
  #define SPIS_CONFIG_CPHA_Pos (1UL)
  #define SPIS_CONFIG_CPHA_Msk (0x1UL << SPIS_CONFIG_CPHA_Pos)
  #define SPIS_CONFIG_CPHA_Min (0x0UL)
  #define SPIS_CONFIG_CPHA_Max (0x1UL)
  #define SPIS_CONFIG_CPHA_Leading (0x0UL)
  #define SPIS_CONFIG_CPHA_Trailing (0x1UL)

