pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CPOL @Bit 2 : Serial clock (SCK) polarity */
  #define SPIS_CONFIG_CPOL_Pos (2UL)
  #define SPIS_CONFIG_CPOL_Msk (0x1UL << SPIS_CONFIG_CPOL_Pos)
  #define SPIS_CONFIG_CPOL_Min (0x0UL)
  #define SPIS_CONFIG_CPOL_Max (0x1UL)
  #define SPIS_CONFIG_CPOL_ActiveHigh (0x0UL)
  #define SPIS_CONFIG_CPOL_ActiveLow (0x1UL)


/* SPIS_DEF: Default character. Character clocked out in case of an ignored transaction. */
  #define SPIS_DEF_ResetValue (0x00000000UL)

/* DEF @Bits 0..7 : Default character. Character clocked out in case of an ignored transaction. */
  #define SPIS_DEF_DEF_Pos (0UL)
  #define SPIS_DEF_DEF_Msk (0xFFUL << SPIS_DEF_DEF_Pos)


/* SPIS_ORC: Over-read character */
  #define SPIS_ORC_ResetValue (0x00000000UL)

/* ORC @Bits 0..7 : Over-read character. Character clocked out after an over-read of the transmit buffer. */
  #define SPIS_ORC_ORC_Pos (0UL)
  #define SPIS_ORC_ORC_Msk (0xFFUL << SPIS_ORC_ORC_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            SPU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================= Struct SPU_PERIPHACCERR ================================================= */
/**
  * @brief PERIPHACCERR [SPU_PERIPHACCERR] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDRESS;
  __IM  uint32_t  INFO;                              /*!< (@ 0x00000004) Information about the transaction that caused first
                                                                         error.*/
} NRF_SPU_PERIPHACCERR_Type;

/* SPU_PERIPHACCERR_ADDRESS: Address of the transaction that caused first error. */
  #define SPU_PERIPHACCERR_ADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..15 : Address */
  #define SPU_PERIPHACCERR_ADDRESS_ADDRESS_Pos (0UL)
  #define SPU_PERIPHACCERR_ADDRESS_ADDRESS_Msk (0xFFFFUL << SPU_PERIPHACCERR_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* SPU_PERIPHACCERR_INFO: Information about the transaction that caused first error. */
  #define SPU_PERIPHACCERR_INFO_ResetValue (0x00000000UL)

/* OWNERID @Bits 0..3 : OWNERID */
  #define SPU_PERIPHACCERR_INFO_OWNERID_Pos (0UL)
  #define SPU_PERIPHACCERR_INFO_OWNERID_Msk (0xFUL << SPU_PERIPHACCERR_INFO_OWNERID_Pos)



/* ==================================================== Struct SPU_PERIPH ==================================================== */
/**
  * @brief PERIPH [SPU_PERIPH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PERM;                              /*!< (@ 0x00000000) Get and set the applicable access permissions for the
                                                                         peripheral slave index n*/
} NRF_SPU_PERIPH_Type;
  #define SPU_PERIPH_MaxCount (32UL)
  #define SPU_PERIPH_MaxIndex (31UL)
  #define SPU_PERIPH_MinIndex (0UL)

/* SPU_PERIPH_PERM: Get and set the applicable access permissions for the peripheral slave index n */
  #define SPU_PERIPH_PERM_ResetValue (0x8000000AUL)

/* SECUREMAPPING @Bits 0..1 : Read capabilities for TrustZone Cortex-M secure attribute */
  #define SPU_PERIPH_PERM_SECUREMAPPING_Pos (0UL)
  #define SPU_PERIPH_PERM_SECUREMAPPING_Msk (0x3UL << SPU_PERIPH_PERM_SECUREMAPPING_Pos)
  #define SPU_PERIPH_PERM_SECUREMAPPING_Min (0x0UL)
  #define SPU_PERIPH_PERM_SECUREMAPPING_Max (0x3UL)
  #define SPU_PERIPH_PERM_SECUREMAPPING_NonSecure (0x0UL)
  #define SPU_PERIPH_PERM_SECUREMAPPING_Secure (0x1UL)
  #define SPU_PERIPH_PERM_SECUREMAPPING_UserSelectable (0x2UL) /*!< Non-secure or secure attribute for this peripheral is
                                                                    defined by the PERIPH[n].PERM register*/
  #define SPU_PERIPH_PERM_SECUREMAPPING_Split (0x3UL)

/* DMA @Bits 2..3 : Read the peripheral DMA capabilities */
  #define SPU_PERIPH_PERM_DMA_Pos (2UL)
  #define SPU_PERIPH_PERM_DMA_Msk (0x3UL << SPU_PERIPH_PERM_DMA_Pos)
  #define SPU_PERIPH_PERM_DMA_Min (0x0UL)
  #define SPU_PERIPH_PERM_DMA_Max (0x2UL)
  #define SPU_PERIPH_PERM_DMA_NoDMA (0x0UL)
  #define SPU_PERIPH_PERM_DMA_NoSeparateAttribute (0x1UL) /*!< Peripheral has DMA and DMA transfers always have the same
                                                               security attribute as assigned to the peripheral*/
  #define SPU_PERIPH_PERM_DMA_SeparateAttribute (0x2UL) /*!< Peripheral has DMA and DMA transfers can have a different security
                                                             attribute than the one assigned to the peripheral*/

/* SECATTR @Bit 4 : Peripheral security mapping */
  #define SPU_PERIPH_PERM_SECATTR_Pos (4UL)
  #define SPU_PERIPH_PERM_SECATTR_Msk (0x1UL << SPU_PERIPH_PERM_SECATTR_Pos)
  #define SPU_PERIPH_PERM_SECATTR_Min (0x0UL)
  #define SPU_PERIPH_PERM_SECATTR_Max (0x1UL)
  #define SPU_PERIPH_PERM_SECATTR_Secure (0x1UL)
  #define SPU_PERIPH_PERM_SECATTR_NonSecure (0x0UL)  /*!< If SECUREMAPPING == UserSelectable: Peripheral is mapped in non-secure
                                                          peripheral address space. If SECUREMAPPING == Split: Peripheral is
                                                          mapped in non-secure and secure peripheral address space.*/

/* DMASEC @Bit 5 : Security attribution for the DMA transfer */
  #define SPU_PERIPH_PERM_DMASEC_Pos (5UL)
  #define SPU_PERIPH_PERM_DMASEC_Msk (0x1UL << SPU_PERIPH_PERM_DMASEC_Pos)
  #define SPU_PERIPH_PERM_DMASEC_Min (0x0UL)
  #define SPU_PERIPH_PERM_DMASEC_Max (0x1UL)
  #define SPU_PERIPH_PERM_DMASEC_Secure (0x1UL)      /*!< DMA transfers initiated by this peripheral have the secure attribute
                                                          set*/
  #define SPU_PERIPH_PERM_DMASEC_NonSecure (0x0UL)   /*!< DMA transfers initiated by this peripheral have the non-secure
                                                          attribute set*/

/* LOCK @Bit 8 : Register lock */
  #define SPU_PERIPH_PERM_LOCK_Pos (8UL)
  #define SPU_PERIPH_PERM_LOCK_Msk (0x1UL << SPU_PERIPH_PERM_LOCK_Pos)
  #define SPU_PERIPH_PERM_LOCK_Min (0x0UL)
  #define SPU_PERIPH_PERM_LOCK_Max (0x1UL)
  #define SPU_PERIPH_PERM_LOCK_Unlocked (0x0UL)
  #define SPU_PERIPH_PERM_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Peripheral owner ID */
  #define SPU_PERIPH_PERM_OWNERID_Pos (16UL)
  #define SPU_PERIPH_PERM_OWNERID_Msk (0xFUL << SPU_PERIPH_PERM_OWNERID_Pos)
  #define SPU_PERIPH_PERM_OWNERID_Min (0x0UL)
  #define SPU_PERIPH_PERM_OWNERID_Max (0xFUL)

/* OWNERPROG @Bit 30 : Indicates if OWNERID is programmable or not */
  #define SPU_PERIPH_PERM_OWNERPROG_Pos (30UL)
  #define SPU_PERIPH_PERM_OWNERPROG_Msk (0x1UL << SPU_PERIPH_PERM_OWNERPROG_Pos)
  #define SPU_PERIPH_PERM_OWNERPROG_Min (0x0UL)
  #define SPU_PERIPH_PERM_OWNERPROG_Max (0x1UL)
  #define SPU_PERIPH_PERM_OWNERPROG_NotProgrammable (0x0UL)
  #define SPU_PERIPH_PERM_OWNERPROG_Programmable (0x1UL)

