pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PRESENT @Bit 31 : Indicates if a peripheral is present with peripheral slave index n */
  #define SPU_PERIPH_PERM_PRESENT_Pos (31UL)
  #define SPU_PERIPH_PERM_PRESENT_Msk (0x1UL << SPU_PERIPH_PERM_PRESENT_Pos)
  #define SPU_PERIPH_PERM_PRESENT_Min (0x0UL)
  #define SPU_PERIPH_PERM_PRESENT_Max (0x1UL)
  #define SPU_PERIPH_PERM_PRESENT_NotPresent (0x0UL)
  #define SPU_PERIPH_PERM_PRESENT_IsPresent (0x1UL)



/* ================================================= Struct SPU_FEATURE_IPCT ================================================= */
/**
  * @brief IPCT [SPU_FEATURE_IPCT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[24];
  __IOM uint32_t  INTERRUPT[8];
} NRF_SPU_FEATURE_IPCT_Type;

/* SPU_FEATURE_IPCT_CH: Configuration of features for channel n of IPCT */
  #define SPU_FEATURE_IPCT_CH_MaxCount (24UL)
  #define SPU_FEATURE_IPCT_CH_MaxIndex (23UL)
  #define SPU_FEATURE_IPCT_CH_MinIndex (0UL)
  #define SPU_FEATURE_IPCT_CH_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_IPCT_CH_SECATTR_Pos (4UL)
  #define SPU_FEATURE_IPCT_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_IPCT_CH_SECATTR_Pos)
  #define SPU_FEATURE_IPCT_CH_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_IPCT_CH_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_IPCT_CH_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_IPCT_CH_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_IPCT_CH_LOCK_Pos (8UL)
  #define SPU_FEATURE_IPCT_CH_LOCK_Msk (0x1UL << SPU_FEATURE_IPCT_CH_LOCK_Pos)
  #define SPU_FEATURE_IPCT_CH_LOCK_Min (0x0UL)
  #define SPU_FEATURE_IPCT_CH_LOCK_Max (0x1UL)
  #define SPU_FEATURE_IPCT_CH_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_IPCT_CH_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_IPCT_CH_OWNERID_Pos (16UL)
  #define SPU_FEATURE_IPCT_CH_OWNERID_Msk (0xFUL << SPU_FEATURE_IPCT_CH_OWNERID_Pos)
  #define SPU_FEATURE_IPCT_CH_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_IPCT_CH_OWNERID_Max (0xFUL)


/* SPU_FEATURE_IPCT_INTERRUPT: Configuration of features for interrupt n of IPCT */
  #define SPU_FEATURE_IPCT_INTERRUPT_MaxCount (8UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_MaxIndex (7UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_MinIndex (0UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Pos (4UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_IPCT_INTERRUPT_LOCK_Pos (8UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_IPCT_INTERRUPT_LOCK_Pos)
  #define SPU_FEATURE_IPCT_INTERRUPT_LOCK_Min (0x0UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_LOCK_Max (0x1UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Pos (16UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_IPCT_INTERRUPT_OWNERID_Max (0xFUL)



/* ================================================ Struct SPU_FEATURE_DPPIC ================================================= */
/**
  * @brief DPPIC [SPU_FEATURE_DPPIC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[24];
  __IOM uint32_t  CHG[8];
} NRF_SPU_FEATURE_DPPIC_Type;

/* SPU_FEATURE_DPPIC_CH: Configuration of features for channel n of DPPIC */
  #define SPU_FEATURE_DPPIC_CH_MaxCount (24UL)
  #define SPU_FEATURE_DPPIC_CH_MaxIndex (23UL)
  #define SPU_FEATURE_DPPIC_CH_MinIndex (0UL)
  #define SPU_FEATURE_DPPIC_CH_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Pos (4UL)
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_DPPIC_CH_SECATTR_Pos)
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_DPPIC_CH_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Pos (8UL)
  #define SPU_FEATURE_DPPIC_CH_LOCK_Msk (0x1UL << SPU_FEATURE_DPPIC_CH_LOCK_Pos)
  #define SPU_FEATURE_DPPIC_CH_LOCK_Min (0x0UL)
  #define SPU_FEATURE_DPPIC_CH_LOCK_Max (0x1UL)
  #define SPU_FEATURE_DPPIC_CH_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_DPPIC_CH_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_DPPIC_CH_OWNERID_Pos (16UL)
  #define SPU_FEATURE_DPPIC_CH_OWNERID_Msk (0xFUL << SPU_FEATURE_DPPIC_CH_OWNERID_Pos)
  #define SPU_FEATURE_DPPIC_CH_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_DPPIC_CH_OWNERID_Max (0xFUL)


/* SPU_FEATURE_DPPIC_CHG: Configuration of features for channel group n of DPPIC */
  #define SPU_FEATURE_DPPIC_CHG_MaxCount (8UL)
  #define SPU_FEATURE_DPPIC_CHG_MaxIndex (7UL)
  #define SPU_FEATURE_DPPIC_CHG_MinIndex (0UL)
  #define SPU_FEATURE_DPPIC_CHG_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Pos (4UL)
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_SECATTR_Pos)
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Pos (8UL)
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_LOCK_Pos)
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Min (0x0UL)
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Max (0x1UL)
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_DPPIC_CHG_OWNERID_Pos (16UL)
  #define SPU_FEATURE_DPPIC_CHG_OWNERID_Msk (0xFUL << SPU_FEATURE_DPPIC_CHG_OWNERID_Pos)
  #define SPU_FEATURE_DPPIC_CHG_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_DPPIC_CHG_OWNERID_Max (0xFUL)



/* ================================================ Struct SPU_FEATURE_GPIOTE ================================================ */
/**
  * @brief GPIOTE [SPU_FEATURE_GPIOTE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[8];
  __IOM uint32_t  INTERRUPT[8];
} NRF_SPU_FEATURE_GPIOTE_Type;
  #define SPU_FEATURE_GPIOTE_MaxCount (2UL)
  #define SPU_FEATURE_GPIOTE_MaxIndex (1UL)
  #define SPU_FEATURE_GPIOTE_MinIndex (0UL)

/* SPU_FEATURE_GPIOTE_CH: Configuration of features for channel o of GPIOTE[n] */
  #define SPU_FEATURE_GPIOTE_CH_MaxCount (8UL)
  #define SPU_FEATURE_GPIOTE_CH_MaxIndex (7UL)
  #define SPU_FEATURE_GPIOTE_CH_MinIndex (0UL)
  #define SPU_FEATURE_GPIOTE_CH_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Pos (4UL)
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_SECATTR_Pos)
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Secure (0x1UL)

