pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Pos (8UL)
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_LOCK_Pos)
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Min (0x0UL)
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Max (0x1UL)
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GPIOTE_CH_OWNERID_Pos (16UL)
  #define SPU_FEATURE_GPIOTE_CH_OWNERID_Msk (0xFUL << SPU_FEATURE_GPIOTE_CH_OWNERID_Pos)
  #define SPU_FEATURE_GPIOTE_CH_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_GPIOTE_CH_OWNERID_Max (0xFUL)


/* SPU_FEATURE_GPIOTE_INTERRUPT: Configuration of features for interrupt o of GPIOTE[n] */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MaxCount (8UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MaxIndex (7UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MinIndex (0UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos (4UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Pos (8UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Pos)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Min (0x0UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Max (0x1UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Pos (16UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_GPIOTE_INTERRUPT_OWNERID_Max (0xFUL)



/* ================================================= Struct SPU_FEATURE_GPIO ================================================= */
/**
  * @brief GPIO [SPU_FEATURE_GPIO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PIN[32];
} NRF_SPU_FEATURE_GPIO_Type;
  #define SPU_FEATURE_GPIO_MaxCount (14UL)
  #define SPU_FEATURE_GPIO_MaxIndex (13UL)
  #define SPU_FEATURE_GPIO_MinIndex (0UL)

/* SPU_FEATURE_GPIO_PIN: Configuration of features for GPIO[n] PIN[o] */
  #define SPU_FEATURE_GPIO_PIN_MaxCount (32UL)
  #define SPU_FEATURE_GPIO_PIN_MaxIndex (31UL)
  #define SPU_FEATURE_GPIO_PIN_MinIndex (0UL)
  #define SPU_FEATURE_GPIO_PIN_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Pos (4UL)
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_SECATTR_Pos)
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_GPIO_PIN_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Pos (8UL)
  #define SPU_FEATURE_GPIO_PIN_LOCK_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_LOCK_Pos)
  #define SPU_FEATURE_GPIO_PIN_LOCK_Min (0x0UL)
  #define SPU_FEATURE_GPIO_PIN_LOCK_Max (0x1UL)
  #define SPU_FEATURE_GPIO_PIN_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_GPIO_PIN_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GPIO_PIN_OWNERID_Pos (16UL)
  #define SPU_FEATURE_GPIO_PIN_OWNERID_Msk (0xFUL << SPU_FEATURE_GPIO_PIN_OWNERID_Pos)
  #define SPU_FEATURE_GPIO_PIN_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_GPIO_PIN_OWNERID_Max (0xFUL)



/* ================================================= Struct SPU_FEATURE_GRTC ================================================= */
/**
  * @brief GRTC [SPU_FEATURE_GRTC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CC[16];
  __IM  uint32_t  RESERVED[13];
  __IOM uint32_t  PWMCONFIG;
  __IOM uint32_t  CLK;
  __IOM uint32_t  SYSCOUNTER;                        /*!< (@ 0x0000007C) Configuration of features for SYSCOUNTERL/SYSCOUNTERH
                                                                         of GRTC*/
  __IOM uint32_t  INTERRUPT[13];
} NRF_SPU_FEATURE_GRTC_Type;

/* SPU_FEATURE_GRTC_CC: Configuration of features for CC n of GRTC */
  #define SPU_FEATURE_GRTC_CC_MaxCount (16UL)
  #define SPU_FEATURE_GRTC_CC_MaxIndex (15UL)
  #define SPU_FEATURE_GRTC_CC_MinIndex (0UL)
  #define SPU_FEATURE_GRTC_CC_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_CC_SECATTR_Pos (4UL)
  #define SPU_FEATURE_GRTC_CC_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_CC_SECATTR_Pos)
  #define SPU_FEATURE_GRTC_CC_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_GRTC_CC_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_GRTC_CC_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_GRTC_CC_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_CC_LOCK_Pos (8UL)
  #define SPU_FEATURE_GRTC_CC_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_CC_LOCK_Pos)
  #define SPU_FEATURE_GRTC_CC_LOCK_Min (0x0UL)
  #define SPU_FEATURE_GRTC_CC_LOCK_Max (0x1UL)
  #define SPU_FEATURE_GRTC_CC_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_GRTC_CC_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_CC_OWNERID_Pos (16UL)
  #define SPU_FEATURE_GRTC_CC_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_CC_OWNERID_Pos)
  #define SPU_FEATURE_GRTC_CC_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_GRTC_CC_OWNERID_Max (0xFUL)


/* SPU_FEATURE_GRTC_PWMCONFIG: Configuration of feature for PWMCONFIG of GRTC */
  #define SPU_FEATURE_GRTC_PWMCONFIG_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Pos (4UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_SECATTR_Secure (0x1UL)

