pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Pos (8UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Pos)
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Min (0x0UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Max (0x1UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_PWMCONFIG_OWNERID_Pos (16UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_PWMCONFIG_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_GRTC_PWMCONFIG_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_GRTC_PWMCONFIG_OWNERID_Max (0xFUL)


/* SPU_FEATURE_GRTC_CLK: Configuration of features for CLKOUT/CLKCFG of GRTC */
  #define SPU_FEATURE_GRTC_CLK_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Pos (4UL)
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_CLK_SECATTR_Pos)
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_GRTC_CLK_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_GRTC_CLK_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_CLK_LOCK_Pos (8UL)
  #define SPU_FEATURE_GRTC_CLK_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_CLK_LOCK_Pos)
  #define SPU_FEATURE_GRTC_CLK_LOCK_Min (0x0UL)
  #define SPU_FEATURE_GRTC_CLK_LOCK_Max (0x1UL)
  #define SPU_FEATURE_GRTC_CLK_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_GRTC_CLK_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_CLK_OWNERID_Pos (16UL)
  #define SPU_FEATURE_GRTC_CLK_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_CLK_OWNERID_Pos)
  #define SPU_FEATURE_GRTC_CLK_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_GRTC_CLK_OWNERID_Max (0xFUL)


/* SPU_FEATURE_GRTC_SYSCOUNTER: Configuration of features for SYSCOUNTERL/SYSCOUNTERH of GRTC */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos (4UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Pos (8UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Pos)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Min (0x0UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Max (0x1UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Pos (16UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_GRTC_SYSCOUNTER_OWNERID_Max (0xFUL)


/* SPU_FEATURE_GRTC_INTERRUPT: Configuration of features for interrupt n of GRTC */
  #define SPU_FEATURE_GRTC_INTERRUPT_MaxCount (13UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_MaxIndex (12UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_MinIndex (0UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos (4UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos (8UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GRTC_INTERRUPT_LOCK_Pos)
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Min (0x0UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Max (0x1UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Pos (16UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_GRTC_INTERRUPT_OWNERID_Max (0xFUL)



/* ================================================ Struct SPU_FEATURE_MRAMC ================================================= */
/**
  * @brief MRAMC [SPU_FEATURE_MRAMC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  WAITSTATES;
  __IOM uint32_t  AUTODPOWERDOWN;                    /*!< (@ 0x00000004) Configuration of features for POWER.AUTODPOWERDOWN of
                                                                         MRAMC [n]*/
  __IOM uint32_t  READY;                             /*!< (@ 0x00000008) Configuration of features for READY and READYNEXT of
                                                                         MRAMC [n]*/
} NRF_SPU_FEATURE_MRAMC_Type;
  #define SPU_FEATURE_MRAMC_MaxCount (2UL)
  #define SPU_FEATURE_MRAMC_MaxIndex (1UL)
  #define SPU_FEATURE_MRAMC_MinIndex (0UL)

/* SPU_FEATURE_MRAMC_WAITSTATES: Configuration of features for WAITSTATES of MRAMC [n] */
  #define SPU_FEATURE_MRAMC_WAITSTATES_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Pos (4UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Msk (0x1UL << SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_SECATTR_Secure (0x1UL)

