pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Pos (8UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Pos)
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Max (0x1UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Pos (16UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Msk (0xFUL << SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Pos) /*!< Bit mask of OWNERID
                                                                            field.*/
  #define SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_WAITSTATES_OWNERID_Max (0xFUL)


/* SPU_FEATURE_MRAMC_AUTODPOWERDOWN: Configuration of features for POWER.AUTODPOWERDOWN of MRAMC [n] */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Pos (4UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Msk (0x1UL << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Pos) /*!< Bit mask of
                                                                            SECATTR field.*/
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Pos (8UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Pos) /*!< Bit mask of LOCK
                                                                            field.*/
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Max (0x1UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Pos (16UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Msk (0xFUL << SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Pos) /*!< Bit mask of
                                                                            OWNERID field.*/
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_AUTODPOWERDOWN_OWNERID_Max (0xFUL)


/* SPU_FEATURE_MRAMC_READY: Configuration of features for READY and READYNEXT of MRAMC [n] */
  #define SPU_FEATURE_MRAMC_READY_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Pos (4UL)
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Msk (0x1UL << SPU_FEATURE_MRAMC_READY_SECATTR_Pos)
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_MRAMC_READY_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_MRAMC_READY_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_MRAMC_READY_LOCK_Pos (8UL)
  #define SPU_FEATURE_MRAMC_READY_LOCK_Msk (0x1UL << SPU_FEATURE_MRAMC_READY_LOCK_Pos)
  #define SPU_FEATURE_MRAMC_READY_LOCK_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_READY_LOCK_Max (0x1UL)
  #define SPU_FEATURE_MRAMC_READY_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_MRAMC_READY_LOCK_Locked (0x1UL)

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_MRAMC_READY_OWNERID_Pos (16UL)
  #define SPU_FEATURE_MRAMC_READY_OWNERID_Msk (0xFUL << SPU_FEATURE_MRAMC_READY_OWNERID_Pos)
  #define SPU_FEATURE_MRAMC_READY_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_MRAMC_READY_OWNERID_Max (0xFUL)



/* =========================================== Struct SPU_FEATURE_BELLS_PROCESSOR ============================================ */
/**
  * @brief PROCESSOR [SPU_FEATURE_BELLS_PROCESSOR] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TASKS[16];                         /*!< (@ 0x00000000) Configuration of features for tasks pair [(o * 2) + 1:o
                                                                         * 2] of Processor ID n*/
  __IOM uint32_t  EVENTS[16];                        /*!< (@ 0x00000040) Configuration of features for events pair [(o * 2) +
                                                                         1:o * 2] of Processor ID n*/
  __IOM uint32_t  INTERRUPT[16];                     /*!< (@ 0x00000080) Configuration of features for interrupt register pair
                                                                         [(o * 2) + 1:o * 2] of Processor ID n*/
} NRF_SPU_FEATURE_BELLS_PROCESSOR_Type;
  #define SPU_FEATURE_BELLS_PROCESSOR_MaxCount (8UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_MaxIndex (7UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_MinIndex (0UL)

/* SPU_FEATURE_BELLS_PROCESSOR_TASKS: Configuration of features for tasks pair [(o * 2) + 1:o * 2] of Processor ID n */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_MaxCount (16UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_MaxIndex (15UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_MinIndex (0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Pos (4UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Pos) /*!< Bit mask
                                                                            of SECATTR field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_LOCK_Pos (8UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_LOCK_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_TASKS_LOCK_Pos) /*!< Bit mask of LOCK
                                                                            field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_LOCK_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_LOCK_Max (0x1UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next
                                                                     reset*/

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_OWNERID_Pos (16UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_OWNERID_Msk (0xFUL << SPU_FEATURE_BELLS_PROCESSOR_TASKS_OWNERID_Pos) /*!< Bit mask
                                                                            of OWNERID field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_TASKS_OWNERID_Max (0xFUL)


/* SPU_FEATURE_BELLS_PROCESSOR_EVENTS: Configuration of features for events pair [(o * 2) + 1:o * 2] of Processor ID n */
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_MaxCount (16UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_MaxIndex (15UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_MinIndex (0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Pos (4UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Pos) /*!< Bit mask
                                                                            of SECATTR field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_SECATTR_Secure (0x1UL)

