pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_LOCK_Pos (8UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_LOCK_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_EVENTS_LOCK_Pos) /*!< Bit mask of
                                                                            LOCK field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_LOCK_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_LOCK_Max (0x1UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next
                                                                      reset*/

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_OWNERID_Pos (16UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_OWNERID_Msk (0xFUL << SPU_FEATURE_BELLS_PROCESSOR_EVENTS_OWNERID_Pos) /*!< Bit mask
                                                                            of OWNERID field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_EVENTS_OWNERID_Max (0xFUL)


/* SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT: Configuration of features for interrupt register pair [(o * 2) + 1:o * 2] of Processor
                                           ID n */

  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_MaxCount (16UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_MaxIndex (15UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_MinIndex (0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_ResetValue (0x00000000UL)

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Pos (4UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Pos) /*!<
                                                                            Bit mask of SECATTR field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Max (0x1UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_NonSecure (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_SECATTR_Secure (0x1UL)

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Pos (8UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Pos) /*!< Bit mask
                                                                            of LOCK field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Max (0x1UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Unlocked (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next
                                                                         reset*/

/* OWNERID @Bits 16..19 : Feature owner ID */
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Pos (16UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Msk (0xFUL << SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Pos) /*!<
                                                                            Bit mask of OWNERID field.*/
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Min (0x0UL)
  #define SPU_FEATURE_BELLS_PROCESSOR_INTERRUPT_OWNERID_Max (0xFUL)



/* ================================================ Struct SPU_FEATURE_BELLS ================================================= */
/**
  * @brief BELLS [SPU_FEATURE_BELLS] (unspecified)
  */
typedef struct {
  __IOM NRF_SPU_FEATURE_BELLS_PROCESSOR_Type PROCESSOR[8];
} NRF_SPU_FEATURE_BELLS_Type;


/* =================================================== Struct SPU_FEATURE ==================================================== */
/**
  * @brief FEATURE [SPU_FEATURE] (unspecified)
  */
typedef union {
  struct {
    __IOM NRF_SPU_FEATURE_IPCT_Type IPCT;
    __IOM NRF_SPU_FEATURE_DPPIC_Type DPPIC;
    __IOM NRF_SPU_FEATURE_GPIOTE_Type GPIOTE[2];
    __IM uint32_t RESERVED[32];
    #if defined(_GNUC_)
      #pragma GCC diagnostic push
      #pragma GCC diagnostic ignored "-Wpedantic"
    #endif
    union {
      __IOM NRF_SPU_FEATURE_GPIO_Type GPIO[14];
      struct {
        __IOM NRF_SPU_FEATURE_GRTC_Type GRTC;
      };
      struct {
        __IM uint32_t RESERVED1[256];
        __IOM NRF_SPU_FEATURE_MRAMC_Type MRAMC[2];
      };
      __IM uint32_t RESERVED2[448];
    };
    #if defined(_GNUC_)
      #pragma GCC diagnostic pop
    #endif
  };
  __IOM NRF_SPU_FEATURE_BELLS_Type BELLS;
  __IM  uint32_t  RESERVED3[576];
} NRF_SPU_FEATURE_Type;

/* ======================================================= Struct SPU ======================================================== */
/**
  * @brief System protection unit
  */
  typedef struct {
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_PERIPHACCERR;              /*!< (@ 0x00000100) A security violation has been detected on one or
                                                                         several peripherals*/
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED2[61];
    __IOM NRF_SPU_PERIPHACCERR_Type PERIPHACCERR;
    __IM uint32_t RESERVED3[61];
    __IOM NRF_SPU_PERIPH_Type PERIPH[32];
    __IM uint32_t RESERVED4[32];
    __IOM NRF_SPU_FEATURE_Type FEATURE;
  } NRF_SPU_Type;

/* SPU_EVENTS_PERIPHACCERR: A security violation has been detected on one or several peripherals */
  #define SPU_EVENTS_PERIPHACCERR_ResetValue (0x00000000UL)

/* EVENTS_PERIPHACCERR @Bit 0 : A security violation has been detected on one or several peripherals */
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Pos (0UL)
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Msk (0x1UL << SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Pos) /*!< Bit
                                                                            mask of EVENTS_PERIPHACCERR field.*/
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Min (0x0UL)
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Max (0x1UL)
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_NotGenerated (0x0UL)
  #define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_Generated (0x1UL)


/* SPU_INTEN: Enable or disable interrupt */
  #define SPU_INTEN_ResetValue (0x00000000UL)

/* PERIPHACCERR @Bit 0 : Enable or disable interrupt for event PERIPHACCERR */
  #define SPU_INTEN_PERIPHACCERR_Pos (0UL)
  #define SPU_INTEN_PERIPHACCERR_Msk (0x1UL << SPU_INTEN_PERIPHACCERR_Pos)
  #define SPU_INTEN_PERIPHACCERR_Min (0x0UL)
  #define SPU_INTEN_PERIPHACCERR_Max (0x1UL)
  #define SPU_INTEN_PERIPHACCERR_Disabled (0x0UL)
  #define SPU_INTEN_PERIPHACCERR_Enabled (0x1UL)


/* SPU_INTENSET: Enable interrupt */
  #define SPU_INTENSET_ResetValue (0x00000000UL)

/* PERIPHACCERR @Bit 0 : Write '1' to enable interrupt for event PERIPHACCERR */
  #define SPU_INTENSET_PERIPHACCERR_Pos (0UL)
  #define SPU_INTENSET_PERIPHACCERR_Msk (0x1UL << SPU_INTENSET_PERIPHACCERR_Pos)
  #define SPU_INTENSET_PERIPHACCERR_Min (0x0UL)
  #define SPU_INTENSET_PERIPHACCERR_Max (0x1UL)
  #define SPU_INTENSET_PERIPHACCERR_Set (0x1UL)
  #define SPU_INTENSET_PERIPHACCERR_Disabled (0x0UL)
  #define SPU_INTENSET_PERIPHACCERR_Enabled (0x1UL)


/* SPU_INTENCLR: Disable interrupt */
  #define SPU_INTENCLR_ResetValue (0x00000000UL)

/* PERIPHACCERR @Bit 0 : Write '1' to disable interrupt for event PERIPHACCERR */
  #define SPU_INTENCLR_PERIPHACCERR_Pos (0UL)
  #define SPU_INTENCLR_PERIPHACCERR_Msk (0x1UL << SPU_INTENCLR_PERIPHACCERR_Pos)
  #define SPU_INTENCLR_PERIPHACCERR_Min (0x0UL)
  #define SPU_INTENCLR_PERIPHACCERR_Max (0x1UL)
  #define SPU_INTENCLR_PERIPHACCERR_Clear (0x1UL)
  #define SPU_INTENCLR_PERIPHACCERR_Disabled (0x0UL)
  #define SPU_INTENCLR_PERIPHACCERR_Enabled (0x1UL)


/* SPU_INTPEND: Pending interrupts */
  #define SPU_INTPEND_ResetValue (0x00000000UL)

/* PERIPHACCERR @Bit 0 : Read pending status of interrupt for event PERIPHACCERR */
  #define SPU_INTPEND_PERIPHACCERR_Pos (0UL)
  #define SPU_INTPEND_PERIPHACCERR_Msk (0x1UL << SPU_INTPEND_PERIPHACCERR_Pos)
  #define SPU_INTPEND_PERIPHACCERR_Min (0x0UL)
  #define SPU_INTPEND_PERIPHACCERR_Max (0x1UL)
  #define SPU_INTPEND_PERIPHACCERR_NotPending (0x0UL)
  #define SPU_INTPEND_PERIPHACCERR_Pending (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            STM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct STM ======================================================== */
/**
  * @brief System Trace Macrocell
  */
  typedef struct {
    __IM uint32_t RESERVED[772];
    __IOM uint32_t DMACTLR;
    __IM uint32_t RESERVED1[120];
    __IM uint32_t HEMASTR;                           /*!< (@ 0x00000DF4) Indicates the STPv2 master number of hardware event
                                                                         trace. This number is the master number presented in
                                                                         STPv2.*/
    __IM uint32_t HEFEAT1R;
    __IM uint32_t HEIDR;                             /*!< (@ 0x00000DFC) Indicates the features of hardware event tracing in the
                                                                         STM.*/
    __IM uint32_t RESERVED2[32];
    __IOM uint32_t TCSR;
    __IM uint32_t RESERVED3[4];
    __IOM uint32_t AUXCR;
    __IM uint32_t RESERVED4[2];
    __IOM uint32_t SPFEAT1R;
    __IOM uint32_t SPFEAT2R;
    __IOM uint32_t SPFEAT3R;
    __IM uint32_t RESERVED5[15];
    __OM uint32_t ITTRIGGER;
    __OM uint32_t ITATBDATA0;                        /*!< (@ 0x00000EEC) Controls the value of the ATDATAM output in integration
                                                                         mode.*/
    __OM uint32_t ITATBCTR2;                         /*!< (@ 0x00000EF0) Controls the value of the ATDATAM output in integration
                                                                         mode.*/
    __OM uint32_t ITATBID;                           /*!< (@ 0x00000EF4) Controls the value of the ATIDM output in integration
                                                                         mode.*/
    __OM uint32_t ITATBCTR0;                         /*!< (@ 0x00000EF8) Controls the value of the ATVALIDM, AFREADYM, and
                                                                         ATBYTESM outputs in integration mode.*/
    __IM uint32_t RESERVED6;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) Used to enable topology detection. This register
                                                                         enables the component to switch from a functional mode,
                                                                         the default behavior, to integration mode where the
                                                                         inputs and outputs of the component can be directly
                                                                         controlled for integration testing and topology
                                                                         solving.*/
    __IM uint32_t RESERVED7[43];
    __IOM uint32_t LAR;                              /*!< (@ 0x00000FB0) This is used to enable write access to device
                                                                         registers.*/
    __IOM uint32_t LSR;                              /*!< (@ 0x00000FB4) This indicates the status of the lock control
                                                                         mechanism. This lock prevents accidental writes by code
                                                                         under debug. Accesses to the extended stimulus port
                                                                         registers are not affected by the lock mechanism. This
                                                                         register must always be present although there might
                                                                         not be any lock access control mechanism. The lock
                                                                         mechanism, where present and locked, must block write
                                                                         accesses to any control register, except the Lock
                                                                         Access Register. For most components this covers all
                                                                         registers except for the Lock Access Register.*/
    __IOM uint32_t AUTHSTATUS;                       /*!< (@ 0x00000FB8) Indicates the current level of tracing permitted by the
                                                                         system*/
    __IM uint32_t RESERVED8[3];
    __IM uint32_t DEVID;
    __IM uint32_t DEVTYPE;
    __IOM uint32_t PIDR4;
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t PIDR0;
    __IOM uint32_t PIDR1;
    __IOM uint32_t PIDR2;
    __IOM uint32_t PIDR3;
    __IOM uint32_t CIDR0;
    __IOM uint32_t CIDR1;
    __IOM uint32_t CIDR2;
    __IOM uint32_t CIDR3;
  } NRF_STM_Type;

/* STM_DMACTLR: Controls the DMA transfer request mechanism. */
  #define STM_DMACTLR_ResetValue (0x00000000UL)

/* SENS @Bits 2..3 : Determines the sensitivity of the DMA request to the current buffer level in the STM */
  #define STM_DMACTLR_SENS_Pos (2UL)
  #define STM_DMACTLR_SENS_Msk (0x3UL << STM_DMACTLR_SENS_Pos)
  #define STM_DMACTLR_SENS_Min (0x0UL)
  #define STM_DMACTLR_SENS_Max (0x3UL)
  #define STM_DMACTLR_SENS_LT25 (0x0UL)
  #define STM_DMACTLR_SENS_LT50 (0x1UL)
  #define STM_DMACTLR_SENS_LT75 (0x2UL)
  #define STM_DMACTLR_SENS_LT100 (0x3UL)


