pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* STM_HEMASTR: Indicates the STPv2 master number of hardware event trace. This number is the master number presented in STPv2.
                 */

  #define STM_HEMASTR_ResetValue (0x00000000UL)

/* MASTER @Bits 0..16 : The STPv2 master number that hardware event traces should be associated with. */
  #define STM_HEMASTR_MASTER_Pos (0UL)
  #define STM_HEMASTR_MASTER_Msk (0x1FFFFUL << STM_HEMASTR_MASTER_Pos)
  #define STM_HEMASTR_MASTER_Min (0x00000UL)
  #define STM_HEMASTR_MASTER_Max (0x0FFFFUL)


/* STM_HEFEAT1R: Indicates the features of the STM. */
  #define STM_HEFEAT1R_ResetValue (0x00000000UL)

/* HETER @Bit 0 : STMHETER support */
  #define STM_HEFEAT1R_HETER_Pos (0UL)
  #define STM_HEFEAT1R_HETER_Msk (0x1UL << STM_HEFEAT1R_HETER_Pos)
  #define STM_HEFEAT1R_HETER_Min (0x0UL)
  #define STM_HEFEAT1R_HETER_Max (0x1UL)
  #define STM_HEFEAT1R_HETER_NotImplemented (0x0UL)
  #define STM_HEFEAT1R_HETER_Implemented (0x1UL)

/* HEERR @Bit 2 : Hardware event error detection support */
  #define STM_HEFEAT1R_HEERR_Pos (2UL)
  #define STM_HEFEAT1R_HEERR_Msk (0x1UL << STM_HEFEAT1R_HEERR_Pos)
  #define STM_HEFEAT1R_HEERR_Min (0x0UL)
  #define STM_HEFEAT1R_HEERR_Max (0x1UL)
  #define STM_HEFEAT1R_HEERR_NotImplemented (0x0UL)
  #define STM_HEFEAT1R_HEERR_Implemented (0x1UL)

/* HEMASTR @Bit 3 : STMHEMASTR support */
  #define STM_HEFEAT1R_HEMASTR_Pos (3UL)
  #define STM_HEFEAT1R_HEMASTR_Msk (0x1UL << STM_HEFEAT1R_HEMASTR_Pos)
  #define STM_HEFEAT1R_HEMASTR_Min (0x0UL)
  #define STM_HEFEAT1R_HEMASTR_Max (0x1UL)
  #define STM_HEFEAT1R_HEMASTR_NotImplemented (0x0UL)
  #define STM_HEFEAT1R_HEMASTR_Implemented (0x1UL)

/* NUMHE @Bits 15..23 : The number of hardware events supported by the STM */
  #define STM_HEFEAT1R_NUMHE_Pos (15UL)
  #define STM_HEFEAT1R_NUMHE_Msk (0x1FFUL << STM_HEFEAT1R_NUMHE_Pos)
  #define STM_HEFEAT1R_NUMHE_Min (0x000UL)
  #define STM_HEFEAT1R_NUMHE_Max (0x0FFUL)


/* STM_HEIDR: Indicates the features of hardware event tracing in the STM. */
  #define STM_HEIDR_ResetValue (0x00000000UL)

/* CLASS @Bits 0..3 : The CLASS field identifies the programmers model */
  #define STM_HEIDR_CLASS_Pos (0UL)
  #define STM_HEIDR_CLASS_Msk (0xFUL << STM_HEIDR_CLASS_Pos)
  #define STM_HEIDR_CLASS_Min (0x1UL)
  #define STM_HEIDR_CLASS_Max (0x1UL)
  #define STM_HEIDR_CLASS_HardwareEventControl (0x1UL)

/* CLASSREV @Bits 4..7 : The CLASSREV field identifies the revision of the programmers model */
  #define STM_HEIDR_CLASSREV_Pos (4UL)
  #define STM_HEIDR_CLASSREV_Msk (0xFUL << STM_HEIDR_CLASSREV_Pos)

/* VENDSPEC @Bits 8..11 : The VENDSPEC field identifies any vendor specific modifications or mappings */
  #define STM_HEIDR_VENDSPEC_Pos (8UL)
  #define STM_HEIDR_VENDSPEC_Msk (0xFUL << STM_HEIDR_VENDSPEC_Pos)


/* STM_TCSR: Controls the STM settings. */
  #define STM_TCSR_ResetValue (0x00000000UL)

/* EN @Bit 0 : Global STM enable */
  #define STM_TCSR_EN_Pos (0UL)
  #define STM_TCSR_EN_Msk (0x1UL << STM_TCSR_EN_Pos)
  #define STM_TCSR_EN_Min (0x0UL)
  #define STM_TCSR_EN_Max (0x1UL)
  #define STM_TCSR_EN_Disabled (0x0UL)
  #define STM_TCSR_EN_Enabled (0x1UL)

/* TSEN @Bit 1 : Enable or disable timestamp bundling. */
  #define STM_TCSR_TSEN_Pos (1UL)
  #define STM_TCSR_TSEN_Msk (0x1UL << STM_TCSR_TSEN_Pos)
  #define STM_TCSR_TSEN_Min (0x0UL)
  #define STM_TCSR_TSEN_Max (0x1UL)
  #define STM_TCSR_TSEN_Disabled (0x0UL)             /*!< Time stamps are disabled. Requests for timestamp generation are
                                                          ignored, and stimulus port writes selecting timestamping are treated
                                                          as if it were not selected.*/
  #define STM_TCSR_TSEN_Enabled (0x1UL)              /*!< Time stamps are enabled. If stimulus writes select timestamping, a
                                                          timestamp is output according to STPv2.*/

/* SYNCEN @Bit 2 : STMSYNCR is implemented so this value is Read As One. */
  #define STM_TCSR_SYNCEN_Pos (2UL)
  #define STM_TCSR_SYNCEN_Msk (0x1UL << STM_TCSR_SYNCEN_Pos)
  #define STM_TCSR_SYNCEN_Min (0x0UL)
  #define STM_TCSR_SYNCEN_Max (0x1UL)
  #define STM_TCSR_SYNCEN_Disabled (0x0UL)
  #define STM_TCSR_SYNCEN_Enabled (0x1UL)

/* COMPEN @Bit 5 : Compression Enable for Stimulus Ports. */
  #define STM_TCSR_COMPEN_Pos (5UL)
  #define STM_TCSR_COMPEN_Msk (0x1UL << STM_TCSR_COMPEN_Pos)
  #define STM_TCSR_COMPEN_Min (0x0UL)
  #define STM_TCSR_COMPEN_Max (0x1UL)
  #define STM_TCSR_COMPEN_Disabled (0x0UL)           /*!< Compression disabled, data transfers are transmitted at the size of
                                                          the transaction.*/
  #define STM_TCSR_COMPEN_Enabled (0x1UL)

/* TRACEID @Bits 16..22 : ATB Trace ID. Setting this value to all zeroes might result in Unpredictable tracing. */
  #define STM_TCSR_TRACEID_Pos (16UL)
  #define STM_TCSR_TRACEID_Msk (0x7FUL << STM_TCSR_TRACEID_Pos)
  #define STM_TCSR_TRACEID_Min (0x7FUL)
  #define STM_TCSR_TRACEID_Max (0x7FUL)

/* BUSY @Bit 23 : STM is busy, for example the STM trace FIFO is not empty. */
  #define STM_TCSR_BUSY_Pos (23UL)
  #define STM_TCSR_BUSY_Msk (0x1UL << STM_TCSR_BUSY_Pos)
  #define STM_TCSR_BUSY_Min (0x0UL)
  #define STM_TCSR_BUSY_Max (0x1UL)
  #define STM_TCSR_BUSY_Ready (0x0UL)
  #define STM_TCSR_BUSY_Busy (0x1UL)


/* STM_AUXCR: Used for implementation defined STM controls. */
  #define STM_AUXCR_ResetValue (0x00000000UL)

/* FIFOAF @Bit 0 : FIFO Auto-flush. */
  #define STM_AUXCR_FIFOAF_Pos (0UL)
  #define STM_AUXCR_FIFOAF_Msk (0x1UL << STM_AUXCR_FIFOAF_Pos)
  #define STM_AUXCR_FIFOAF_Min (0x0UL)
  #define STM_AUXCR_FIFOAF_Max (0x1UL)
  #define STM_AUXCR_FIFOAF_Disabled (0x0UL)
  #define STM_AUXCR_FIFOAF_Enabled (0x1UL)           /*!< Auto-flush is enabled. The STM automatically drains all data it has
                                                          even if the ATB interface is not fully utilized.*/

/* ASYNCPE @Bit 1 : Is ASYNC priority higher than trace? */
  #define STM_AUXCR_ASYNCPE_Pos (1UL)
  #define STM_AUXCR_ASYNCPE_Msk (0x1UL << STM_AUXCR_ASYNCPE_Pos)
  #define STM_AUXCR_ASYNCPE_Min (0x0UL)
  #define STM_AUXCR_ASYNCPE_Max (0x1UL)
  #define STM_AUXCR_ASYNCPE_Lower (0x0UL)
  #define STM_AUXCR_ASYNCPE_Escalate (0x1UL)

/* PRIORINVDIS @Bit 2 : Controls arbitration between AXI and HW during flush. */
  #define STM_AUXCR_PRIORINVDIS_Pos (2UL)
  #define STM_AUXCR_PRIORINVDIS_Msk (0x1UL << STM_AUXCR_PRIORINVDIS_Pos)
  #define STM_AUXCR_PRIORINVDIS_Min (0x0UL)
  #define STM_AUXCR_PRIORINVDIS_Max (0x1UL)
  #define STM_AUXCR_PRIORINVDIS_Enabled (0x0UL)      /*!< Priority inversion, when AXI flush is finished, HW gets priority until
                                                          HW flush is done.*/
  #define STM_AUXCR_PRIORINVDIS_Disabled (0x1UL)

/* CLKON @Bit 3 : Provides override control for architectural clock gate enable. */
  #define STM_AUXCR_CLKON_Pos (3UL)
  #define STM_AUXCR_CLKON_Msk (0x1UL << STM_AUXCR_CLKON_Pos)
  #define STM_AUXCR_CLKON_Min (0x0UL)
  #define STM_AUXCR_CLKON_Max (0x1UL)
  #define STM_AUXCR_CLKON_Disabled (0x0UL)
  #define STM_AUXCR_CLKON_Enabled (0x1UL)

/* AFREADYHIGH @Bit 4 : Provides override control for the AFREADY output */
  #define STM_AUXCR_AFREADYHIGH_Pos (4UL)
  #define STM_AUXCR_AFREADYHIGH_Msk (0x1UL << STM_AUXCR_AFREADYHIGH_Pos)
  #define STM_AUXCR_AFREADYHIGH_Min (0x0UL)
  #define STM_AUXCR_AFREADYHIGH_Max (0x1UL)
  #define STM_AUXCR_AFREADYHIGH_Disabled (0x0UL)
  #define STM_AUXCR_AFREADYHIGH_Enabled (0x1UL)


/* STM_SPFEAT1R: Indicates the features of the STM. */
  #define STM_SPFEAT1R_ResetValue (0x00000000UL)

/* PROT @Bits 0..3 : Indicates the implemented STM protocol. */
  #define STM_SPFEAT1R_PROT_Pos (0UL)
  #define STM_SPFEAT1R_PROT_Msk (0xFUL << STM_SPFEAT1R_PROT_Pos)
  #define STM_SPFEAT1R_PROT_Min (0x1UL)
  #define STM_SPFEAT1R_PROT_Max (0x1UL)
  #define STM_SPFEAT1R_PROT_STPV2 (0x1UL)

/* TS @Bits 4..5 : Timestamp support. */
  #define STM_SPFEAT1R_TS_Pos (4UL)
  #define STM_SPFEAT1R_TS_Msk (0x3UL << STM_SPFEAT1R_TS_Pos)
  #define STM_SPFEAT1R_TS_Min (0x1UL)
  #define STM_SPFEAT1R_TS_Max (0x1UL)
  #define STM_SPFEAT1R_TS_Absolute (0x1UL)

/* TSFREQ @Bit 6 : Timestamp frequency indication configuration. */
  #define STM_SPFEAT1R_TSFREQ_Pos (6UL)
  #define STM_SPFEAT1R_TSFREQ_Msk (0x1UL << STM_SPFEAT1R_TSFREQ_Pos)
  #define STM_SPFEAT1R_TSFREQ_Min (0x0UL)
  #define STM_SPFEAT1R_TSFREQ_Max (0x1UL)
  #define STM_SPFEAT1R_TSFREQ_NotImplemented (0x0UL)
  #define STM_SPFEAT1R_TSFREQ_Implemented (0x1UL)

/* FORCETS @Bit 7 : Timestamp force configuration. */
  #define STM_SPFEAT1R_FORCETS_Pos (7UL)
  #define STM_SPFEAT1R_FORCETS_Msk (0x1UL << STM_SPFEAT1R_FORCETS_Pos)
  #define STM_SPFEAT1R_FORCETS_Min (0x0UL)
  #define STM_SPFEAT1R_FORCETS_Max (0x1UL)
  #define STM_SPFEAT1R_FORCETS_NotImplemented (0x0UL)
  #define STM_SPFEAT1R_FORCETS_Implemented (0x1UL)

