pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRACEBUS @Bits 10..13 : Trace bus support. */
  #define STM_SPFEAT1R_TRACEBUS_Pos (10UL)
  #define STM_SPFEAT1R_TRACEBUS_Msk (0xFUL << STM_SPFEAT1R_TRACEBUS_Pos)

/* TRIGCTL @Bits 14..15 : Trigger control support. */
  #define STM_SPFEAT1R_TRIGCTL_Pos (14UL)
  #define STM_SPFEAT1R_TRIGCTL_Msk (0x3UL << STM_SPFEAT1R_TRIGCTL_Pos)

/* TSPRESCALE @Bits 16..17 : Timestamp prescale support */
  #define STM_SPFEAT1R_TSPRESCALE_Pos (16UL)
  #define STM_SPFEAT1R_TSPRESCALE_Msk (0x3UL << STM_SPFEAT1R_TSPRESCALE_Pos)
  #define STM_SPFEAT1R_TSPRESCALE_Min (0x0UL)
  #define STM_SPFEAT1R_TSPRESCALE_Max (0x1UL)
  #define STM_SPFEAT1R_TSPRESCALE_NotImplemented (0x0UL)
  #define STM_SPFEAT1R_TSPRESCALE_Implemented (0x1UL)

/* HWTEN @Bits 18..19 : STMTCSR.HWTEN support */
  #define STM_SPFEAT1R_HWTEN_Pos (18UL)
  #define STM_SPFEAT1R_HWTEN_Msk (0x3UL << STM_SPFEAT1R_HWTEN_Pos)
  #define STM_SPFEAT1R_HWTEN_Min (0x1UL)
  #define STM_SPFEAT1R_HWTEN_Max (0x1UL)
  #define STM_SPFEAT1R_HWTEN_NotImplemented (0x1UL)

/* SYNCEN @Bits 20..21 : STMTCSR.SYNCEN support */
  #define STM_SPFEAT1R_SYNCEN_Pos (20UL)
  #define STM_SPFEAT1R_SYNCEN_Msk (0x3UL << STM_SPFEAT1R_SYNCEN_Pos)
  #define STM_SPFEAT1R_SYNCEN_Min (0x2UL)
  #define STM_SPFEAT1R_SYNCEN_Max (0x2UL)
  #define STM_SPFEAT1R_SYNCEN_ReadAsOne (0x2UL)

/* SWOEN @Bits 22..23 : STMTCSR.SWOEN support */
  #define STM_SPFEAT1R_SWOEN_Pos (22UL)
  #define STM_SPFEAT1R_SWOEN_Msk (0x3UL << STM_SPFEAT1R_SWOEN_Pos)
  #define STM_SPFEAT1R_SWOEN_Min (0x1UL)
  #define STM_SPFEAT1R_SWOEN_Max (0x1UL)
  #define STM_SPFEAT1R_SWOEN_NotImplemented (0x1UL)


/* STM_SPFEAT2R: Indicates the features of the STM. */
  #define STM_SPFEAT2R_ResetValue (0x00000000UL)

/* SPTER @Bits 0..1 : STMSPTER support. */
  #define STM_SPFEAT2R_SPTER_Pos (0UL)
  #define STM_SPFEAT2R_SPTER_Msk (0x3UL << STM_SPFEAT2R_SPTER_Pos)
  #define STM_SPFEAT2R_SPTER_Min (0x2UL)
  #define STM_SPFEAT2R_SPTER_Max (0x2UL)
  #define STM_SPFEAT2R_SPTER_Implemented (0x2UL)

/* SPER @Bit 2 : STMSPER presence. */
  #define STM_SPFEAT2R_SPER_Pos (2UL)
  #define STM_SPFEAT2R_SPER_Msk (0x1UL << STM_SPFEAT2R_SPER_Pos)
  #define STM_SPFEAT2R_SPER_Min (0x0UL)
  #define STM_SPFEAT2R_SPER_Max (0x1UL)
  #define STM_SPFEAT2R_SPER_Implemented (0x0UL)
  #define STM_SPFEAT2R_SPER_NotImplemented (0x1UL)

/* SPCOMP @Bits 4..5 : Data compression on stimulus ports support. */
  #define STM_SPFEAT2R_SPCOMP_Pos (4UL)
  #define STM_SPFEAT2R_SPCOMP_Msk (0x3UL << STM_SPFEAT2R_SPCOMP_Pos)
  #define STM_SPFEAT2R_SPCOMP_Min (0x3UL)
  #define STM_SPFEAT2R_SPCOMP_Max (0x3UL)
  #define STM_SPFEAT2R_SPCOMP_Programmable (0x3UL)   /*!< Data compression support is programmable. STMTCSR.COMPEN is
                                                          implemented.*/

/* SPOVERRIDE @Bit 6 : Timestamp force configuration. */
  #define STM_SPFEAT2R_SPOVERRIDE_Pos (6UL)
  #define STM_SPFEAT2R_SPOVERRIDE_Msk (0x1UL << STM_SPFEAT2R_SPOVERRIDE_Pos)
  #define STM_SPFEAT2R_SPOVERRIDE_Min (0x0UL)
  #define STM_SPFEAT2R_SPOVERRIDE_Max (0x1UL)
  #define STM_SPFEAT2R_SPOVERRIDE_NotImplemented (0x0UL)
  #define STM_SPFEAT2R_SPOVERRIDE_Implemented (0x1UL)

/* PRIVMASK @Bits 7..8 : STMPRIVMASKR support. */
  #define STM_SPFEAT2R_PRIVMASK_Pos (7UL)
  #define STM_SPFEAT2R_PRIVMASK_Msk (0x3UL << STM_SPFEAT2R_PRIVMASK_Pos)
  #define STM_SPFEAT2R_PRIVMASK_Min (0x1UL)
  #define STM_SPFEAT2R_PRIVMASK_Max (0x1UL)
  #define STM_SPFEAT2R_PRIVMASK_NotImplemented (0x1UL)

/* SPTRTYPE @Bits 9..10 : Stimulus port transaction type support. */
  #define STM_SPFEAT2R_SPTRTYPE_Pos (9UL)
  #define STM_SPFEAT2R_SPTRTYPE_Msk (0x3UL << STM_SPFEAT2R_SPTRTYPE_Pos)
  #define STM_SPFEAT2R_SPTRTYPE_Min (0x2UL)
  #define STM_SPFEAT2R_SPTRTYPE_Max (0x2UL)
  #define STM_SPFEAT2R_SPTRTYPE_InvariantAndGuaranteed (0x2UL) /*!< Both invariant timing and guaranteed transactions are
                                                                    supported.*/

/* DSIZE @Bits 12..15 : Fundamental data size. */
  #define STM_SPFEAT2R_DSIZE_Pos (12UL)
  #define STM_SPFEAT2R_DSIZE_Msk (0xFUL << STM_SPFEAT2R_DSIZE_Pos)
  #define STM_SPFEAT2R_DSIZE_Min (0x0UL)
  #define STM_SPFEAT2R_DSIZE_Max (0x0UL)
  #define STM_SPFEAT2R_DSIZE_Bits32 (0x0UL)

/* SPTYPE @Bits 18..19 : Stimulus port type support */
  #define STM_SPFEAT2R_SPTYPE_Pos (18UL)
  #define STM_SPFEAT2R_SPTYPE_Msk (0x3UL << STM_SPFEAT2R_SPTYPE_Pos)
  #define STM_SPFEAT2R_SPTYPE_Min (0x1UL)
  #define STM_SPFEAT2R_SPTYPE_Max (0x1UL)
  #define STM_SPFEAT2R_SPTYPE_OnlyExtended (0x1UL)


/* STM_SPFEAT3R: Indicates the features of the STM. */
  #define STM_SPFEAT3R_ResetValue (0x00000000UL)

/* NUMMAST @Bits 0..6 : The number of stimulus ports masters implemented, minus 1. */
  #define STM_SPFEAT3R_NUMMAST_Pos (0UL)
  #define STM_SPFEAT3R_NUMMAST_Msk (0x7FUL << STM_SPFEAT3R_NUMMAST_Pos)
  #define STM_SPFEAT3R_NUMMAST_Min (0x3FUL)
  #define STM_SPFEAT3R_NUMMAST_Max (0x3FUL)
  #define STM_SPFEAT3R_NUMMAST_Masters128 (0x3FUL)


/* STM_ITTRIGGER: Integration Test for Cross-Trigger Outputs Register. */
  #define STM_ITTRIGGER_ResetValue (0x00000000UL)

/* TRIGOUTSPTE_W @Bit 0 : Sets the value of the TRIGOUTSPTE output in integration mode. */
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Pos (0UL)
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Msk (0x1UL << STM_ITTRIGGER_TRIGOUTSPTE_W_Pos)
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Min (0x0UL)
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Max (0x1UL)
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_Low (0x0UL)
  #define STM_ITTRIGGER_TRIGOUTSPTE_W_High (0x1UL)

/* TRIGOUTSW_W @Bit 1 : Sets the value of the TRIGOUTSW output in integration mode. */
  #define STM_ITTRIGGER_TRIGOUTSW_W_Pos (1UL)
  #define STM_ITTRIGGER_TRIGOUTSW_W_Msk (0x1UL << STM_ITTRIGGER_TRIGOUTSW_W_Pos)
  #define STM_ITTRIGGER_TRIGOUTSW_W_Min (0x0UL)
  #define STM_ITTRIGGER_TRIGOUTSW_W_Max (0x1UL)
  #define STM_ITTRIGGER_TRIGOUTSW_W_Low (0x0UL)
  #define STM_ITTRIGGER_TRIGOUTSW_W_High (0x1UL)

/* TRIGOUTHETE_W @Bit 2 : Sets the value of the TRIGOUTHETE output in integration mode. */
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Pos (2UL)
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Msk (0x1UL << STM_ITTRIGGER_TRIGOUTHETE_W_Pos)
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Min (0x0UL)
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Max (0x1UL)
  #define STM_ITTRIGGER_TRIGOUTHETE_W_Low (0x0UL)
  #define STM_ITTRIGGER_TRIGOUTHETE_W_High (0x1UL)

/* ASYNCOUT_W @Bit 3 : Sets the value of the ASYNCOUT output in integration mode. */
  #define STM_ITTRIGGER_ASYNCOUT_W_Pos (3UL)
  #define STM_ITTRIGGER_ASYNCOUT_W_Msk (0x1UL << STM_ITTRIGGER_ASYNCOUT_W_Pos)
  #define STM_ITTRIGGER_ASYNCOUT_W_Min (0x0UL)
  #define STM_ITTRIGGER_ASYNCOUT_W_Max (0x1UL)
  #define STM_ITTRIGGER_ASYNCOUT_W_Low (0x0UL)
  #define STM_ITTRIGGER_ASYNCOUT_W_High (0x1UL)


/* STM_ITATBDATA0: Controls the value of the ATDATAM output in integration mode. */
  #define STM_ITATBDATA0_ResetValue (0x00000000UL)

/* ATDATAM0_W @Bit 0 : Sets the value of the ATDATAM[0]. */
  #define STM_ITATBDATA0_ATDATAM0_W_Pos (0UL)
  #define STM_ITATBDATA0_ATDATAM0_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM0_W_Pos)
  #define STM_ITATBDATA0_ATDATAM0_W_Min (0x0UL)
  #define STM_ITATBDATA0_ATDATAM0_W_Max (0x1UL)
  #define STM_ITATBDATA0_ATDATAM0_W_Low (0x0UL)
  #define STM_ITATBDATA0_ATDATAM0_W_High (0x1UL)

/* ATDATAM7_W @Bit 1 : Sets the value of the ATDATAM[7] output. */
  #define STM_ITATBDATA0_ATDATAM7_W_Pos (1UL)
  #define STM_ITATBDATA0_ATDATAM7_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM7_W_Pos)
  #define STM_ITATBDATA0_ATDATAM7_W_Min (0x0UL)
  #define STM_ITATBDATA0_ATDATAM7_W_Max (0x1UL)
  #define STM_ITATBDATA0_ATDATAM7_W_Low (0x0UL)
  #define STM_ITATBDATA0_ATDATAM7_W_High (0x1UL)

/* ATDATAM15_W @Bit 2 : Sets the value of the ATDATAM[15]. */
  #define STM_ITATBDATA0_ATDATAM15_W_Pos (2UL)
  #define STM_ITATBDATA0_ATDATAM15_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM15_W_Pos)
  #define STM_ITATBDATA0_ATDATAM15_W_Min (0x0UL)
  #define STM_ITATBDATA0_ATDATAM15_W_Max (0x1UL)
  #define STM_ITATBDATA0_ATDATAM15_W_Low (0x0UL)
  #define STM_ITATBDATA0_ATDATAM15_W_High (0x1UL)

/* ATDATAM23_W @Bit 3 : Sets the value of the ATDATAM[23]. */
  #define STM_ITATBDATA0_ATDATAM23_W_Pos (3UL)
  #define STM_ITATBDATA0_ATDATAM23_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM23_W_Pos)
  #define STM_ITATBDATA0_ATDATAM23_W_Min (0x0UL)
  #define STM_ITATBDATA0_ATDATAM23_W_Max (0x1UL)
  #define STM_ITATBDATA0_ATDATAM23_W_Low (0x0UL)
  #define STM_ITATBDATA0_ATDATAM23_W_High (0x1UL)

