pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ATDATAM31_W @Bit 4 : Sets the value of the ATDATAM[31]. */
  #define STM_ITATBDATA0_ATDATAM31_W_Pos (4UL)
  #define STM_ITATBDATA0_ATDATAM31_W_Msk (0x1UL << STM_ITATBDATA0_ATDATAM31_W_Pos)
  #define STM_ITATBDATA0_ATDATAM31_W_Min (0x0UL)
  #define STM_ITATBDATA0_ATDATAM31_W_Max (0x1UL)
  #define STM_ITATBDATA0_ATDATAM31_W_Low (0x0UL)
  #define STM_ITATBDATA0_ATDATAM31_W_High (0x1UL)


/* STM_ITATBCTR2: Controls the value of the ATDATAM output in integration mode. */
  #define STM_ITATBCTR2_ResetValue (0x00000000UL)

/* ATREADYM_R @Bit 0 : Reads the value of the ATREADYM input. */
  #define STM_ITATBCTR2_ATREADYM_R_Pos (0UL)
  #define STM_ITATBCTR2_ATREADYM_R_Msk (0x1UL << STM_ITATBCTR2_ATREADYM_R_Pos)
  #define STM_ITATBCTR2_ATREADYM_R_Min (0x0UL)
  #define STM_ITATBCTR2_ATREADYM_R_Max (0x1UL)
  #define STM_ITATBCTR2_ATREADYM_R_Low (0x0UL)
  #define STM_ITATBCTR2_ATREADYM_R_High (0x1UL)

/* AFVALIDM_R @Bit 1 : Reads the value of the AFVALIDM input. */
  #define STM_ITATBCTR2_AFVALIDM_R_Pos (1UL)
  #define STM_ITATBCTR2_AFVALIDM_R_Msk (0x1UL << STM_ITATBCTR2_AFVALIDM_R_Pos)
  #define STM_ITATBCTR2_AFVALIDM_R_Min (0x0UL)
  #define STM_ITATBCTR2_AFVALIDM_R_Max (0x1UL)
  #define STM_ITATBCTR2_AFVALIDM_R_Low (0x0UL)
  #define STM_ITATBCTR2_AFVALIDM_R_High (0x1UL)


/* STM_ITATBID: Controls the value of the ATIDM output in integration mode. */
  #define STM_ITATBID_ResetValue (0x00000000UL)

/* ATIDM_W0 @Bit 0 : Sets the value of pin 0 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W0_Pos (0UL)
  #define STM_ITATBID_ATIDM_W0_Msk (0x1UL << STM_ITATBID_ATIDM_W0_Pos)
  #define STM_ITATBID_ATIDM_W0_Min (0x0UL)
  #define STM_ITATBID_ATIDM_W0_Max (0x1UL)
  #define STM_ITATBID_ATIDM_W0_Low (0x0UL)
  #define STM_ITATBID_ATIDM_W0_High (0x1UL)

/* ATIDM_W1 @Bit 1 : Sets the value of pin 1 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W1_Pos (1UL)
  #define STM_ITATBID_ATIDM_W1_Msk (0x1UL << STM_ITATBID_ATIDM_W1_Pos)
  #define STM_ITATBID_ATIDM_W1_Min (0x0UL)
  #define STM_ITATBID_ATIDM_W1_Max (0x1UL)
  #define STM_ITATBID_ATIDM_W1_Low (0x0UL)
  #define STM_ITATBID_ATIDM_W1_High (0x1UL)

/* ATIDM_W2 @Bit 2 : Sets the value of pin 2 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W2_Pos (2UL)
  #define STM_ITATBID_ATIDM_W2_Msk (0x1UL << STM_ITATBID_ATIDM_W2_Pos)
  #define STM_ITATBID_ATIDM_W2_Min (0x0UL)
  #define STM_ITATBID_ATIDM_W2_Max (0x1UL)
  #define STM_ITATBID_ATIDM_W2_Low (0x0UL)
  #define STM_ITATBID_ATIDM_W2_High (0x1UL)

/* ATIDM_W3 @Bit 3 : Sets the value of pin 3 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W3_Pos (3UL)
  #define STM_ITATBID_ATIDM_W3_Msk (0x1UL << STM_ITATBID_ATIDM_W3_Pos)
  #define STM_ITATBID_ATIDM_W3_Min (0x0UL)
  #define STM_ITATBID_ATIDM_W3_Max (0x1UL)
  #define STM_ITATBID_ATIDM_W3_Low (0x0UL)
  #define STM_ITATBID_ATIDM_W3_High (0x1UL)

/* ATIDM_W4 @Bit 4 : Sets the value of pin 4 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W4_Pos (4UL)
  #define STM_ITATBID_ATIDM_W4_Msk (0x1UL << STM_ITATBID_ATIDM_W4_Pos)
  #define STM_ITATBID_ATIDM_W4_Min (0x0UL)
  #define STM_ITATBID_ATIDM_W4_Max (0x1UL)
  #define STM_ITATBID_ATIDM_W4_Low (0x0UL)
  #define STM_ITATBID_ATIDM_W4_High (0x1UL)

/* ATIDM_W5 @Bit 5 : Sets the value of pin 5 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W5_Pos (5UL)
  #define STM_ITATBID_ATIDM_W5_Msk (0x1UL << STM_ITATBID_ATIDM_W5_Pos)
  #define STM_ITATBID_ATIDM_W5_Min (0x0UL)
  #define STM_ITATBID_ATIDM_W5_Max (0x1UL)
  #define STM_ITATBID_ATIDM_W5_Low (0x0UL)
  #define STM_ITATBID_ATIDM_W5_High (0x1UL)

/* ATIDM_W6 @Bit 6 : Sets the value of pin 6 of the ATIDM output. */
  #define STM_ITATBID_ATIDM_W6_Pos (6UL)
  #define STM_ITATBID_ATIDM_W6_Msk (0x1UL << STM_ITATBID_ATIDM_W6_Pos)
  #define STM_ITATBID_ATIDM_W6_Min (0x0UL)
  #define STM_ITATBID_ATIDM_W6_Max (0x1UL)
  #define STM_ITATBID_ATIDM_W6_Low (0x0UL)
  #define STM_ITATBID_ATIDM_W6_High (0x1UL)


/* STM_ITATBCTR0: Controls the value of the ATVALIDM, AFREADYM, and ATBYTESM outputs in integration mode. */
  #define STM_ITATBCTR0_ResetValue (0x00000000UL)

/* ATVALIDM_W @Bit 0 : Sets the value of the ATVALIDM output. */
  #define STM_ITATBCTR0_ATVALIDM_W_Pos (0UL)
  #define STM_ITATBCTR0_ATVALIDM_W_Msk (0x1UL << STM_ITATBCTR0_ATVALIDM_W_Pos)
  #define STM_ITATBCTR0_ATVALIDM_W_Min (0x0UL)
  #define STM_ITATBCTR0_ATVALIDM_W_Max (0x1UL)
  #define STM_ITATBCTR0_ATVALIDM_W_Low (0x0UL)
  #define STM_ITATBCTR0_ATVALIDM_W_High (0x1UL)

/* AFREADYM_W @Bit 1 : Sets the value of the AFREADYM_W output. */
  #define STM_ITATBCTR0_AFREADYM_W_Pos (1UL)
  #define STM_ITATBCTR0_AFREADYM_W_Msk (0x1UL << STM_ITATBCTR0_AFREADYM_W_Pos)
  #define STM_ITATBCTR0_AFREADYM_W_Min (0x0UL)
  #define STM_ITATBCTR0_AFREADYM_W_Max (0x1UL)
  #define STM_ITATBCTR0_AFREADYM_W_Low (0x0UL)
  #define STM_ITATBCTR0_AFREADYM_W_High (0x1UL)

/* ATBYTESM_W0 @Bit 8 : Sets the value of pin 0 of the ATBYTESM output. */
  #define STM_ITATBCTR0_ATBYTESM_W0_Pos (8UL)
  #define STM_ITATBCTR0_ATBYTESM_W0_Msk (0x1UL << STM_ITATBCTR0_ATBYTESM_W0_Pos)
  #define STM_ITATBCTR0_ATBYTESM_W0_Min (0x0UL)
  #define STM_ITATBCTR0_ATBYTESM_W0_Max (0x1UL)
  #define STM_ITATBCTR0_ATBYTESM_W0_Low (0x0UL)
  #define STM_ITATBCTR0_ATBYTESM_W0_High (0x1UL)

/* ATBYTESM_W1 @Bit 9 : Sets the value of pin 1 of the ATBYTESM output. */
  #define STM_ITATBCTR0_ATBYTESM_W1_Pos (9UL)
  #define STM_ITATBCTR0_ATBYTESM_W1_Msk (0x1UL << STM_ITATBCTR0_ATBYTESM_W1_Pos)
  #define STM_ITATBCTR0_ATBYTESM_W1_Min (0x0UL)
  #define STM_ITATBCTR0_ATBYTESM_W1_Max (0x1UL)
  #define STM_ITATBCTR0_ATBYTESM_W1_Low (0x0UL)
  #define STM_ITATBCTR0_ATBYTESM_W1_High (0x1UL)


/* STM_ITCTRL: Used to enable topology detection. This register enables the component to switch from a functional mode, the
                default behavior, to integration mode where the inputs and outputs of the component can be directly controlled
                for integration testing and topology solving. */

  #define STM_ITCTRL_ResetValue (0x00000000UL)

/* INTEGRATIONMODE @Bit 0 : Enables the component to switch from functional mode to integration mode and back. If no integration
                            functionality is implemented, this register must read as zero. */

  #define STM_ITCTRL_INTEGRATIONMODE_Pos (0UL)
  #define STM_ITCTRL_INTEGRATIONMODE_Msk (0x1UL << STM_ITCTRL_INTEGRATIONMODE_Pos)
  #define STM_ITCTRL_INTEGRATIONMODE_Min (0x0UL)
  #define STM_ITCTRL_INTEGRATIONMODE_Max (0x1UL)
  #define STM_ITCTRL_INTEGRATIONMODE_Disabled (0x0UL)
  #define STM_ITCTRL_INTEGRATIONMODE_Enabled (0x1UL)


/* STM_LAR: This is used to enable write access to device registers. */
  #define STM_LAR_ResetValue (0x00000000UL)

