pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ACCESS @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.
                        */

  #define STM_LAR_ACCESS_Pos (0UL)
  #define STM_LAR_ACCESS_Msk (0xFFFFFFFFUL << STM_LAR_ACCESS_Pos)
  #define STM_LAR_ACCESS_Min (0xC5ACCE55UL)
  #define STM_LAR_ACCESS_Max (0xC5ACCE55UL)
  #define STM_LAR_ACCESS_UnLock (0xC5ACCE55UL)


/* STM_LSR: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under debug.
             Accesses to the extended stimulus port registers are not affected by the lock mechanism. This register must always
             be present although there might not be any lock access control mechanism. The lock mechanism, where present and
             locked, must block write accesses to any control register, except the Lock Access Register. For most components
             this covers all registers except for the Lock Access Register. */

  #define STM_LSR_ResetValue (0x00000000UL)

/* PRESENT @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define STM_LSR_PRESENT_Pos (0UL)
  #define STM_LSR_PRESENT_Msk (0x1UL << STM_LSR_PRESENT_Pos)
  #define STM_LSR_PRESENT_Min (0x0UL)
  #define STM_LSR_PRESENT_Max (0x1UL)
  #define STM_LSR_PRESENT_NotImplemented (0x0UL)     /*!< No lock control mechanism exists, writes to the Lock Access Register
                                                          are ignored.*/
  #define STM_LSR_PRESENT_Implemented (0x1UL)

/* LOCKED @Bit 1 : Returns the current status of the Lock. */
  #define STM_LSR_LOCKED_Pos (1UL)
  #define STM_LSR_LOCKED_Msk (0x1UL << STM_LSR_LOCKED_Pos)
  #define STM_LSR_LOCKED_Min (0x0UL)
  #define STM_LSR_LOCKED_Max (0x1UL)
  #define STM_LSR_LOCKED_UnLocked (0x0UL)
  #define STM_LSR_LOCKED_Locked (0x1UL)              /*!< Write access to the component is blocked. All writes to control
                                                          registers are ignored. Reads are permitted.*/

/* TYPE @Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
  #define STM_LSR_TYPE_Pos (2UL)
  #define STM_LSR_TYPE_Msk (0x1UL << STM_LSR_TYPE_Pos)
  #define STM_LSR_TYPE_Min (0x0UL)
  #define STM_LSR_TYPE_Max (0x1UL)
  #define STM_LSR_TYPE_Bits32 (0x0UL)
  #define STM_LSR_TYPE_Bits8 (0x1UL)


/* STM_AUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define STM_AUTHSTATUS_ResetValue (0x00000000UL)

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define STM_AUTHSTATUS_NSID_Pos (0UL)
  #define STM_AUTHSTATUS_NSID_Msk (0x3UL << STM_AUTHSTATUS_NSID_Pos)
  #define STM_AUTHSTATUS_NSID_Min (0x0UL)
  #define STM_AUTHSTATUS_NSID_Max (0x1UL)
  #define STM_AUTHSTATUS_NSID_NotImplemented (0x0UL)
  #define STM_AUTHSTATUS_NSID_Implemented (0x1UL)

/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define STM_AUTHSTATUS_NSNID_Pos (2UL)
  #define STM_AUTHSTATUS_NSNID_Msk (0x3UL << STM_AUTHSTATUS_NSNID_Pos)
  #define STM_AUTHSTATUS_NSNID_Min (0x0UL)
  #define STM_AUTHSTATUS_NSNID_Max (0x1UL)
  #define STM_AUTHSTATUS_NSNID_NotImplemented (0x0UL)
  #define STM_AUTHSTATUS_NSNID_Implemented (0x1UL)

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define STM_AUTHSTATUS_SID_Pos (4UL)
  #define STM_AUTHSTATUS_SID_Msk (0x3UL << STM_AUTHSTATUS_SID_Pos)
  #define STM_AUTHSTATUS_SID_Min (0x0UL)
  #define STM_AUTHSTATUS_SID_Max (0x1UL)
  #define STM_AUTHSTATUS_SID_NotImplemented (0x0UL)
  #define STM_AUTHSTATUS_SID_Implemented (0x1UL)

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define STM_AUTHSTATUS_SNID_Pos (6UL)
  #define STM_AUTHSTATUS_SNID_Msk (0x3UL << STM_AUTHSTATUS_SNID_Pos)
  #define STM_AUTHSTATUS_SNID_Min (0x0UL)
  #define STM_AUTHSTATUS_SNID_Max (0x1UL)
  #define STM_AUTHSTATUS_SNID_NotImplemented (0x0UL)
  #define STM_AUTHSTATUS_SNID_Implemented (0x1UL)


/* STM_DEVID: Indicates the capabilities of the STM. */
  #define STM_DEVID_ResetValue (0x00000000UL)

/* NUMSP @Bits 0..16 : This value indicates the number of stimulus ports implemented. */
  #define STM_DEVID_NUMSP_Pos (0UL)
  #define STM_DEVID_NUMSP_Msk (0x1FFFFUL << STM_DEVID_NUMSP_Pos)
  #define STM_DEVID_NUMSP_Max (0x10000UL)


/* STM_DEVTYPE: Controls the single-shot comparator. */
  #define STM_DEVTYPE_ResetValue (0x00000000UL)

/* MAJOR @Bits 0..3 : The main type of the component */
  #define STM_DEVTYPE_MAJOR_Pos (0UL)
  #define STM_DEVTYPE_MAJOR_Msk (0xFUL << STM_DEVTYPE_MAJOR_Pos)
  #define STM_DEVTYPE_MAJOR_Min (0x3UL)
  #define STM_DEVTYPE_MAJOR_Max (0x3UL)
  #define STM_DEVTYPE_MAJOR_TraceSource (0x3UL)

/* SUB @Bits 4..7 : The sub-type of the component */
  #define STM_DEVTYPE_SUB_Pos (4UL)
  #define STM_DEVTYPE_SUB_Msk (0xFUL << STM_DEVTYPE_SUB_Pos)
  #define STM_DEVTYPE_SUB_Min (0x6UL)
  #define STM_DEVTYPE_SUB_Max (0x6UL)
  #define STM_DEVTYPE_SUB_StimulusTrace (0x6UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          STMDATA                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct STMDATA_DOMAIN ================================================== */
/**
  * @brief DOMAIN [STMDATA_DOMAIN] (unspecified)
  */
typedef struct {
  __IOM uint8_t   DATA[16777216];                    /*!< (@ 0x00000000) STM extended stimulus port data buffer area for domain
                                                                         n. NonSecure writes to this region generates trace
                                                                         packets with id n+96. Secure writes to this region
                                                                         generates trace packets with id n+32.*/
} NRF_STMDATA_DOMAIN_Type;
  #define STMDATA_DOMAIN_MaxCount (16UL)
  #define STMDATA_DOMAIN_MaxIndex (15UL)
  #define STMDATA_DOMAIN_MinIndex (0UL)

/* ===================================================== Struct STMDATA ====================================================== */
/**
  * @brief System Trace Macrocell data buffer
  */
  typedef struct {
    __IOM NRF_STMDATA_DOMAIN_Type DOMAIN[16];
  } NRF_STMDATA_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            SWI                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct SWI ======================================================== */
/**
  * @brief Software interrupt
  */
  typedef struct {
    __IM uint32_t RESERVED;
  } NRF_SWI_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            TBM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TBM ======================================================== */
/**
  * @brief Trace buffer monitor
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_FLUSH;
    __IM uint32_t RESERVED[61];
    __IOM uint32_t EVENTS_HALFFULL;
    __IOM uint32_t EVENTS_FULL;
    __IOM uint32_t EVENTS_FLUSH;
    __IM uint32_t RESERVED1[125];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t BUFFERSIZE;
    __IOM uint32_t COUNT;
    __IM uint32_t COUNTSNAPSHOT;
  } NRF_TBM_Type;

/* TBM_TASKS_START: Start counter */
  #define TBM_TASKS_START_ResetValue (0x00000000UL)

