pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS_START @Bit 0 : Start counter */
  #define TBM_TASKS_START_TASKS_START_Pos (0UL)
  #define TBM_TASKS_START_TASKS_START_Msk (0x1UL << TBM_TASKS_START_TASKS_START_Pos)
  #define TBM_TASKS_START_TASKS_START_Min (0x1UL)
  #define TBM_TASKS_START_TASKS_START_Max (0x1UL)
  #define TBM_TASKS_START_TASKS_START_Trigger (0x1UL)


/* TBM_TASKS_STOP: Stop counter, clear counter value */
  #define TBM_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop counter, clear counter value */
  #define TBM_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define TBM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TBM_TASKS_STOP_TASKS_STOP_Pos)
  #define TBM_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define TBM_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define TBM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* TBM_TASKS_FLUSH: Save current counter value to COUNTSNAPSHOT */
  #define TBM_TASKS_FLUSH_ResetValue (0x00000000UL)

/* TASKS_FLUSH @Bit 0 : Save current counter value to COUNTSNAPSHOT */
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Pos (0UL)
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Msk (0x1UL << TBM_TASKS_FLUSH_TASKS_FLUSH_Pos)
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Min (0x1UL)
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Max (0x1UL)
  #define TBM_TASKS_FLUSH_TASKS_FLUSH_Trigger (0x1UL)


/* TBM_EVENTS_HALFFULL: Counter value equals half-full */
  #define TBM_EVENTS_HALFFULL_ResetValue (0x00000000UL)

/* EVENTS_HALFFULL @Bit 0 : Counter value equals half-full */
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Pos (0UL)
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Msk (0x1UL << TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Pos) /*!< Bit mask of
                                                                            EVENTS_HALFFULL field.*/
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Min (0x0UL)
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Max (0x1UL)
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_NotGenerated (0x0UL)
  #define TBM_EVENTS_HALFFULL_EVENTS_HALFFULL_Generated (0x1UL)


/* TBM_EVENTS_FULL: Counter value equals full */
  #define TBM_EVENTS_FULL_ResetValue (0x00000000UL)

/* EVENTS_FULL @Bit 0 : Counter value equals full */
  #define TBM_EVENTS_FULL_EVENTS_FULL_Pos (0UL)
  #define TBM_EVENTS_FULL_EVENTS_FULL_Msk (0x1UL << TBM_EVENTS_FULL_EVENTS_FULL_Pos)
  #define TBM_EVENTS_FULL_EVENTS_FULL_Min (0x0UL)
  #define TBM_EVENTS_FULL_EVENTS_FULL_Max (0x1UL)
  #define TBM_EVENTS_FULL_EVENTS_FULL_NotGenerated (0x0UL)
  #define TBM_EVENTS_FULL_EVENTS_FULL_Generated (0x1UL)


/* TBM_EVENTS_FLUSH: Counter value saved to COUNTSNAPSHOT due to flush */
  #define TBM_EVENTS_FLUSH_ResetValue (0x00000000UL)

/* EVENTS_FLUSH @Bit 0 : Counter value saved to COUNTSNAPSHOT due to flush */
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Pos (0UL)
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Msk (0x1UL << TBM_EVENTS_FLUSH_EVENTS_FLUSH_Pos)
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Min (0x0UL)
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Max (0x1UL)
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_NotGenerated (0x0UL)
  #define TBM_EVENTS_FLUSH_EVENTS_FLUSH_Generated (0x1UL)


/* TBM_INTEN: Enable or disable interrupt */
  #define TBM_INTEN_ResetValue (0x00000000UL)

/* HALFFULL @Bit 0 : Enable or disable interrupt for event HALFFULL */
  #define TBM_INTEN_HALFFULL_Pos (0UL)
  #define TBM_INTEN_HALFFULL_Msk (0x1UL << TBM_INTEN_HALFFULL_Pos)
  #define TBM_INTEN_HALFFULL_Min (0x0UL)
  #define TBM_INTEN_HALFFULL_Max (0x1UL)
  #define TBM_INTEN_HALFFULL_Disabled (0x0UL)
  #define TBM_INTEN_HALFFULL_Enabled (0x1UL)

/* FULL @Bit 1 : Enable or disable interrupt for event FULL */
  #define TBM_INTEN_FULL_Pos (1UL)
  #define TBM_INTEN_FULL_Msk (0x1UL << TBM_INTEN_FULL_Pos)
  #define TBM_INTEN_FULL_Min (0x0UL)
  #define TBM_INTEN_FULL_Max (0x1UL)
  #define TBM_INTEN_FULL_Disabled (0x0UL)
  #define TBM_INTEN_FULL_Enabled (0x1UL)

/* FLUSH @Bit 2 : Enable or disable interrupt for event FLUSH */
  #define TBM_INTEN_FLUSH_Pos (2UL)
  #define TBM_INTEN_FLUSH_Msk (0x1UL << TBM_INTEN_FLUSH_Pos)
  #define TBM_INTEN_FLUSH_Min (0x0UL)
  #define TBM_INTEN_FLUSH_Max (0x1UL)
  #define TBM_INTEN_FLUSH_Disabled (0x0UL)
  #define TBM_INTEN_FLUSH_Enabled (0x1UL)


/* TBM_INTENSET: Enable interrupt */
  #define TBM_INTENSET_ResetValue (0x00000000UL)

/* HALFFULL @Bit 0 : Write '1' to enable interrupt for event HALFFULL */
  #define TBM_INTENSET_HALFFULL_Pos (0UL)
  #define TBM_INTENSET_HALFFULL_Msk (0x1UL << TBM_INTENSET_HALFFULL_Pos)
  #define TBM_INTENSET_HALFFULL_Min (0x0UL)
  #define TBM_INTENSET_HALFFULL_Max (0x1UL)
  #define TBM_INTENSET_HALFFULL_Set (0x1UL)
  #define TBM_INTENSET_HALFFULL_Disabled (0x0UL)
  #define TBM_INTENSET_HALFFULL_Enabled (0x1UL)

/* FULL @Bit 1 : Write '1' to enable interrupt for event FULL */
  #define TBM_INTENSET_FULL_Pos (1UL)
  #define TBM_INTENSET_FULL_Msk (0x1UL << TBM_INTENSET_FULL_Pos)
  #define TBM_INTENSET_FULL_Min (0x0UL)
  #define TBM_INTENSET_FULL_Max (0x1UL)
  #define TBM_INTENSET_FULL_Set (0x1UL)
  #define TBM_INTENSET_FULL_Disabled (0x0UL)
  #define TBM_INTENSET_FULL_Enabled (0x1UL)

/* FLUSH @Bit 2 : Write '1' to enable interrupt for event FLUSH */
  #define TBM_INTENSET_FLUSH_Pos (2UL)
  #define TBM_INTENSET_FLUSH_Msk (0x1UL << TBM_INTENSET_FLUSH_Pos)
  #define TBM_INTENSET_FLUSH_Min (0x0UL)
  #define TBM_INTENSET_FLUSH_Max (0x1UL)
  #define TBM_INTENSET_FLUSH_Set (0x1UL)
  #define TBM_INTENSET_FLUSH_Disabled (0x0UL)
  #define TBM_INTENSET_FLUSH_Enabled (0x1UL)


/* TBM_INTENCLR: Disable interrupt */
  #define TBM_INTENCLR_ResetValue (0x00000000UL)

/* HALFFULL @Bit 0 : Write '1' to disable interrupt for event HALFFULL */
  #define TBM_INTENCLR_HALFFULL_Pos (0UL)
  #define TBM_INTENCLR_HALFFULL_Msk (0x1UL << TBM_INTENCLR_HALFFULL_Pos)
  #define TBM_INTENCLR_HALFFULL_Min (0x0UL)
  #define TBM_INTENCLR_HALFFULL_Max (0x1UL)
  #define TBM_INTENCLR_HALFFULL_Clear (0x1UL)
  #define TBM_INTENCLR_HALFFULL_Disabled (0x0UL)
  #define TBM_INTENCLR_HALFFULL_Enabled (0x1UL)

/* FULL @Bit 1 : Write '1' to disable interrupt for event FULL */
  #define TBM_INTENCLR_FULL_Pos (1UL)
  #define TBM_INTENCLR_FULL_Msk (0x1UL << TBM_INTENCLR_FULL_Pos)
  #define TBM_INTENCLR_FULL_Min (0x0UL)
  #define TBM_INTENCLR_FULL_Max (0x1UL)
  #define TBM_INTENCLR_FULL_Clear (0x1UL)
  #define TBM_INTENCLR_FULL_Disabled (0x0UL)
  #define TBM_INTENCLR_FULL_Enabled (0x1UL)

/* FLUSH @Bit 2 : Write '1' to disable interrupt for event FLUSH */
  #define TBM_INTENCLR_FLUSH_Pos (2UL)
  #define TBM_INTENCLR_FLUSH_Msk (0x1UL << TBM_INTENCLR_FLUSH_Pos)
  #define TBM_INTENCLR_FLUSH_Min (0x0UL)
  #define TBM_INTENCLR_FLUSH_Max (0x1UL)
  #define TBM_INTENCLR_FLUSH_Clear (0x1UL)
  #define TBM_INTENCLR_FLUSH_Disabled (0x0UL)
  #define TBM_INTENCLR_FLUSH_Enabled (0x1UL)


