pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TBM_INTPEND: Pending interrupts */
  #define TBM_INTPEND_ResetValue (0x00000000UL)

/* HALFFULL @Bit 0 : Read pending status of interrupt for event HALFFULL */
  #define TBM_INTPEND_HALFFULL_Pos (0UL)
  #define TBM_INTPEND_HALFFULL_Msk (0x1UL << TBM_INTPEND_HALFFULL_Pos)
  #define TBM_INTPEND_HALFFULL_Min (0x0UL)
  #define TBM_INTPEND_HALFFULL_Max (0x1UL)
  #define TBM_INTPEND_HALFFULL_NotPending (0x0UL)
  #define TBM_INTPEND_HALFFULL_Pending (0x1UL)

/* FULL @Bit 1 : Read pending status of interrupt for event FULL */
  #define TBM_INTPEND_FULL_Pos (1UL)
  #define TBM_INTPEND_FULL_Msk (0x1UL << TBM_INTPEND_FULL_Pos)
  #define TBM_INTPEND_FULL_Min (0x0UL)
  #define TBM_INTPEND_FULL_Max (0x1UL)
  #define TBM_INTPEND_FULL_NotPending (0x0UL)
  #define TBM_INTPEND_FULL_Pending (0x1UL)

/* FLUSH @Bit 2 : Read pending status of interrupt for event FLUSH */
  #define TBM_INTPEND_FLUSH_Pos (2UL)
  #define TBM_INTPEND_FLUSH_Msk (0x1UL << TBM_INTPEND_FLUSH_Pos)
  #define TBM_INTPEND_FLUSH_Min (0x0UL)
  #define TBM_INTPEND_FLUSH_Max (0x1UL)
  #define TBM_INTPEND_FLUSH_NotPending (0x0UL)
  #define TBM_INTPEND_FLUSH_Pending (0x1UL)


/* TBM_BUFFERSIZE: System RAM trace buffer total size in bytes */
  #define TBM_BUFFERSIZE_ResetValue (0x00000400UL)

/* BUFFERSIZE @Bits 0..12 : Must only be configured in STOP mode. Must be programmed to multiple of 16 bytes to make half-buffer
                            size always 64 bit word aligned. Typical minimum BUFFERSIZE value 0x010 i.e. 16 bytes, typical
                            maximum value 0x1000 i.e. 4096 bytes. */

  #define TBM_BUFFERSIZE_BUFFERSIZE_Pos (0UL)
  #define TBM_BUFFERSIZE_BUFFERSIZE_Msk (0x1FFFUL << TBM_BUFFERSIZE_BUFFERSIZE_Pos)
  #define TBM_BUFFERSIZE_BUFFERSIZE_Zero (0x0000UL)
  #define TBM_BUFFERSIZE_BUFFERSIZE_Min (0x0010UL)
  #define TBM_BUFFERSIZE_BUFFERSIZE_Max (0x1000UL)


/* TBM_COUNT: Counter current value */
  #define TBM_COUNT_ResetValue (0x00000000UL)

/* COUNT @Bits 0..12 : Counter current value. Only writable when counter is in stopped state. Writing when not in stopped state
                       will generate a bus fault. */

  #define TBM_COUNT_COUNT_Pos (0UL)
  #define TBM_COUNT_COUNT_Msk (0x1FFFUL << TBM_COUNT_COUNT_Pos)


/* TBM_COUNTSNAPSHOT: Copy of the current COUNT value */
  #define TBM_COUNTSNAPSHOT_ResetValue (0x00000000UL)

/* COUNTSNAPSHOT @Bits 0..12 : TASKS_FLUSH will copy the current COUNT value to this register. */
  #define TBM_COUNTSNAPSHOT_COUNTSNAPSHOT_Pos (0UL)
  #define TBM_COUNTSNAPSHOT_COUNTSNAPSHOT_Msk (0x1FFFUL << TBM_COUNTSNAPSHOT_COUNTSNAPSHOT_Pos) /*!< Bit mask of COUNTSNAPSHOT
                                                                            field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          TDDCONF                                          ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ===================================================== Struct TDDCONF ====================================================== */
/**
  * @brief TDDCONF
  */
  typedef struct {
    __IM uint32_t RESERVED[256];
    __IOM uint32_t SYSPWRUPREQ;
    __IOM uint32_t DBGPWRUPREQ;
    __IOM uint32_t TRACEPORTSPEED;
    __IM uint32_t DEBUGPOWERREQSTATUS;               /*!< (@ 0x0000040C) Combined effective system status of both SWJ-DP and
                                                                         TDDCONF registers originated power requests*/
  } NRF_TDDCONF_Type;

/* TDDCONF_SYSPWRUPREQ: System power-up request */
  #define TDDCONF_SYSPWRUPREQ_ResetValue (0x00000000UL)

/* ACTIVE @Bit 0 : Activate power-up request */
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Pos (0UL)
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Msk (0x1UL << TDDCONF_SYSPWRUPREQ_ACTIVE_Pos)
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Min (0x0UL)
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Max (0x1UL)
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_NotActive (0x0UL)
  #define TDDCONF_SYSPWRUPREQ_ACTIVE_Active (0x1UL)


/* TDDCONF_DBGPWRUPREQ: Debug power-up request */
  #define TDDCONF_DBGPWRUPREQ_ResetValue (0x00000000UL)

/* ACTIVE @Bit 0 : Activate power-up request */
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Pos (0UL)
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Msk (0x1UL << TDDCONF_DBGPWRUPREQ_ACTIVE_Pos)
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Min (0x0UL)
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Max (0x1UL)
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_NotActive (0x0UL)
  #define TDDCONF_DBGPWRUPREQ_ACTIVE_Active (0x1UL)


/* TDDCONF_TRACEPORTSPEED: Trace port trace clock speed */
  #define TDDCONF_TRACEPORTSPEED_ResetValue (0x00000000UL)

/* SPEED @Bits 0..1 : Trace clock speed */
  #define TDDCONF_TRACEPORTSPEED_SPEED_Pos (0UL)
  #define TDDCONF_TRACEPORTSPEED_SPEED_Msk (0x3UL << TDDCONF_TRACEPORTSPEED_SPEED_Pos)
  #define TDDCONF_TRACEPORTSPEED_SPEED_Min (0x0UL)
  #define TDDCONF_TRACEPORTSPEED_SPEED_Max (0x3UL)
  #define TDDCONF_TRACEPORTSPEED_SPEED_Speed100MHz (0x0UL)
  #define TDDCONF_TRACEPORTSPEED_SPEED_Speed50MHz (0x1UL)
  #define TDDCONF_TRACEPORTSPEED_SPEED_Speed25MHz (0x2UL)
  #define TDDCONF_TRACEPORTSPEED_SPEED_Speed12500KHz (0x3UL)


/* TDDCONF_DEBUGPOWERREQSTATUS: Combined effective system status of both SWJ-DP and TDDCONF registers originated power requests
                                 */

  #define TDDCONF_DEBUGPOWERREQSTATUS_ResetValue (0x00000000UL)

/* SYSPWRUPREQUESTED @Bit 0 : System powerup request status */
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Pos (0UL)
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Msk (0x1UL << TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Pos) /*!<
                                                                            Bit mask of SYSPWRUPREQUESTED field.*/
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Min (0x0UL)
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_Max (0x1UL)
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_NoPowerReq (0x0UL)
  #define TDDCONF_DEBUGPOWERREQSTATUS_SYSPWRUPREQUESTED_PowerReq (0x1UL)

/* DBGPWRUPREQUESTED @Bit 1 : Debug domain powerup request status */
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Pos (1UL)
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Msk (0x1UL << TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Pos) /*!<
                                                                            Bit mask of DBGPWRUPREQUESTED field.*/
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Min (0x0UL)
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_Max (0x1UL)
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_NoPowerReq (0x0UL)
  #define TDDCONF_DEBUGPOWERREQSTATUS_DBGPWRUPREQUESTED_PowerReq (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TEMP                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TEMP ======================================================= */
/**
  * @brief Temperature Sensor
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_DATARDY;
    __IM uint32_t RESERVED2[31];
    __IOM uint32_t PUBLISH_DATARDY;
    __IM uint32_t RESERVED3[96];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED4[127];
    __IM int32_t  TEMP;
    __IM uint32_t RESERVED5[5];
    __IOM uint32_t A0;
    __IOM uint32_t A1;
    __IOM uint32_t A2;
    __IOM uint32_t A3;
    __IOM uint32_t A4;
    __IOM uint32_t A5;
    __IOM uint32_t A6;
    __IM uint32_t RESERVED6;
    __IOM uint32_t B0;
    __IOM uint32_t B1;
    __IOM uint32_t B2;
    __IOM uint32_t B3;
    __IOM uint32_t B4;
    __IOM uint32_t B5;
    __IOM uint32_t B6;
    __IM uint32_t RESERVED7;
    __IOM uint32_t T0;
    __IOM uint32_t T1;
    __IOM uint32_t T2;
    __IOM uint32_t T3;
    __IOM uint32_t T4;
    __IOM uint32_t T5;
  } NRF_TEMP_Type;

/* TEMP_TASKS_START: Start temperature measurement */
  #define TEMP_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start temperature measurement */
  #define TEMP_TASKS_START_TASKS_START_Pos (0UL)
  #define TEMP_TASKS_START_TASKS_START_Msk (0x1UL << TEMP_TASKS_START_TASKS_START_Pos)
  #define TEMP_TASKS_START_TASKS_START_Min (0x1UL)
  #define TEMP_TASKS_START_TASKS_START_Max (0x1UL)
  #define TEMP_TASKS_START_TASKS_START_Trigger (0x1UL)


