pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TEMP_TASKS_STOP: Stop temperature measurement */
  #define TEMP_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop temperature measurement */
  #define TEMP_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define TEMP_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TEMP_TASKS_STOP_TASKS_STOP_Pos)
  #define TEMP_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define TEMP_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define TEMP_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* TEMP_SUBSCRIBE_START: Subscribe configuration for task START */
  #define TEMP_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define TEMP_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define TEMP_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << TEMP_SUBSCRIBE_START_CHIDX_Pos)
  #define TEMP_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define TEMP_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TEMP_SUBSCRIBE_START_EN_Pos (31UL)
  #define TEMP_SUBSCRIBE_START_EN_Msk (0x1UL << TEMP_SUBSCRIBE_START_EN_Pos)
  #define TEMP_SUBSCRIBE_START_EN_Min (0x0UL)
  #define TEMP_SUBSCRIBE_START_EN_Max (0x1UL)
  #define TEMP_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define TEMP_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* TEMP_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define TEMP_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define TEMP_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define TEMP_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << TEMP_SUBSCRIBE_STOP_CHIDX_Pos)
  #define TEMP_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define TEMP_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TEMP_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define TEMP_SUBSCRIBE_STOP_EN_Msk (0x1UL << TEMP_SUBSCRIBE_STOP_EN_Pos)
  #define TEMP_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define TEMP_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define TEMP_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define TEMP_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* TEMP_EVENTS_DATARDY: Temperature measurement complete, data ready */
  #define TEMP_EVENTS_DATARDY_ResetValue (0x00000000UL)

/* EVENTS_DATARDY @Bit 0 : Temperature measurement complete, data ready */
  #define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Pos (0UL)
  #define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Msk (0x1UL << TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Pos) /*!< Bit mask of
                                                                            EVENTS_DATARDY field.*/
  #define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Min (0x0UL)
  #define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Max (0x1UL)
  #define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_NotGenerated (0x0UL)
  #define TEMP_EVENTS_DATARDY_EVENTS_DATARDY_Generated (0x1UL)


/* TEMP_PUBLISH_DATARDY: Publish configuration for event DATARDY */
  #define TEMP_PUBLISH_DATARDY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event DATARDY will publish to */
  #define TEMP_PUBLISH_DATARDY_CHIDX_Pos (0UL)
  #define TEMP_PUBLISH_DATARDY_CHIDX_Msk (0xFFUL << TEMP_PUBLISH_DATARDY_CHIDX_Pos)
  #define TEMP_PUBLISH_DATARDY_CHIDX_Min (0x00UL)
  #define TEMP_PUBLISH_DATARDY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TEMP_PUBLISH_DATARDY_EN_Pos (31UL)
  #define TEMP_PUBLISH_DATARDY_EN_Msk (0x1UL << TEMP_PUBLISH_DATARDY_EN_Pos)
  #define TEMP_PUBLISH_DATARDY_EN_Min (0x0UL)
  #define TEMP_PUBLISH_DATARDY_EN_Max (0x1UL)
  #define TEMP_PUBLISH_DATARDY_EN_Disabled (0x0UL)
  #define TEMP_PUBLISH_DATARDY_EN_Enabled (0x1UL)


/* TEMP_INTENSET: Enable interrupt */
  #define TEMP_INTENSET_ResetValue (0x00000000UL)

/* DATARDY @Bit 0 : Write '1' to enable interrupt for event DATARDY */
  #define TEMP_INTENSET_DATARDY_Pos (0UL)
  #define TEMP_INTENSET_DATARDY_Msk (0x1UL << TEMP_INTENSET_DATARDY_Pos)
  #define TEMP_INTENSET_DATARDY_Min (0x0UL)
  #define TEMP_INTENSET_DATARDY_Max (0x1UL)
  #define TEMP_INTENSET_DATARDY_Set (0x1UL)
  #define TEMP_INTENSET_DATARDY_Disabled (0x0UL)
  #define TEMP_INTENSET_DATARDY_Enabled (0x1UL)


/* TEMP_INTENCLR: Disable interrupt */
  #define TEMP_INTENCLR_ResetValue (0x00000000UL)

/* DATARDY @Bit 0 : Write '1' to disable interrupt for event DATARDY */
  #define TEMP_INTENCLR_DATARDY_Pos (0UL)
  #define TEMP_INTENCLR_DATARDY_Msk (0x1UL << TEMP_INTENCLR_DATARDY_Pos)
  #define TEMP_INTENCLR_DATARDY_Min (0x0UL)
  #define TEMP_INTENCLR_DATARDY_Max (0x1UL)
  #define TEMP_INTENCLR_DATARDY_Clear (0x1UL)
  #define TEMP_INTENCLR_DATARDY_Disabled (0x0UL)
  #define TEMP_INTENCLR_DATARDY_Enabled (0x1UL)


/* TEMP_TEMP: Temperature in degC (0.25deg steps) */
  #define TEMP_TEMP_ResetValue (0x00000000UL)

/* TEMP @Bits 0..31 : Temperature in degC (0.25deg steps) */
  #define TEMP_TEMP_TEMP_Pos (0UL)
  #define TEMP_TEMP_TEMP_Msk (0xFFFFFFFFUL << TEMP_TEMP_TEMP_Pos)


/* TEMP_A0: Slope of 1st piece wise linear function */
  #define TEMP_A0_ResetValue (0x00000276UL)

/* A0 @Bits 0..11 : Slope of 1st piece wise linear function */
  #define TEMP_A0_A0_Pos (0UL)
  #define TEMP_A0_A0_Msk (0xFFFUL << TEMP_A0_A0_Pos)


/* TEMP_A1: Slope of 2nd piece wise linear function */
  #define TEMP_A1_ResetValue (0x00000324UL)

/* A1 @Bits 0..11 : Slope of 2nd piece wise linear function */
  #define TEMP_A1_A1_Pos (0UL)
  #define TEMP_A1_A1_Msk (0xFFFUL << TEMP_A1_A1_Pos)


/* TEMP_A2: Slope of 3rd piece wise linear function */
  #define TEMP_A2_ResetValue (0x000003ABUL)

/* A2 @Bits 0..11 : Slope of 3rd piece wise linear function */
  #define TEMP_A2_A2_Pos (0UL)
  #define TEMP_A2_A2_Msk (0xFFFUL << TEMP_A2_A2_Pos)


/* TEMP_A3: Slope of 4th piece wise linear function */
  #define TEMP_A3_ResetValue (0x00000453UL)

/* A3 @Bits 0..11 : Slope of 4th piece wise linear function */
  #define TEMP_A3_A3_Pos (0UL)
  #define TEMP_A3_A3_Msk (0xFFFUL << TEMP_A3_A3_Pos)


/* TEMP_A4: Slope of 5th piece wise linear function */
  #define TEMP_A4_ResetValue (0x0000049BUL)

/* A4 @Bits 0..11 : Slope of 5th piece wise linear function */
  #define TEMP_A4_A4_Pos (0UL)
  #define TEMP_A4_A4_Msk (0xFFFUL << TEMP_A4_A4_Pos)


/* TEMP_A5: Slope of 6th piece wise linear function */
  #define TEMP_A5_ResetValue (0x00000550UL)

/* A5 @Bits 0..11 : Slope of 6th piece wise linear function */
  #define TEMP_A5_A5_Pos (0UL)
  #define TEMP_A5_A5_Msk (0xFFFUL << TEMP_A5_A5_Pos)


