pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TEMP_A6: Slope of 7th piece wise linear function */
  #define TEMP_A6_ResetValue (0x0000067EUL)

/* A6 @Bits 0..11 : Slope of 7th piece wise linear function */
  #define TEMP_A6_A6_Pos (0UL)
  #define TEMP_A6_A6_Msk (0xFFFUL << TEMP_A6_A6_Pos)


/* TEMP_B0: y-intercept of 1st piece wise linear function */
  #define TEMP_B0_ResetValue (0x00000FA6UL)

/* B0 @Bits 0..11 : y-intercept of 1st piece wise linear function */
  #define TEMP_B0_B0_Pos (0UL)
  #define TEMP_B0_B0_Msk (0xFFFUL << TEMP_B0_B0_Pos)


/* TEMP_B1: y-intercept of 2nd piece wise linear function */
  #define TEMP_B1_ResetValue (0x00000F35UL)

/* B1 @Bits 0..11 : y-intercept of 2nd piece wise linear function */
  #define TEMP_B1_B1_Pos (0UL)
  #define TEMP_B1_B1_Msk (0xFFFUL << TEMP_B1_B1_Pos)


/* TEMP_B2: y-intercept of 3rd piece wise linear function */
  #define TEMP_B2_ResetValue (0x00000FAAUL)

/* B2 @Bits 0..11 : y-intercept of 3rd piece wise linear function */
  #define TEMP_B2_B2_Pos (0UL)
  #define TEMP_B2_B2_Msk (0xFFFUL << TEMP_B2_B2_Pos)


/* TEMP_B3: y-intercept of 4th piece wise linear function */
  #define TEMP_B3_ResetValue (0x0000007EUL)

/* B3 @Bits 0..11 : y-intercept of 4th piece wise linear function */
  #define TEMP_B3_B3_Pos (0UL)
  #define TEMP_B3_B3_Msk (0xFFFUL << TEMP_B3_B3_Pos)


/* TEMP_B4: y-intercept of 5th piece wise linear function */
  #define TEMP_B4_ResetValue (0x000000EAUL)

/* B4 @Bits 0..11 : y-intercept of 5th piece wise linear function */
  #define TEMP_B4_B4_Pos (0UL)
  #define TEMP_B4_B4_Msk (0xFFFUL << TEMP_B4_B4_Pos)


/* TEMP_B5: y-intercept of 6th piece wise linear function */
  #define TEMP_B5_ResetValue (0x000001EDUL)

/* B5 @Bits 0..11 : y-intercept of 6th piece wise linear function */
  #define TEMP_B5_B5_Pos (0UL)
  #define TEMP_B5_B5_Msk (0xFFFUL << TEMP_B5_B5_Pos)


/* TEMP_B6: y-intercept of 7th piece wise linear function */
  #define TEMP_B6_ResetValue (0x00000378UL)

/* B6 @Bits 0..11 : y-intercept of 7th piece wise linear function */
  #define TEMP_B6_B6_Pos (0UL)
  #define TEMP_B6_B6_Msk (0xFFFUL << TEMP_B6_B6_Pos)


/* TEMP_T0: End point of 1st piece wise linear function */
  #define TEMP_T0_ResetValue (0x000000EDUL)

/* T0 @Bits 0..7 : End point of 1st piece wise linear function */
  #define TEMP_T0_T0_Pos (0UL)
  #define TEMP_T0_T0_Msk (0xFFUL << TEMP_T0_T0_Pos)


/* TEMP_T1: End point of 2nd piece wise linear function */
  #define TEMP_T1_ResetValue (0x00000013UL)

/* T1 @Bits 0..7 : End point of 2nd piece wise linear function */
  #define TEMP_T1_T1_Pos (0UL)
  #define TEMP_T1_T1_Msk (0xFFUL << TEMP_T1_T1_Pos)


/* TEMP_T2: End point of 3rd piece wise linear function */
  #define TEMP_T2_ResetValue (0x00000029UL)

/* T2 @Bits 0..7 : End point of 3rd piece wise linear function */
  #define TEMP_T2_T2_Pos (0UL)
  #define TEMP_T2_T2_Msk (0xFFUL << TEMP_T2_T2_Pos)


/* TEMP_T3: End point of 4th piece wise linear function */
  #define TEMP_T3_ResetValue (0x0000003CUL)

/* T3 @Bits 0..7 : End point of 4th piece wise linear function */
  #define TEMP_T3_T3_Pos (0UL)
  #define TEMP_T3_T3_Msk (0xFFUL << TEMP_T3_T3_Pos)


/* TEMP_T4: End point of 5th piece wise linear function */
  #define TEMP_T4_ResetValue (0x00000044UL)

/* T4 @Bits 0..7 : End point of 5th piece wise linear function */
  #define TEMP_T4_T4_Pos (0UL)
  #define TEMP_T4_T4_Msk (0xFFUL << TEMP_T4_T4_Pos)


/* TEMP_T5: End point of 6th piece wise linear function */
  #define TEMP_T5_ResetValue (0x00000053UL)

/* T5 @Bits 0..7 : End point of 6th piece wise linear function */
  #define TEMP_T5_T5_Pos (0UL)
  #define TEMP_T5_T5_Msk (0xFFUL << TEMP_T5_T5_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct TIMER ======================================================= */
/**
  * @brief Timer/Counter
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __OM uint32_t TASKS_COUNT;
    __OM uint32_t TASKS_CLEAR;
    __OM uint32_t TASKS_SHUTDOWN;
    __IM uint32_t RESERVED[11];
    __OM uint32_t TASKS_CAPTURE[8];
    __IM uint32_t RESERVED1[8];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IOM uint32_t SUBSCRIBE_COUNT;
    __IOM uint32_t SUBSCRIBE_CLEAR;
    __IOM uint32_t SUBSCRIBE_SHUTDOWN;
    __IM uint32_t RESERVED2[11];
    __IOM uint32_t SUBSCRIBE_CAPTURE[8];
    __IM uint32_t RESERVED3[24];
    __IOM uint32_t EVENTS_COMPARE[8];
    __IM uint32_t RESERVED4[24];
    __IOM uint32_t PUBLISH_COMPARE[8];
    __IM uint32_t RESERVED5[8];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED7[126];
    __IOM uint32_t MODE;
    __IOM uint32_t BITMODE;
    __IM uint32_t RESERVED8;
    __IOM uint32_t PRESCALER;
    __IM uint32_t RESERVED9[11];
    __IOM uint32_t CC[8];
    __IM uint32_t RESERVED10[8];
    __IOM uint32_t ONESHOTEN[8];                     /*!< (@ 0x00000580) Enable one-shot operation for Capture/Compare channel
                                                                         n*/
  } NRF_TIMER_Type;

/* TIMER_TASKS_START: Start Timer */
  #define TIMER_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start Timer */
  #define TIMER_TASKS_START_TASKS_START_Pos (0UL)
  #define TIMER_TASKS_START_TASKS_START_Msk (0x1UL << TIMER_TASKS_START_TASKS_START_Pos)
  #define TIMER_TASKS_START_TASKS_START_Min (0x1UL)
  #define TIMER_TASKS_START_TASKS_START_Max (0x1UL)
  #define TIMER_TASKS_START_TASKS_START_Trigger (0x1UL)


