pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TIMER_TASKS_STOP: Stop Timer */
  #define TIMER_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop Timer */
  #define TIMER_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define TIMER_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TIMER_TASKS_STOP_TASKS_STOP_Pos)
  #define TIMER_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define TIMER_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define TIMER_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* TIMER_TASKS_COUNT: Increment Timer (Counter mode only) */
  #define TIMER_TASKS_COUNT_ResetValue (0x00000000UL)

/* TASKS_COUNT @Bit 0 : Increment Timer (Counter mode only) */
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Pos (0UL)
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Msk (0x1UL << TIMER_TASKS_COUNT_TASKS_COUNT_Pos)
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Min (0x1UL)
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Max (0x1UL)
  #define TIMER_TASKS_COUNT_TASKS_COUNT_Trigger (0x1UL)


/* TIMER_TASKS_CLEAR: Clear time */
  #define TIMER_TASKS_CLEAR_ResetValue (0x00000000UL)

/* TASKS_CLEAR @Bit 0 : Clear time */
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos (0UL)
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Msk (0x1UL << TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos)
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Min (0x1UL)
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Max (0x1UL)
  #define TIMER_TASKS_CLEAR_TASKS_CLEAR_Trigger (0x1UL)


/* TIMER_TASKS_SHUTDOWN: Shut down timer */
  #define TIMER_TASKS_SHUTDOWN_ResetValue (0x00000000UL)

/* TASKS_SHUTDOWN @Bit 0 : Shut down timer */
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos (0UL)
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk (0x1UL << TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos) /*!< Bit mask of
                                                                            TASKS_SHUTDOWN field.*/
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Min (0x1UL)
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Max (0x1UL)
  #define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger (0x1UL)


/* TIMER_TASKS_CAPTURE: Capture Timer value to CC[n] register */
  #define TIMER_TASKS_CAPTURE_MaxCount (8UL)
  #define TIMER_TASKS_CAPTURE_MaxIndex (7UL)
  #define TIMER_TASKS_CAPTURE_MinIndex (0UL)
  #define TIMER_TASKS_CAPTURE_ResetValue (0x00000000UL)

/* TASKS_CAPTURE @Bit 0 : Capture Timer value to CC[n] register */
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos (0UL)
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Msk (0x1UL << TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos) /*!< Bit mask of TASKS_CAPTURE
                                                                            field.*/
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Min (0x1UL)
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Max (0x1UL)
  #define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Trigger (0x1UL)


/* TIMER_SUBSCRIBE_START: Subscribe configuration for task START */
  #define TIMER_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define TIMER_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define TIMER_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << TIMER_SUBSCRIBE_START_CHIDX_Pos)
  #define TIMER_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define TIMER_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TIMER_SUBSCRIBE_START_EN_Pos (31UL)
  #define TIMER_SUBSCRIBE_START_EN_Msk (0x1UL << TIMER_SUBSCRIBE_START_EN_Pos)
  #define TIMER_SUBSCRIBE_START_EN_Min (0x0UL)
  #define TIMER_SUBSCRIBE_START_EN_Max (0x1UL)
  #define TIMER_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define TIMER_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* TIMER_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define TIMER_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define TIMER_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define TIMER_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << TIMER_SUBSCRIBE_STOP_CHIDX_Pos)
  #define TIMER_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define TIMER_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TIMER_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define TIMER_SUBSCRIBE_STOP_EN_Msk (0x1UL << TIMER_SUBSCRIBE_STOP_EN_Pos)
  #define TIMER_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define TIMER_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define TIMER_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define TIMER_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* TIMER_SUBSCRIBE_COUNT: Subscribe configuration for task COUNT */
  #define TIMER_SUBSCRIBE_COUNT_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task COUNT will subscribe to */
  #define TIMER_SUBSCRIBE_COUNT_CHIDX_Pos (0UL)
  #define TIMER_SUBSCRIBE_COUNT_CHIDX_Msk (0xFFUL << TIMER_SUBSCRIBE_COUNT_CHIDX_Pos)
  #define TIMER_SUBSCRIBE_COUNT_CHIDX_Min (0x00UL)
  #define TIMER_SUBSCRIBE_COUNT_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TIMER_SUBSCRIBE_COUNT_EN_Pos (31UL)
  #define TIMER_SUBSCRIBE_COUNT_EN_Msk (0x1UL << TIMER_SUBSCRIBE_COUNT_EN_Pos)
  #define TIMER_SUBSCRIBE_COUNT_EN_Min (0x0UL)
  #define TIMER_SUBSCRIBE_COUNT_EN_Max (0x1UL)
  #define TIMER_SUBSCRIBE_COUNT_EN_Disabled (0x0UL)
  #define TIMER_SUBSCRIBE_COUNT_EN_Enabled (0x1UL)


/* TIMER_SUBSCRIBE_CLEAR: Subscribe configuration for task CLEAR */
  #define TIMER_SUBSCRIBE_CLEAR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CLEAR will subscribe to */
  #define TIMER_SUBSCRIBE_CLEAR_CHIDX_Pos (0UL)
  #define TIMER_SUBSCRIBE_CLEAR_CHIDX_Msk (0xFFUL << TIMER_SUBSCRIBE_CLEAR_CHIDX_Pos)
  #define TIMER_SUBSCRIBE_CLEAR_CHIDX_Min (0x00UL)
  #define TIMER_SUBSCRIBE_CLEAR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TIMER_SUBSCRIBE_CLEAR_EN_Pos (31UL)
  #define TIMER_SUBSCRIBE_CLEAR_EN_Msk (0x1UL << TIMER_SUBSCRIBE_CLEAR_EN_Pos)
  #define TIMER_SUBSCRIBE_CLEAR_EN_Min (0x0UL)
  #define TIMER_SUBSCRIBE_CLEAR_EN_Max (0x1UL)
  #define TIMER_SUBSCRIBE_CLEAR_EN_Disabled (0x0UL)
  #define TIMER_SUBSCRIBE_CLEAR_EN_Enabled (0x1UL)


/* TIMER_SUBSCRIBE_SHUTDOWN: Subscribe configuration for task SHUTDOWN */
  #define TIMER_SUBSCRIBE_SHUTDOWN_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SHUTDOWN will subscribe to */
  #define TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Pos (0UL)
  #define TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Msk (0xFFUL << TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Pos)
  #define TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Min (0x00UL)
  #define TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TIMER_SUBSCRIBE_SHUTDOWN_EN_Pos (31UL)
  #define TIMER_SUBSCRIBE_SHUTDOWN_EN_Msk (0x1UL << TIMER_SUBSCRIBE_SHUTDOWN_EN_Pos)
  #define TIMER_SUBSCRIBE_SHUTDOWN_EN_Min (0x0UL)
  #define TIMER_SUBSCRIBE_SHUTDOWN_EN_Max (0x1UL)
  #define TIMER_SUBSCRIBE_SHUTDOWN_EN_Disabled (0x0UL)
  #define TIMER_SUBSCRIBE_SHUTDOWN_EN_Enabled (0x1UL)


/* TIMER_SUBSCRIBE_CAPTURE: Subscribe configuration for task CAPTURE[n] */
  #define TIMER_SUBSCRIBE_CAPTURE_MaxCount (8UL)
  #define TIMER_SUBSCRIBE_CAPTURE_MaxIndex (7UL)
  #define TIMER_SUBSCRIBE_CAPTURE_MinIndex (0UL)
  #define TIMER_SUBSCRIBE_CAPTURE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task CAPTURE[n] will subscribe to */
  #define TIMER_SUBSCRIBE_CAPTURE_CHIDX_Pos (0UL)
  #define TIMER_SUBSCRIBE_CAPTURE_CHIDX_Msk (0xFFUL << TIMER_SUBSCRIBE_CAPTURE_CHIDX_Pos)
  #define TIMER_SUBSCRIBE_CAPTURE_CHIDX_Min (0x00UL)
  #define TIMER_SUBSCRIBE_CAPTURE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TIMER_SUBSCRIBE_CAPTURE_EN_Pos (31UL)
  #define TIMER_SUBSCRIBE_CAPTURE_EN_Msk (0x1UL << TIMER_SUBSCRIBE_CAPTURE_EN_Pos)
  #define TIMER_SUBSCRIBE_CAPTURE_EN_Min (0x0UL)
  #define TIMER_SUBSCRIBE_CAPTURE_EN_Max (0x1UL)
  #define TIMER_SUBSCRIBE_CAPTURE_EN_Disabled (0x0UL)
  #define TIMER_SUBSCRIBE_CAPTURE_EN_Enabled (0x1UL)


