pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TIMER_EVENTS_COMPARE: Compare event on CC[n] match */
  #define TIMER_EVENTS_COMPARE_MaxCount (8UL)
  #define TIMER_EVENTS_COMPARE_MaxIndex (7UL)
  #define TIMER_EVENTS_COMPARE_MinIndex (0UL)
  #define TIMER_EVENTS_COMPARE_ResetValue (0x00000000UL)

/* EVENTS_COMPARE @Bit 0 : Compare event on CC[n] match */
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos (0UL)
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Msk (0x1UL << TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos) /*!< Bit mask of
                                                                            EVENTS_COMPARE field.*/
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Min (0x0UL)
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Max (0x1UL)
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated (0x0UL)
  #define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Generated (0x1UL)


/* TIMER_PUBLISH_COMPARE: Publish configuration for event COMPARE[n] */
  #define TIMER_PUBLISH_COMPARE_MaxCount (8UL)
  #define TIMER_PUBLISH_COMPARE_MaxIndex (7UL)
  #define TIMER_PUBLISH_COMPARE_MinIndex (0UL)
  #define TIMER_PUBLISH_COMPARE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event COMPARE[n] will publish to */
  #define TIMER_PUBLISH_COMPARE_CHIDX_Pos (0UL)
  #define TIMER_PUBLISH_COMPARE_CHIDX_Msk (0xFFUL << TIMER_PUBLISH_COMPARE_CHIDX_Pos)
  #define TIMER_PUBLISH_COMPARE_CHIDX_Min (0x00UL)
  #define TIMER_PUBLISH_COMPARE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TIMER_PUBLISH_COMPARE_EN_Pos (31UL)
  #define TIMER_PUBLISH_COMPARE_EN_Msk (0x1UL << TIMER_PUBLISH_COMPARE_EN_Pos)
  #define TIMER_PUBLISH_COMPARE_EN_Min (0x0UL)
  #define TIMER_PUBLISH_COMPARE_EN_Max (0x1UL)
  #define TIMER_PUBLISH_COMPARE_EN_Disabled (0x0UL)
  #define TIMER_PUBLISH_COMPARE_EN_Enabled (0x1UL)


/* TIMER_SHORTS: Shortcuts between local events and tasks */
  #define TIMER_SHORTS_ResetValue (0x00000000UL)

/* COMPARE0_CLEAR @Bit 0 : Shortcut between event COMPARE[0] and task CLEAR */
  #define TIMER_SHORTS_COMPARE0_CLEAR_Pos (0UL)
  #define TIMER_SHORTS_COMPARE0_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE0_CLEAR_Pos)
  #define TIMER_SHORTS_COMPARE0_CLEAR_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE0_CLEAR_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE0_CLEAR_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE0_CLEAR_Enabled (0x1UL)

/* COMPARE1_CLEAR @Bit 1 : Shortcut between event COMPARE[1] and task CLEAR */
  #define TIMER_SHORTS_COMPARE1_CLEAR_Pos (1UL)
  #define TIMER_SHORTS_COMPARE1_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE1_CLEAR_Pos)
  #define TIMER_SHORTS_COMPARE1_CLEAR_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE1_CLEAR_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE1_CLEAR_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE1_CLEAR_Enabled (0x1UL)

/* COMPARE2_CLEAR @Bit 2 : Shortcut between event COMPARE[2] and task CLEAR */
  #define TIMER_SHORTS_COMPARE2_CLEAR_Pos (2UL)
  #define TIMER_SHORTS_COMPARE2_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE2_CLEAR_Pos)
  #define TIMER_SHORTS_COMPARE2_CLEAR_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE2_CLEAR_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE2_CLEAR_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE2_CLEAR_Enabled (0x1UL)

/* COMPARE3_CLEAR @Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
  #define TIMER_SHORTS_COMPARE3_CLEAR_Pos (3UL)
  #define TIMER_SHORTS_COMPARE3_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE3_CLEAR_Pos)
  #define TIMER_SHORTS_COMPARE3_CLEAR_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE3_CLEAR_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE3_CLEAR_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE3_CLEAR_Enabled (0x1UL)

/* COMPARE4_CLEAR @Bit 4 : Shortcut between event COMPARE[4] and task CLEAR */
  #define TIMER_SHORTS_COMPARE4_CLEAR_Pos (4UL)
  #define TIMER_SHORTS_COMPARE4_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE4_CLEAR_Pos)
  #define TIMER_SHORTS_COMPARE4_CLEAR_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE4_CLEAR_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE4_CLEAR_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE4_CLEAR_Enabled (0x1UL)

/* COMPARE5_CLEAR @Bit 5 : Shortcut between event COMPARE[5] and task CLEAR */
  #define TIMER_SHORTS_COMPARE5_CLEAR_Pos (5UL)
  #define TIMER_SHORTS_COMPARE5_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE5_CLEAR_Pos)
  #define TIMER_SHORTS_COMPARE5_CLEAR_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE5_CLEAR_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE5_CLEAR_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE5_CLEAR_Enabled (0x1UL)

/* COMPARE6_CLEAR @Bit 6 : Shortcut between event COMPARE[6] and task CLEAR */
  #define TIMER_SHORTS_COMPARE6_CLEAR_Pos (6UL)
  #define TIMER_SHORTS_COMPARE6_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE6_CLEAR_Pos)
  #define TIMER_SHORTS_COMPARE6_CLEAR_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE6_CLEAR_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE6_CLEAR_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE6_CLEAR_Enabled (0x1UL)

/* COMPARE7_CLEAR @Bit 7 : Shortcut between event COMPARE[7] and task CLEAR */
  #define TIMER_SHORTS_COMPARE7_CLEAR_Pos (7UL)
  #define TIMER_SHORTS_COMPARE7_CLEAR_Msk (0x1UL << TIMER_SHORTS_COMPARE7_CLEAR_Pos)
  #define TIMER_SHORTS_COMPARE7_CLEAR_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE7_CLEAR_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE7_CLEAR_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE7_CLEAR_Enabled (0x1UL)

/* COMPARE0_STOP @Bit 16 : Shortcut between event COMPARE[0] and task STOP */
  #define TIMER_SHORTS_COMPARE0_STOP_Pos (16UL)
  #define TIMER_SHORTS_COMPARE0_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE0_STOP_Pos)
  #define TIMER_SHORTS_COMPARE0_STOP_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE0_STOP_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE0_STOP_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE0_STOP_Enabled (0x1UL)

/* COMPARE1_STOP @Bit 17 : Shortcut between event COMPARE[1] and task STOP */
  #define TIMER_SHORTS_COMPARE1_STOP_Pos (17UL)
  #define TIMER_SHORTS_COMPARE1_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE1_STOP_Pos)
  #define TIMER_SHORTS_COMPARE1_STOP_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE1_STOP_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE1_STOP_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE1_STOP_Enabled (0x1UL)

/* COMPARE2_STOP @Bit 18 : Shortcut between event COMPARE[2] and task STOP */
  #define TIMER_SHORTS_COMPARE2_STOP_Pos (18UL)
  #define TIMER_SHORTS_COMPARE2_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE2_STOP_Pos)
  #define TIMER_SHORTS_COMPARE2_STOP_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE2_STOP_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE2_STOP_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE2_STOP_Enabled (0x1UL)

/* COMPARE3_STOP @Bit 19 : Shortcut between event COMPARE[3] and task STOP */
  #define TIMER_SHORTS_COMPARE3_STOP_Pos (19UL)
  #define TIMER_SHORTS_COMPARE3_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE3_STOP_Pos)
  #define TIMER_SHORTS_COMPARE3_STOP_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE3_STOP_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE3_STOP_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE3_STOP_Enabled (0x1UL)

/* COMPARE4_STOP @Bit 20 : Shortcut between event COMPARE[4] and task STOP */
  #define TIMER_SHORTS_COMPARE4_STOP_Pos (20UL)
  #define TIMER_SHORTS_COMPARE4_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE4_STOP_Pos)
  #define TIMER_SHORTS_COMPARE4_STOP_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE4_STOP_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE4_STOP_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE4_STOP_Enabled (0x1UL)

