pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPARE5_STOP @Bit 21 : Shortcut between event COMPARE[5] and task STOP */
  #define TIMER_SHORTS_COMPARE5_STOP_Pos (21UL)
  #define TIMER_SHORTS_COMPARE5_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE5_STOP_Pos)
  #define TIMER_SHORTS_COMPARE5_STOP_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE5_STOP_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE5_STOP_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE5_STOP_Enabled (0x1UL)

/* COMPARE6_STOP @Bit 22 : Shortcut between event COMPARE[6] and task STOP */
  #define TIMER_SHORTS_COMPARE6_STOP_Pos (22UL)
  #define TIMER_SHORTS_COMPARE6_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE6_STOP_Pos)
  #define TIMER_SHORTS_COMPARE6_STOP_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE6_STOP_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE6_STOP_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE6_STOP_Enabled (0x1UL)

/* COMPARE7_STOP @Bit 23 : Shortcut between event COMPARE[7] and task STOP */
  #define TIMER_SHORTS_COMPARE7_STOP_Pos (23UL)
  #define TIMER_SHORTS_COMPARE7_STOP_Msk (0x1UL << TIMER_SHORTS_COMPARE7_STOP_Pos)
  #define TIMER_SHORTS_COMPARE7_STOP_Min (0x0UL)
  #define TIMER_SHORTS_COMPARE7_STOP_Max (0x1UL)
  #define TIMER_SHORTS_COMPARE7_STOP_Disabled (0x0UL)
  #define TIMER_SHORTS_COMPARE7_STOP_Enabled (0x1UL)


/* TIMER_INTEN: Enable or disable interrupt */
  #define TIMER_INTEN_ResetValue (0x00000000UL)

/* COMPARE0 @Bit 16 : Enable or disable interrupt for event COMPARE[0] */
  #define TIMER_INTEN_COMPARE0_Pos (16UL)
  #define TIMER_INTEN_COMPARE0_Msk (0x1UL << TIMER_INTEN_COMPARE0_Pos)
  #define TIMER_INTEN_COMPARE0_Min (0x0UL)
  #define TIMER_INTEN_COMPARE0_Max (0x1UL)
  #define TIMER_INTEN_COMPARE0_Disabled (0x0UL)
  #define TIMER_INTEN_COMPARE0_Enabled (0x1UL)

/* COMPARE1 @Bit 17 : Enable or disable interrupt for event COMPARE[1] */
  #define TIMER_INTEN_COMPARE1_Pos (17UL)
  #define TIMER_INTEN_COMPARE1_Msk (0x1UL << TIMER_INTEN_COMPARE1_Pos)
  #define TIMER_INTEN_COMPARE1_Min (0x0UL)
  #define TIMER_INTEN_COMPARE1_Max (0x1UL)
  #define TIMER_INTEN_COMPARE1_Disabled (0x0UL)
  #define TIMER_INTEN_COMPARE1_Enabled (0x1UL)

/* COMPARE2 @Bit 18 : Enable or disable interrupt for event COMPARE[2] */
  #define TIMER_INTEN_COMPARE2_Pos (18UL)
  #define TIMER_INTEN_COMPARE2_Msk (0x1UL << TIMER_INTEN_COMPARE2_Pos)
  #define TIMER_INTEN_COMPARE2_Min (0x0UL)
  #define TIMER_INTEN_COMPARE2_Max (0x1UL)
  #define TIMER_INTEN_COMPARE2_Disabled (0x0UL)
  #define TIMER_INTEN_COMPARE2_Enabled (0x1UL)

/* COMPARE3 @Bit 19 : Enable or disable interrupt for event COMPARE[3] */
  #define TIMER_INTEN_COMPARE3_Pos (19UL)
  #define TIMER_INTEN_COMPARE3_Msk (0x1UL << TIMER_INTEN_COMPARE3_Pos)
  #define TIMER_INTEN_COMPARE3_Min (0x0UL)
  #define TIMER_INTEN_COMPARE3_Max (0x1UL)
  #define TIMER_INTEN_COMPARE3_Disabled (0x0UL)
  #define TIMER_INTEN_COMPARE3_Enabled (0x1UL)

/* COMPARE4 @Bit 20 : Enable or disable interrupt for event COMPARE[4] */
  #define TIMER_INTEN_COMPARE4_Pos (20UL)
  #define TIMER_INTEN_COMPARE4_Msk (0x1UL << TIMER_INTEN_COMPARE4_Pos)
  #define TIMER_INTEN_COMPARE4_Min (0x0UL)
  #define TIMER_INTEN_COMPARE4_Max (0x1UL)
  #define TIMER_INTEN_COMPARE4_Disabled (0x0UL)
  #define TIMER_INTEN_COMPARE4_Enabled (0x1UL)

/* COMPARE5 @Bit 21 : Enable or disable interrupt for event COMPARE[5] */
  #define TIMER_INTEN_COMPARE5_Pos (21UL)
  #define TIMER_INTEN_COMPARE5_Msk (0x1UL << TIMER_INTEN_COMPARE5_Pos)
  #define TIMER_INTEN_COMPARE5_Min (0x0UL)
  #define TIMER_INTEN_COMPARE5_Max (0x1UL)
  #define TIMER_INTEN_COMPARE5_Disabled (0x0UL)
  #define TIMER_INTEN_COMPARE5_Enabled (0x1UL)

/* COMPARE6 @Bit 22 : Enable or disable interrupt for event COMPARE[6] */
  #define TIMER_INTEN_COMPARE6_Pos (22UL)
  #define TIMER_INTEN_COMPARE6_Msk (0x1UL << TIMER_INTEN_COMPARE6_Pos)
  #define TIMER_INTEN_COMPARE6_Min (0x0UL)
  #define TIMER_INTEN_COMPARE6_Max (0x1UL)
  #define TIMER_INTEN_COMPARE6_Disabled (0x0UL)
  #define TIMER_INTEN_COMPARE6_Enabled (0x1UL)

/* COMPARE7 @Bit 23 : Enable or disable interrupt for event COMPARE[7] */
  #define TIMER_INTEN_COMPARE7_Pos (23UL)
  #define TIMER_INTEN_COMPARE7_Msk (0x1UL << TIMER_INTEN_COMPARE7_Pos)
  #define TIMER_INTEN_COMPARE7_Min (0x0UL)
  #define TIMER_INTEN_COMPARE7_Max (0x1UL)
  #define TIMER_INTEN_COMPARE7_Disabled (0x0UL)
  #define TIMER_INTEN_COMPARE7_Enabled (0x1UL)


/* TIMER_INTENSET: Enable interrupt */
  #define TIMER_INTENSET_ResetValue (0x00000000UL)

/* COMPARE0 @Bit 16 : Write '1' to enable interrupt for event COMPARE[0] */
  #define TIMER_INTENSET_COMPARE0_Pos (16UL)
  #define TIMER_INTENSET_COMPARE0_Msk (0x1UL << TIMER_INTENSET_COMPARE0_Pos)
  #define TIMER_INTENSET_COMPARE0_Min (0x0UL)
  #define TIMER_INTENSET_COMPARE0_Max (0x1UL)
  #define TIMER_INTENSET_COMPARE0_Set (0x1UL)
  #define TIMER_INTENSET_COMPARE0_Disabled (0x0UL)
  #define TIMER_INTENSET_COMPARE0_Enabled (0x1UL)

/* COMPARE1 @Bit 17 : Write '1' to enable interrupt for event COMPARE[1] */
  #define TIMER_INTENSET_COMPARE1_Pos (17UL)
  #define TIMER_INTENSET_COMPARE1_Msk (0x1UL << TIMER_INTENSET_COMPARE1_Pos)
  #define TIMER_INTENSET_COMPARE1_Min (0x0UL)
  #define TIMER_INTENSET_COMPARE1_Max (0x1UL)
  #define TIMER_INTENSET_COMPARE1_Set (0x1UL)
  #define TIMER_INTENSET_COMPARE1_Disabled (0x0UL)
  #define TIMER_INTENSET_COMPARE1_Enabled (0x1UL)

/* COMPARE2 @Bit 18 : Write '1' to enable interrupt for event COMPARE[2] */
  #define TIMER_INTENSET_COMPARE2_Pos (18UL)
  #define TIMER_INTENSET_COMPARE2_Msk (0x1UL << TIMER_INTENSET_COMPARE2_Pos)
  #define TIMER_INTENSET_COMPARE2_Min (0x0UL)
  #define TIMER_INTENSET_COMPARE2_Max (0x1UL)
  #define TIMER_INTENSET_COMPARE2_Set (0x1UL)
  #define TIMER_INTENSET_COMPARE2_Disabled (0x0UL)
  #define TIMER_INTENSET_COMPARE2_Enabled (0x1UL)

/* COMPARE3 @Bit 19 : Write '1' to enable interrupt for event COMPARE[3] */
  #define TIMER_INTENSET_COMPARE3_Pos (19UL)
  #define TIMER_INTENSET_COMPARE3_Msk (0x1UL << TIMER_INTENSET_COMPARE3_Pos)
  #define TIMER_INTENSET_COMPARE3_Min (0x0UL)
  #define TIMER_INTENSET_COMPARE3_Max (0x1UL)
  #define TIMER_INTENSET_COMPARE3_Set (0x1UL)
  #define TIMER_INTENSET_COMPARE3_Disabled (0x0UL)
  #define TIMER_INTENSET_COMPARE3_Enabled (0x1UL)

/* COMPARE4 @Bit 20 : Write '1' to enable interrupt for event COMPARE[4] */
  #define TIMER_INTENSET_COMPARE4_Pos (20UL)
  #define TIMER_INTENSET_COMPARE4_Msk (0x1UL << TIMER_INTENSET_COMPARE4_Pos)
  #define TIMER_INTENSET_COMPARE4_Min (0x0UL)
  #define TIMER_INTENSET_COMPARE4_Max (0x1UL)
  #define TIMER_INTENSET_COMPARE4_Set (0x1UL)
  #define TIMER_INTENSET_COMPARE4_Disabled (0x0UL)
  #define TIMER_INTENSET_COMPARE4_Enabled (0x1UL)

