pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* COMPARE5 @Bit 21 : Write '1' to enable interrupt for event COMPARE[5] */
  #define TIMER_INTENSET_COMPARE5_Pos (21UL)
  #define TIMER_INTENSET_COMPARE5_Msk (0x1UL << TIMER_INTENSET_COMPARE5_Pos)
  #define TIMER_INTENSET_COMPARE5_Min (0x0UL)
  #define TIMER_INTENSET_COMPARE5_Max (0x1UL)
  #define TIMER_INTENSET_COMPARE5_Set (0x1UL)
  #define TIMER_INTENSET_COMPARE5_Disabled (0x0UL)
  #define TIMER_INTENSET_COMPARE5_Enabled (0x1UL)

/* COMPARE6 @Bit 22 : Write '1' to enable interrupt for event COMPARE[6] */
  #define TIMER_INTENSET_COMPARE6_Pos (22UL)
  #define TIMER_INTENSET_COMPARE6_Msk (0x1UL << TIMER_INTENSET_COMPARE6_Pos)
  #define TIMER_INTENSET_COMPARE6_Min (0x0UL)
  #define TIMER_INTENSET_COMPARE6_Max (0x1UL)
  #define TIMER_INTENSET_COMPARE6_Set (0x1UL)
  #define TIMER_INTENSET_COMPARE6_Disabled (0x0UL)
  #define TIMER_INTENSET_COMPARE6_Enabled (0x1UL)

/* COMPARE7 @Bit 23 : Write '1' to enable interrupt for event COMPARE[7] */
  #define TIMER_INTENSET_COMPARE7_Pos (23UL)
  #define TIMER_INTENSET_COMPARE7_Msk (0x1UL << TIMER_INTENSET_COMPARE7_Pos)
  #define TIMER_INTENSET_COMPARE7_Min (0x0UL)
  #define TIMER_INTENSET_COMPARE7_Max (0x1UL)
  #define TIMER_INTENSET_COMPARE7_Set (0x1UL)
  #define TIMER_INTENSET_COMPARE7_Disabled (0x0UL)
  #define TIMER_INTENSET_COMPARE7_Enabled (0x1UL)


/* TIMER_INTENCLR: Disable interrupt */
  #define TIMER_INTENCLR_ResetValue (0x00000000UL)

/* COMPARE0 @Bit 16 : Write '1' to disable interrupt for event COMPARE[0] */
  #define TIMER_INTENCLR_COMPARE0_Pos (16UL)
  #define TIMER_INTENCLR_COMPARE0_Msk (0x1UL << TIMER_INTENCLR_COMPARE0_Pos)
  #define TIMER_INTENCLR_COMPARE0_Min (0x0UL)
  #define TIMER_INTENCLR_COMPARE0_Max (0x1UL)
  #define TIMER_INTENCLR_COMPARE0_Clear (0x1UL)
  #define TIMER_INTENCLR_COMPARE0_Disabled (0x0UL)
  #define TIMER_INTENCLR_COMPARE0_Enabled (0x1UL)

/* COMPARE1 @Bit 17 : Write '1' to disable interrupt for event COMPARE[1] */
  #define TIMER_INTENCLR_COMPARE1_Pos (17UL)
  #define TIMER_INTENCLR_COMPARE1_Msk (0x1UL << TIMER_INTENCLR_COMPARE1_Pos)
  #define TIMER_INTENCLR_COMPARE1_Min (0x0UL)
  #define TIMER_INTENCLR_COMPARE1_Max (0x1UL)
  #define TIMER_INTENCLR_COMPARE1_Clear (0x1UL)
  #define TIMER_INTENCLR_COMPARE1_Disabled (0x0UL)
  #define TIMER_INTENCLR_COMPARE1_Enabled (0x1UL)

/* COMPARE2 @Bit 18 : Write '1' to disable interrupt for event COMPARE[2] */
  #define TIMER_INTENCLR_COMPARE2_Pos (18UL)
  #define TIMER_INTENCLR_COMPARE2_Msk (0x1UL << TIMER_INTENCLR_COMPARE2_Pos)
  #define TIMER_INTENCLR_COMPARE2_Min (0x0UL)
  #define TIMER_INTENCLR_COMPARE2_Max (0x1UL)
  #define TIMER_INTENCLR_COMPARE2_Clear (0x1UL)
  #define TIMER_INTENCLR_COMPARE2_Disabled (0x0UL)
  #define TIMER_INTENCLR_COMPARE2_Enabled (0x1UL)

/* COMPARE3 @Bit 19 : Write '1' to disable interrupt for event COMPARE[3] */
  #define TIMER_INTENCLR_COMPARE3_Pos (19UL)
  #define TIMER_INTENCLR_COMPARE3_Msk (0x1UL << TIMER_INTENCLR_COMPARE3_Pos)
  #define TIMER_INTENCLR_COMPARE3_Min (0x0UL)
  #define TIMER_INTENCLR_COMPARE3_Max (0x1UL)
  #define TIMER_INTENCLR_COMPARE3_Clear (0x1UL)
  #define TIMER_INTENCLR_COMPARE3_Disabled (0x0UL)
  #define TIMER_INTENCLR_COMPARE3_Enabled (0x1UL)

/* COMPARE4 @Bit 20 : Write '1' to disable interrupt for event COMPARE[4] */
  #define TIMER_INTENCLR_COMPARE4_Pos (20UL)
  #define TIMER_INTENCLR_COMPARE4_Msk (0x1UL << TIMER_INTENCLR_COMPARE4_Pos)
  #define TIMER_INTENCLR_COMPARE4_Min (0x0UL)
  #define TIMER_INTENCLR_COMPARE4_Max (0x1UL)
  #define TIMER_INTENCLR_COMPARE4_Clear (0x1UL)
  #define TIMER_INTENCLR_COMPARE4_Disabled (0x0UL)
  #define TIMER_INTENCLR_COMPARE4_Enabled (0x1UL)

/* COMPARE5 @Bit 21 : Write '1' to disable interrupt for event COMPARE[5] */
  #define TIMER_INTENCLR_COMPARE5_Pos (21UL)
  #define TIMER_INTENCLR_COMPARE5_Msk (0x1UL << TIMER_INTENCLR_COMPARE5_Pos)
  #define TIMER_INTENCLR_COMPARE5_Min (0x0UL)
  #define TIMER_INTENCLR_COMPARE5_Max (0x1UL)
  #define TIMER_INTENCLR_COMPARE5_Clear (0x1UL)
  #define TIMER_INTENCLR_COMPARE5_Disabled (0x0UL)
  #define TIMER_INTENCLR_COMPARE5_Enabled (0x1UL)

/* COMPARE6 @Bit 22 : Write '1' to disable interrupt for event COMPARE[6] */
  #define TIMER_INTENCLR_COMPARE6_Pos (22UL)
  #define TIMER_INTENCLR_COMPARE6_Msk (0x1UL << TIMER_INTENCLR_COMPARE6_Pos)
  #define TIMER_INTENCLR_COMPARE6_Min (0x0UL)
  #define TIMER_INTENCLR_COMPARE6_Max (0x1UL)
  #define TIMER_INTENCLR_COMPARE6_Clear (0x1UL)
  #define TIMER_INTENCLR_COMPARE6_Disabled (0x0UL)
  #define TIMER_INTENCLR_COMPARE6_Enabled (0x1UL)

/* COMPARE7 @Bit 23 : Write '1' to disable interrupt for event COMPARE[7] */
  #define TIMER_INTENCLR_COMPARE7_Pos (23UL)
  #define TIMER_INTENCLR_COMPARE7_Msk (0x1UL << TIMER_INTENCLR_COMPARE7_Pos)
  #define TIMER_INTENCLR_COMPARE7_Min (0x0UL)
  #define TIMER_INTENCLR_COMPARE7_Max (0x1UL)
  #define TIMER_INTENCLR_COMPARE7_Clear (0x1UL)
  #define TIMER_INTENCLR_COMPARE7_Disabled (0x0UL)
  #define TIMER_INTENCLR_COMPARE7_Enabled (0x1UL)


/* TIMER_MODE: Timer mode selection */
  #define TIMER_MODE_ResetValue (0x00000000UL)

/* MODE @Bits 0..1 : Timer mode */
  #define TIMER_MODE_MODE_Pos (0UL)
  #define TIMER_MODE_MODE_Msk (0x3UL << TIMER_MODE_MODE_Pos)
  #define TIMER_MODE_MODE_Min (0x0UL)
  #define TIMER_MODE_MODE_Max (0x2UL)
  #define TIMER_MODE_MODE_Timer (0x0UL)
  #define TIMER_MODE_MODE_Counter (0x1UL)
  #define TIMER_MODE_MODE_LowPowerCounter (0x2UL)


/* TIMER_BITMODE: Configure the number of bits used by the TIMER */
  #define TIMER_BITMODE_ResetValue (0x00000000UL)

/* BITMODE @Bits 0..1 : Timer bit width */
  #define TIMER_BITMODE_BITMODE_Pos (0UL)
  #define TIMER_BITMODE_BITMODE_Msk (0x3UL << TIMER_BITMODE_BITMODE_Pos)
  #define TIMER_BITMODE_BITMODE_Min (0x0UL)
  #define TIMER_BITMODE_BITMODE_Max (0x3UL)
  #define TIMER_BITMODE_BITMODE_16Bit (0x0UL)
  #define TIMER_BITMODE_BITMODE_08Bit (0x1UL)
  #define TIMER_BITMODE_BITMODE_24Bit (0x2UL)
  #define TIMER_BITMODE_BITMODE_32Bit (0x3UL)


/* TIMER_PRESCALER: Timer prescaler register */
  #define TIMER_PRESCALER_ResetValue (0x00000004UL)

