pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PORT_SIZE_1 @Bit 0 : Indicates whether the TPIU supports port size of 1-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Pos (0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_1 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_1_Supported (0x1UL)

/* PORT_SIZE_2 @Bit 1 : Indicates whether the TPIU supports port size of 2-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Pos (1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_2 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_2_Supported (0x1UL)

/* PORT_SIZE_3 @Bit 2 : Indicates whether the TPIU supports port size of 3-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Pos (2UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_3 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_3_Supported (0x1UL)

/* PORT_SIZE_4 @Bit 3 : Indicates whether the TPIU supports port size of 4-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Pos (3UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_4 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_4_Supported (0x1UL)

/* PORT_SIZE_5 @Bit 4 : Indicates whether the TPIU supports port size of 5-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Pos (4UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_5 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_5_Supported (0x1UL)

/* PORT_SIZE_6 @Bit 5 : Indicates whether the TPIU supports port size of 6-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Pos (5UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_6 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_6_Supported (0x1UL)

/* PORT_SIZE_7 @Bit 6 : Indicates whether the TPIU supports port size of 7-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Pos (6UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_7 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_7_Supported (0x1UL)

/* PORT_SIZE_8 @Bit 7 : Indicates whether the TPIU supports port size of 8-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Pos (7UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_8 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Supported (0x1UL)

/* PORT_SIZE_9 @Bit 8 : Indicates whether the TPIU supports port size of 9-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Pos (8UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_9 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Supported (0x1UL)

/* PORT_SIZE_10 @Bit 9 : Indicates whether the TPIU supports port size of 10-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Pos (9UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_10 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Supported (0x1UL)

