pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PORT_SIZE_11 @Bit 10 : Indicates whether the TPIU supports port size of 11-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Pos (10UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_11 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Supported (0x1UL)

/* PORT_SIZE_12 @Bit 11 : Indicates whether the TPIU supports port size of 12-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Pos (11UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_12 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Supported (0x1UL)

/* PORT_SIZE_13 @Bit 12 : Indicates whether the TPIU supports port size of 13-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Pos (12UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_13 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Supported (0x1UL)

/* PORT_SIZE_14 @Bit 13 : Indicates whether the TPIU supports port size of 14-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Pos (13UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_14 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Supported (0x1UL)

/* PORT_SIZE_15 @Bit 14 : Indicates whether the TPIU supports port size of 15-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Pos (14UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_15 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Supported (0x1UL)

/* PORT_SIZE_16 @Bit 15 : Indicates whether the TPIU supports port size of 16-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Pos (15UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_16 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Supported (0x1UL)

/* PORT_SIZE_17 @Bit 16 : Indicates whether the TPIU supports port size of 17-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Pos (16UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_17 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_17_Supported (0x1UL)

/* PORT_SIZE_18 @Bit 17 : Indicates whether the TPIU supports port size of 18-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Pos (17UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_18 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_18_Supported (0x1UL)

/* PORT_SIZE_19 @Bit 18 : Indicates whether the TPIU supports port size of 19-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Pos (18UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_19 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_19_Supported (0x1UL)

/* PORT_SIZE_20 @Bit 19 : Indicates whether the TPIU supports port size of 20-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Pos (19UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_20 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_20_Supported (0x1UL)

