pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PORT_SIZE_21 @Bit 20 : Indicates whether the TPIU supports port size of 21-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Pos (20UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_21 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_21_Supported (0x1UL)

/* PORT_SIZE_22 @Bit 21 : Indicates whether the TPIU supports port size of 22-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Pos (21UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_22 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_22_Supported (0x1UL)

/* PORT_SIZE_23 @Bit 22 : Indicates whether the TPIU supports port size of 23-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Pos (22UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_23 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_23_Supported (0x1UL)

/* PORT_SIZE_24 @Bit 23 : Indicates whether the TPIU supports port size of 24-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Pos (23UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_24 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_24_Supported (0x1UL)

/* PORT_SIZE_25 @Bit 24 : Indicates whether the TPIU supports port size of 25-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Pos (24UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_25 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_25_Supported (0x1UL)

/* PORT_SIZE_26 @Bit 25 : Indicates whether the TPIU supports port size of 26-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Pos (25UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_26 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_26_Supported (0x1UL)

/* PORT_SIZE_27 @Bit 26 : Indicates whether the TPIU supports port size of 27-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_27_Pos (26UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_27_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_27_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_27 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_27_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_27_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_27_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_27_Supported (0x1UL)

/* PORT_SIZE_28 @Bit 27 : Indicates whether the TPIU supports port size of 28-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_28_Pos (27UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_28_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_28_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_28 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_28_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_28_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_28_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_28_Supported (0x1UL)

/* PORT_SIZE_29 @Bit 28 : Indicates whether the TPIU supports port size of 29-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_29_Pos (28UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_29_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_29_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_29 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_29_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_29_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_29_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_29_Supported (0x1UL)

/* PORT_SIZE_30 @Bit 29 : Indicates whether the TPIU supports port size of 30-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_30_Pos (29UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_30_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_30_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_30 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_30_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_30_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_30_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_30_Supported (0x1UL)

/* PORT_SIZE_31 @Bit 30 : Indicates whether the TPIU supports port size of 31-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_31_Pos (30UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_31_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_31_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_31 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_31_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_31_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_31_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_31_Supported (0x1UL)

/* PORT_SIZE_32 @Bit 31 : Indicates whether the TPIU supports port size of 32-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_32_Pos (31UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_32_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_32_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_32 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_32_Min (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_32_Max (0x1UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_32_NotSupported (0x0UL)
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_32_Supported (0x1UL)


/* TPIU_CURRENTPORTSIZE: Each bit location is a single port size. One bit can be set, and indicates the current port size. */
  #define TPIU_CURRENTPORTSIZE_ResetValue (0x00000000UL)

/* PORT_SIZE_1 @Bit 0 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_1_Pos (0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_1_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_1_Pos) /*!< Bit mask of PORT_SIZE_1
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_1_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_1_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_1_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_1_Selected (0x1UL)

/* PORT_SIZE_2 @Bit 1 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_2_Pos (1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_2_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_2_Pos) /*!< Bit mask of PORT_SIZE_2
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_2_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_2_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_2_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_2_Selected (0x1UL)

/* PORT_SIZE_3 @Bit 2 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_3_Pos (2UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_3_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_3_Pos) /*!< Bit mask of PORT_SIZE_3
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_3_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_3_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_3_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_3_Selected (0x1UL)

