pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PORT_SIZE_4 @Bit 3 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_4_Pos (3UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_4_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_4_Pos) /*!< Bit mask of PORT_SIZE_4
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_4_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_4_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_4_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_4_Selected (0x1UL)

/* PORT_SIZE_5 @Bit 4 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_5_Pos (4UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_5_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_5_Pos) /*!< Bit mask of PORT_SIZE_5
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_5_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_5_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_5_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_5_Selected (0x1UL)

/* PORT_SIZE_6 @Bit 5 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_6_Pos (5UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_6_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_6_Pos) /*!< Bit mask of PORT_SIZE_6
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_6_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_6_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_6_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_6_Selected (0x1UL)

/* PORT_SIZE_7 @Bit 6 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_7_Pos (6UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_7_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_7_Pos) /*!< Bit mask of PORT_SIZE_7
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_7_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_7_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_7_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_7_Selected (0x1UL)

/* PORT_SIZE_8 @Bit 7 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_8_Pos (7UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_8_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_8_Pos) /*!< Bit mask of PORT_SIZE_8
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_8_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_8_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_8_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_8_Selected (0x1UL)

/* PORT_SIZE_9 @Bit 8 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_9_Pos (8UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_9_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_9_Pos) /*!< Bit mask of PORT_SIZE_9
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_9_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_9_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_9_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_9_Selected (0x1UL)

/* PORT_SIZE_10 @Bit 9 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_10_Pos (9UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_10_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_10_Pos) /*!< Bit mask of PORT_SIZE_10
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_10_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_10_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_10_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_10_Selected (0x1UL)

/* PORT_SIZE_11 @Bit 10 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_11_Pos (10UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_11_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_11_Pos) /*!< Bit mask of PORT_SIZE_11
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_11_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_11_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_11_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_11_Selected (0x1UL)

/* PORT_SIZE_12 @Bit 11 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_12_Pos (11UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_12_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_12_Pos) /*!< Bit mask of PORT_SIZE_12
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_12_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_12_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_12_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_12_Selected (0x1UL)

/* PORT_SIZE_13 @Bit 12 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_13_Pos (12UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_13_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_13_Pos) /*!< Bit mask of PORT_SIZE_13
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_13_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_13_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_13_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_13_Selected (0x1UL)

/* PORT_SIZE_14 @Bit 13 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_14_Pos (13UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_14_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_14_Pos) /*!< Bit mask of PORT_SIZE_14
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_14_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_14_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_14_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_14_Selected (0x1UL)

