pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PORT_SIZE_15 @Bit 14 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_15_Pos (14UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_15_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_15_Pos) /*!< Bit mask of PORT_SIZE_15
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_15_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_15_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_15_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_15_Selected (0x1UL)

/* PORT_SIZE_16 @Bit 15 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_16_Pos (15UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_16_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_16_Pos) /*!< Bit mask of PORT_SIZE_16
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_16_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_16_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_16_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_16_Selected (0x1UL)

/* PORT_SIZE_17 @Bit 16 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_17_Pos (16UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_17_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_17_Pos) /*!< Bit mask of PORT_SIZE_17
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_17_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_17_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_17_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_17_Selected (0x1UL)

/* PORT_SIZE_18 @Bit 17 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_18_Pos (17UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_18_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_18_Pos) /*!< Bit mask of PORT_SIZE_18
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_18_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_18_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_18_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_18_Selected (0x1UL)

/* PORT_SIZE_19 @Bit 18 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_19_Pos (18UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_19_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_19_Pos) /*!< Bit mask of PORT_SIZE_19
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_19_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_19_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_19_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_19_Selected (0x1UL)

/* PORT_SIZE_20 @Bit 19 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_20_Pos (19UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_20_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_20_Pos) /*!< Bit mask of PORT_SIZE_20
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_20_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_20_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_20_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_20_Selected (0x1UL)

/* PORT_SIZE_21 @Bit 20 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_21_Pos (20UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_21_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_21_Pos) /*!< Bit mask of PORT_SIZE_21
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_21_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_21_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_21_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_21_Selected (0x1UL)

/* PORT_SIZE_22 @Bit 21 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_22_Pos (21UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_22_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_22_Pos) /*!< Bit mask of PORT_SIZE_22
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_22_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_22_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_22_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_22_Selected (0x1UL)

/* PORT_SIZE_23 @Bit 22 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_23_Pos (22UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_23_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_23_Pos) /*!< Bit mask of PORT_SIZE_23
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_23_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_23_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_23_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_23_Selected (0x1UL)

/* PORT_SIZE_24 @Bit 23 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_24_Pos (23UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_24_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_24_Pos) /*!< Bit mask of PORT_SIZE_24
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_24_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_24_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_24_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_24_Selected (0x1UL)

/* PORT_SIZE_25 @Bit 24 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_25_Pos (24UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_25_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_25_Pos) /*!< Bit mask of PORT_SIZE_25
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_25_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_25_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_25_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_25_Selected (0x1UL)

/* PORT_SIZE_26 @Bit 25 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_26_Pos (25UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_26_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_26_Pos) /*!< Bit mask of PORT_SIZE_26
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_26_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_26_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_26_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_26_Selected (0x1UL)

/* PORT_SIZE_27 @Bit 26 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_27_Pos (26UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_27_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_27_Pos) /*!< Bit mask of PORT_SIZE_27
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_27_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_27_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_27_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_27_Selected (0x1UL)

/* PORT_SIZE_28 @Bit 27 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_28_Pos (27UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_28_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_28_Pos) /*!< Bit mask of PORT_SIZE_28
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_28_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_28_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_28_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_28_Selected (0x1UL)

