pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PORT_SIZE_29 @Bit 28 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Pos (28UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Pos) /*!< Bit mask of PORT_SIZE_29
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_29_Selected (0x1UL)

/* PORT_SIZE_30 @Bit 29 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Pos (29UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Pos) /*!< Bit mask of PORT_SIZE_30
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_30_Selected (0x1UL)

/* PORT_SIZE_31 @Bit 30 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Pos (30UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Pos) /*!< Bit mask of PORT_SIZE_31
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_31_Selected (0x1UL)

/* PORT_SIZE_32 @Bit 31 : Indicates which port size is currently selected. */
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Pos (31UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Msk (0x1UL << TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Pos) /*!< Bit mask of PORT_SIZE_32
                                                                            field.*/
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Min (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Max (0x1UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_NotSelected (0x0UL)
  #define TPIU_CURRENTPORTSIZE_PORT_SIZE_32_Selected (0x1UL)


/* TPIU_SUPPORTEDTRIGGERMODES: The Supported_trigger_modes register indicates the implemented trigger counter multipliers and
                                other supported features of the trigger system. */

  #define TPIU_SUPPORTEDTRIGGERMODES_ResetValue (0x00000000UL)

/* MULT0 @Bit 0 : Indicates whether multiplying the trigger counter by 2^(0+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Pos (0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT0_Pos)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Min (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Max (0x1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_NotSelected (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT0_Selected (0x1UL)

/* MULT1 @Bit 1 : Indicates whether multiplying the trigger counter by 2^(1+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Pos (1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT1_Pos)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Min (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Max (0x1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_NotSelected (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT1_Selected (0x1UL)

/* MULT2 @Bit 2 : Indicates whether multiplying the trigger counter by 2^(2+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Pos (2UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT2_Pos)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Min (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Max (0x1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_NotSelected (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT2_Selected (0x1UL)

/* MULT3 @Bit 3 : Indicates whether multiplying the trigger counter by 2^(3+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Pos (3UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT3_Pos)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Min (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Max (0x1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_NotSelected (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT3_Selected (0x1UL)

/* MULT4 @Bit 4 : Indicates whether multiplying the trigger counter by 2^(4+1) is supported. */
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Pos (4UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_MULT4_Pos)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Min (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Max (0x1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_NotSelected (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_MULT4_Selected (0x1UL)

/* TCOUNT8 @Bit 8 : Indicates whether an 8-bit wide counter register is implemented. */
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Pos (8UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Pos) /*!< Bit mask of TCOUNT8
                                                                            field.*/
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Min (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Max (0x1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_NotImplemented (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TCOUNT8_Implemented (0x1UL)

/* TRIGGERED @Bit 16 : A trigger has occurred and the counter has reached 0. */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Pos (16UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Pos) /*!< Bit mask of
                                                                            TRIGGERED field.*/
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Min (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Max (0x1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_NotOccured (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRIGGERED_Occured (0x1UL)

