pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRGRUN @Bit 17 : A trigger has occurred but the counter is not at 0. */
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Pos (17UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Msk (0x1UL << TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Pos)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Min (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Max (0x1UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_NotOccured (0x0UL)
  #define TPIU_SUPPORTEDTRIGGERMODES_TRGRUN_Occured (0x1UL)


/* TPIU_TRIGGERCOUNTERVALUE: The Trigger_counter_value register enables delaying the indication of triggers to any external
                              connected trace capture or storage devices. */

  #define TPIU_TRIGGERCOUNTERVALUE_ResetValue (0x00000000UL)

/* TrigCount @Bits 0..7 : 8-bit counter value for the number of words to be output from the formatter before a trigger is
                          inserted. */

  #define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Pos (0UL)
  #define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Msk (0xFFUL << TPIU_TRIGGERCOUNTERVALUE_TrigCount_Pos) /*!< Bit mask of TrigCount
                                                                            field.*/
  #define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Min (0x00UL)
  #define TPIU_TRIGGERCOUNTERVALUE_TrigCount_Max (0xFFUL)


/* TPIU_TRIGGERMULTIPLIER: The Trigger_multiplier register contains the selectors for the trigger counter multiplier. */
  #define TPIU_TRIGGERMULTIPLIER_ResetValue (0x00000000UL)

/* MULT0 @Bit 0 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Pos (0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT0_Pos)
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Min (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Max (0x1UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Disabled (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT0_Enabled (0x1UL)

/* MULT1 @Bit 1 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Pos (1UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT1_Pos)
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Min (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Max (0x1UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Disabled (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT1_Enabled (0x1UL)

/* MULT2 @Bit 2 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Pos (2UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT2_Pos)
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Min (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Max (0x1UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Disabled (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT2_Enabled (0x1UL)

/* MULT3 @Bit 3 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Pos (3UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT3_Pos)
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Min (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Max (0x1UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Disabled (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT3_Enabled (0x1UL)

/* MULT4 @Bit 4 : Multiply the Trigger Counter by 2^n. */
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Pos (4UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Msk (0x1UL << TPIU_TRIGGERMULTIPLIER_MULT4_Pos)
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Min (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Max (0x1UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Disabled (0x0UL)
  #define TPIU_TRIGGERMULTIPLIER_MULT4_Enabled (0x1UL)


/* TPIU_SUPPPORTEDTESTPATTERNMODES: The Supported_test_pattern_modes register provides a set of known bit sequences or patterns
                                     that can be output over the trace port and can be detected by the TPA or other associated
                                     trace capture device. */

  #define TPIU_SUPPPORTEDTESTPATTERNMODES_ResetValue (0x00000000UL)

/* PATW1 @Bit 0 : Indicates whether the walking 1s pattern is supported as output over the trace port. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Pos (0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Pos) /*!< Bit mask of PATW1
                                                                            field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Min (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Max (0x1UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_NotSupported (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW1_Supported (0x1UL)

/* PATW0 @Bit 1 : Indicates whether the walking 0s pattern is supported as output over the trace port. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Pos (1UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Pos) /*!< Bit mask of PATW0
                                                                            field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Min (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Max (0x1UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_NotSupported (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATW0_Supported (0x1UL)

/* PATA5 @Bit 2 : Indicates whether the AA/55 pattern is supported as output over the trace port. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Pos (2UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Pos) /*!< Bit mask of PATA5
                                                                            field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Min (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Max (0x1UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_NotSupported (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATA5_Supported (0x1UL)

/* PATF0 @Bit 3 : Indicates whether the FF/00 pattern is supported as output over the trace port. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Pos (3UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Pos) /*!< Bit mask of PATF0
                                                                            field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Min (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Max (0x1UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_NotSupported (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PATF0_Supported (0x1UL)

/* PTIMEEN @Bit 16 : Indicates whether timed mode is supported. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Pos (16UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Pos) /*!< Bit mask of
                                                                            PTIMEEN field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Min (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Max (0x1UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_NotSupported (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PTIMEEN_Supported (0x1UL)

