pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PCONTEN @Bit 17 : Indicates whether continuous mode is supported. */
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Pos (17UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Msk (0x1UL << TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Pos) /*!< Bit mask of
                                                                            PCONTEN field.*/
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Min (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Max (0x1UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_NotSupported (0x0UL)
  #define TPIU_SUPPPORTEDTESTPATTERNMODES_PCONTEN_Supported (0x1UL)


/* TPIU_CURRENTTESTPATTERNMODES: Current_test_pattern_mode indicates the current test pattern or mode selected. */
  #define TPIU_CURRENTTESTPATTERNMODES_ResetValue (0x00000000UL)

/* PATW1 @Bit 0 : Indicates whether the walking 1s pattern is supported as output over the trace port. */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Pos (0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATW1_Pos) /*!< Bit mask of PATW1
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Min (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Max (0x1UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Disabled (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATW1_Enabled (0x1UL)

/* PATW0 @Bit 1 : Indicates whether the walking 0s pattern is supported as output over the trace port. */
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Pos (1UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATW0_Pos) /*!< Bit mask of PATW0
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Min (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Max (0x1UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Disabled (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATW0_Enabled (0x1UL)

/* PATA5 @Bit 2 : Indicates whether the AA/55 pattern is supported as output over the trace port. */
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Pos (2UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATA5_Pos) /*!< Bit mask of PATA5
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Min (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Max (0x1UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Disabled (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATA5_Enabled (0x1UL)

/* PATF0 @Bit 3 : Indicates whether the FF/00 pattern is supported as output over the trace port. */
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Pos (3UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PATF0_Pos) /*!< Bit mask of PATF0
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Min (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Max (0x1UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Disabled (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PATF0_Enabled (0x1UL)

/* PTIMEEN @Bit 16 : Indicates whether timed mode is supported. */
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Pos (16UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Pos) /*!< Bit mask of PTIMEEN
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Min (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Max (0x1UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Disabled (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PTIMEEN_Enabled (0x1UL)

/* PCONTEN @Bit 17 : Indicates whether continuous mode is supported. */
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Pos (17UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Msk (0x1UL << TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Pos) /*!< Bit mask of PCONTEN
                                                                            field.*/
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Min (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Max (0x1UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Disabled (0x0UL)
  #define TPIU_CURRENTTESTPATTERNMODES_PCONTEN_Enabled (0x1UL)


/* TPIU_TPRCR: The TPRCR register is an 8-bit counter start value that is decremented. A write sets the initial counter value
                and a read returns the programmed value. */

  #define TPIU_TPRCR_ResetValue (0x00000000UL)

/* PATTCOUNT @Bits 0..7 : 8-bit counter value to indicate the number of traceclkin cycles for which a pattern runs before it
                          switches to the next pattern. */

  #define TPIU_TPRCR_PATTCOUNT_Pos (0UL)
  #define TPIU_TPRCR_PATTCOUNT_Msk (0xFFUL << TPIU_TPRCR_PATTCOUNT_Pos)
  #define TPIU_TPRCR_PATTCOUNT_Min (0x00UL)
  #define TPIU_TPRCR_PATTCOUNT_Max (0xFFUL)


/* TPIU_FFSR: The FFSR register indicates the current status of the formatter and flush features available in the TPIU. */
  #define TPIU_FFSR_ResetValue (0x00000000UL)

/* FLINPROG @Bit 0 : Flush in progress. */
  #define TPIU_FFSR_FLINPROG_Pos (0UL)
  #define TPIU_FFSR_FLINPROG_Msk (0x1UL << TPIU_FFSR_FLINPROG_Pos)
  #define TPIU_FFSR_FLINPROG_Min (0x0UL)
  #define TPIU_FFSR_FLINPROG_Max (0x1UL)
  #define TPIU_FFSR_FLINPROG_NotInProgress (0x0UL)
  #define TPIU_FFSR_FLINPROG_InProgress (0x1UL)

/* FTSTOPPED @Bit 1 : The formatter has received a stop request signal and all trace data and post-amble is sent. Any additional
                      trace data on the ATB interface is ignored and atreadys goes HIGH. */

  #define TPIU_FFSR_FTSTOPPED_Pos (1UL)
  #define TPIU_FFSR_FTSTOPPED_Msk (0x1UL << TPIU_FFSR_FTSTOPPED_Pos)
  #define TPIU_FFSR_FTSTOPPED_Min (0x0UL)
  #define TPIU_FFSR_FTSTOPPED_Max (0x1UL)
  #define TPIU_FFSR_FTSTOPPED_Running (0x0UL)
  #define TPIU_FFSR_FTSTOPPED_Stopped (0x1UL)

/* TCPRESENT @Bit 2 : Indicates whether the TRACECTL pin is available for use. */
  #define TPIU_FFSR_TCPRESENT_Pos (2UL)
  #define TPIU_FFSR_TCPRESENT_Msk (0x1UL << TPIU_FFSR_TCPRESENT_Pos)
  #define TPIU_FFSR_TCPRESENT_Min (0x0UL)
  #define TPIU_FFSR_TCPRESENT_Max (0x1UL)
  #define TPIU_FFSR_TCPRESENT_NotPresent (0x0UL)
  #define TPIU_FFSR_TCPRESENT_Present (0x1UL)


/* TPIU_FFCR: The FFCR register controls the generation of stop, trigger, and flush events. */
  #define TPIU_FFCR_ResetValue (0x00000000UL)

/* ENFTC @Bit 0 : Do not embed triggers into the formatted stream. Trace disable cycles and triggers are indicated by tracectl,
                  where present. */

  #define TPIU_FFCR_ENFTC_Pos (0UL)
  #define TPIU_FFCR_ENFTC_Msk (0x1UL << TPIU_FFCR_ENFTC_Pos)
  #define TPIU_FFCR_ENFTC_Min (0x0UL)
  #define TPIU_FFCR_ENFTC_Max (0x1UL)
  #define TPIU_FFCR_ENFTC_Disabled (0x0UL)
  #define TPIU_FFCR_ENFTC_Enabled (0x1UL)

/* ENFCONT @Bit 1 : Is embedded in trigger packets and indicates that no cycle is using sync packets. */
  #define TPIU_FFCR_ENFCONT_Pos (1UL)
  #define TPIU_FFCR_ENFCONT_Msk (0x1UL << TPIU_FFCR_ENFCONT_Pos)
  #define TPIU_FFCR_ENFCONT_Min (0x0UL)
  #define TPIU_FFCR_ENFCONT_Max (0x1UL)
  #define TPIU_FFCR_ENFCONT_Disabled (0x0UL)
  #define TPIU_FFCR_ENFCONT_Enabled (0x1UL)

/* FONFLIN @Bit 4 : Enables the use of the flushin connection. */
  #define TPIU_FFCR_FONFLIN_Pos (4UL)
  #define TPIU_FFCR_FONFLIN_Msk (0x1UL << TPIU_FFCR_FONFLIN_Pos)
  #define TPIU_FFCR_FONFLIN_Min (0x0UL)
  #define TPIU_FFCR_FONFLIN_Max (0x1UL)
  #define TPIU_FFCR_FONFLIN_Disabled (0x0UL)
  #define TPIU_FFCR_FONFLIN_Enabled (0x1UL)

/* FONTRIG @Bit 5 : Initiates a manual flush of data in the system when a trigger event occurs. */
  #define TPIU_FFCR_FONTRIG_Pos (5UL)
  #define TPIU_FFCR_FONTRIG_Msk (0x1UL << TPIU_FFCR_FONTRIG_Pos)
  #define TPIU_FFCR_FONTRIG_Min (0x0UL)
  #define TPIU_FFCR_FONTRIG_Max (0x1UL)
  #define TPIU_FFCR_FONTRIG_Disabled (0x0UL)
  #define TPIU_FFCR_FONTRIG_Enabled (0x1UL)

/* FONMANR @Bit 6 : Generates a flush. This bit is set to 0 when this flush is serviced. */
  #define TPIU_FFCR_FONMANR_Pos (6UL)
  #define TPIU_FFCR_FONMANR_Msk (0x1UL << TPIU_FFCR_FONMANR_Pos)
  #define TPIU_FFCR_FONMANR_Min (0x0UL)
  #define TPIU_FFCR_FONMANR_Max (0x1UL)
  #define TPIU_FFCR_FONMANR_Disabled (0x0UL)
  #define TPIU_FFCR_FONMANR_Enabled (0x1UL)

/* FONMANW @Bit 7 : Generates a flush. This bit is set to 1 when this flush is serviced. */
  #define TPIU_FFCR_FONMANW_Pos (7UL)
  #define TPIU_FFCR_FONMANW_Msk (0x1UL << TPIU_FFCR_FONMANW_Pos)
  #define TPIU_FFCR_FONMANW_Min (0x0UL)
  #define TPIU_FFCR_FONMANW_Max (0x1UL)
  #define TPIU_FFCR_FONMANW_Disabled (0x0UL)
  #define TPIU_FFCR_FONMANW_Enabled (0x1UL)

/* TRIGIN @Bit 8 : Indicates a trigger when trigin is asserted. */
  #define TPIU_FFCR_TRIGIN_Pos (8UL)
  #define TPIU_FFCR_TRIGIN_Msk (0x1UL << TPIU_FFCR_TRIGIN_Pos)
  #define TPIU_FFCR_TRIGIN_Min (0x0UL)
  #define TPIU_FFCR_TRIGIN_Max (0x1UL)
  #define TPIU_FFCR_TRIGIN_Disabled (0x0UL)
  #define TPIU_FFCR_TRIGIN_Enabled (0x1UL)

