pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGEVT @Bit 9 : Indicates a trigger on a trigger event. */
  #define TPIU_FFCR_TRIGEVT_Pos (9UL)
  #define TPIU_FFCR_TRIGEVT_Msk (0x1UL << TPIU_FFCR_TRIGEVT_Pos)
  #define TPIU_FFCR_TRIGEVT_Min (0x0UL)
  #define TPIU_FFCR_TRIGEVT_Max (0x1UL)
  #define TPIU_FFCR_TRIGEVT_Disabled (0x0UL)
  #define TPIU_FFCR_TRIGEVT_Enabled (0x1UL)

/* TRIGFL @Bit 10 : Indicates a trigger when flush completion on afreadys is returned. */
  #define TPIU_FFCR_TRIGFL_Pos (10UL)
  #define TPIU_FFCR_TRIGFL_Msk (0x1UL << TPIU_FFCR_TRIGFL_Pos)
  #define TPIU_FFCR_TRIGFL_Min (0x0UL)
  #define TPIU_FFCR_TRIGFL_Max (0x1UL)
  #define TPIU_FFCR_TRIGFL_Disabled (0x0UL)
  #define TPIU_FFCR_TRIGFL_Enabled (0x1UL)

/* STOPFL @Bit 12 : Forces the FIFO to drain off any part-completed packets. */
  #define TPIU_FFCR_STOPFL_Pos (12UL)
  #define TPIU_FFCR_STOPFL_Msk (0x1UL << TPIU_FFCR_STOPFL_Pos)
  #define TPIU_FFCR_STOPFL_Min (0x0UL)
  #define TPIU_FFCR_STOPFL_Max (0x1UL)
  #define TPIU_FFCR_STOPFL_Disabled (0x0UL)
  #define TPIU_FFCR_STOPFL_Enabled (0x1UL)

/* STOPTRIG @Bit 13 : Stops the formatter after a trigger event is observed. Reset to disabled or 0. */
  #define TPIU_FFCR_STOPTRIG_Pos (13UL)
  #define TPIU_FFCR_STOPTRIG_Msk (0x1UL << TPIU_FFCR_STOPTRIG_Pos)
  #define TPIU_FFCR_STOPTRIG_Min (0x0UL)
  #define TPIU_FFCR_STOPTRIG_Max (0x1UL)
  #define TPIU_FFCR_STOPTRIG_Disabled (0x0UL)
  #define TPIU_FFCR_STOPTRIG_Enabled (0x1UL)


/* TPIU_FSCR: The FSCR register enables the frequency of synchronization information to be optimized to suit the Trace Port
               Analyzer (TPA) capture buffer size. */

  #define TPIU_FSCR_ResetValue (0x00000000UL)

/* CYCCOUNT @Bits 0..11 : 12-bit counter reload value. Indicates the number of complete frames between full synchronization
                          packets. */

  #define TPIU_FSCR_CYCCOUNT_Pos (0UL)
  #define TPIU_FSCR_CYCCOUNT_Msk (0xFFFUL << TPIU_FSCR_CYCCOUNT_Pos)
  #define TPIU_FSCR_CYCCOUNT_Min (0x000UL)
  #define TPIU_FSCR_CYCCOUNT_Max (0x400UL)


/* TPIU_EXTCTLINPORT: Two ports can be used as a control and feedback mechanism for any serializers, pin sharing multiplexers,
                       or other solutions that might be added to the trace output pins either for pin control or a high-speed
                       trace port solution. */

  #define TPIU_EXTCTLINPORT_ResetValue (0x00000000UL)

/* EXTCTLIN0 @Bit 0 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Pos (0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN0_Pos)
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Min (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Max (0x1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Low (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_High (0x1UL)

/* EXTCTLIN1 @Bit 1 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Pos (1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN1_Pos)
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Min (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Max (0x1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Low (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_High (0x1UL)

/* EXTCTLIN2 @Bit 2 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Pos (2UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN2_Pos)
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Min (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Max (0x1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Low (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_High (0x1UL)

/* EXTCTLIN3 @Bit 3 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Pos (3UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN3_Pos)
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Min (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Max (0x1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Low (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_High (0x1UL)

/* EXTCTLIN4 @Bit 4 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Pos (4UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN4_Pos)
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Min (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Max (0x1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Low (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_High (0x1UL)

/* EXTCTLIN5 @Bit 5 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Pos (5UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN5_Pos)
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Min (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Max (0x1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Low (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_High (0x1UL)

/* EXTCTLIN6 @Bit 6 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Pos (6UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN6_Pos)
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Min (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Max (0x1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Low (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_High (0x1UL)

/* EXTCTLIN7 @Bit 7 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Pos (7UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN7_Pos)
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Min (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Max (0x1UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Low (0x0UL)
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_High (0x1UL)


/* TPIU_EXTCTLOUTPORT: Two ports can be used as a control and feedback mechanism for any serializers, pin sharing multiplexers,
                        or other solutions that might be added to the trace output pins either for pin control or a high speed
                        trace port solution. These ports are raw register banks that sample or export the corresponding external
                        pins. */

  #define TPIU_EXTCTLOUTPORT_ResetValue (0x00000000UL)

/* EXTCTLOUT0 @Bit 0 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Pos (0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Pos)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Min (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Max (0x1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_Low (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT0_High (0x1UL)

/* EXTCTLOUT1 @Bit 1 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Pos (1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Pos)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Min (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Max (0x1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_Low (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT1_High (0x1UL)

/* EXTCTLOUT2 @Bit 2 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Pos (2UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Pos)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Min (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Max (0x1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_Low (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT2_High (0x1UL)

/* EXTCTLOUT3 @Bit 3 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Pos (3UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Pos)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Min (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Max (0x1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_Low (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT3_High (0x1UL)

