pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EXTCTLOUT4 @Bit 4 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Pos (4UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Pos)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Min (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Max (0x1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_Low (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT4_High (0x1UL)

/* EXTCTLOUT5 @Bit 5 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Pos (5UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Pos)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Min (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Max (0x1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_Low (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT5_High (0x1UL)

/* EXTCTLOUT6 @Bit 6 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Pos (6UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Pos)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Min (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Max (0x1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_Low (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT6_High (0x1UL)

/* EXTCTLOUT7 @Bit 7 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Pos (7UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Pos)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Min (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Max (0x1UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Low (0x0UL)
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_High (0x1UL)


/* TPIU_ITTRFLINACK: The ITTRFLINACK register enables control of the triginack and flushinack outputs from the TPIU. */
  #define TPIU_ITTRFLINACK_ResetValue (0x00000000UL)

/* TRIGINACK @Bit 0 : Sets the value of triginack. */
  #define TPIU_ITTRFLINACK_TRIGINACK_Pos (0UL)
  #define TPIU_ITTRFLINACK_TRIGINACK_Msk (0x1UL << TPIU_ITTRFLINACK_TRIGINACK_Pos)
  #define TPIU_ITTRFLINACK_TRIGINACK_Min (0x0UL)
  #define TPIU_ITTRFLINACK_TRIGINACK_Max (0x1UL)
  #define TPIU_ITTRFLINACK_TRIGINACK_Low (0x0UL)
  #define TPIU_ITTRFLINACK_TRIGINACK_High (0x1UL)

/* FLUSHINACK @Bit 1 : Sets the value of flushinack. */
  #define TPIU_ITTRFLINACK_FLUSHINACK_Pos (1UL)
  #define TPIU_ITTRFLINACK_FLUSHINACK_Msk (0x1UL << TPIU_ITTRFLINACK_FLUSHINACK_Pos)
  #define TPIU_ITTRFLINACK_FLUSHINACK_Min (0x0UL)
  #define TPIU_ITTRFLINACK_FLUSHINACK_Max (0x1UL)
  #define TPIU_ITTRFLINACK_FLUSHINACK_Low (0x0UL)
  #define TPIU_ITTRFLINACK_FLUSHINACK_High (0x1UL)


/* TPIU_ITTRFLIN: The ITTRFLIN register contains the values of the flushin and trigin inputs to the TPIU. */
  #define TPIU_ITTRFLIN_ResetValue (0x00000000UL)

/* TRIGIN @Bit 0 : Reads the value of trigin. */
  #define TPIU_ITTRFLIN_TRIGIN_Pos (0UL)
  #define TPIU_ITTRFLIN_TRIGIN_Msk (0x1UL << TPIU_ITTRFLIN_TRIGIN_Pos)
  #define TPIU_ITTRFLIN_TRIGIN_Min (0x0UL)
  #define TPIU_ITTRFLIN_TRIGIN_Max (0x1UL)
  #define TPIU_ITTRFLIN_TRIGIN_Low (0x0UL)
  #define TPIU_ITTRFLIN_TRIGIN_High (0x1UL)

/* FLUSHIN @Bit 1 : Reads the value of flushin. */
  #define TPIU_ITTRFLIN_FLUSHIN_Pos (1UL)
  #define TPIU_ITTRFLIN_FLUSHIN_Msk (0x1UL << TPIU_ITTRFLIN_FLUSHIN_Pos)
  #define TPIU_ITTRFLIN_FLUSHIN_Min (0x0UL)
  #define TPIU_ITTRFLIN_FLUSHIN_Max (0x1UL)
  #define TPIU_ITTRFLIN_FLUSHIN_Low (0x0UL)
  #define TPIU_ITTRFLIN_FLUSHIN_High (0x1UL)


/* TPIU_ITATBDATA0: The ITATBDATA0 register contains the value of the atdatas inputs to the TPIU. The values are valid only when
                     atvalids is HIGH. */

  #define TPIU_ITATBDATA0_ResetValue (0x00000000UL)

/* ATDATA0 @Bit 0 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA0_Pos (0UL)
  #define TPIU_ITATBDATA0_ATDATA0_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA0_Pos)
  #define TPIU_ITATBDATA0_ATDATA0_Min (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA0_Max (0x1UL)
  #define TPIU_ITATBDATA0_ATDATA0_Low (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA0_High (0x1UL)

/* ATDATA1 @Bit 1 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA1_Pos (1UL)
  #define TPIU_ITATBDATA0_ATDATA1_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA1_Pos)
  #define TPIU_ITATBDATA0_ATDATA1_Min (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA1_Max (0x1UL)
  #define TPIU_ITATBDATA0_ATDATA1_Low (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA1_High (0x1UL)

/* ATDATA2 @Bit 2 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA2_Pos (2UL)
  #define TPIU_ITATBDATA0_ATDATA2_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA2_Pos)
  #define TPIU_ITATBDATA0_ATDATA2_Min (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA2_Max (0x1UL)
  #define TPIU_ITATBDATA0_ATDATA2_Low (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA2_High (0x1UL)

/* ATDATA3 @Bit 3 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA3_Pos (3UL)
  #define TPIU_ITATBDATA0_ATDATA3_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA3_Pos)
  #define TPIU_ITATBDATA0_ATDATA3_Min (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA3_Max (0x1UL)
  #define TPIU_ITATBDATA0_ATDATA3_Low (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA3_High (0x1UL)

/* ATDATA4 @Bit 4 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA4_Pos (4UL)
  #define TPIU_ITATBDATA0_ATDATA4_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA4_Pos)
  #define TPIU_ITATBDATA0_ATDATA4_Min (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA4_Max (0x1UL)
  #define TPIU_ITATBDATA0_ATDATA4_Low (0x0UL)
  #define TPIU_ITATBDATA0_ATDATA4_High (0x1UL)


/* TPIU_ITATBCTR2: Enables control of the atreadys and afvalids outputs of the TPIU. */
  #define TPIU_ITATBCTR2_ResetValue (0x00000000UL)

/* ATREADY @Bit 0 : Sets the value of afvalid. */
  #define TPIU_ITATBCTR2_ATREADY_Pos (0UL)
  #define TPIU_ITATBCTR2_ATREADY_Msk (0x1UL << TPIU_ITATBCTR2_ATREADY_Pos)
  #define TPIU_ITATBCTR2_ATREADY_Min (0x0UL)
  #define TPIU_ITATBCTR2_ATREADY_Max (0x1UL)
  #define TPIU_ITATBCTR2_ATREADY_Low (0x0UL)
  #define TPIU_ITATBCTR2_ATREADY_High (0x1UL)

/* AFVALID @Bit 1 : Sets the value of atready. */
  #define TPIU_ITATBCTR2_AFVALID_Pos (1UL)
  #define TPIU_ITATBCTR2_AFVALID_Msk (0x1UL << TPIU_ITATBCTR2_AFVALID_Pos)
  #define TPIU_ITATBCTR2_AFVALID_Min (0x0UL)
  #define TPIU_ITATBCTR2_AFVALID_Max (0x1UL)
  #define TPIU_ITATBCTR2_AFVALID_Low (0x0UL)
  #define TPIU_ITATBCTR2_AFVALID_High (0x1UL)


/* TPIU_ITATBCTR1: The ITATBCTR1 register contains the value of the atids input to the TPIU. This is only valid when atvalids is
                    HIGH. */

