pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define TPIU_ITATBCTR1_ResetValue (0x00000000UL)

/* ATID @Bits 0..6 : Reads the value of atids. */
  #define TPIU_ITATBCTR1_ATID_Pos (0UL)
  #define TPIU_ITATBCTR1_ATID_Msk (0x7FUL << TPIU_ITATBCTR1_ATID_Pos)
  #define TPIU_ITATBCTR1_ATID_Min (0x0UL)
  #define TPIU_ITATBCTR1_ATID_Max (0x1UL)
  #define TPIU_ITATBCTR1_ATID_Low (0x00UL)
  #define TPIU_ITATBCTR1_ATID_High (0x01UL)


/* TPIU_ITATBCTR0: The ITATBCTR0 register captures the values of the atvalids, afreadys, and atbytess inputs to the TPIU. To
                    ensure the integration registers work correctly in a system, the value of atbytess is only valid when
                    atvalids, bit[0], is HIGH. */

  #define TPIU_ITATBCTR0_ResetValue (0x00000000UL)

/* ATVALID @Bit 0 : Reads the value of atvalids. */
  #define TPIU_ITATBCTR0_ATVALID_Pos (0UL)
  #define TPIU_ITATBCTR0_ATVALID_Msk (0x1UL << TPIU_ITATBCTR0_ATVALID_Pos)
  #define TPIU_ITATBCTR0_ATVALID_Min (0x0UL)
  #define TPIU_ITATBCTR0_ATVALID_Max (0x1UL)
  #define TPIU_ITATBCTR0_ATVALID_Low (0x0UL)
  #define TPIU_ITATBCTR0_ATVALID_High (0x1UL)

/* AFREADY @Bit 2 : Reads the value of afreadys. */
  #define TPIU_ITATBCTR0_AFREADY_Pos (2UL)
  #define TPIU_ITATBCTR0_AFREADY_Msk (0x1UL << TPIU_ITATBCTR0_AFREADY_Pos)
  #define TPIU_ITATBCTR0_AFREADY_Min (0x0UL)
  #define TPIU_ITATBCTR0_AFREADY_Max (0x1UL)
  #define TPIU_ITATBCTR0_AFREADY_Low (0x0UL)
  #define TPIU_ITATBCTR0_AFREADY_High (0x1UL)

/* ATBYTES @Bits 8..9 : Reads the value of atbytess. */
  #define TPIU_ITATBCTR0_ATBYTES_Pos (8UL)
  #define TPIU_ITATBCTR0_ATBYTES_Msk (0x3UL << TPIU_ITATBCTR0_ATBYTES_Pos)
  #define TPIU_ITATBCTR0_ATBYTES_Min (0x0UL)
  #define TPIU_ITATBCTR0_ATBYTES_Max (0x1UL)
  #define TPIU_ITATBCTR0_ATBYTES_Low (0x0UL)
  #define TPIU_ITATBCTR0_ATBYTES_High (0x1UL)


/* TPIU_ITCTRL: Used to enable topology detection. This register enables the component to switch from a functional mode, the
                 default behavior, to integration mode where the inputs and outputs of the component can be directly controlled
                 for integration testing and topology solving. */

  #define TPIU_ITCTRL_ResetValue (0x00000000UL)

/* INTEGRATIONMODE @Bit 0 : Enables the component to switch from functional mode to integration mode and back. If no integration
                            functionality is implemented, this register must read as zero. */

  #define TPIU_ITCTRL_INTEGRATIONMODE_Pos (0UL)
  #define TPIU_ITCTRL_INTEGRATIONMODE_Msk (0x1UL << TPIU_ITCTRL_INTEGRATIONMODE_Pos)
  #define TPIU_ITCTRL_INTEGRATIONMODE_Min (0x0UL)
  #define TPIU_ITCTRL_INTEGRATIONMODE_Max (0x1UL)
  #define TPIU_ITCTRL_INTEGRATIONMODE_Disabled (0x0UL)
  #define TPIU_ITCTRL_INTEGRATIONMODE_Enabled (0x1UL)


/* TPIU_CLAIMSET: Software can use the claim tag to coordinate application and debugger access to trace unit functionality. The
                   claim tags have no effect on the operation of the component. The CLAIMSET register sets bits in the claim
                   tag, and determines the number of claim bits implemented. */

  #define TPIU_CLAIMSET_ResetValue (0x00000000UL)

/* BIT0 @Bit 0 : Set claim bit 0 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT0_Pos (0UL)
  #define TPIU_CLAIMSET_BIT0_Msk (0x1UL << TPIU_CLAIMSET_BIT0_Pos)
  #define TPIU_CLAIMSET_BIT0_Min (0x0UL)
  #define TPIU_CLAIMSET_BIT0_Max (0x1UL)
  #define TPIU_CLAIMSET_BIT0_NotImplemented (0x0UL)
  #define TPIU_CLAIMSET_BIT0_Implemented (0x1UL)
  #define TPIU_CLAIMSET_BIT0_Set (0x1UL)

/* BIT1 @Bit 1 : Set claim bit 1 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT1_Pos (1UL)
  #define TPIU_CLAIMSET_BIT1_Msk (0x1UL << TPIU_CLAIMSET_BIT1_Pos)
  #define TPIU_CLAIMSET_BIT1_Min (0x0UL)
  #define TPIU_CLAIMSET_BIT1_Max (0x1UL)
  #define TPIU_CLAIMSET_BIT1_NotImplemented (0x0UL)
  #define TPIU_CLAIMSET_BIT1_Implemented (0x1UL)
  #define TPIU_CLAIMSET_BIT1_Set (0x1UL)

/* BIT2 @Bit 2 : Set claim bit 2 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT2_Pos (2UL)
  #define TPIU_CLAIMSET_BIT2_Msk (0x1UL << TPIU_CLAIMSET_BIT2_Pos)
  #define TPIU_CLAIMSET_BIT2_Min (0x0UL)
  #define TPIU_CLAIMSET_BIT2_Max (0x1UL)
  #define TPIU_CLAIMSET_BIT2_NotImplemented (0x0UL)
  #define TPIU_CLAIMSET_BIT2_Implemented (0x1UL)
  #define TPIU_CLAIMSET_BIT2_Set (0x1UL)

/* BIT3 @Bit 3 : Set claim bit 3 and check if bit is implemented or not. */
  #define TPIU_CLAIMSET_BIT3_Pos (3UL)
  #define TPIU_CLAIMSET_BIT3_Msk (0x1UL << TPIU_CLAIMSET_BIT3_Pos)
  #define TPIU_CLAIMSET_BIT3_Min (0x0UL)
  #define TPIU_CLAIMSET_BIT3_Max (0x1UL)
  #define TPIU_CLAIMSET_BIT3_NotImplemented (0x0UL)
  #define TPIU_CLAIMSET_BIT3_Implemented (0x1UL)
  #define TPIU_CLAIMSET_BIT3_Set (0x1UL)


/* TPIU_CLAIMCLR: Software can use the claim tag to coordinate application and debugger access to trace unit functionality. The
                   claim tags have no effect on the operation of the component. The CLAIMCLR register sets the bits in the claim
                   tag to 0 and determines the current value of the claim tag. */

  #define TPIU_CLAIMCLR_ResetValue (0x00000000UL)

/* BIT0 @Bit 0 : Read or clear claim bit 0. */
  #define TPIU_CLAIMCLR_BIT0_Pos (0UL)
  #define TPIU_CLAIMCLR_BIT0_Msk (0x1UL << TPIU_CLAIMCLR_BIT0_Pos)
  #define TPIU_CLAIMCLR_BIT0_Min (0x0UL)
  #define TPIU_CLAIMCLR_BIT0_Max (0x1UL)
  #define TPIU_CLAIMCLR_BIT0_Cleared (0x0UL)
  #define TPIU_CLAIMCLR_BIT0_Set (0x1UL)
  #define TPIU_CLAIMCLR_BIT0_Clear (0x1UL)

/* BIT1 @Bit 1 : Read or clear claim bit 1. */
  #define TPIU_CLAIMCLR_BIT1_Pos (1UL)
  #define TPIU_CLAIMCLR_BIT1_Msk (0x1UL << TPIU_CLAIMCLR_BIT1_Pos)
  #define TPIU_CLAIMCLR_BIT1_Min (0x0UL)
  #define TPIU_CLAIMCLR_BIT1_Max (0x1UL)
  #define TPIU_CLAIMCLR_BIT1_Cleared (0x0UL)
  #define TPIU_CLAIMCLR_BIT1_Set (0x1UL)
  #define TPIU_CLAIMCLR_BIT1_Clear (0x1UL)

/* BIT2 @Bit 2 : Read or clear claim bit 2. */
  #define TPIU_CLAIMCLR_BIT2_Pos (2UL)
  #define TPIU_CLAIMCLR_BIT2_Msk (0x1UL << TPIU_CLAIMCLR_BIT2_Pos)
  #define TPIU_CLAIMCLR_BIT2_Min (0x0UL)
  #define TPIU_CLAIMCLR_BIT2_Max (0x1UL)
  #define TPIU_CLAIMCLR_BIT2_Cleared (0x0UL)
  #define TPIU_CLAIMCLR_BIT2_Set (0x1UL)
  #define TPIU_CLAIMCLR_BIT2_Clear (0x1UL)

/* BIT3 @Bit 3 : Read or clear claim bit 3. */
  #define TPIU_CLAIMCLR_BIT3_Pos (3UL)
  #define TPIU_CLAIMCLR_BIT3_Msk (0x1UL << TPIU_CLAIMCLR_BIT3_Pos)
  #define TPIU_CLAIMCLR_BIT3_Min (0x0UL)
  #define TPIU_CLAIMCLR_BIT3_Max (0x1UL)
  #define TPIU_CLAIMCLR_BIT3_Cleared (0x0UL)
  #define TPIU_CLAIMCLR_BIT3_Set (0x1UL)
  #define TPIU_CLAIMCLR_BIT3_Clear (0x1UL)


/* TPIU_LAR: This is used to enable write access to device registers. */
  #define TPIU_LAR_ResetValue (0x00000000UL)

