pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ACCESS @Bits 0..31 : A write of 0xC5ACCE55 enables further write access to this device. Any other write removes write access.
                        */

  #define TPIU_LAR_ACCESS_Pos (0UL)
  #define TPIU_LAR_ACCESS_Msk (0xFFFFFFFFUL << TPIU_LAR_ACCESS_Pos)
  #define TPIU_LAR_ACCESS_Min (0xC5ACCE55UL)
  #define TPIU_LAR_ACCESS_Max (0xC5ACCE55UL)
  #define TPIU_LAR_ACCESS_UnLock (0xC5ACCE55UL)


/* TPIU_LSR: This indicates the status of the lock control mechanism. This lock prevents accidental writes by code under debug.
              Accesses to the extended stimulus port registers are not affected by the lock mechanism. This register must always
              be present although there might not be any lock access control mechanism. The lock mechanism, where present and
              locked, must block write accesses to any control register, except the Lock Access Register. For most components
              this covers all registers except for the Lock Access Register. */

  #define TPIU_LSR_ResetValue (0x00000000UL)

/* PRESENT @Bit 0 : Indicates that a lock control mechanism exists for this device. */
  #define TPIU_LSR_PRESENT_Pos (0UL)
  #define TPIU_LSR_PRESENT_Msk (0x1UL << TPIU_LSR_PRESENT_Pos)
  #define TPIU_LSR_PRESENT_Min (0x0UL)
  #define TPIU_LSR_PRESENT_Max (0x1UL)
  #define TPIU_LSR_PRESENT_NotImplemented (0x0UL)    /*!< No lock control mechanism exists, writes to the Lock Access Register
                                                          are ignored.*/
  #define TPIU_LSR_PRESENT_Implemented (0x1UL)

/* LOCKED @Bit 1 : Returns the current status of the Lock. */
  #define TPIU_LSR_LOCKED_Pos (1UL)
  #define TPIU_LSR_LOCKED_Msk (0x1UL << TPIU_LSR_LOCKED_Pos)
  #define TPIU_LSR_LOCKED_Min (0x0UL)
  #define TPIU_LSR_LOCKED_Max (0x1UL)
  #define TPIU_LSR_LOCKED_UnLocked (0x0UL)
  #define TPIU_LSR_LOCKED_Locked (0x1UL)             /*!< Write access to the component is blocked. All writes to control
                                                          registers are ignored. Reads are permitted.*/

/* TYPE @Bit 2 : Indicates if the Lock Access Register is implemented as 8-bit or 32-bit. */
  #define TPIU_LSR_TYPE_Pos (2UL)
  #define TPIU_LSR_TYPE_Msk (0x1UL << TPIU_LSR_TYPE_Pos)
  #define TPIU_LSR_TYPE_Min (0x0UL)
  #define TPIU_LSR_TYPE_Max (0x1UL)
  #define TPIU_LSR_TYPE_Bits32 (0x0UL)
  #define TPIU_LSR_TYPE_Bits8 (0x1UL)


/* TPIU_AUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define TPIU_AUTHSTATUS_ResetValue (0x00000000UL)

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define TPIU_AUTHSTATUS_NSID_Pos (0UL)
  #define TPIU_AUTHSTATUS_NSID_Msk (0x3UL << TPIU_AUTHSTATUS_NSID_Pos)
  #define TPIU_AUTHSTATUS_NSID_Min (0x0UL)
  #define TPIU_AUTHSTATUS_NSID_Max (0x1UL)
  #define TPIU_AUTHSTATUS_NSID_NotImplemented (0x0UL)
  #define TPIU_AUTHSTATUS_NSID_Implemented (0x1UL)

/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define TPIU_AUTHSTATUS_NSNID_Pos (2UL)
  #define TPIU_AUTHSTATUS_NSNID_Msk (0x3UL << TPIU_AUTHSTATUS_NSNID_Pos)
  #define TPIU_AUTHSTATUS_NSNID_Min (0x0UL)
  #define TPIU_AUTHSTATUS_NSNID_Max (0x1UL)
  #define TPIU_AUTHSTATUS_NSNID_NotImplemented (0x0UL)
  #define TPIU_AUTHSTATUS_NSNID_Implemented (0x1UL)

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define TPIU_AUTHSTATUS_SID_Pos (4UL)
  #define TPIU_AUTHSTATUS_SID_Msk (0x3UL << TPIU_AUTHSTATUS_SID_Pos)
  #define TPIU_AUTHSTATUS_SID_Min (0x0UL)
  #define TPIU_AUTHSTATUS_SID_Max (0x1UL)
  #define TPIU_AUTHSTATUS_SID_NotImplemented (0x0UL)
  #define TPIU_AUTHSTATUS_SID_Implemented (0x1UL)

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define TPIU_AUTHSTATUS_SNID_Pos (6UL)
  #define TPIU_AUTHSTATUS_SNID_Msk (0x3UL << TPIU_AUTHSTATUS_SNID_Pos)
  #define TPIU_AUTHSTATUS_SNID_Min (0x0UL)
  #define TPIU_AUTHSTATUS_SNID_Max (0x1UL)
  #define TPIU_AUTHSTATUS_SNID_NotImplemented (0x0UL)
  #define TPIU_AUTHSTATUS_SNID_Implemented (0x1UL)


/* TPIU_DEVID: Indicates the capabilities of the component. */
  #define TPIU_DEVID_ResetValue (0x00000000UL)

/* MUXNUM @Bits 0..4 : Indicates the hidden level of input multiplexing. When non-zero, this value indicates the type of
                       multiplexing on the input to the ATB. Currently only 0x00 is supported, that is, no multiplexing is
                       present. This value helps detect the ATB structure. */

  #define TPIU_DEVID_MUXNUM_Pos (0UL)
  #define TPIU_DEVID_MUXNUM_Msk (0x1FUL << TPIU_DEVID_MUXNUM_Pos)

/* CLKRELAT @Bit 5 : Indicates the relationship between atclk and traceclkin. */
  #define TPIU_DEVID_CLKRELAT_Pos (5UL)
  #define TPIU_DEVID_CLKRELAT_Msk (0x1UL << TPIU_DEVID_CLKRELAT_Pos)
  #define TPIU_DEVID_CLKRELAT_Min (0x0UL)
  #define TPIU_DEVID_CLKRELAT_Max (0x1UL)
  #define TPIU_DEVID_CLKRELAT_Synchronous (0x0UL)
  #define TPIU_DEVID_CLKRELAT_ASynchronous (0x1UL)

/* FIFOSIZE @Bits 6..8 : FIFO size in powers of 2. */
  #define TPIU_DEVID_FIFOSIZE_Pos (6UL)
  #define TPIU_DEVID_FIFOSIZE_Msk (0x7UL << TPIU_DEVID_FIFOSIZE_Pos)
  #define TPIU_DEVID_FIFOSIZE_Min (0x2UL)
  #define TPIU_DEVID_FIFOSIZE_Max (0x2UL)
  #define TPIU_DEVID_FIFOSIZE_Entries4 (0x2UL)

/* TCLKDATA @Bit 9 : Indicates whether trace clock plus data is supported. */
  #define TPIU_DEVID_TCLKDATA_Pos (9UL)
  #define TPIU_DEVID_TCLKDATA_Msk (0x1UL << TPIU_DEVID_TCLKDATA_Pos)
  #define TPIU_DEVID_TCLKDATA_Min (0x0UL)
  #define TPIU_DEVID_TCLKDATA_Max (0x1UL)
  #define TPIU_DEVID_TCLKDATA_Supported (0x0UL)
  #define TPIU_DEVID_TCLKDATA_NotSupported (0x1UL)

/* SWOMAN @Bit 10 : Indicates whether Serial Wire Output, Manchester encoded format, is supported. */
  #define TPIU_DEVID_SWOMAN_Pos (10UL)
  #define TPIU_DEVID_SWOMAN_Msk (0x1UL << TPIU_DEVID_SWOMAN_Pos)
  #define TPIU_DEVID_SWOMAN_Min (0x0UL)
  #define TPIU_DEVID_SWOMAN_Max (0x1UL)
  #define TPIU_DEVID_SWOMAN_NotSupported (0x0UL)
  #define TPIU_DEVID_SWOMAN_Supported (0x1UL)

/* SWOUARTNRZ @Bit 11 : Indicates whether Serial Wire Output, UART or NRZ, is supported. */
  #define TPIU_DEVID_SWOUARTNRZ_Pos (11UL)
  #define TPIU_DEVID_SWOUARTNRZ_Msk (0x1UL << TPIU_DEVID_SWOUARTNRZ_Pos)
  #define TPIU_DEVID_SWOUARTNRZ_Min (0x0UL)
  #define TPIU_DEVID_SWOUARTNRZ_Max (0x1UL)
  #define TPIU_DEVID_SWOUARTNRZ_NotSupported (0x0UL)
  #define TPIU_DEVID_SWOUARTNRZ_Supported (0x1UL)


