pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TPIU_DEVTYPE: The DEVTYPE register provides a debugger with information about the component when the Part Number field is not
                  recognized. The debugger can then report this information. */

  #define TPIU_DEVTYPE_ResetValue (0x00000000UL)

/* MAJOR @Bits 0..3 : The main type of the component */
  #define TPIU_DEVTYPE_MAJOR_Pos (0UL)
  #define TPIU_DEVTYPE_MAJOR_Msk (0xFUL << TPIU_DEVTYPE_MAJOR_Pos)
  #define TPIU_DEVTYPE_MAJOR_Min (0x1UL)
  #define TPIU_DEVTYPE_MAJOR_Max (0x1UL)
  #define TPIU_DEVTYPE_MAJOR_TraceSource (0x1UL)

/* SUB @Bits 4..7 : The sub-type of the component */
  #define TPIU_DEVTYPE_SUB_Pos (4UL)
  #define TPIU_DEVTYPE_SUB_Msk (0xFUL << TPIU_DEVTYPE_SUB_Pos)
  #define TPIU_DEVTYPE_SUB_Min (0x1UL)
  #define TPIU_DEVTYPE_SUB_Max (0x1UL)
  #define TPIU_DEVTYPE_SUB_TracePort (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TSGEN                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct TSGEN ======================================================= */
/**
  * @brief Timestamp generator
  */
  typedef struct {
    __IOM uint32_t CNTCR;
    __IM uint32_t CNTSR;
    __IOM uint32_t CNTCVL;
    __IOM uint32_t CNTCVU;
    __IM uint32_t RESERVED[4];
    __IOM uint32_t CNTFID0;
    __IM uint32_t RESERVED1[1003];
    __IM uint32_t PIDR4;
    __IM uint32_t RESERVED2[3];
    __IM uint32_t PIDR0;
    __IM uint32_t PIDR1;
    __IM uint32_t PIDR2;
    __IM uint32_t PIDR3;
    __IM uint32_t CIDR0;
    __IM uint32_t CIDR1;
    __IM uint32_t CIDR2;
    __IM uint32_t CIDR3;
  } NRF_TSGEN_Type;

/* TSGEN_CNTCR: Counter Control Register */
  #define TSGEN_CNTCR_ResetValue (0x00000000UL)

/* EN @Bit 0 : Counter enable */
  #define TSGEN_CNTCR_EN_Pos (0UL)
  #define TSGEN_CNTCR_EN_Msk (0x1UL << TSGEN_CNTCR_EN_Pos)
  #define TSGEN_CNTCR_EN_Min (0x0UL)
  #define TSGEN_CNTCR_EN_Max (0x1UL)
  #define TSGEN_CNTCR_EN_Disabled (0x0UL)
  #define TSGEN_CNTCR_EN_Enabled (0x1UL)

/* HDBG @Bit 1 : Halt on Debug */
  #define TSGEN_CNTCR_HDBG_Pos (1UL)
  #define TSGEN_CNTCR_HDBG_Msk (0x1UL << TSGEN_CNTCR_HDBG_Pos)
  #define TSGEN_CNTCR_HDBG_Min (0x0UL)
  #define TSGEN_CNTCR_HDBG_Max (0x1UL)
  #define TSGEN_CNTCR_HDBG_Disabled (0x0UL)
  #define TSGEN_CNTCR_HDBG_Enabled (0x1UL)           /*!< Halt on debug, when HLTDBG is driven HIGH, the count value is held
                                                          static.*/


/* TSGEN_CNTSR: Counter Status Register */
  #define TSGEN_CNTSR_ResetValue (0x00000000UL)

/* DBGH @Bit 1 : Debug halted */
  #define TSGEN_CNTSR_DBGH_Pos (1UL)
  #define TSGEN_CNTSR_DBGH_Msk (0x1UL << TSGEN_CNTSR_DBGH_Pos)


/* TSGEN_CNTCVL: Current Counter Value Lower register */
  #define TSGEN_CNTCVL_ResetValue (0x00000000UL)

/* CNTCVL_L_32 @Bits 0..31 : Current value of Counter, lower 32 bits */
  #define TSGEN_CNTCVL_CNTCVL_L_32_Pos (0UL)
  #define TSGEN_CNTCVL_CNTCVL_L_32_Msk (0xFFFFFFFFUL << TSGEN_CNTCVL_CNTCVL_L_32_Pos)


/* TSGEN_CNTCVU: Current Counter Value Upper register */
  #define TSGEN_CNTCVU_ResetValue (0x00000000UL)

/* CNTCVU_U_32 @Bits 0..31 : Current value of Counter, upper 32 bits */
  #define TSGEN_CNTCVU_CNTCVU_U_32_Pos (0UL)
  #define TSGEN_CNTCVU_CNTCVU_U_32_Msk (0xFFFFFFFFUL << TSGEN_CNTCVU_CNTCVU_U_32_Pos)


/* TSGEN_CNTFID0: Base Frequency ID */
  #define TSGEN_CNTFID0_ResetValue (0x00000000UL)

/* FREQ @Bits 0..31 : Frequency in number of ticks per second (up to 4 GHz) */
  #define TSGEN_CNTFID0_FREQ_Pos (0UL)
  #define TSGEN_CNTFID0_FREQ_Msk (0xFFFFFFFFUL << TSGEN_CNTFID0_FREQ_Pos)


/* TSGEN_PIDR4: Peripheral ID4 Register */
  #define TSGEN_PIDR4_ResetValue (0x00000004UL)

/* DES_2 @Bits 0..3 : JEDEC continuation code indicating the designer of the component, together with the identity code. */
  #define TSGEN_PIDR4_DES_2_Pos (0UL)
  #define TSGEN_PIDR4_DES_2_Msk (0xFUL << TSGEN_PIDR4_DES_2_Pos)

/* SIZE @Bits 4..7 : This is a 4-bit value that indicates the total contiguous size of the memory window used by this component
                     in powers of 2 from the standard 4KB. If a component only requires the standard 4KB, this must read as 0x0,
                     4KB only. For 8KB set to 0x1, for 16KB set to 0x2, for 32KB set to 0x3, and so on. */

  #define TSGEN_PIDR4_SIZE_Pos (4UL)
  #define TSGEN_PIDR4_SIZE_Msk (0xFUL << TSGEN_PIDR4_SIZE_Pos)


/* TSGEN_PIDR0: Peripheral ID0 Register */
  #define TSGEN_PIDR0_ResetValue (0x00000001UL)

/* PART_0 @Bits 0..7 : Bits [7:0] of the component part number. This is selected by the designer of the component. */
  #define TSGEN_PIDR0_PART_0_Pos (0UL)
  #define TSGEN_PIDR0_PART_0_Msk (0xFFUL << TSGEN_PIDR0_PART_0_Pos)


/* TSGEN_PIDR1: Peripheral ID1 Register */
  #define TSGEN_PIDR1_ResetValue (0x000000B1UL)

/* PART_1 @Bits 0..3 : Bits [11:8] of the component part number. This is selected by the designer of the component. */
  #define TSGEN_PIDR1_PART_1_Pos (0UL)
  #define TSGEN_PIDR1_PART_1_Msk (0xFUL << TSGEN_PIDR1_PART_1_Pos)

/* DES_0 @Bits 4..7 : Bits [3:0] of the JEDEC identity code indicating the designer of the component, together with the
                      continuation code. */

  #define TSGEN_PIDR1_DES_0_Pos (4UL)
  #define TSGEN_PIDR1_DES_0_Msk (0xFUL << TSGEN_PIDR1_DES_0_Pos)


/* TSGEN_PIDR2: Peripheral ID2 Register */
  #define TSGEN_PIDR2_ResetValue (0x0000001BUL)

/* DES_1 @Bits 0..2 : Bits [6:4] of the JEDEC identity code indicating the designer of the component, together with the
                      continuation code. */

  #define TSGEN_PIDR2_DES_1_Pos (0UL)
  #define TSGEN_PIDR2_DES_1_Msk (0x7UL << TSGEN_PIDR2_DES_1_Pos)

/* JEDEC @Bit 3 : Always set. Indicates that a JEDEC assigned value is used. */
  #define TSGEN_PIDR2_JEDEC_Pos (3UL)
  #define TSGEN_PIDR2_JEDEC_Msk (0x1UL << TSGEN_PIDR2_JEDEC_Pos)

/* REVISION @Bits 4..7 : The Revision field is an incremental value starting at 0x0 for the first design of this component. This
                         only increases by 1 for both major and minor revisions and is used as a look-up to establish the exact
                         major and minor revision. */

  #define TSGEN_PIDR2_REVISION_Pos (4UL)
  #define TSGEN_PIDR2_REVISION_Msk (0xFUL << TSGEN_PIDR2_REVISION_Pos)


/* TSGEN_PIDR3: Peripheral ID3 Register */
  #define TSGEN_PIDR3_ResetValue (0x00000000UL)

/* CMOD @Bits 0..3 : Where the component is reusable IP, this value indicates if the customer has modified the behavior of the
                     component. In most cases this field is zero. */

  #define TSGEN_PIDR3_CMOD_Pos (0UL)
  #define TSGEN_PIDR3_CMOD_Msk (0xFUL << TSGEN_PIDR3_CMOD_Pos)

/* REVAND @Bits 4..7 : This field indicates minor errata fixes specific to this design, for example metal fixes after
                       implementation. In most cases this field is zero. It is recommended that component designers ensure this
                       field can be changed by a metal fix if required, for example by driving it from registers that reset to
                       zero. */

  #define TSGEN_PIDR3_REVAND_Pos (4UL)
  #define TSGEN_PIDR3_REVAND_Msk (0xFUL << TSGEN_PIDR3_REVAND_Pos)


