pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define TWIM_SUBSCRIBE_DMA_TX_START_CHIDX_Pos (0UL)
  #define TWIM_SUBSCRIBE_DMA_TX_START_CHIDX_Msk (0xFFUL << TWIM_SUBSCRIBE_DMA_TX_START_CHIDX_Pos)
  #define TWIM_SUBSCRIBE_DMA_TX_START_CHIDX_Min (0x00UL)
  #define TWIM_SUBSCRIBE_DMA_TX_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_SUBSCRIBE_DMA_TX_START_EN_Pos (31UL)
  #define TWIM_SUBSCRIBE_DMA_TX_START_EN_Msk (0x1UL << TWIM_SUBSCRIBE_DMA_TX_START_EN_Pos)
  #define TWIM_SUBSCRIBE_DMA_TX_START_EN_Min (0x0UL)
  #define TWIM_SUBSCRIBE_DMA_TX_START_EN_Max (0x1UL)
  #define TWIM_SUBSCRIBE_DMA_TX_START_EN_Disabled (0x0UL)
  #define TWIM_SUBSCRIBE_DMA_TX_START_EN_Enabled (0x1UL)


/* TWIM_SUBSCRIBE_DMA_TX_STOP: Subscribe configuration for task STOP */
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_CHIDX_Pos (0UL)
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_CHIDX_Msk (0xFFUL << TWIM_SUBSCRIBE_DMA_TX_STOP_CHIDX_Pos)
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_CHIDX_Min (0x00UL)
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_EN_Pos (31UL)
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_EN_Msk (0x1UL << TWIM_SUBSCRIBE_DMA_TX_STOP_EN_Pos)
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_EN_Min (0x0UL)
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_EN_Max (0x1UL)
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_EN_Disabled (0x0UL)
  #define TWIM_SUBSCRIBE_DMA_TX_STOP_EN_Enabled (0x1UL)



/* ================================================ Struct TWIM_SUBSCRIBE_DMA ================================================ */
/**
  * @brief SUBSCRIBE_DMA [TWIM_SUBSCRIBE_DMA] Subscribe configuration for tasks
  */
typedef struct {
  __IOM NRF_TWIM_SUBSCRIBE_DMA_RX_Type RX;
  __IOM NRF_TWIM_SUBSCRIBE_DMA_TX_Type TX;
} NRF_TWIM_SUBSCRIBE_DMA_Type;


/* ================================================ Struct TWIM_EVENTS_DMA_RX ================================================ */
/**
  * @brief RX [TWIM_EVENTS_DMA_RX] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;
  __IOM uint32_t  MATCH[4];
} NRF_TWIM_EVENTS_DMA_RX_Type;

/* TWIM_EVENTS_DMA_RX_END: Generated after all MAXCNT bytes have been transferred */
  #define TWIM_EVENTS_DMA_RX_END_ResetValue (0x00000000UL)

/* END @Bit 0 : Generated after all MAXCNT bytes have been transferred */
  #define TWIM_EVENTS_DMA_RX_END_END_Pos (0UL)
  #define TWIM_EVENTS_DMA_RX_END_END_Msk (0x1UL << TWIM_EVENTS_DMA_RX_END_END_Pos)
  #define TWIM_EVENTS_DMA_RX_END_END_Min (0x0UL)
  #define TWIM_EVENTS_DMA_RX_END_END_Max (0x1UL)
  #define TWIM_EVENTS_DMA_RX_END_END_NotGenerated (0x0UL)
  #define TWIM_EVENTS_DMA_RX_END_END_Generated (0x1UL)


/* TWIM_EVENTS_DMA_RX_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                              to be written to prepare for the next sequence. */

  #define TWIM_EVENTS_DMA_RX_READY_ResetValue (0x00000000UL)

/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */

  #define TWIM_EVENTS_DMA_RX_READY_READY_Pos (0UL)
  #define TWIM_EVENTS_DMA_RX_READY_READY_Msk (0x1UL << TWIM_EVENTS_DMA_RX_READY_READY_Pos)
  #define TWIM_EVENTS_DMA_RX_READY_READY_Min (0x0UL)
  #define TWIM_EVENTS_DMA_RX_READY_READY_Max (0x1UL)
  #define TWIM_EVENTS_DMA_RX_READY_READY_NotGenerated (0x0UL)
  #define TWIM_EVENTS_DMA_RX_READY_READY_Generated (0x1UL)


/* TWIM_EVENTS_DMA_RX_BUSERROR: An error occured during the bus transfer. */
  #define TWIM_EVENTS_DMA_RX_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bit 0 : An error occured during the bus transfer. */
  #define TWIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Pos (0UL)
  #define TWIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Msk (0x1UL << TWIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define TWIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Min (0x0UL)
  #define TWIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Max (0x1UL)
  #define TWIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_NotGenerated (0x0UL)
  #define TWIM_EVENTS_DMA_RX_BUSERROR_BUSERROR_Generated (0x1UL)


/* TWIM_EVENTS_DMA_RX_MATCH: Pattern match is detected on the DMA data bus. */
  #define TWIM_EVENTS_DMA_RX_MATCH_MaxCount (4UL)
  #define TWIM_EVENTS_DMA_RX_MATCH_MaxIndex (3UL)
  #define TWIM_EVENTS_DMA_RX_MATCH_MinIndex (0UL)
  #define TWIM_EVENTS_DMA_RX_MATCH_ResetValue (0x00000000UL)

/* MATCH @Bit 0 : Pattern match is detected on the DMA data bus. */
  #define TWIM_EVENTS_DMA_RX_MATCH_MATCH_Pos (0UL)
  #define TWIM_EVENTS_DMA_RX_MATCH_MATCH_Msk (0x1UL << TWIM_EVENTS_DMA_RX_MATCH_MATCH_Pos)
  #define TWIM_EVENTS_DMA_RX_MATCH_MATCH_Min (0x0UL)
  #define TWIM_EVENTS_DMA_RX_MATCH_MATCH_Max (0x1UL)
  #define TWIM_EVENTS_DMA_RX_MATCH_MATCH_NotGenerated (0x0UL)
  #define TWIM_EVENTS_DMA_RX_MATCH_MATCH_Generated (0x1UL)



/* ================================================ Struct TWIM_EVENTS_DMA_TX ================================================ */
/**
  * @brief TX [TWIM_EVENTS_DMA_TX] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;
} NRF_TWIM_EVENTS_DMA_TX_Type;

/* TWIM_EVENTS_DMA_TX_END: Generated after all MAXCNT bytes have been transferred */
  #define TWIM_EVENTS_DMA_TX_END_ResetValue (0x00000000UL)

