pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define TWIM_PUBLISH_DMA_TX_END_CHIDX_Pos (0UL)
  #define TWIM_PUBLISH_DMA_TX_END_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_DMA_TX_END_CHIDX_Pos)
  #define TWIM_PUBLISH_DMA_TX_END_CHIDX_Min (0x00UL)
  #define TWIM_PUBLISH_DMA_TX_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_DMA_TX_END_EN_Pos (31UL)
  #define TWIM_PUBLISH_DMA_TX_END_EN_Msk (0x1UL << TWIM_PUBLISH_DMA_TX_END_EN_Pos)
  #define TWIM_PUBLISH_DMA_TX_END_EN_Min (0x0UL)
  #define TWIM_PUBLISH_DMA_TX_END_EN_Max (0x1UL)
  #define TWIM_PUBLISH_DMA_TX_END_EN_Disabled (0x0UL)
  #define TWIM_PUBLISH_DMA_TX_END_EN_Enabled (0x1UL)


/* TWIM_PUBLISH_DMA_TX_READY: Publish configuration for event READY */
  #define TWIM_PUBLISH_DMA_TX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define TWIM_PUBLISH_DMA_TX_READY_CHIDX_Pos (0UL)
  #define TWIM_PUBLISH_DMA_TX_READY_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_DMA_TX_READY_CHIDX_Pos)
  #define TWIM_PUBLISH_DMA_TX_READY_CHIDX_Min (0x00UL)
  #define TWIM_PUBLISH_DMA_TX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_DMA_TX_READY_EN_Pos (31UL)
  #define TWIM_PUBLISH_DMA_TX_READY_EN_Msk (0x1UL << TWIM_PUBLISH_DMA_TX_READY_EN_Pos)
  #define TWIM_PUBLISH_DMA_TX_READY_EN_Min (0x0UL)
  #define TWIM_PUBLISH_DMA_TX_READY_EN_Max (0x1UL)
  #define TWIM_PUBLISH_DMA_TX_READY_EN_Disabled (0x0UL)
  #define TWIM_PUBLISH_DMA_TX_READY_EN_Enabled (0x1UL)


/* TWIM_PUBLISH_DMA_TX_BUSERROR: Publish configuration for event BUSERROR */
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos (0UL)
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Min (0x00UL)
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_EN_Pos (31UL)
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_EN_Msk (0x1UL << TWIM_PUBLISH_DMA_TX_BUSERROR_EN_Pos)
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_EN_Min (0x0UL)
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_EN_Max (0x1UL)
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_EN_Disabled (0x0UL)
  #define TWIM_PUBLISH_DMA_TX_BUSERROR_EN_Enabled (0x1UL)



/* ================================================= Struct TWIM_PUBLISH_DMA ================================================= */
/**
  * @brief PUBLISH_DMA [TWIM_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM NRF_TWIM_PUBLISH_DMA_RX_Type RX;
  __IOM NRF_TWIM_PUBLISH_DMA_TX_Type TX;
} NRF_TWIM_PUBLISH_DMA_Type;


/* ==================================================== Struct TWIM_PSEL ===================================================== */
/**
  * @brief PSEL [TWIM_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCL;
  __IOM uint32_t  SDA;
} NRF_TWIM_PSEL_Type;

/* TWIM_PSEL_SCL: Pin select for SCL signal */
  #define TWIM_PSEL_SCL_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define TWIM_PSEL_SCL_PIN_Pos (0UL)
  #define TWIM_PSEL_SCL_PIN_Msk (0x1FUL << TWIM_PSEL_SCL_PIN_Pos)
  #define TWIM_PSEL_SCL_PIN_Min (0x00UL)
  #define TWIM_PSEL_SCL_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define TWIM_PSEL_SCL_PORT_Pos (5UL)
  #define TWIM_PSEL_SCL_PORT_Msk (0xFUL << TWIM_PSEL_SCL_PORT_Pos)
  #define TWIM_PSEL_SCL_PORT_Min (0x0UL)
  #define TWIM_PSEL_SCL_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define TWIM_PSEL_SCL_CONNECT_Pos (31UL)
  #define TWIM_PSEL_SCL_CONNECT_Msk (0x1UL << TWIM_PSEL_SCL_CONNECT_Pos)
  #define TWIM_PSEL_SCL_CONNECT_Min (0x0UL)
  #define TWIM_PSEL_SCL_CONNECT_Max (0x1UL)
  #define TWIM_PSEL_SCL_CONNECT_Disconnected (0x1UL)
  #define TWIM_PSEL_SCL_CONNECT_Connected (0x0UL)


/* TWIM_PSEL_SDA: Pin select for SDA signal */
  #define TWIM_PSEL_SDA_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define TWIM_PSEL_SDA_PIN_Pos (0UL)
  #define TWIM_PSEL_SDA_PIN_Msk (0x1FUL << TWIM_PSEL_SDA_PIN_Pos)
  #define TWIM_PSEL_SDA_PIN_Min (0x00UL)
  #define TWIM_PSEL_SDA_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define TWIM_PSEL_SDA_PORT_Pos (5UL)
  #define TWIM_PSEL_SDA_PORT_Msk (0xFUL << TWIM_PSEL_SDA_PORT_Pos)
  #define TWIM_PSEL_SDA_PORT_Min (0x0UL)
  #define TWIM_PSEL_SDA_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define TWIM_PSEL_SDA_CONNECT_Pos (31UL)
  #define TWIM_PSEL_SDA_CONNECT_Msk (0x1UL << TWIM_PSEL_SDA_CONNECT_Pos)
  #define TWIM_PSEL_SDA_CONNECT_Min (0x0UL)
  #define TWIM_PSEL_SDA_CONNECT_Max (0x1UL)
  #define TWIM_PSEL_SDA_CONNECT_Disconnected (0x1UL)
  #define TWIM_PSEL_SDA_CONNECT_Connected (0x0UL)



/* ================================================ Struct TWIM_DMA_RX_MATCH ================================================= */
/**
  * @brief MATCH [TWIM_DMA_RX_MATCH] Registers to control the behavior of the pattern matcher engine
  */
typedef struct {
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  CANDIDATE[4];                      /*!< (@ 0x00000004) The data to look for - any match will trigger the
                                                                         MATCH[n] event, if enabled.*/
} NRF_TWIM_DMA_RX_MATCH_Type;

/* TWIM_DMA_RX_MATCH_CONFIG: Configure individual match events */
  #define TWIM_DMA_RX_MATCH_CONFIG_ResetValue (0x00000000UL)

/* ENABLE0 @Bit 0 : Enable match filter 0 */
  #define TWIM_DMA_RX_MATCH_CONFIG_ENABLE0_Pos (0UL)
  #define TWIM_DMA_RX_MATCH_CONFIG_ENABLE0_Msk (0x1UL << TWIM_DMA_RX_MATCH_CONFIG_ENABLE0_Pos)
  #define TWIM_DMA_RX_MATCH_CONFIG_ENABLE0_Min (0x0UL)
  #define TWIM_DMA_RX_MATCH_CONFIG_ENABLE0_Max (0x1UL)
  #define TWIM_DMA_RX_MATCH_CONFIG_ENABLE0_Disabled (0x0UL)
  #define TWIM_DMA_RX_MATCH_CONFIG_ENABLE0_Enabled (0x1UL)

