pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TWIM_DMA_RX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define TWIM_DMA_RX_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define TWIM_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define TWIM_DMA_RX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << TWIM_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* =================================================== Struct TWIM_DMA_TX ==================================================== */
/**
  * @brief TX [TWIM_DMA_TX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/
  __IM  uint32_t  CURRENTAMOUNT;
  __IOM uint32_t  LIST;
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_TWIM_DMA_TX_Type;

/* TWIM_DMA_TX_PTR: RAM buffer start address */
  #define TWIM_DMA_TX_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define TWIM_DMA_TX_PTR_PTR_Pos (0UL)
  #define TWIM_DMA_TX_PTR_PTR_Msk (0xFFFFFFFFUL << TWIM_DMA_TX_PTR_PTR_Pos)


/* TWIM_DMA_TX_MAXCNT: Maximum number of bytes in channel buffer */
  #define TWIM_DMA_TX_MAXCNT_ResetValue (0x00000000UL)

/* MAXCNT @Bits 0..14 : Maximum number of bytes in channel buffer */
  #define TWIM_DMA_TX_MAXCNT_MAXCNT_Pos (0UL)
  #define TWIM_DMA_TX_MAXCNT_MAXCNT_Msk (0x7FFFUL << TWIM_DMA_TX_MAXCNT_MAXCNT_Pos)
  #define TWIM_DMA_TX_MAXCNT_MAXCNT_Min (0x0001UL)
  #define TWIM_DMA_TX_MAXCNT_MAXCNT_Max (0x7FFFUL)


/* TWIM_DMA_TX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after each
                        MATCH event. */

  #define TWIM_DMA_TX_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define TWIM_DMA_TX_AMOUNT_AMOUNT_Pos (0UL)
  #define TWIM_DMA_TX_AMOUNT_AMOUNT_Msk (0x7FFFUL << TWIM_DMA_TX_AMOUNT_AMOUNT_Pos)
  #define TWIM_DMA_TX_AMOUNT_AMOUNT_Min (0x0001UL)
  #define TWIM_DMA_TX_AMOUNT_AMOUNT_Max (0x7FFFUL)


/* TWIM_DMA_TX_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define TWIM_DMA_TX_CURRENTAMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define TWIM_DMA_TX_CURRENTAMOUNT_AMOUNT_Pos (0UL)
  #define TWIM_DMA_TX_CURRENTAMOUNT_AMOUNT_Msk (0x7FFFUL << TWIM_DMA_TX_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/
  #define TWIM_DMA_TX_CURRENTAMOUNT_AMOUNT_Min (0x0001UL)
  #define TWIM_DMA_TX_CURRENTAMOUNT_AMOUNT_Max (0x7FFFUL)


/* TWIM_DMA_TX_LIST: EasyDMA list type */
  #define TWIM_DMA_TX_LIST_ResetValue (0x00000000UL)

/* TYPE @Bits 0..2 : List type */
  #define TWIM_DMA_TX_LIST_TYPE_Pos (0UL)
  #define TWIM_DMA_TX_LIST_TYPE_Msk (0x7UL << TWIM_DMA_TX_LIST_TYPE_Pos)
  #define TWIM_DMA_TX_LIST_TYPE_Min (0x0UL)
  #define TWIM_DMA_TX_LIST_TYPE_Max (0x1UL)
  #define TWIM_DMA_TX_LIST_TYPE_Disabled (0x0UL)
  #define TWIM_DMA_TX_LIST_TYPE_ArrayList (0x1UL)


/* TWIM_DMA_TX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define TWIM_DMA_TX_TERMINATEONBUSERROR_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : (unspecified) */
  #define TWIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos (0UL)
  #define TWIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << TWIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define TWIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL)
  #define TWIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL)
  #define TWIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL)
  #define TWIM_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL)


/* TWIM_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define TWIM_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define TWIM_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define TWIM_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << TWIM_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ===================================================== Struct TWIM_DMA ===================================================== */
/**
  * @brief DMA [TWIM_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_TWIM_DMA_RX_Type RX;
  __IOM NRF_TWIM_DMA_TX_Type TX;
} NRF_TWIM_DMA_Type;

/* ======================================================= Struct TWIM ======================================================= */
/**
  * @brief I2C compatible Two-Wire Master Interface with EasyDMA
  */
  typedef struct {
    __IM uint32_t RESERVED;
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop TWI transaction. Must be issued while the TWI
                                                                         master is not suspended.*/
    __IM uint32_t RESERVED1;
    __OM uint32_t TASKS_SUSPEND;
    __OM uint32_t TASKS_RESUME;
    __IM uint32_t RESERVED2[5];
    __OM NRF_TWIM_TASKS_DMA_Type TASKS_DMA;
    __IM uint32_t RESERVED3[11];
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED4;
    __IOM uint32_t SUBSCRIBE_SUSPEND;
    __IOM uint32_t SUBSCRIBE_RESUME;
    __IM uint32_t RESERVED5[5];
    __IOM NRF_TWIM_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA;
    __IM uint32_t RESERVED6[11];
    __IOM uint32_t EVENTS_STOPPED;
    __IM uint32_t RESERVED7[3];
    __IOM uint32_t EVENTS_ERROR;
    __IM uint32_t RESERVED8[4];
    __IOM uint32_t EVENTS_SUSPENDED;                 /*!< (@ 0x00000128) SUSPEND task has been issued, TWI traffic is now
                                                                         suspended.*/
    __IM uint32_t RESERVED9[2];
    __IOM uint32_t EVENTS_LASTRX;
    __IOM uint32_t EVENTS_LASTTX;
    __IM uint32_t RESERVED10[4];
    __IOM NRF_TWIM_EVENTS_DMA_Type EVENTS_DMA;
    __IM uint32_t RESERVED11[4];
    __IOM uint32_t PUBLISH_STOPPED;
    __IM uint32_t RESERVED12[3];
    __IOM uint32_t PUBLISH_ERROR;
    __IM uint32_t RESERVED13[4];
    __IOM uint32_t PUBLISH_SUSPENDED;
    __IM uint32_t RESERVED14[2];
    __IOM uint32_t PUBLISH_LASTRX;
    __IOM uint32_t PUBLISH_LASTTX;
    __IM uint32_t RESERVED15[4];
    __IOM NRF_TWIM_PUBLISH_DMA_Type PUBLISH_DMA;
    __IM uint32_t RESERVED16[3];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED17[63];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED18[110];
    __IOM uint32_t ERRORSRC;
    __IM uint32_t RESERVED19[14];
    __IOM uint32_t ENABLE;
    __IM uint32_t RESERVED20[8];
    __IOM uint32_t FREQUENCY;                        /*!< (@ 0x00000524) TWI frequency. Accuracy depends on the HFCLK source
                                                                         selected.*/
    __IM uint32_t RESERVED21[24];
    __IOM uint32_t ADDRESS;
    __IM uint32_t RESERVED22[29];
    __IOM NRF_TWIM_PSEL_Type PSEL;
    __IM uint32_t RESERVED23[62];
    __IOM NRF_TWIM_DMA_Type DMA;
  } NRF_TWIM_Type;

/* TWIM_TASKS_STOP: Stop TWI transaction. Must be issued while the TWI master is not suspended. */
  #define TWIM_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop TWI transaction. Must be issued while the TWI master is not suspended. */
  #define TWIM_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define TWIM_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TWIM_TASKS_STOP_TASKS_STOP_Pos)
  #define TWIM_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define TWIM_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define TWIM_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


