pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TWIM_TASKS_SUSPEND: Suspend TWI transaction */
  #define TWIM_TASKS_SUSPEND_ResetValue (0x00000000UL)

/* TASKS_SUSPEND @Bit 0 : Suspend TWI transaction */
  #define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL)
  #define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND
                                                                            field.*/
  #define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Min (0x1UL)
  #define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Max (0x1UL)
  #define TWIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL)


/* TWIM_TASKS_RESUME: Resume TWI transaction */
  #define TWIM_TASKS_RESUME_ResetValue (0x00000000UL)

/* TASKS_RESUME @Bit 0 : Resume TWI transaction */
  #define TWIM_TASKS_RESUME_TASKS_RESUME_Pos (0UL)
  #define TWIM_TASKS_RESUME_TASKS_RESUME_Msk (0x1UL << TWIM_TASKS_RESUME_TASKS_RESUME_Pos)
  #define TWIM_TASKS_RESUME_TASKS_RESUME_Min (0x1UL)
  #define TWIM_TASKS_RESUME_TASKS_RESUME_Max (0x1UL)
  #define TWIM_TASKS_RESUME_TASKS_RESUME_Trigger (0x1UL)


/* TWIM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define TWIM_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define TWIM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define TWIM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << TWIM_SUBSCRIBE_STOP_CHIDX_Pos)
  #define TWIM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define TWIM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define TWIM_SUBSCRIBE_STOP_EN_Msk (0x1UL << TWIM_SUBSCRIBE_STOP_EN_Pos)
  #define TWIM_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define TWIM_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define TWIM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define TWIM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* TWIM_SUBSCRIBE_SUSPEND: Subscribe configuration for task SUSPEND */
  #define TWIM_SUBSCRIBE_SUSPEND_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SUSPEND will subscribe to */
  #define TWIM_SUBSCRIBE_SUSPEND_CHIDX_Pos (0UL)
  #define TWIM_SUBSCRIBE_SUSPEND_CHIDX_Msk (0xFFUL << TWIM_SUBSCRIBE_SUSPEND_CHIDX_Pos)
  #define TWIM_SUBSCRIBE_SUSPEND_CHIDX_Min (0x00UL)
  #define TWIM_SUBSCRIBE_SUSPEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_SUBSCRIBE_SUSPEND_EN_Pos (31UL)
  #define TWIM_SUBSCRIBE_SUSPEND_EN_Msk (0x1UL << TWIM_SUBSCRIBE_SUSPEND_EN_Pos)
  #define TWIM_SUBSCRIBE_SUSPEND_EN_Min (0x0UL)
  #define TWIM_SUBSCRIBE_SUSPEND_EN_Max (0x1UL)
  #define TWIM_SUBSCRIBE_SUSPEND_EN_Disabled (0x0UL)
  #define TWIM_SUBSCRIBE_SUSPEND_EN_Enabled (0x1UL)


/* TWIM_SUBSCRIBE_RESUME: Subscribe configuration for task RESUME */
  #define TWIM_SUBSCRIBE_RESUME_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RESUME will subscribe to */
  #define TWIM_SUBSCRIBE_RESUME_CHIDX_Pos (0UL)
  #define TWIM_SUBSCRIBE_RESUME_CHIDX_Msk (0xFFUL << TWIM_SUBSCRIBE_RESUME_CHIDX_Pos)
  #define TWIM_SUBSCRIBE_RESUME_CHIDX_Min (0x00UL)
  #define TWIM_SUBSCRIBE_RESUME_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_SUBSCRIBE_RESUME_EN_Pos (31UL)
  #define TWIM_SUBSCRIBE_RESUME_EN_Msk (0x1UL << TWIM_SUBSCRIBE_RESUME_EN_Pos)
  #define TWIM_SUBSCRIBE_RESUME_EN_Min (0x0UL)
  #define TWIM_SUBSCRIBE_RESUME_EN_Max (0x1UL)
  #define TWIM_SUBSCRIBE_RESUME_EN_Disabled (0x0UL)
  #define TWIM_SUBSCRIBE_RESUME_EN_Enabled (0x1UL)


/* TWIM_EVENTS_STOPPED: TWI stopped */
  #define TWIM_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : TWI stopped */
  #define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define TWIM_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* TWIM_EVENTS_ERROR: TWI error */
  #define TWIM_EVENTS_ERROR_ResetValue (0x00000000UL)

/* EVENTS_ERROR @Bit 0 : TWI error */
  #define TWIM_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)
  #define TWIM_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << TWIM_EVENTS_ERROR_EVENTS_ERROR_Pos)
  #define TWIM_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)
  #define TWIM_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)
  #define TWIM_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL)
  #define TWIM_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL)


/* TWIM_EVENTS_SUSPENDED: SUSPEND task has been issued, TWI traffic is now suspended. */
  #define TWIM_EVENTS_SUSPENDED_ResetValue (0x00000000UL)

/* EVENTS_SUSPENDED @Bit 0 : SUSPEND task has been issued, TWI traffic is now suspended. */
  #define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Pos (0UL)
  #define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Msk (0x1UL << TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Pos) /*!< Bit mask of
                                                                            EVENTS_SUSPENDED field.*/
  #define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Min (0x0UL)
  #define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Max (0x1UL)
  #define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_NotGenerated (0x0UL)
  #define TWIM_EVENTS_SUSPENDED_EVENTS_SUSPENDED_Generated (0x1UL)


/* TWIM_EVENTS_LASTRX: Byte boundary, starting to receive the last byte */
  #define TWIM_EVENTS_LASTRX_ResetValue (0x00000000UL)

/* EVENTS_LASTRX @Bit 0 : Byte boundary, starting to receive the last byte */
  #define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Pos (0UL)
  #define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Msk (0x1UL << TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Pos) /*!< Bit mask of EVENTS_LASTRX
                                                                            field.*/
  #define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Min (0x0UL)
  #define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Max (0x1UL)
  #define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_NotGenerated (0x0UL)
  #define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Generated (0x1UL)


