pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TWIM_EVENTS_LASTTX: Byte boundary, starting to transmit the last byte */
  #define TWIM_EVENTS_LASTTX_ResetValue (0x00000000UL)

/* EVENTS_LASTTX @Bit 0 : Byte boundary, starting to transmit the last byte */
  #define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Pos (0UL)
  #define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Msk (0x1UL << TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Pos) /*!< Bit mask of EVENTS_LASTTX
                                                                            field.*/
  #define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Min (0x0UL)
  #define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Max (0x1UL)
  #define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_NotGenerated (0x0UL)
  #define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Generated (0x1UL)


/* TWIM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define TWIM_PUBLISH_STOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define TWIM_PUBLISH_STOPPED_CHIDX_Pos (0UL)
  #define TWIM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_STOPPED_CHIDX_Pos)
  #define TWIM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)
  #define TWIM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_STOPPED_EN_Pos (31UL)
  #define TWIM_PUBLISH_STOPPED_EN_Msk (0x1UL << TWIM_PUBLISH_STOPPED_EN_Pos)
  #define TWIM_PUBLISH_STOPPED_EN_Min (0x0UL)
  #define TWIM_PUBLISH_STOPPED_EN_Max (0x1UL)
  #define TWIM_PUBLISH_STOPPED_EN_Disabled (0x0UL)
  #define TWIM_PUBLISH_STOPPED_EN_Enabled (0x1UL)


/* TWIM_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define TWIM_PUBLISH_ERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define TWIM_PUBLISH_ERROR_CHIDX_Pos (0UL)
  #define TWIM_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_ERROR_CHIDX_Pos)
  #define TWIM_PUBLISH_ERROR_CHIDX_Min (0x00UL)
  #define TWIM_PUBLISH_ERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_ERROR_EN_Pos (31UL)
  #define TWIM_PUBLISH_ERROR_EN_Msk (0x1UL << TWIM_PUBLISH_ERROR_EN_Pos)
  #define TWIM_PUBLISH_ERROR_EN_Min (0x0UL)
  #define TWIM_PUBLISH_ERROR_EN_Max (0x1UL)
  #define TWIM_PUBLISH_ERROR_EN_Disabled (0x0UL)
  #define TWIM_PUBLISH_ERROR_EN_Enabled (0x1UL)


/* TWIM_PUBLISH_SUSPENDED: Publish configuration for event SUSPENDED */
  #define TWIM_PUBLISH_SUSPENDED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event SUSPENDED will publish to */
  #define TWIM_PUBLISH_SUSPENDED_CHIDX_Pos (0UL)
  #define TWIM_PUBLISH_SUSPENDED_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_SUSPENDED_CHIDX_Pos)
  #define TWIM_PUBLISH_SUSPENDED_CHIDX_Min (0x00UL)
  #define TWIM_PUBLISH_SUSPENDED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_SUSPENDED_EN_Pos (31UL)
  #define TWIM_PUBLISH_SUSPENDED_EN_Msk (0x1UL << TWIM_PUBLISH_SUSPENDED_EN_Pos)
  #define TWIM_PUBLISH_SUSPENDED_EN_Min (0x0UL)
  #define TWIM_PUBLISH_SUSPENDED_EN_Max (0x1UL)
  #define TWIM_PUBLISH_SUSPENDED_EN_Disabled (0x0UL)
  #define TWIM_PUBLISH_SUSPENDED_EN_Enabled (0x1UL)


/* TWIM_PUBLISH_LASTRX: Publish configuration for event LASTRX */
  #define TWIM_PUBLISH_LASTRX_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event LASTRX will publish to */
  #define TWIM_PUBLISH_LASTRX_CHIDX_Pos (0UL)
  #define TWIM_PUBLISH_LASTRX_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_LASTRX_CHIDX_Pos)
  #define TWIM_PUBLISH_LASTRX_CHIDX_Min (0x00UL)
  #define TWIM_PUBLISH_LASTRX_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_LASTRX_EN_Pos (31UL)
  #define TWIM_PUBLISH_LASTRX_EN_Msk (0x1UL << TWIM_PUBLISH_LASTRX_EN_Pos)
  #define TWIM_PUBLISH_LASTRX_EN_Min (0x0UL)
  #define TWIM_PUBLISH_LASTRX_EN_Max (0x1UL)
  #define TWIM_PUBLISH_LASTRX_EN_Disabled (0x0UL)
  #define TWIM_PUBLISH_LASTRX_EN_Enabled (0x1UL)


/* TWIM_PUBLISH_LASTTX: Publish configuration for event LASTTX */
  #define TWIM_PUBLISH_LASTTX_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event LASTTX will publish to */
  #define TWIM_PUBLISH_LASTTX_CHIDX_Pos (0UL)
  #define TWIM_PUBLISH_LASTTX_CHIDX_Msk (0xFFUL << TWIM_PUBLISH_LASTTX_CHIDX_Pos)
  #define TWIM_PUBLISH_LASTTX_CHIDX_Min (0x00UL)
  #define TWIM_PUBLISH_LASTTX_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIM_PUBLISH_LASTTX_EN_Pos (31UL)
  #define TWIM_PUBLISH_LASTTX_EN_Msk (0x1UL << TWIM_PUBLISH_LASTTX_EN_Pos)
  #define TWIM_PUBLISH_LASTTX_EN_Min (0x0UL)
  #define TWIM_PUBLISH_LASTTX_EN_Max (0x1UL)
  #define TWIM_PUBLISH_LASTTX_EN_Disabled (0x0UL)
  #define TWIM_PUBLISH_LASTTX_EN_Enabled (0x1UL)


/* TWIM_SHORTS: Shortcuts between local events and tasks */
  #define TWIM_SHORTS_ResetValue (0x00000000UL)

/* LASTTX_DMA_RX_START @Bit 7 : Shortcut between event LASTTX and task DMA.RX.START */
  #define TWIM_SHORTS_LASTTX_DMA_RX_START_Pos (7UL)
  #define TWIM_SHORTS_LASTTX_DMA_RX_START_Msk (0x1UL << TWIM_SHORTS_LASTTX_DMA_RX_START_Pos) /*!< Bit mask of
                                                                            LASTTX_DMA_RX_START field.*/
  #define TWIM_SHORTS_LASTTX_DMA_RX_START_Min (0x0UL)
  #define TWIM_SHORTS_LASTTX_DMA_RX_START_Max (0x1UL)
  #define TWIM_SHORTS_LASTTX_DMA_RX_START_Disabled (0x0UL)
  #define TWIM_SHORTS_LASTTX_DMA_RX_START_Enabled (0x1UL)

/* LASTTX_SUSPEND @Bit 8 : Shortcut between event LASTTX and task SUSPEND */
  #define TWIM_SHORTS_LASTTX_SUSPEND_Pos (8UL)
  #define TWIM_SHORTS_LASTTX_SUSPEND_Msk (0x1UL << TWIM_SHORTS_LASTTX_SUSPEND_Pos)
  #define TWIM_SHORTS_LASTTX_SUSPEND_Min (0x0UL)
  #define TWIM_SHORTS_LASTTX_SUSPEND_Max (0x1UL)
  #define TWIM_SHORTS_LASTTX_SUSPEND_Disabled (0x0UL)
  #define TWIM_SHORTS_LASTTX_SUSPEND_Enabled (0x1UL)

/* LASTTX_STOP @Bit 9 : Shortcut between event LASTTX and task STOP */
  #define TWIM_SHORTS_LASTTX_STOP_Pos (9UL)
  #define TWIM_SHORTS_LASTTX_STOP_Msk (0x1UL << TWIM_SHORTS_LASTTX_STOP_Pos)
  #define TWIM_SHORTS_LASTTX_STOP_Min (0x0UL)
  #define TWIM_SHORTS_LASTTX_STOP_Max (0x1UL)
  #define TWIM_SHORTS_LASTTX_STOP_Disabled (0x0UL)
  #define TWIM_SHORTS_LASTTX_STOP_Enabled (0x1UL)

/* LASTRX_DMA_TX_START @Bit 10 : Shortcut between event LASTRX and task DMA.TX.START */
  #define TWIM_SHORTS_LASTRX_DMA_TX_START_Pos (10UL)
  #define TWIM_SHORTS_LASTRX_DMA_TX_START_Msk (0x1UL << TWIM_SHORTS_LASTRX_DMA_TX_START_Pos) /*!< Bit mask of
                                                                            LASTRX_DMA_TX_START field.*/
  #define TWIM_SHORTS_LASTRX_DMA_TX_START_Min (0x0UL)
  #define TWIM_SHORTS_LASTRX_DMA_TX_START_Max (0x1UL)
  #define TWIM_SHORTS_LASTRX_DMA_TX_START_Disabled (0x0UL)
  #define TWIM_SHORTS_LASTRX_DMA_TX_START_Enabled (0x1UL)

/* LASTRX_STOP @Bit 12 : Shortcut between event LASTRX and task STOP */
  #define TWIM_SHORTS_LASTRX_STOP_Pos (12UL)
  #define TWIM_SHORTS_LASTRX_STOP_Msk (0x1UL << TWIM_SHORTS_LASTRX_STOP_Pos)
  #define TWIM_SHORTS_LASTRX_STOP_Min (0x0UL)
  #define TWIM_SHORTS_LASTRX_STOP_Max (0x1UL)
  #define TWIM_SHORTS_LASTRX_STOP_Disabled (0x0UL)
  #define TWIM_SHORTS_LASTRX_STOP_Enabled (0x1UL)

/* DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 @Bit 21 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] Allows
                                               daisy-chaining match events. */

  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos (21UL)
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1
                                                                            field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Disabled (0x0UL)
  #define TWIM_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Enabled (0x1UL)

/* DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 @Bit 22 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[2] Allows
                                               daisy-chaining match events. */

  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos (22UL)
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2
                                                                            field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Disabled (0x0UL)
  #define TWIM_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Enabled (0x1UL)

/* DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3 @Bit 23 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[3] Allows
                                               daisy-chaining match events. */

  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Pos (23UL)
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Msk (0x1UL << TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3
                                                                            field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3 field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3 field.*/
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Disabled (0x0UL)
  #define TWIM_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Enabled (0x1UL)

