pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ERROR @Bit 5 : Enable or disable interrupt for event ERROR */
  #define TWIM_INTEN_ERROR_Pos (5UL)
  #define TWIM_INTEN_ERROR_Msk (0x1UL << TWIM_INTEN_ERROR_Pos)
  #define TWIM_INTEN_ERROR_Min (0x0UL)
  #define TWIM_INTEN_ERROR_Max (0x1UL)
  #define TWIM_INTEN_ERROR_Disabled (0x0UL)
  #define TWIM_INTEN_ERROR_Enabled (0x1UL)

/* SUSPENDED @Bit 10 : Enable or disable interrupt for event SUSPENDED */
  #define TWIM_INTEN_SUSPENDED_Pos (10UL)
  #define TWIM_INTEN_SUSPENDED_Msk (0x1UL << TWIM_INTEN_SUSPENDED_Pos)
  #define TWIM_INTEN_SUSPENDED_Min (0x0UL)
  #define TWIM_INTEN_SUSPENDED_Max (0x1UL)
  #define TWIM_INTEN_SUSPENDED_Disabled (0x0UL)
  #define TWIM_INTEN_SUSPENDED_Enabled (0x1UL)

/* LASTRX @Bit 13 : Enable or disable interrupt for event LASTRX */
  #define TWIM_INTEN_LASTRX_Pos (13UL)
  #define TWIM_INTEN_LASTRX_Msk (0x1UL << TWIM_INTEN_LASTRX_Pos)
  #define TWIM_INTEN_LASTRX_Min (0x0UL)
  #define TWIM_INTEN_LASTRX_Max (0x1UL)
  #define TWIM_INTEN_LASTRX_Disabled (0x0UL)
  #define TWIM_INTEN_LASTRX_Enabled (0x1UL)

/* LASTTX @Bit 14 : Enable or disable interrupt for event LASTTX */
  #define TWIM_INTEN_LASTTX_Pos (14UL)
  #define TWIM_INTEN_LASTTX_Msk (0x1UL << TWIM_INTEN_LASTTX_Pos)
  #define TWIM_INTEN_LASTTX_Min (0x0UL)
  #define TWIM_INTEN_LASTTX_Max (0x1UL)
  #define TWIM_INTEN_LASTTX_Disabled (0x0UL)
  #define TWIM_INTEN_LASTTX_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Enable or disable interrupt for event DMARXEND */
  #define TWIM_INTEN_DMARXEND_Pos (19UL)
  #define TWIM_INTEN_DMARXEND_Msk (0x1UL << TWIM_INTEN_DMARXEND_Pos)
  #define TWIM_INTEN_DMARXEND_Min (0x0UL)
  #define TWIM_INTEN_DMARXEND_Max (0x1UL)
  #define TWIM_INTEN_DMARXEND_Disabled (0x0UL)
  #define TWIM_INTEN_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Enable or disable interrupt for event DMARXREADY */
  #define TWIM_INTEN_DMARXREADY_Pos (20UL)
  #define TWIM_INTEN_DMARXREADY_Msk (0x1UL << TWIM_INTEN_DMARXREADY_Pos)
  #define TWIM_INTEN_DMARXREADY_Min (0x0UL)
  #define TWIM_INTEN_DMARXREADY_Max (0x1UL)
  #define TWIM_INTEN_DMARXREADY_Disabled (0x0UL)
  #define TWIM_INTEN_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Enable or disable interrupt for event DMARXBUSERROR */
  #define TWIM_INTEN_DMARXBUSERROR_Pos (21UL)
  #define TWIM_INTEN_DMARXBUSERROR_Msk (0x1UL << TWIM_INTEN_DMARXBUSERROR_Pos)
  #define TWIM_INTEN_DMARXBUSERROR_Min (0x0UL)
  #define TWIM_INTEN_DMARXBUSERROR_Max (0x1UL)
  #define TWIM_INTEN_DMARXBUSERROR_Disabled (0x0UL)
  #define TWIM_INTEN_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Enable or disable interrupt for event DMARXMATCH[0] */
  #define TWIM_INTEN_DMARXMATCH0_Pos (22UL)
  #define TWIM_INTEN_DMARXMATCH0_Msk (0x1UL << TWIM_INTEN_DMARXMATCH0_Pos)
  #define TWIM_INTEN_DMARXMATCH0_Min (0x0UL)
  #define TWIM_INTEN_DMARXMATCH0_Max (0x1UL)
  #define TWIM_INTEN_DMARXMATCH0_Disabled (0x0UL)
  #define TWIM_INTEN_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Enable or disable interrupt for event DMARXMATCH[1] */
  #define TWIM_INTEN_DMARXMATCH1_Pos (23UL)
  #define TWIM_INTEN_DMARXMATCH1_Msk (0x1UL << TWIM_INTEN_DMARXMATCH1_Pos)
  #define TWIM_INTEN_DMARXMATCH1_Min (0x0UL)
  #define TWIM_INTEN_DMARXMATCH1_Max (0x1UL)
  #define TWIM_INTEN_DMARXMATCH1_Disabled (0x0UL)
  #define TWIM_INTEN_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Enable or disable interrupt for event DMARXMATCH[2] */
  #define TWIM_INTEN_DMARXMATCH2_Pos (24UL)
  #define TWIM_INTEN_DMARXMATCH2_Msk (0x1UL << TWIM_INTEN_DMARXMATCH2_Pos)
  #define TWIM_INTEN_DMARXMATCH2_Min (0x0UL)
  #define TWIM_INTEN_DMARXMATCH2_Max (0x1UL)
  #define TWIM_INTEN_DMARXMATCH2_Disabled (0x0UL)
  #define TWIM_INTEN_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Enable or disable interrupt for event DMARXMATCH[3] */
  #define TWIM_INTEN_DMARXMATCH3_Pos (25UL)
  #define TWIM_INTEN_DMARXMATCH3_Msk (0x1UL << TWIM_INTEN_DMARXMATCH3_Pos)
  #define TWIM_INTEN_DMARXMATCH3_Min (0x0UL)
  #define TWIM_INTEN_DMARXMATCH3_Max (0x1UL)
  #define TWIM_INTEN_DMARXMATCH3_Disabled (0x0UL)
  #define TWIM_INTEN_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Enable or disable interrupt for event DMATXEND */
  #define TWIM_INTEN_DMATXEND_Pos (26UL)
  #define TWIM_INTEN_DMATXEND_Msk (0x1UL << TWIM_INTEN_DMATXEND_Pos)
  #define TWIM_INTEN_DMATXEND_Min (0x0UL)
  #define TWIM_INTEN_DMATXEND_Max (0x1UL)
  #define TWIM_INTEN_DMATXEND_Disabled (0x0UL)
  #define TWIM_INTEN_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Enable or disable interrupt for event DMATXREADY */
  #define TWIM_INTEN_DMATXREADY_Pos (27UL)
  #define TWIM_INTEN_DMATXREADY_Msk (0x1UL << TWIM_INTEN_DMATXREADY_Pos)
  #define TWIM_INTEN_DMATXREADY_Min (0x0UL)
  #define TWIM_INTEN_DMATXREADY_Max (0x1UL)
  #define TWIM_INTEN_DMATXREADY_Disabled (0x0UL)
  #define TWIM_INTEN_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Enable or disable interrupt for event DMATXBUSERROR */
  #define TWIM_INTEN_DMATXBUSERROR_Pos (28UL)
  #define TWIM_INTEN_DMATXBUSERROR_Msk (0x1UL << TWIM_INTEN_DMATXBUSERROR_Pos)
  #define TWIM_INTEN_DMATXBUSERROR_Min (0x0UL)
  #define TWIM_INTEN_DMATXBUSERROR_Max (0x1UL)
  #define TWIM_INTEN_DMATXBUSERROR_Disabled (0x0UL)
  #define TWIM_INTEN_DMATXBUSERROR_Enabled (0x1UL)


/* TWIM_INTENSET: Enable interrupt */
  #define TWIM_INTENSET_ResetValue (0x00000000UL)

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define TWIM_INTENSET_STOPPED_Pos (1UL)
  #define TWIM_INTENSET_STOPPED_Msk (0x1UL << TWIM_INTENSET_STOPPED_Pos)
  #define TWIM_INTENSET_STOPPED_Min (0x0UL)
  #define TWIM_INTENSET_STOPPED_Max (0x1UL)
  #define TWIM_INTENSET_STOPPED_Set (0x1UL)
  #define TWIM_INTENSET_STOPPED_Disabled (0x0UL)
  #define TWIM_INTENSET_STOPPED_Enabled (0x1UL)

/* ERROR @Bit 5 : Write '1' to enable interrupt for event ERROR */
  #define TWIM_INTENSET_ERROR_Pos (5UL)
  #define TWIM_INTENSET_ERROR_Msk (0x1UL << TWIM_INTENSET_ERROR_Pos)
  #define TWIM_INTENSET_ERROR_Min (0x0UL)
  #define TWIM_INTENSET_ERROR_Max (0x1UL)
  #define TWIM_INTENSET_ERROR_Set (0x1UL)
  #define TWIM_INTENSET_ERROR_Disabled (0x0UL)
  #define TWIM_INTENSET_ERROR_Enabled (0x1UL)

/* SUSPENDED @Bit 10 : Write '1' to enable interrupt for event SUSPENDED */
  #define TWIM_INTENSET_SUSPENDED_Pos (10UL)
  #define TWIM_INTENSET_SUSPENDED_Msk (0x1UL << TWIM_INTENSET_SUSPENDED_Pos)
  #define TWIM_INTENSET_SUSPENDED_Min (0x0UL)
  #define TWIM_INTENSET_SUSPENDED_Max (0x1UL)
  #define TWIM_INTENSET_SUSPENDED_Set (0x1UL)
  #define TWIM_INTENSET_SUSPENDED_Disabled (0x0UL)
  #define TWIM_INTENSET_SUSPENDED_Enabled (0x1UL)

/* LASTRX @Bit 13 : Write '1' to enable interrupt for event LASTRX */
  #define TWIM_INTENSET_LASTRX_Pos (13UL)
  #define TWIM_INTENSET_LASTRX_Msk (0x1UL << TWIM_INTENSET_LASTRX_Pos)
  #define TWIM_INTENSET_LASTRX_Min (0x0UL)
  #define TWIM_INTENSET_LASTRX_Max (0x1UL)
  #define TWIM_INTENSET_LASTRX_Set (0x1UL)
  #define TWIM_INTENSET_LASTRX_Disabled (0x0UL)
  #define TWIM_INTENSET_LASTRX_Enabled (0x1UL)

/* LASTTX @Bit 14 : Write '1' to enable interrupt for event LASTTX */
  #define TWIM_INTENSET_LASTTX_Pos (14UL)
  #define TWIM_INTENSET_LASTTX_Msk (0x1UL << TWIM_INTENSET_LASTTX_Pos)
  #define TWIM_INTENSET_LASTTX_Min (0x0UL)
  #define TWIM_INTENSET_LASTTX_Max (0x1UL)
  #define TWIM_INTENSET_LASTTX_Set (0x1UL)
  #define TWIM_INTENSET_LASTTX_Disabled (0x0UL)
  #define TWIM_INTENSET_LASTTX_Enabled (0x1UL)

