pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LASTTX @Bit 14 : Write '1' to disable interrupt for event LASTTX */
  #define TWIM_INTENCLR_LASTTX_Pos (14UL)
  #define TWIM_INTENCLR_LASTTX_Msk (0x1UL << TWIM_INTENCLR_LASTTX_Pos)
  #define TWIM_INTENCLR_LASTTX_Min (0x0UL)
  #define TWIM_INTENCLR_LASTTX_Max (0x1UL)
  #define TWIM_INTENCLR_LASTTX_Clear (0x1UL)
  #define TWIM_INTENCLR_LASTTX_Disabled (0x0UL)
  #define TWIM_INTENCLR_LASTTX_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Write '1' to disable interrupt for event DMARXEND */
  #define TWIM_INTENCLR_DMARXEND_Pos (19UL)
  #define TWIM_INTENCLR_DMARXEND_Msk (0x1UL << TWIM_INTENCLR_DMARXEND_Pos)
  #define TWIM_INTENCLR_DMARXEND_Min (0x0UL)
  #define TWIM_INTENCLR_DMARXEND_Max (0x1UL)
  #define TWIM_INTENCLR_DMARXEND_Clear (0x1UL)
  #define TWIM_INTENCLR_DMARXEND_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define TWIM_INTENCLR_DMARXREADY_Pos (20UL)
  #define TWIM_INTENCLR_DMARXREADY_Msk (0x1UL << TWIM_INTENCLR_DMARXREADY_Pos)
  #define TWIM_INTENCLR_DMARXREADY_Min (0x0UL)
  #define TWIM_INTENCLR_DMARXREADY_Max (0x1UL)
  #define TWIM_INTENCLR_DMARXREADY_Clear (0x1UL)
  #define TWIM_INTENCLR_DMARXREADY_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Write '1' to disable interrupt for event DMARXBUSERROR */
  #define TWIM_INTENCLR_DMARXBUSERROR_Pos (21UL)
  #define TWIM_INTENCLR_DMARXBUSERROR_Msk (0x1UL << TWIM_INTENCLR_DMARXBUSERROR_Pos)
  #define TWIM_INTENCLR_DMARXBUSERROR_Min (0x0UL)
  #define TWIM_INTENCLR_DMARXBUSERROR_Max (0x1UL)
  #define TWIM_INTENCLR_DMARXBUSERROR_Clear (0x1UL)
  #define TWIM_INTENCLR_DMARXBUSERROR_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Write '1' to disable interrupt for event DMARXMATCH[0] */
  #define TWIM_INTENCLR_DMARXMATCH0_Pos (22UL)
  #define TWIM_INTENCLR_DMARXMATCH0_Msk (0x1UL << TWIM_INTENCLR_DMARXMATCH0_Pos)
  #define TWIM_INTENCLR_DMARXMATCH0_Min (0x0UL)
  #define TWIM_INTENCLR_DMARXMATCH0_Max (0x1UL)
  #define TWIM_INTENCLR_DMARXMATCH0_Clear (0x1UL)
  #define TWIM_INTENCLR_DMARXMATCH0_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Write '1' to disable interrupt for event DMARXMATCH[1] */
  #define TWIM_INTENCLR_DMARXMATCH1_Pos (23UL)
  #define TWIM_INTENCLR_DMARXMATCH1_Msk (0x1UL << TWIM_INTENCLR_DMARXMATCH1_Pos)
  #define TWIM_INTENCLR_DMARXMATCH1_Min (0x0UL)
  #define TWIM_INTENCLR_DMARXMATCH1_Max (0x1UL)
  #define TWIM_INTENCLR_DMARXMATCH1_Clear (0x1UL)
  #define TWIM_INTENCLR_DMARXMATCH1_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Write '1' to disable interrupt for event DMARXMATCH[2] */
  #define TWIM_INTENCLR_DMARXMATCH2_Pos (24UL)
  #define TWIM_INTENCLR_DMARXMATCH2_Msk (0x1UL << TWIM_INTENCLR_DMARXMATCH2_Pos)
  #define TWIM_INTENCLR_DMARXMATCH2_Min (0x0UL)
  #define TWIM_INTENCLR_DMARXMATCH2_Max (0x1UL)
  #define TWIM_INTENCLR_DMARXMATCH2_Clear (0x1UL)
  #define TWIM_INTENCLR_DMARXMATCH2_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Write '1' to disable interrupt for event DMARXMATCH[3] */
  #define TWIM_INTENCLR_DMARXMATCH3_Pos (25UL)
  #define TWIM_INTENCLR_DMARXMATCH3_Msk (0x1UL << TWIM_INTENCLR_DMARXMATCH3_Pos)
  #define TWIM_INTENCLR_DMARXMATCH3_Min (0x0UL)
  #define TWIM_INTENCLR_DMARXMATCH3_Max (0x1UL)
  #define TWIM_INTENCLR_DMARXMATCH3_Clear (0x1UL)
  #define TWIM_INTENCLR_DMARXMATCH3_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Write '1' to disable interrupt for event DMATXEND */
  #define TWIM_INTENCLR_DMATXEND_Pos (26UL)
  #define TWIM_INTENCLR_DMATXEND_Msk (0x1UL << TWIM_INTENCLR_DMATXEND_Pos)
  #define TWIM_INTENCLR_DMATXEND_Min (0x0UL)
  #define TWIM_INTENCLR_DMATXEND_Max (0x1UL)
  #define TWIM_INTENCLR_DMATXEND_Clear (0x1UL)
  #define TWIM_INTENCLR_DMATXEND_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Write '1' to disable interrupt for event DMATXREADY */
  #define TWIM_INTENCLR_DMATXREADY_Pos (27UL)
  #define TWIM_INTENCLR_DMATXREADY_Msk (0x1UL << TWIM_INTENCLR_DMATXREADY_Pos)
  #define TWIM_INTENCLR_DMATXREADY_Min (0x0UL)
  #define TWIM_INTENCLR_DMATXREADY_Max (0x1UL)
  #define TWIM_INTENCLR_DMATXREADY_Clear (0x1UL)
  #define TWIM_INTENCLR_DMATXREADY_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Write '1' to disable interrupt for event DMATXBUSERROR */
  #define TWIM_INTENCLR_DMATXBUSERROR_Pos (28UL)
  #define TWIM_INTENCLR_DMATXBUSERROR_Msk (0x1UL << TWIM_INTENCLR_DMATXBUSERROR_Pos)
  #define TWIM_INTENCLR_DMATXBUSERROR_Min (0x0UL)
  #define TWIM_INTENCLR_DMATXBUSERROR_Max (0x1UL)
  #define TWIM_INTENCLR_DMATXBUSERROR_Clear (0x1UL)
  #define TWIM_INTENCLR_DMATXBUSERROR_Disabled (0x0UL)
  #define TWIM_INTENCLR_DMATXBUSERROR_Enabled (0x1UL)


/* TWIM_ERRORSRC: Error source */
  #define TWIM_ERRORSRC_ResetValue (0x00000000UL)

/* OVERRUN @Bit 0 : Overrun error */
  #define TWIM_ERRORSRC_OVERRUN_Pos (0UL)
  #define TWIM_ERRORSRC_OVERRUN_Msk (0x1UL << TWIM_ERRORSRC_OVERRUN_Pos)
  #define TWIM_ERRORSRC_OVERRUN_Min (0x0UL)
  #define TWIM_ERRORSRC_OVERRUN_Max (0x1UL)
  #define TWIM_ERRORSRC_OVERRUN_NotReceived (0x0UL)
  #define TWIM_ERRORSRC_OVERRUN_Received (0x1UL)

/* ANACK @Bit 1 : NACK received after sending the address (write '1' to clear) */
  #define TWIM_ERRORSRC_ANACK_Pos (1UL)
  #define TWIM_ERRORSRC_ANACK_Msk (0x1UL << TWIM_ERRORSRC_ANACK_Pos)
  #define TWIM_ERRORSRC_ANACK_Min (0x0UL)
  #define TWIM_ERRORSRC_ANACK_Max (0x1UL)
  #define TWIM_ERRORSRC_ANACK_NotReceived (0x0UL)
  #define TWIM_ERRORSRC_ANACK_Received (0x1UL)

/* DNACK @Bit 2 : NACK received after sending a data byte (write '1' to clear) */
  #define TWIM_ERRORSRC_DNACK_Pos (2UL)
  #define TWIM_ERRORSRC_DNACK_Msk (0x1UL << TWIM_ERRORSRC_DNACK_Pos)
  #define TWIM_ERRORSRC_DNACK_Min (0x0UL)
  #define TWIM_ERRORSRC_DNACK_Max (0x1UL)
  #define TWIM_ERRORSRC_DNACK_NotReceived (0x0UL)
  #define TWIM_ERRORSRC_DNACK_Received (0x1UL)


/* TWIM_ENABLE: Enable TWIM */
  #define TWIM_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bits 0..3 : Enable or disable TWIM */
  #define TWIM_ENABLE_ENABLE_Pos (0UL)
  #define TWIM_ENABLE_ENABLE_Msk (0xFUL << TWIM_ENABLE_ENABLE_Pos)
  #define TWIM_ENABLE_ENABLE_Min (0x0UL)
  #define TWIM_ENABLE_ENABLE_Max (0x6UL)
  #define TWIM_ENABLE_ENABLE_Disabled (0x0UL)
  #define TWIM_ENABLE_ENABLE_Enabled (0x6UL)


/* TWIM_FREQUENCY: TWI frequency. Accuracy depends on the HFCLK source selected. */
  #define TWIM_FREQUENCY_ResetValue (0x04000000UL)

