pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TWIS_EVENTS_DMA_RX_END: Generated after all MAXCNT bytes have been transferred */
  #define TWIS_EVENTS_DMA_RX_END_ResetValue (0x00000000UL)

/* END @Bit 0 : Generated after all MAXCNT bytes have been transferred */
  #define TWIS_EVENTS_DMA_RX_END_END_Pos (0UL)
  #define TWIS_EVENTS_DMA_RX_END_END_Msk (0x1UL << TWIS_EVENTS_DMA_RX_END_END_Pos)
  #define TWIS_EVENTS_DMA_RX_END_END_Min (0x0UL)
  #define TWIS_EVENTS_DMA_RX_END_END_Max (0x1UL)
  #define TWIS_EVENTS_DMA_RX_END_END_NotGenerated (0x0UL)
  #define TWIS_EVENTS_DMA_RX_END_END_Generated (0x1UL)


/* TWIS_EVENTS_DMA_RX_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                              to be written to prepare for the next sequence. */

  #define TWIS_EVENTS_DMA_RX_READY_ResetValue (0x00000000UL)

/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */

  #define TWIS_EVENTS_DMA_RX_READY_READY_Pos (0UL)
  #define TWIS_EVENTS_DMA_RX_READY_READY_Msk (0x1UL << TWIS_EVENTS_DMA_RX_READY_READY_Pos)
  #define TWIS_EVENTS_DMA_RX_READY_READY_Min (0x0UL)
  #define TWIS_EVENTS_DMA_RX_READY_READY_Max (0x1UL)
  #define TWIS_EVENTS_DMA_RX_READY_READY_NotGenerated (0x0UL)
  #define TWIS_EVENTS_DMA_RX_READY_READY_Generated (0x1UL)


/* TWIS_EVENTS_DMA_RX_BUSERROR: An error occured during the bus transfer. */
  #define TWIS_EVENTS_DMA_RX_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bit 0 : An error occured during the bus transfer. */
  #define TWIS_EVENTS_DMA_RX_BUSERROR_BUSERROR_Pos (0UL)
  #define TWIS_EVENTS_DMA_RX_BUSERROR_BUSERROR_Msk (0x1UL << TWIS_EVENTS_DMA_RX_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define TWIS_EVENTS_DMA_RX_BUSERROR_BUSERROR_Min (0x0UL)
  #define TWIS_EVENTS_DMA_RX_BUSERROR_BUSERROR_Max (0x1UL)
  #define TWIS_EVENTS_DMA_RX_BUSERROR_BUSERROR_NotGenerated (0x0UL)
  #define TWIS_EVENTS_DMA_RX_BUSERROR_BUSERROR_Generated (0x1UL)


/* TWIS_EVENTS_DMA_RX_MATCH: Pattern match is detected on the DMA data bus. */
  #define TWIS_EVENTS_DMA_RX_MATCH_MaxCount (4UL)
  #define TWIS_EVENTS_DMA_RX_MATCH_MaxIndex (3UL)
  #define TWIS_EVENTS_DMA_RX_MATCH_MinIndex (0UL)
  #define TWIS_EVENTS_DMA_RX_MATCH_ResetValue (0x00000000UL)

/* MATCH @Bit 0 : Pattern match is detected on the DMA data bus. */
  #define TWIS_EVENTS_DMA_RX_MATCH_MATCH_Pos (0UL)
  #define TWIS_EVENTS_DMA_RX_MATCH_MATCH_Msk (0x1UL << TWIS_EVENTS_DMA_RX_MATCH_MATCH_Pos)
  #define TWIS_EVENTS_DMA_RX_MATCH_MATCH_Min (0x0UL)
  #define TWIS_EVENTS_DMA_RX_MATCH_MATCH_Max (0x1UL)
  #define TWIS_EVENTS_DMA_RX_MATCH_MATCH_NotGenerated (0x0UL)
  #define TWIS_EVENTS_DMA_RX_MATCH_MATCH_Generated (0x1UL)



/* ================================================ Struct TWIS_EVENTS_DMA_TX ================================================ */
/**
  * @brief TX [TWIS_EVENTS_DMA_TX] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;
} NRF_TWIS_EVENTS_DMA_TX_Type;

/* TWIS_EVENTS_DMA_TX_END: Generated after all MAXCNT bytes have been transferred */
  #define TWIS_EVENTS_DMA_TX_END_ResetValue (0x00000000UL)

/* END @Bit 0 : Generated after all MAXCNT bytes have been transferred */
  #define TWIS_EVENTS_DMA_TX_END_END_Pos (0UL)
  #define TWIS_EVENTS_DMA_TX_END_END_Msk (0x1UL << TWIS_EVENTS_DMA_TX_END_END_Pos)
  #define TWIS_EVENTS_DMA_TX_END_END_Min (0x0UL)
  #define TWIS_EVENTS_DMA_TX_END_END_Max (0x1UL)
  #define TWIS_EVENTS_DMA_TX_END_END_NotGenerated (0x0UL)
  #define TWIS_EVENTS_DMA_TX_END_END_Generated (0x1UL)


/* TWIS_EVENTS_DMA_TX_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                              to be written to prepare for the next sequence. */

  #define TWIS_EVENTS_DMA_TX_READY_ResetValue (0x00000000UL)

/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */

  #define TWIS_EVENTS_DMA_TX_READY_READY_Pos (0UL)
  #define TWIS_EVENTS_DMA_TX_READY_READY_Msk (0x1UL << TWIS_EVENTS_DMA_TX_READY_READY_Pos)
  #define TWIS_EVENTS_DMA_TX_READY_READY_Min (0x0UL)
  #define TWIS_EVENTS_DMA_TX_READY_READY_Max (0x1UL)
  #define TWIS_EVENTS_DMA_TX_READY_READY_NotGenerated (0x0UL)
  #define TWIS_EVENTS_DMA_TX_READY_READY_Generated (0x1UL)


/* TWIS_EVENTS_DMA_TX_BUSERROR: An error occured during the bus transfer. */
  #define TWIS_EVENTS_DMA_TX_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bit 0 : An error occured during the bus transfer. */
  #define TWIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Pos (0UL)
  #define TWIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Msk (0x1UL << TWIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define TWIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Min (0x0UL)
  #define TWIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Max (0x1UL)
  #define TWIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_NotGenerated (0x0UL)
  #define TWIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Generated (0x1UL)



/* ================================================= Struct TWIS_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [TWIS_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM NRF_TWIS_EVENTS_DMA_RX_Type RX;
  __IOM NRF_TWIS_EVENTS_DMA_TX_Type TX;
} NRF_TWIS_EVENTS_DMA_Type;


/* =============================================== Struct TWIS_PUBLISH_DMA_RX ================================================ */
/**
  * @brief RX [TWIS_PUBLISH_DMA_RX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;
  __IOM uint32_t  BUSERROR;
  __IOM uint32_t  MATCH[4];
} NRF_TWIS_PUBLISH_DMA_RX_Type;

/* TWIS_PUBLISH_DMA_RX_END: Publish configuration for event END */
  #define TWIS_PUBLISH_DMA_RX_END_ResetValue (0x00000000UL)

