pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define TWIS_PUBLISH_DMA_RX_END_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_DMA_RX_END_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_RX_END_CHIDX_Pos)
  #define TWIS_PUBLISH_DMA_RX_END_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_DMA_RX_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_RX_END_EN_Pos (31UL)
  #define TWIS_PUBLISH_DMA_RX_END_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_RX_END_EN_Pos)
  #define TWIS_PUBLISH_DMA_RX_END_EN_Min (0x0UL)
  #define TWIS_PUBLISH_DMA_RX_END_EN_Max (0x1UL)
  #define TWIS_PUBLISH_DMA_RX_END_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_DMA_RX_END_EN_Enabled (0x1UL)


/* TWIS_PUBLISH_DMA_RX_READY: Publish configuration for event READY */
  #define TWIS_PUBLISH_DMA_RX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define TWIS_PUBLISH_DMA_RX_READY_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_DMA_RX_READY_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_RX_READY_CHIDX_Pos)
  #define TWIS_PUBLISH_DMA_RX_READY_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_DMA_RX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_RX_READY_EN_Pos (31UL)
  #define TWIS_PUBLISH_DMA_RX_READY_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_RX_READY_EN_Pos)
  #define TWIS_PUBLISH_DMA_RX_READY_EN_Min (0x0UL)
  #define TWIS_PUBLISH_DMA_RX_READY_EN_Max (0x1UL)
  #define TWIS_PUBLISH_DMA_RX_READY_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_DMA_RX_READY_EN_Enabled (0x1UL)


/* TWIS_PUBLISH_DMA_RX_BUSERROR: Publish configuration for event BUSERROR */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Pos (31UL)
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Pos)
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Min (0x0UL)
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Max (0x1UL)
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_DMA_RX_BUSERROR_EN_Enabled (0x1UL)


/* TWIS_PUBLISH_DMA_RX_MATCH: Publish configuration for event MATCH[n] */
  #define TWIS_PUBLISH_DMA_RX_MATCH_MaxCount (4UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_MaxIndex (3UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_MinIndex (0UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event MATCH[n] will publish to */
  #define TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Pos)
  #define TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Pos (31UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_RX_MATCH_EN_Pos)
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Min (0x0UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Max (0x1UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_DMA_RX_MATCH_EN_Enabled (0x1UL)



/* =============================================== Struct TWIS_PUBLISH_DMA_TX ================================================ */
/**
  * @brief TX [TWIS_PUBLISH_DMA_TX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;
  __IOM uint32_t  BUSERROR;
} NRF_TWIS_PUBLISH_DMA_TX_Type;

/* TWIS_PUBLISH_DMA_TX_END: Publish configuration for event END */
  #define TWIS_PUBLISH_DMA_TX_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define TWIS_PUBLISH_DMA_TX_END_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_DMA_TX_END_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_TX_END_CHIDX_Pos)
  #define TWIS_PUBLISH_DMA_TX_END_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_DMA_TX_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_TX_END_EN_Pos (31UL)
  #define TWIS_PUBLISH_DMA_TX_END_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_TX_END_EN_Pos)
  #define TWIS_PUBLISH_DMA_TX_END_EN_Min (0x0UL)
  #define TWIS_PUBLISH_DMA_TX_END_EN_Max (0x1UL)
  #define TWIS_PUBLISH_DMA_TX_END_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_DMA_TX_END_EN_Enabled (0x1UL)


/* TWIS_PUBLISH_DMA_TX_READY: Publish configuration for event READY */
  #define TWIS_PUBLISH_DMA_TX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define TWIS_PUBLISH_DMA_TX_READY_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_DMA_TX_READY_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_TX_READY_CHIDX_Pos)
  #define TWIS_PUBLISH_DMA_TX_READY_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_DMA_TX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Pos (31UL)
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_TX_READY_EN_Pos)
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Min (0x0UL)
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Max (0x1UL)
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_DMA_TX_READY_EN_Enabled (0x1UL)


/* TWIS_PUBLISH_DMA_TX_BUSERROR: Publish configuration for event BUSERROR */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Pos (31UL)
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Msk (0x1UL << TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Pos)
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Min (0x0UL)
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Max (0x1UL)
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_DMA_TX_BUSERROR_EN_Enabled (0x1UL)



/* ================================================= Struct TWIS_PUBLISH_DMA ================================================= */
/**
  * @brief PUBLISH_DMA [TWIS_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM NRF_TWIS_PUBLISH_DMA_RX_Type RX;
  __IOM NRF_TWIS_PUBLISH_DMA_TX_Type TX;
} NRF_TWIS_PUBLISH_DMA_Type;


/* ==================================================== Struct TWIS_PSEL ===================================================== */
/**
  * @brief PSEL [TWIS_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SCL;
  __IOM uint32_t  SDA;
} NRF_TWIS_PSEL_Type;

/* TWIS_PSEL_SCL: Pin select for SCL signal */
  #define TWIS_PSEL_SCL_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define TWIS_PSEL_SCL_PIN_Pos (0UL)
  #define TWIS_PSEL_SCL_PIN_Msk (0x1FUL << TWIS_PSEL_SCL_PIN_Pos)
  #define TWIS_PSEL_SCL_PIN_Min (0x00UL)
  #define TWIS_PSEL_SCL_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define TWIS_PSEL_SCL_PORT_Pos (5UL)
  #define TWIS_PSEL_SCL_PORT_Msk (0xFUL << TWIS_PSEL_SCL_PORT_Pos)
  #define TWIS_PSEL_SCL_PORT_Min (0x0UL)
  #define TWIS_PSEL_SCL_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define TWIS_PSEL_SCL_CONNECT_Pos (31UL)
  #define TWIS_PSEL_SCL_CONNECT_Msk (0x1UL << TWIS_PSEL_SCL_CONNECT_Pos)
  #define TWIS_PSEL_SCL_CONNECT_Min (0x0UL)
  #define TWIS_PSEL_SCL_CONNECT_Max (0x1UL)
  #define TWIS_PSEL_SCL_CONNECT_Disconnected (0x1UL)
  #define TWIS_PSEL_SCL_CONNECT_Connected (0x0UL)


/* TWIS_PSEL_SDA: Pin select for SDA signal */
  #define TWIS_PSEL_SDA_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define TWIS_PSEL_SDA_PIN_Pos (0UL)
  #define TWIS_PSEL_SDA_PIN_Msk (0x1FUL << TWIS_PSEL_SDA_PIN_Pos)
  #define TWIS_PSEL_SDA_PIN_Min (0x00UL)
  #define TWIS_PSEL_SDA_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define TWIS_PSEL_SDA_PORT_Pos (5UL)
  #define TWIS_PSEL_SDA_PORT_Msk (0xFUL << TWIS_PSEL_SDA_PORT_Pos)
  #define TWIS_PSEL_SDA_PORT_Min (0x0UL)
  #define TWIS_PSEL_SDA_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define TWIS_PSEL_SDA_CONNECT_Pos (31UL)
  #define TWIS_PSEL_SDA_CONNECT_Msk (0x1UL << TWIS_PSEL_SDA_CONNECT_Pos)
  #define TWIS_PSEL_SDA_CONNECT_Min (0x0UL)
  #define TWIS_PSEL_SDA_CONNECT_Max (0x1UL)
  #define TWIS_PSEL_SDA_CONNECT_Disconnected (0x1UL)
  #define TWIS_PSEL_SDA_CONNECT_Connected (0x0UL)



/* ================================================ Struct TWIS_DMA_RX_MATCH ================================================= */
/**
  * @brief MATCH [TWIS_DMA_RX_MATCH] Registers to control the behavior of the pattern matcher engine
  */
typedef struct {
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  CANDIDATE[4];                      /*!< (@ 0x00000004) The data to look for - any match will trigger the
                                                                         MATCH[n] event, if enabled.*/
} NRF_TWIS_DMA_RX_MATCH_Type;

/* TWIS_DMA_RX_MATCH_CONFIG: Configure individual match events */
  #define TWIS_DMA_RX_MATCH_CONFIG_ResetValue (0x00000000UL)

