pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ENABLE0 @Bit 0 : Enable match filter 0 */
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE0_Pos (0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE0_Msk (0x1UL << TWIS_DMA_RX_MATCH_CONFIG_ENABLE0_Pos)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE0_Min (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE0_Max (0x1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE0_Disabled (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE0_Enabled (0x1UL)

/* ENABLE1 @Bit 1 : Enable match filter 1 */
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE1_Pos (1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE1_Msk (0x1UL << TWIS_DMA_RX_MATCH_CONFIG_ENABLE1_Pos)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE1_Min (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE1_Max (0x1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE1_Disabled (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE1_Enabled (0x1UL)

/* ENABLE2 @Bit 2 : Enable match filter 2 */
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE2_Pos (2UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE2_Msk (0x1UL << TWIS_DMA_RX_MATCH_CONFIG_ENABLE2_Pos)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE2_Min (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE2_Max (0x1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE2_Disabled (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE2_Enabled (0x1UL)

/* ENABLE3 @Bit 3 : Enable match filter 3 */
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE3_Pos (3UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE3_Msk (0x1UL << TWIS_DMA_RX_MATCH_CONFIG_ENABLE3_Pos)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE3_Min (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE3_Max (0x1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE3_Disabled (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ENABLE3_Enabled (0x1UL)

/* ONESHOT0 @Bit 16 : Configure match filter 0 as one-shot or sticky */
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Pos (16UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Msk (0x1UL << TWIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Pos) /*!< Bit mask of ONESHOT0
                                                                            field.*/
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Min (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Max (0x1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Continuous (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT0_Oneshot (0x1UL)

/* ONESHOT1 @Bit 17 : Configure match filter 1 as one-shot or sticky */
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Pos (17UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Msk (0x1UL << TWIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Pos) /*!< Bit mask of ONESHOT1
                                                                            field.*/
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Min (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Max (0x1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Continuous (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT1_Oneshot (0x1UL)

/* ONESHOT2 @Bit 18 : Configure match filter 2 as one-shot or sticky */
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Pos (18UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Msk (0x1UL << TWIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Pos) /*!< Bit mask of ONESHOT2
                                                                            field.*/
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Min (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Max (0x1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Continuous (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT2_Oneshot (0x1UL)

/* ONESHOT3 @Bit 19 : Configure match filter 3 as one-shot or sticky */
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Pos (19UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Msk (0x1UL << TWIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Pos) /*!< Bit mask of ONESHOT3
                                                                            field.*/
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Min (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Max (0x1UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Continuous (0x0UL)
  #define TWIS_DMA_RX_MATCH_CONFIG_ONESHOT3_Oneshot (0x1UL)


/* TWIS_DMA_RX_MATCH_CANDIDATE: The data to look for - any match will trigger the MATCH[n] event, if enabled. */
  #define TWIS_DMA_RX_MATCH_CANDIDATE_MaxCount (4UL)
  #define TWIS_DMA_RX_MATCH_CANDIDATE_MaxIndex (3UL)
  #define TWIS_DMA_RX_MATCH_CANDIDATE_MinIndex (0UL)
  #define TWIS_DMA_RX_MATCH_CANDIDATE_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Data to look for */
  #define TWIS_DMA_RX_MATCH_CANDIDATE_DATA_Pos (0UL)
  #define TWIS_DMA_RX_MATCH_CANDIDATE_DATA_Msk (0xFFFFFFFFUL << TWIS_DMA_RX_MATCH_CANDIDATE_DATA_Pos) /*!< Bit mask of DATA
                                                                            field.*/



/* =================================================== Struct TWIS_DMA_RX ==================================================== */
/**
  * @brief RX [TWIS_DMA_RX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/
  __IM  uint32_t  CURRENTAMOUNT;
  __IOM uint32_t  LIST;
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IOM uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
  __IOM NRF_TWIS_DMA_RX_MATCH_Type MATCH;            /*!< (@ 0x00000024) Registers to control the behavior of the pattern
                                                                         matcher engine*/
} NRF_TWIS_DMA_RX_Type;

/* TWIS_DMA_RX_PTR: RAM buffer start address */
  #define TWIS_DMA_RX_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define TWIS_DMA_RX_PTR_PTR_Pos (0UL)
  #define TWIS_DMA_RX_PTR_PTR_Msk (0xFFFFFFFFUL << TWIS_DMA_RX_PTR_PTR_Pos)


/* TWIS_DMA_RX_MAXCNT: Maximum number of bytes in channel buffer */
  #define TWIS_DMA_RX_MAXCNT_ResetValue (0x00000000UL)

/* MAXCNT @Bits 0..14 : Maximum number of bytes in channel buffer */
  #define TWIS_DMA_RX_MAXCNT_MAXCNT_Pos (0UL)
  #define TWIS_DMA_RX_MAXCNT_MAXCNT_Msk (0x7FFFUL << TWIS_DMA_RX_MAXCNT_MAXCNT_Pos)
  #define TWIS_DMA_RX_MAXCNT_MAXCNT_Min (0x0001UL)
  #define TWIS_DMA_RX_MAXCNT_MAXCNT_Max (0x7FFFUL)


/* TWIS_DMA_RX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after each
                        MATCH event. */

  #define TWIS_DMA_RX_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define TWIS_DMA_RX_AMOUNT_AMOUNT_Pos (0UL)
  #define TWIS_DMA_RX_AMOUNT_AMOUNT_Msk (0x7FFFUL << TWIS_DMA_RX_AMOUNT_AMOUNT_Pos)
  #define TWIS_DMA_RX_AMOUNT_AMOUNT_Min (0x0001UL)
  #define TWIS_DMA_RX_AMOUNT_AMOUNT_Max (0x7FFFUL)


/* TWIS_DMA_RX_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define TWIS_DMA_RX_CURRENTAMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define TWIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Pos (0UL)
  #define TWIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Msk (0x7FFFUL << TWIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/
  #define TWIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Min (0x0001UL)
  #define TWIS_DMA_RX_CURRENTAMOUNT_AMOUNT_Max (0x7FFFUL)


/* TWIS_DMA_RX_LIST: EasyDMA list type */
  #define TWIS_DMA_RX_LIST_ResetValue (0x00000000UL)

/* TYPE @Bits 0..2 : List type */
  #define TWIS_DMA_RX_LIST_TYPE_Pos (0UL)
  #define TWIS_DMA_RX_LIST_TYPE_Msk (0x7UL << TWIS_DMA_RX_LIST_TYPE_Pos)
  #define TWIS_DMA_RX_LIST_TYPE_Min (0x0UL)
  #define TWIS_DMA_RX_LIST_TYPE_Max (0x1UL)
  #define TWIS_DMA_RX_LIST_TYPE_Disabled (0x0UL)
  #define TWIS_DMA_RX_LIST_TYPE_ArrayList (0x1UL)


/* TWIS_DMA_RX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define TWIS_DMA_RX_TERMINATEONBUSERROR_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : (unspecified) */
  #define TWIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos (0UL)
  #define TWIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << TWIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define TWIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL)
  #define TWIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL)
  #define TWIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL)
  #define TWIS_DMA_RX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL)


/* TWIS_DMA_RX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define TWIS_DMA_RX_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define TWIS_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define TWIS_DMA_RX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << TWIS_DMA_RX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* =================================================== Struct TWIS_DMA_TX ==================================================== */
/**
  * @brief TX [TWIS_DMA_TX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;
  __IOM uint32_t  MAXCNT;
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/
  __IM  uint32_t  CURRENTAMOUNT;
  __IOM uint32_t  LIST;
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IOM uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
} NRF_TWIS_DMA_TX_Type;

/* TWIS_DMA_TX_PTR: RAM buffer start address */
  #define TWIS_DMA_TX_PTR_ResetValue (0x00000000UL)

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define TWIS_DMA_TX_PTR_PTR_Pos (0UL)
  #define TWIS_DMA_TX_PTR_PTR_Msk (0xFFFFFFFFUL << TWIS_DMA_TX_PTR_PTR_Pos)


/* TWIS_DMA_TX_MAXCNT: Maximum number of bytes in channel buffer */
  #define TWIS_DMA_TX_MAXCNT_ResetValue (0x00000000UL)

/* MAXCNT @Bits 0..14 : Maximum number of bytes in channel buffer */
  #define TWIS_DMA_TX_MAXCNT_MAXCNT_Pos (0UL)
  #define TWIS_DMA_TX_MAXCNT_MAXCNT_Msk (0x7FFFUL << TWIS_DMA_TX_MAXCNT_MAXCNT_Pos)
  #define TWIS_DMA_TX_MAXCNT_MAXCNT_Min (0x0001UL)
  #define TWIS_DMA_TX_MAXCNT_MAXCNT_Max (0x7FFFUL)


/* TWIS_DMA_TX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after each
                        MATCH event. */

