pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define TWIS_DMA_TX_AMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define TWIS_DMA_TX_AMOUNT_AMOUNT_Pos (0UL)
  #define TWIS_DMA_TX_AMOUNT_AMOUNT_Msk (0x7FFFUL << TWIS_DMA_TX_AMOUNT_AMOUNT_Pos)
  #define TWIS_DMA_TX_AMOUNT_AMOUNT_Min (0x0001UL)
  #define TWIS_DMA_TX_AMOUNT_AMOUNT_Max (0x7FFFUL)


/* TWIS_DMA_TX_CURRENTAMOUNT: Number of bytes transferred in the current transaction */
  #define TWIS_DMA_TX_CURRENTAMOUNT_ResetValue (0x00000000UL)

/* AMOUNT @Bits 0..14 : Number of bytes transferred in the current transaction. Continuously updated. */
  #define TWIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Pos (0UL)
  #define TWIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Msk (0x7FFFUL << TWIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/
  #define TWIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Min (0x0001UL)
  #define TWIS_DMA_TX_CURRENTAMOUNT_AMOUNT_Max (0x7FFFUL)


/* TWIS_DMA_TX_LIST: EasyDMA list type */
  #define TWIS_DMA_TX_LIST_ResetValue (0x00000000UL)

/* TYPE @Bits 0..2 : List type */
  #define TWIS_DMA_TX_LIST_TYPE_Pos (0UL)
  #define TWIS_DMA_TX_LIST_TYPE_Msk (0x7UL << TWIS_DMA_TX_LIST_TYPE_Pos)
  #define TWIS_DMA_TX_LIST_TYPE_Min (0x0UL)
  #define TWIS_DMA_TX_LIST_TYPE_Max (0x1UL)
  #define TWIS_DMA_TX_LIST_TYPE_Disabled (0x0UL)
  #define TWIS_DMA_TX_LIST_TYPE_ArrayList (0x1UL)


/* TWIS_DMA_TX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ResetValue (0x00000000UL)

/* ENABLE @Bit 0 : (unspecified) */
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos (0UL)
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL)
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL)
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL)
  #define TWIS_DMA_TX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL)


/* TWIS_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define TWIS_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define TWIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define TWIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << TWIS_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ===================================================== Struct TWIS_DMA ===================================================== */
/**
  * @brief DMA [TWIS_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_TWIS_DMA_RX_Type RX;
  __IOM NRF_TWIS_DMA_TX_Type TX;
} NRF_TWIS_DMA_Type;

/* ======================================================= Struct TWIS ======================================================= */
/**
  * @brief I2C compatible Two-Wire Slave Interface with EasyDMA
  */
  typedef struct {
    __IM uint32_t RESERVED;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED1;
    __OM uint32_t TASKS_SUSPEND;
    __OM uint32_t TASKS_RESUME;
    __IM uint32_t RESERVED2[3];
    __OM uint32_t TASKS_PREPARERX;
    __OM uint32_t TASKS_PREPARETX;
    __IM uint32_t RESERVED3[2];
    __OM NRF_TWIS_TASKS_DMA_Type TASKS_DMA;
    __IM uint32_t RESERVED4[13];
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED5;
    __IOM uint32_t SUBSCRIBE_SUSPEND;
    __IOM uint32_t SUBSCRIBE_RESUME;
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t SUBSCRIBE_PREPARERX;
    __IOM uint32_t SUBSCRIBE_PREPARETX;
    __IM uint32_t RESERVED7[2];
    __IOM NRF_TWIS_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA;
    __IM uint32_t RESERVED8[13];
    __IOM uint32_t EVENTS_STOPPED;
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t EVENTS_ERROR;
    __IM uint32_t RESERVED10[9];
    __IOM uint32_t EVENTS_WRITE;
    __IOM uint32_t EVENTS_READ;
    __IM uint32_t RESERVED11[2];
    __IOM NRF_TWIS_EVENTS_DMA_Type EVENTS_DMA;
    __IM uint32_t RESERVED12[4];
    __IOM uint32_t PUBLISH_STOPPED;
    __IM uint32_t RESERVED13[3];
    __IOM uint32_t PUBLISH_ERROR;
    __IM uint32_t RESERVED14[9];
    __IOM uint32_t PUBLISH_WRITE;
    __IOM uint32_t PUBLISH_READ;
    __IM uint32_t RESERVED15[2];
    __IOM NRF_TWIS_PUBLISH_DMA_Type PUBLISH_DMA;
    __IM uint32_t RESERVED16[3];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED17[63];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED18[113];
    __IOM uint32_t ERRORSRC;
    __IM uint32_t MATCH;
    __IM uint32_t RESERVED19[10];
    __IOM uint32_t ENABLE;
    __IM uint32_t RESERVED20[33];
    __IOM uint32_t ADDRESS[2];
    __IM uint32_t RESERVED21;
    __IOM uint32_t CONFIG;
    __IM uint32_t RESERVED22[10];
    __IOM uint32_t ORC;                              /*!< (@ 0x000005C0) Over-read character. Character sent out in case of an
                                                                         over-read of the transmit buffer.*/
    __IM uint32_t RESERVED23[15];
    __IOM NRF_TWIS_PSEL_Type PSEL;
    __IM uint32_t RESERVED24[62];
    __IOM NRF_TWIS_DMA_Type DMA;
  } NRF_TWIS_Type;

/* TWIS_TASKS_STOP: Stop TWI transaction */
  #define TWIS_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop TWI transaction */
  #define TWIS_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define TWIS_TASKS_STOP_TASKS_STOP_Msk (0x1UL << TWIS_TASKS_STOP_TASKS_STOP_Pos)
  #define TWIS_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define TWIS_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define TWIS_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* TWIS_TASKS_SUSPEND: Suspend TWI transaction */
  #define TWIS_TASKS_SUSPEND_ResetValue (0x00000000UL)

/* TASKS_SUSPEND @Bit 0 : Suspend TWI transaction */
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Pos (0UL)
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Msk (0x1UL << TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Pos) /*!< Bit mask of TASKS_SUSPEND
                                                                            field.*/
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Min (0x1UL)
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Max (0x1UL)
  #define TWIS_TASKS_SUSPEND_TASKS_SUSPEND_Trigger (0x1UL)


