pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TWIS_TASKS_RESUME: Resume TWI transaction */
  #define TWIS_TASKS_RESUME_ResetValue (0x00000000UL)

/* TASKS_RESUME @Bit 0 : Resume TWI transaction */
  #define TWIS_TASKS_RESUME_TASKS_RESUME_Pos (0UL)
  #define TWIS_TASKS_RESUME_TASKS_RESUME_Msk (0x1UL << TWIS_TASKS_RESUME_TASKS_RESUME_Pos)
  #define TWIS_TASKS_RESUME_TASKS_RESUME_Min (0x1UL)
  #define TWIS_TASKS_RESUME_TASKS_RESUME_Max (0x1UL)
  #define TWIS_TASKS_RESUME_TASKS_RESUME_Trigger (0x1UL)


/* TWIS_TASKS_PREPARERX: Prepare the TWI slave to respond to a write command */
  #define TWIS_TASKS_PREPARERX_ResetValue (0x00000000UL)

/* TASKS_PREPARERX @Bit 0 : Prepare the TWI slave to respond to a write command */
  #define TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Pos (0UL)
  #define TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Msk (0x1UL << TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Pos) /*!< Bit mask of
                                                                            TASKS_PREPARERX field.*/
  #define TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Min (0x1UL)
  #define TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Max (0x1UL)
  #define TWIS_TASKS_PREPARERX_TASKS_PREPARERX_Trigger (0x1UL)


/* TWIS_TASKS_PREPARETX: Prepare the TWI slave to respond to a read command */
  #define TWIS_TASKS_PREPARETX_ResetValue (0x00000000UL)

/* TASKS_PREPARETX @Bit 0 : Prepare the TWI slave to respond to a read command */
  #define TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Pos (0UL)
  #define TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Msk (0x1UL << TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Pos) /*!< Bit mask of
                                                                            TASKS_PREPARETX field.*/
  #define TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Min (0x1UL)
  #define TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Max (0x1UL)
  #define TWIS_TASKS_PREPARETX_TASKS_PREPARETX_Trigger (0x1UL)


/* TWIS_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define TWIS_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define TWIS_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define TWIS_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << TWIS_SUBSCRIBE_STOP_CHIDX_Pos)
  #define TWIS_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define TWIS_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define TWIS_SUBSCRIBE_STOP_EN_Msk (0x1UL << TWIS_SUBSCRIBE_STOP_EN_Pos)
  #define TWIS_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define TWIS_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define TWIS_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define TWIS_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* TWIS_SUBSCRIBE_SUSPEND: Subscribe configuration for task SUSPEND */
  #define TWIS_SUBSCRIBE_SUSPEND_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task SUSPEND will subscribe to */
  #define TWIS_SUBSCRIBE_SUSPEND_CHIDX_Pos (0UL)
  #define TWIS_SUBSCRIBE_SUSPEND_CHIDX_Msk (0xFFUL << TWIS_SUBSCRIBE_SUSPEND_CHIDX_Pos)
  #define TWIS_SUBSCRIBE_SUSPEND_CHIDX_Min (0x00UL)
  #define TWIS_SUBSCRIBE_SUSPEND_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_SUBSCRIBE_SUSPEND_EN_Pos (31UL)
  #define TWIS_SUBSCRIBE_SUSPEND_EN_Msk (0x1UL << TWIS_SUBSCRIBE_SUSPEND_EN_Pos)
  #define TWIS_SUBSCRIBE_SUSPEND_EN_Min (0x0UL)
  #define TWIS_SUBSCRIBE_SUSPEND_EN_Max (0x1UL)
  #define TWIS_SUBSCRIBE_SUSPEND_EN_Disabled (0x0UL)
  #define TWIS_SUBSCRIBE_SUSPEND_EN_Enabled (0x1UL)


/* TWIS_SUBSCRIBE_RESUME: Subscribe configuration for task RESUME */
  #define TWIS_SUBSCRIBE_RESUME_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task RESUME will subscribe to */
  #define TWIS_SUBSCRIBE_RESUME_CHIDX_Pos (0UL)
  #define TWIS_SUBSCRIBE_RESUME_CHIDX_Msk (0xFFUL << TWIS_SUBSCRIBE_RESUME_CHIDX_Pos)
  #define TWIS_SUBSCRIBE_RESUME_CHIDX_Min (0x00UL)
  #define TWIS_SUBSCRIBE_RESUME_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_SUBSCRIBE_RESUME_EN_Pos (31UL)
  #define TWIS_SUBSCRIBE_RESUME_EN_Msk (0x1UL << TWIS_SUBSCRIBE_RESUME_EN_Pos)
  #define TWIS_SUBSCRIBE_RESUME_EN_Min (0x0UL)
  #define TWIS_SUBSCRIBE_RESUME_EN_Max (0x1UL)
  #define TWIS_SUBSCRIBE_RESUME_EN_Disabled (0x0UL)
  #define TWIS_SUBSCRIBE_RESUME_EN_Enabled (0x1UL)


/* TWIS_SUBSCRIBE_PREPARERX: Subscribe configuration for task PREPARERX */
  #define TWIS_SUBSCRIBE_PREPARERX_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task PREPARERX will subscribe to */
  #define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Pos (0UL)
  #define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Msk (0xFFUL << TWIS_SUBSCRIBE_PREPARERX_CHIDX_Pos)
  #define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Min (0x00UL)
  #define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Pos (31UL)
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Msk (0x1UL << TWIS_SUBSCRIBE_PREPARERX_EN_Pos)
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Min (0x0UL)
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Max (0x1UL)
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Disabled (0x0UL)
  #define TWIS_SUBSCRIBE_PREPARERX_EN_Enabled (0x1UL)


/* TWIS_SUBSCRIBE_PREPARETX: Subscribe configuration for task PREPARETX */
  #define TWIS_SUBSCRIBE_PREPARETX_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task PREPARETX will subscribe to */
  #define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Pos (0UL)
  #define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Msk (0xFFUL << TWIS_SUBSCRIBE_PREPARETX_CHIDX_Pos)
  #define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Min (0x00UL)
  #define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Pos (31UL)
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Msk (0x1UL << TWIS_SUBSCRIBE_PREPARETX_EN_Pos)
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Min (0x0UL)
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Max (0x1UL)
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Disabled (0x0UL)
  #define TWIS_SUBSCRIBE_PREPARETX_EN_Enabled (0x1UL)


/* TWIS_EVENTS_STOPPED: TWI stopped */
  #define TWIS_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : TWI stopped */
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* TWIS_EVENTS_ERROR: TWI error */
  #define TWIS_EVENTS_ERROR_ResetValue (0x00000000UL)

/* EVENTS_ERROR @Bit 0 : TWI error */
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << TWIS_EVENTS_ERROR_EVENTS_ERROR_Pos)
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL)
  #define TWIS_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL)


/* TWIS_EVENTS_WRITE: Write command received */
  #define TWIS_EVENTS_WRITE_ResetValue (0x00000000UL)

/* EVENTS_WRITE @Bit 0 : Write command received */
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos (0UL)
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Msk (0x1UL << TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos)
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Min (0x0UL)
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Max (0x1UL)
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_NotGenerated (0x0UL)
  #define TWIS_EVENTS_WRITE_EVENTS_WRITE_Generated (0x1UL)


/* TWIS_EVENTS_READ: Read command received */
  #define TWIS_EVENTS_READ_ResetValue (0x00000000UL)

/* EVENTS_READ @Bit 0 : Read command received */
  #define TWIS_EVENTS_READ_EVENTS_READ_Pos (0UL)
  #define TWIS_EVENTS_READ_EVENTS_READ_Msk (0x1UL << TWIS_EVENTS_READ_EVENTS_READ_Pos)
  #define TWIS_EVENTS_READ_EVENTS_READ_Min (0x0UL)
  #define TWIS_EVENTS_READ_EVENTS_READ_Max (0x1UL)
  #define TWIS_EVENTS_READ_EVENTS_READ_NotGenerated (0x0UL)
  #define TWIS_EVENTS_READ_EVENTS_READ_Generated (0x1UL)


/* TWIS_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define TWIS_PUBLISH_STOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define TWIS_PUBLISH_STOPPED_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_STOPPED_CHIDX_Pos)
  #define TWIS_PUBLISH_STOPPED_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_STOPPED_EN_Pos (31UL)
  #define TWIS_PUBLISH_STOPPED_EN_Msk (0x1UL << TWIS_PUBLISH_STOPPED_EN_Pos)
  #define TWIS_PUBLISH_STOPPED_EN_Min (0x0UL)
  #define TWIS_PUBLISH_STOPPED_EN_Max (0x1UL)
  #define TWIS_PUBLISH_STOPPED_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_STOPPED_EN_Enabled (0x1UL)


/* TWIS_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define TWIS_PUBLISH_ERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define TWIS_PUBLISH_ERROR_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_ERROR_CHIDX_Pos)
  #define TWIS_PUBLISH_ERROR_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_ERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_ERROR_EN_Pos (31UL)
  #define TWIS_PUBLISH_ERROR_EN_Msk (0x1UL << TWIS_PUBLISH_ERROR_EN_Pos)
  #define TWIS_PUBLISH_ERROR_EN_Min (0x0UL)
  #define TWIS_PUBLISH_ERROR_EN_Max (0x1UL)
  #define TWIS_PUBLISH_ERROR_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_ERROR_EN_Enabled (0x1UL)


/* TWIS_PUBLISH_WRITE: Publish configuration for event WRITE */
  #define TWIS_PUBLISH_WRITE_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event WRITE will publish to */
  #define TWIS_PUBLISH_WRITE_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_WRITE_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_WRITE_CHIDX_Pos)
  #define TWIS_PUBLISH_WRITE_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_WRITE_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_WRITE_EN_Pos (31UL)
  #define TWIS_PUBLISH_WRITE_EN_Msk (0x1UL << TWIS_PUBLISH_WRITE_EN_Pos)
  #define TWIS_PUBLISH_WRITE_EN_Min (0x0UL)
  #define TWIS_PUBLISH_WRITE_EN_Max (0x1UL)
  #define TWIS_PUBLISH_WRITE_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_WRITE_EN_Enabled (0x1UL)


/* TWIS_PUBLISH_READ: Publish configuration for event READ */
  #define TWIS_PUBLISH_READ_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READ will publish to */
  #define TWIS_PUBLISH_READ_CHIDX_Pos (0UL)
  #define TWIS_PUBLISH_READ_CHIDX_Msk (0xFFUL << TWIS_PUBLISH_READ_CHIDX_Pos)
  #define TWIS_PUBLISH_READ_CHIDX_Min (0x00UL)
  #define TWIS_PUBLISH_READ_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define TWIS_PUBLISH_READ_EN_Pos (31UL)
  #define TWIS_PUBLISH_READ_EN_Msk (0x1UL << TWIS_PUBLISH_READ_EN_Pos)
  #define TWIS_PUBLISH_READ_EN_Min (0x0UL)
  #define TWIS_PUBLISH_READ_EN_Max (0x1UL)
  #define TWIS_PUBLISH_READ_EN_Disabled (0x0UL)
  #define TWIS_PUBLISH_READ_EN_Enabled (0x1UL)


/* TWIS_SHORTS: Shortcuts between local events and tasks */
  #define TWIS_SHORTS_ResetValue (0x00000000UL)

/* WRITE_SUSPEND @Bit 13 : Shortcut between event WRITE and task SUSPEND */
  #define TWIS_SHORTS_WRITE_SUSPEND_Pos (13UL)
  #define TWIS_SHORTS_WRITE_SUSPEND_Msk (0x1UL << TWIS_SHORTS_WRITE_SUSPEND_Pos)
  #define TWIS_SHORTS_WRITE_SUSPEND_Min (0x0UL)
  #define TWIS_SHORTS_WRITE_SUSPEND_Max (0x1UL)
  #define TWIS_SHORTS_WRITE_SUSPEND_Disabled (0x0UL)
  #define TWIS_SHORTS_WRITE_SUSPEND_Enabled (0x1UL)

/* READ_SUSPEND @Bit 14 : Shortcut between event READ and task SUSPEND */
  #define TWIS_SHORTS_READ_SUSPEND_Pos (14UL)
  #define TWIS_SHORTS_READ_SUSPEND_Msk (0x1UL << TWIS_SHORTS_READ_SUSPEND_Pos)
  #define TWIS_SHORTS_READ_SUSPEND_Min (0x0UL)
  #define TWIS_SHORTS_READ_SUSPEND_Max (0x1UL)
  #define TWIS_SHORTS_READ_SUSPEND_Disabled (0x0UL)
  #define TWIS_SHORTS_READ_SUSPEND_Enabled (0x1UL)

/* DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 @Bit 21 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[1] Allows
                                               daisy-chaining match events. */

  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos (21UL)
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1
                                                                            field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1 field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Disabled (0x0UL)
  #define TWIS_SHORTS_DMA_RX_MATCH0_DMA_RX_ENABLEMATCH1_Enabled (0x1UL)

/* DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 @Bit 22 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[2] Allows
                                               daisy-chaining match events. */

  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos (22UL)
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2
                                                                            field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2 field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Disabled (0x0UL)
  #define TWIS_SHORTS_DMA_RX_MATCH1_DMA_RX_ENABLEMATCH2_Enabled (0x1UL)

/* DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3 @Bit 23 : Shortcut between event DMA.RX.MATCH[n] and task DMA.RX.ENABLEMATCH[3] Allows
                                               daisy-chaining match events. */

  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Pos (23UL)
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Msk (0x1UL << TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Pos) /*!<
                                                                            Bit mask of DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3
                                                                            field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Min (0x0UL) /*!< Min enumerator value of
                                                                         DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3 field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Max (0x1UL) /*!< Max enumerator value of
                                                                         DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3 field.*/
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Disabled (0x0UL)
  #define TWIS_SHORTS_DMA_RX_MATCH2_DMA_RX_ENABLEMATCH3_Enabled (0x1UL)

