pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ERROR @Bit 5 : Enable or disable interrupt for event ERROR */
  #define TWIS_INTEN_ERROR_Pos (5UL)
  #define TWIS_INTEN_ERROR_Msk (0x1UL << TWIS_INTEN_ERROR_Pos)
  #define TWIS_INTEN_ERROR_Min (0x0UL)
  #define TWIS_INTEN_ERROR_Max (0x1UL)
  #define TWIS_INTEN_ERROR_Disabled (0x0UL)
  #define TWIS_INTEN_ERROR_Enabled (0x1UL)

/* WRITE @Bit 15 : Enable or disable interrupt for event WRITE */
  #define TWIS_INTEN_WRITE_Pos (15UL)
  #define TWIS_INTEN_WRITE_Msk (0x1UL << TWIS_INTEN_WRITE_Pos)
  #define TWIS_INTEN_WRITE_Min (0x0UL)
  #define TWIS_INTEN_WRITE_Max (0x1UL)
  #define TWIS_INTEN_WRITE_Disabled (0x0UL)
  #define TWIS_INTEN_WRITE_Enabled (0x1UL)

/* READ @Bit 16 : Enable or disable interrupt for event READ */
  #define TWIS_INTEN_READ_Pos (16UL)
  #define TWIS_INTEN_READ_Msk (0x1UL << TWIS_INTEN_READ_Pos)
  #define TWIS_INTEN_READ_Min (0x0UL)
  #define TWIS_INTEN_READ_Max (0x1UL)
  #define TWIS_INTEN_READ_Disabled (0x0UL)
  #define TWIS_INTEN_READ_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Enable or disable interrupt for event DMARXEND */
  #define TWIS_INTEN_DMARXEND_Pos (19UL)
  #define TWIS_INTEN_DMARXEND_Msk (0x1UL << TWIS_INTEN_DMARXEND_Pos)
  #define TWIS_INTEN_DMARXEND_Min (0x0UL)
  #define TWIS_INTEN_DMARXEND_Max (0x1UL)
  #define TWIS_INTEN_DMARXEND_Disabled (0x0UL)
  #define TWIS_INTEN_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Enable or disable interrupt for event DMARXREADY */
  #define TWIS_INTEN_DMARXREADY_Pos (20UL)
  #define TWIS_INTEN_DMARXREADY_Msk (0x1UL << TWIS_INTEN_DMARXREADY_Pos)
  #define TWIS_INTEN_DMARXREADY_Min (0x0UL)
  #define TWIS_INTEN_DMARXREADY_Max (0x1UL)
  #define TWIS_INTEN_DMARXREADY_Disabled (0x0UL)
  #define TWIS_INTEN_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Enable or disable interrupt for event DMARXBUSERROR */
  #define TWIS_INTEN_DMARXBUSERROR_Pos (21UL)
  #define TWIS_INTEN_DMARXBUSERROR_Msk (0x1UL << TWIS_INTEN_DMARXBUSERROR_Pos)
  #define TWIS_INTEN_DMARXBUSERROR_Min (0x0UL)
  #define TWIS_INTEN_DMARXBUSERROR_Max (0x1UL)
  #define TWIS_INTEN_DMARXBUSERROR_Disabled (0x0UL)
  #define TWIS_INTEN_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Enable or disable interrupt for event DMARXMATCH[0] */
  #define TWIS_INTEN_DMARXMATCH0_Pos (22UL)
  #define TWIS_INTEN_DMARXMATCH0_Msk (0x1UL << TWIS_INTEN_DMARXMATCH0_Pos)
  #define TWIS_INTEN_DMARXMATCH0_Min (0x0UL)
  #define TWIS_INTEN_DMARXMATCH0_Max (0x1UL)
  #define TWIS_INTEN_DMARXMATCH0_Disabled (0x0UL)
  #define TWIS_INTEN_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Enable or disable interrupt for event DMARXMATCH[1] */
  #define TWIS_INTEN_DMARXMATCH1_Pos (23UL)
  #define TWIS_INTEN_DMARXMATCH1_Msk (0x1UL << TWIS_INTEN_DMARXMATCH1_Pos)
  #define TWIS_INTEN_DMARXMATCH1_Min (0x0UL)
  #define TWIS_INTEN_DMARXMATCH1_Max (0x1UL)
  #define TWIS_INTEN_DMARXMATCH1_Disabled (0x0UL)
  #define TWIS_INTEN_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Enable or disable interrupt for event DMARXMATCH[2] */
  #define TWIS_INTEN_DMARXMATCH2_Pos (24UL)
  #define TWIS_INTEN_DMARXMATCH2_Msk (0x1UL << TWIS_INTEN_DMARXMATCH2_Pos)
  #define TWIS_INTEN_DMARXMATCH2_Min (0x0UL)
  #define TWIS_INTEN_DMARXMATCH2_Max (0x1UL)
  #define TWIS_INTEN_DMARXMATCH2_Disabled (0x0UL)
  #define TWIS_INTEN_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Enable or disable interrupt for event DMARXMATCH[3] */
  #define TWIS_INTEN_DMARXMATCH3_Pos (25UL)
  #define TWIS_INTEN_DMARXMATCH3_Msk (0x1UL << TWIS_INTEN_DMARXMATCH3_Pos)
  #define TWIS_INTEN_DMARXMATCH3_Min (0x0UL)
  #define TWIS_INTEN_DMARXMATCH3_Max (0x1UL)
  #define TWIS_INTEN_DMARXMATCH3_Disabled (0x0UL)
  #define TWIS_INTEN_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Enable or disable interrupt for event DMATXEND */
  #define TWIS_INTEN_DMATXEND_Pos (26UL)
  #define TWIS_INTEN_DMATXEND_Msk (0x1UL << TWIS_INTEN_DMATXEND_Pos)
  #define TWIS_INTEN_DMATXEND_Min (0x0UL)
  #define TWIS_INTEN_DMATXEND_Max (0x1UL)
  #define TWIS_INTEN_DMATXEND_Disabled (0x0UL)
  #define TWIS_INTEN_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Enable or disable interrupt for event DMATXREADY */
  #define TWIS_INTEN_DMATXREADY_Pos (27UL)
  #define TWIS_INTEN_DMATXREADY_Msk (0x1UL << TWIS_INTEN_DMATXREADY_Pos)
  #define TWIS_INTEN_DMATXREADY_Min (0x0UL)
  #define TWIS_INTEN_DMATXREADY_Max (0x1UL)
  #define TWIS_INTEN_DMATXREADY_Disabled (0x0UL)
  #define TWIS_INTEN_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Enable or disable interrupt for event DMATXBUSERROR */
  #define TWIS_INTEN_DMATXBUSERROR_Pos (28UL)
  #define TWIS_INTEN_DMATXBUSERROR_Msk (0x1UL << TWIS_INTEN_DMATXBUSERROR_Pos)
  #define TWIS_INTEN_DMATXBUSERROR_Min (0x0UL)
  #define TWIS_INTEN_DMATXBUSERROR_Max (0x1UL)
  #define TWIS_INTEN_DMATXBUSERROR_Disabled (0x0UL)
  #define TWIS_INTEN_DMATXBUSERROR_Enabled (0x1UL)


/* TWIS_INTENSET: Enable interrupt */
  #define TWIS_INTENSET_ResetValue (0x00000000UL)

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define TWIS_INTENSET_STOPPED_Pos (1UL)
  #define TWIS_INTENSET_STOPPED_Msk (0x1UL << TWIS_INTENSET_STOPPED_Pos)
  #define TWIS_INTENSET_STOPPED_Min (0x0UL)
  #define TWIS_INTENSET_STOPPED_Max (0x1UL)
  #define TWIS_INTENSET_STOPPED_Set (0x1UL)
  #define TWIS_INTENSET_STOPPED_Disabled (0x0UL)
  #define TWIS_INTENSET_STOPPED_Enabled (0x1UL)

/* ERROR @Bit 5 : Write '1' to enable interrupt for event ERROR */
  #define TWIS_INTENSET_ERROR_Pos (5UL)
  #define TWIS_INTENSET_ERROR_Msk (0x1UL << TWIS_INTENSET_ERROR_Pos)
  #define TWIS_INTENSET_ERROR_Min (0x0UL)
  #define TWIS_INTENSET_ERROR_Max (0x1UL)
  #define TWIS_INTENSET_ERROR_Set (0x1UL)
  #define TWIS_INTENSET_ERROR_Disabled (0x0UL)
  #define TWIS_INTENSET_ERROR_Enabled (0x1UL)

/* WRITE @Bit 15 : Write '1' to enable interrupt for event WRITE */
  #define TWIS_INTENSET_WRITE_Pos (15UL)
  #define TWIS_INTENSET_WRITE_Msk (0x1UL << TWIS_INTENSET_WRITE_Pos)
  #define TWIS_INTENSET_WRITE_Min (0x0UL)
  #define TWIS_INTENSET_WRITE_Max (0x1UL)
  #define TWIS_INTENSET_WRITE_Set (0x1UL)
  #define TWIS_INTENSET_WRITE_Disabled (0x0UL)
  #define TWIS_INTENSET_WRITE_Enabled (0x1UL)

