pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* READ @Bit 16 : Write '1' to enable interrupt for event READ */
  #define TWIS_INTENSET_READ_Pos (16UL)
  #define TWIS_INTENSET_READ_Msk (0x1UL << TWIS_INTENSET_READ_Pos)
  #define TWIS_INTENSET_READ_Min (0x0UL)
  #define TWIS_INTENSET_READ_Max (0x1UL)
  #define TWIS_INTENSET_READ_Set (0x1UL)
  #define TWIS_INTENSET_READ_Disabled (0x0UL)
  #define TWIS_INTENSET_READ_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Write '1' to enable interrupt for event DMARXEND */
  #define TWIS_INTENSET_DMARXEND_Pos (19UL)
  #define TWIS_INTENSET_DMARXEND_Msk (0x1UL << TWIS_INTENSET_DMARXEND_Pos)
  #define TWIS_INTENSET_DMARXEND_Min (0x0UL)
  #define TWIS_INTENSET_DMARXEND_Max (0x1UL)
  #define TWIS_INTENSET_DMARXEND_Set (0x1UL)
  #define TWIS_INTENSET_DMARXEND_Disabled (0x0UL)
  #define TWIS_INTENSET_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Write '1' to enable interrupt for event DMARXREADY */
  #define TWIS_INTENSET_DMARXREADY_Pos (20UL)
  #define TWIS_INTENSET_DMARXREADY_Msk (0x1UL << TWIS_INTENSET_DMARXREADY_Pos)
  #define TWIS_INTENSET_DMARXREADY_Min (0x0UL)
  #define TWIS_INTENSET_DMARXREADY_Max (0x1UL)
  #define TWIS_INTENSET_DMARXREADY_Set (0x1UL)
  #define TWIS_INTENSET_DMARXREADY_Disabled (0x0UL)
  #define TWIS_INTENSET_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Write '1' to enable interrupt for event DMARXBUSERROR */
  #define TWIS_INTENSET_DMARXBUSERROR_Pos (21UL)
  #define TWIS_INTENSET_DMARXBUSERROR_Msk (0x1UL << TWIS_INTENSET_DMARXBUSERROR_Pos)
  #define TWIS_INTENSET_DMARXBUSERROR_Min (0x0UL)
  #define TWIS_INTENSET_DMARXBUSERROR_Max (0x1UL)
  #define TWIS_INTENSET_DMARXBUSERROR_Set (0x1UL)
  #define TWIS_INTENSET_DMARXBUSERROR_Disabled (0x0UL)
  #define TWIS_INTENSET_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Write '1' to enable interrupt for event DMARXMATCH[0] */
  #define TWIS_INTENSET_DMARXMATCH0_Pos (22UL)
  #define TWIS_INTENSET_DMARXMATCH0_Msk (0x1UL << TWIS_INTENSET_DMARXMATCH0_Pos)
  #define TWIS_INTENSET_DMARXMATCH0_Min (0x0UL)
  #define TWIS_INTENSET_DMARXMATCH0_Max (0x1UL)
  #define TWIS_INTENSET_DMARXMATCH0_Set (0x1UL)
  #define TWIS_INTENSET_DMARXMATCH0_Disabled (0x0UL)
  #define TWIS_INTENSET_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Write '1' to enable interrupt for event DMARXMATCH[1] */
  #define TWIS_INTENSET_DMARXMATCH1_Pos (23UL)
  #define TWIS_INTENSET_DMARXMATCH1_Msk (0x1UL << TWIS_INTENSET_DMARXMATCH1_Pos)
  #define TWIS_INTENSET_DMARXMATCH1_Min (0x0UL)
  #define TWIS_INTENSET_DMARXMATCH1_Max (0x1UL)
  #define TWIS_INTENSET_DMARXMATCH1_Set (0x1UL)
  #define TWIS_INTENSET_DMARXMATCH1_Disabled (0x0UL)
  #define TWIS_INTENSET_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Write '1' to enable interrupt for event DMARXMATCH[2] */
  #define TWIS_INTENSET_DMARXMATCH2_Pos (24UL)
  #define TWIS_INTENSET_DMARXMATCH2_Msk (0x1UL << TWIS_INTENSET_DMARXMATCH2_Pos)
  #define TWIS_INTENSET_DMARXMATCH2_Min (0x0UL)
  #define TWIS_INTENSET_DMARXMATCH2_Max (0x1UL)
  #define TWIS_INTENSET_DMARXMATCH2_Set (0x1UL)
  #define TWIS_INTENSET_DMARXMATCH2_Disabled (0x0UL)
  #define TWIS_INTENSET_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Write '1' to enable interrupt for event DMARXMATCH[3] */
  #define TWIS_INTENSET_DMARXMATCH3_Pos (25UL)
  #define TWIS_INTENSET_DMARXMATCH3_Msk (0x1UL << TWIS_INTENSET_DMARXMATCH3_Pos)
  #define TWIS_INTENSET_DMARXMATCH3_Min (0x0UL)
  #define TWIS_INTENSET_DMARXMATCH3_Max (0x1UL)
  #define TWIS_INTENSET_DMARXMATCH3_Set (0x1UL)
  #define TWIS_INTENSET_DMARXMATCH3_Disabled (0x0UL)
  #define TWIS_INTENSET_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Write '1' to enable interrupt for event DMATXEND */
  #define TWIS_INTENSET_DMATXEND_Pos (26UL)
  #define TWIS_INTENSET_DMATXEND_Msk (0x1UL << TWIS_INTENSET_DMATXEND_Pos)
  #define TWIS_INTENSET_DMATXEND_Min (0x0UL)
  #define TWIS_INTENSET_DMATXEND_Max (0x1UL)
  #define TWIS_INTENSET_DMATXEND_Set (0x1UL)
  #define TWIS_INTENSET_DMATXEND_Disabled (0x0UL)
  #define TWIS_INTENSET_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Write '1' to enable interrupt for event DMATXREADY */
  #define TWIS_INTENSET_DMATXREADY_Pos (27UL)
  #define TWIS_INTENSET_DMATXREADY_Msk (0x1UL << TWIS_INTENSET_DMATXREADY_Pos)
  #define TWIS_INTENSET_DMATXREADY_Min (0x0UL)
  #define TWIS_INTENSET_DMATXREADY_Max (0x1UL)
  #define TWIS_INTENSET_DMATXREADY_Set (0x1UL)
  #define TWIS_INTENSET_DMATXREADY_Disabled (0x0UL)
  #define TWIS_INTENSET_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Write '1' to enable interrupt for event DMATXBUSERROR */
  #define TWIS_INTENSET_DMATXBUSERROR_Pos (28UL)
  #define TWIS_INTENSET_DMATXBUSERROR_Msk (0x1UL << TWIS_INTENSET_DMATXBUSERROR_Pos)
  #define TWIS_INTENSET_DMATXBUSERROR_Min (0x0UL)
  #define TWIS_INTENSET_DMATXBUSERROR_Max (0x1UL)
  #define TWIS_INTENSET_DMATXBUSERROR_Set (0x1UL)
  #define TWIS_INTENSET_DMATXBUSERROR_Disabled (0x0UL)
  #define TWIS_INTENSET_DMATXBUSERROR_Enabled (0x1UL)


/* TWIS_INTENCLR: Disable interrupt */
  #define TWIS_INTENCLR_ResetValue (0x00000000UL)

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define TWIS_INTENCLR_STOPPED_Pos (1UL)
  #define TWIS_INTENCLR_STOPPED_Msk (0x1UL << TWIS_INTENCLR_STOPPED_Pos)
  #define TWIS_INTENCLR_STOPPED_Min (0x0UL)
  #define TWIS_INTENCLR_STOPPED_Max (0x1UL)
  #define TWIS_INTENCLR_STOPPED_Clear (0x1UL)
  #define TWIS_INTENCLR_STOPPED_Disabled (0x0UL)
  #define TWIS_INTENCLR_STOPPED_Enabled (0x1UL)

/* ERROR @Bit 5 : Write '1' to disable interrupt for event ERROR */
  #define TWIS_INTENCLR_ERROR_Pos (5UL)
  #define TWIS_INTENCLR_ERROR_Msk (0x1UL << TWIS_INTENCLR_ERROR_Pos)
  #define TWIS_INTENCLR_ERROR_Min (0x0UL)
  #define TWIS_INTENCLR_ERROR_Max (0x1UL)
  #define TWIS_INTENCLR_ERROR_Clear (0x1UL)
  #define TWIS_INTENCLR_ERROR_Disabled (0x0UL)
  #define TWIS_INTENCLR_ERROR_Enabled (0x1UL)

/* WRITE @Bit 15 : Write '1' to disable interrupt for event WRITE */
  #define TWIS_INTENCLR_WRITE_Pos (15UL)
  #define TWIS_INTENCLR_WRITE_Msk (0x1UL << TWIS_INTENCLR_WRITE_Pos)
  #define TWIS_INTENCLR_WRITE_Min (0x0UL)
  #define TWIS_INTENCLR_WRITE_Max (0x1UL)
  #define TWIS_INTENCLR_WRITE_Clear (0x1UL)
  #define TWIS_INTENCLR_WRITE_Disabled (0x0UL)
  #define TWIS_INTENCLR_WRITE_Enabled (0x1UL)

/* READ @Bit 16 : Write '1' to disable interrupt for event READ */
  #define TWIS_INTENCLR_READ_Pos (16UL)
  #define TWIS_INTENCLR_READ_Msk (0x1UL << TWIS_INTENCLR_READ_Pos)
  #define TWIS_INTENCLR_READ_Min (0x0UL)
  #define TWIS_INTENCLR_READ_Max (0x1UL)
  #define TWIS_INTENCLR_READ_Clear (0x1UL)
  #define TWIS_INTENCLR_READ_Disabled (0x0UL)
  #define TWIS_INTENCLR_READ_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Write '1' to disable interrupt for event DMARXEND */
  #define TWIS_INTENCLR_DMARXEND_Pos (19UL)
  #define TWIS_INTENCLR_DMARXEND_Msk (0x1UL << TWIS_INTENCLR_DMARXEND_Pos)
  #define TWIS_INTENCLR_DMARXEND_Min (0x0UL)
  #define TWIS_INTENCLR_DMARXEND_Max (0x1UL)
  #define TWIS_INTENCLR_DMARXEND_Clear (0x1UL)
  #define TWIS_INTENCLR_DMARXEND_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMARXEND_Enabled (0x1UL)

