pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define TWIS_INTENCLR_DMARXREADY_Pos (20UL)
  #define TWIS_INTENCLR_DMARXREADY_Msk (0x1UL << TWIS_INTENCLR_DMARXREADY_Pos)
  #define TWIS_INTENCLR_DMARXREADY_Min (0x0UL)
  #define TWIS_INTENCLR_DMARXREADY_Max (0x1UL)
  #define TWIS_INTENCLR_DMARXREADY_Clear (0x1UL)
  #define TWIS_INTENCLR_DMARXREADY_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Write '1' to disable interrupt for event DMARXBUSERROR */
  #define TWIS_INTENCLR_DMARXBUSERROR_Pos (21UL)
  #define TWIS_INTENCLR_DMARXBUSERROR_Msk (0x1UL << TWIS_INTENCLR_DMARXBUSERROR_Pos)
  #define TWIS_INTENCLR_DMARXBUSERROR_Min (0x0UL)
  #define TWIS_INTENCLR_DMARXBUSERROR_Max (0x1UL)
  #define TWIS_INTENCLR_DMARXBUSERROR_Clear (0x1UL)
  #define TWIS_INTENCLR_DMARXBUSERROR_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Write '1' to disable interrupt for event DMARXMATCH[0] */
  #define TWIS_INTENCLR_DMARXMATCH0_Pos (22UL)
  #define TWIS_INTENCLR_DMARXMATCH0_Msk (0x1UL << TWIS_INTENCLR_DMARXMATCH0_Pos)
  #define TWIS_INTENCLR_DMARXMATCH0_Min (0x0UL)
  #define TWIS_INTENCLR_DMARXMATCH0_Max (0x1UL)
  #define TWIS_INTENCLR_DMARXMATCH0_Clear (0x1UL)
  #define TWIS_INTENCLR_DMARXMATCH0_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Write '1' to disable interrupt for event DMARXMATCH[1] */
  #define TWIS_INTENCLR_DMARXMATCH1_Pos (23UL)
  #define TWIS_INTENCLR_DMARXMATCH1_Msk (0x1UL << TWIS_INTENCLR_DMARXMATCH1_Pos)
  #define TWIS_INTENCLR_DMARXMATCH1_Min (0x0UL)
  #define TWIS_INTENCLR_DMARXMATCH1_Max (0x1UL)
  #define TWIS_INTENCLR_DMARXMATCH1_Clear (0x1UL)
  #define TWIS_INTENCLR_DMARXMATCH1_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Write '1' to disable interrupt for event DMARXMATCH[2] */
  #define TWIS_INTENCLR_DMARXMATCH2_Pos (24UL)
  #define TWIS_INTENCLR_DMARXMATCH2_Msk (0x1UL << TWIS_INTENCLR_DMARXMATCH2_Pos)
  #define TWIS_INTENCLR_DMARXMATCH2_Min (0x0UL)
  #define TWIS_INTENCLR_DMARXMATCH2_Max (0x1UL)
  #define TWIS_INTENCLR_DMARXMATCH2_Clear (0x1UL)
  #define TWIS_INTENCLR_DMARXMATCH2_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Write '1' to disable interrupt for event DMARXMATCH[3] */
  #define TWIS_INTENCLR_DMARXMATCH3_Pos (25UL)
  #define TWIS_INTENCLR_DMARXMATCH3_Msk (0x1UL << TWIS_INTENCLR_DMARXMATCH3_Pos)
  #define TWIS_INTENCLR_DMARXMATCH3_Min (0x0UL)
  #define TWIS_INTENCLR_DMARXMATCH3_Max (0x1UL)
  #define TWIS_INTENCLR_DMARXMATCH3_Clear (0x1UL)
  #define TWIS_INTENCLR_DMARXMATCH3_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Write '1' to disable interrupt for event DMATXEND */
  #define TWIS_INTENCLR_DMATXEND_Pos (26UL)
  #define TWIS_INTENCLR_DMATXEND_Msk (0x1UL << TWIS_INTENCLR_DMATXEND_Pos)
  #define TWIS_INTENCLR_DMATXEND_Min (0x0UL)
  #define TWIS_INTENCLR_DMATXEND_Max (0x1UL)
  #define TWIS_INTENCLR_DMATXEND_Clear (0x1UL)
  #define TWIS_INTENCLR_DMATXEND_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Write '1' to disable interrupt for event DMATXREADY */
  #define TWIS_INTENCLR_DMATXREADY_Pos (27UL)
  #define TWIS_INTENCLR_DMATXREADY_Msk (0x1UL << TWIS_INTENCLR_DMATXREADY_Pos)
  #define TWIS_INTENCLR_DMATXREADY_Min (0x0UL)
  #define TWIS_INTENCLR_DMATXREADY_Max (0x1UL)
  #define TWIS_INTENCLR_DMATXREADY_Clear (0x1UL)
  #define TWIS_INTENCLR_DMATXREADY_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Write '1' to disable interrupt for event DMATXBUSERROR */
  #define TWIS_INTENCLR_DMATXBUSERROR_Pos (28UL)
  #define TWIS_INTENCLR_DMATXBUSERROR_Msk (0x1UL << TWIS_INTENCLR_DMATXBUSERROR_Pos)
  #define TWIS_INTENCLR_DMATXBUSERROR_Min (0x0UL)
  #define TWIS_INTENCLR_DMATXBUSERROR_Max (0x1UL)
  #define TWIS_INTENCLR_DMATXBUSERROR_Clear (0x1UL)
  #define TWIS_INTENCLR_DMATXBUSERROR_Disabled (0x0UL)
  #define TWIS_INTENCLR_DMATXBUSERROR_Enabled (0x1UL)


/* TWIS_ERRORSRC: Error source */
  #define TWIS_ERRORSRC_ResetValue (0x00000000UL)

/* OVERFLOW @Bit 0 : RX buffer overflow detected, and prevented */
  #define TWIS_ERRORSRC_OVERFLOW_Pos (0UL)
  #define TWIS_ERRORSRC_OVERFLOW_Msk (0x1UL << TWIS_ERRORSRC_OVERFLOW_Pos)
  #define TWIS_ERRORSRC_OVERFLOW_Min (0x0UL)
  #define TWIS_ERRORSRC_OVERFLOW_Max (0x1UL)
  #define TWIS_ERRORSRC_OVERFLOW_NotDetected (0x0UL)
  #define TWIS_ERRORSRC_OVERFLOW_Detected (0x1UL)

/* DNACK @Bit 2 : NACK sent after receiving a data byte */
  #define TWIS_ERRORSRC_DNACK_Pos (2UL)
  #define TWIS_ERRORSRC_DNACK_Msk (0x1UL << TWIS_ERRORSRC_DNACK_Pos)
  #define TWIS_ERRORSRC_DNACK_Min (0x0UL)
  #define TWIS_ERRORSRC_DNACK_Max (0x1UL)
  #define TWIS_ERRORSRC_DNACK_NotReceived (0x0UL)
  #define TWIS_ERRORSRC_DNACK_Received (0x1UL)

/* OVERREAD @Bit 3 : TX buffer over-read detected, and prevented */
  #define TWIS_ERRORSRC_OVERREAD_Pos (3UL)
  #define TWIS_ERRORSRC_OVERREAD_Msk (0x1UL << TWIS_ERRORSRC_OVERREAD_Pos)
  #define TWIS_ERRORSRC_OVERREAD_Min (0x0UL)
  #define TWIS_ERRORSRC_OVERREAD_Max (0x1UL)
  #define TWIS_ERRORSRC_OVERREAD_NotDetected (0x0UL)
  #define TWIS_ERRORSRC_OVERREAD_Detected (0x1UL)


/* TWIS_MATCH: Status register indicating which address had a match */
  #define TWIS_MATCH_ResetValue (0x00000000UL)

/* MATCH @Bit 0 : Indication of which address in ADDRESS that matched the incoming address */
  #define TWIS_MATCH_MATCH_Pos (0UL)
  #define TWIS_MATCH_MATCH_Msk (0x1UL << TWIS_MATCH_MATCH_Pos)
  #define TWIS_MATCH_MATCH_Min (0x0UL)
  #define TWIS_MATCH_MATCH_Max (0x1UL)


/* TWIS_ENABLE: Enable TWIS */
  #define TWIS_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bits 0..3 : Enable or disable TWIS */
  #define TWIS_ENABLE_ENABLE_Pos (0UL)
  #define TWIS_ENABLE_ENABLE_Msk (0xFUL << TWIS_ENABLE_ENABLE_Pos)
  #define TWIS_ENABLE_ENABLE_Min (0x0UL)
  #define TWIS_ENABLE_ENABLE_Max (0x9UL)
  #define TWIS_ENABLE_ENABLE_Disabled (0x0UL)
  #define TWIS_ENABLE_ENABLE_Enabled (0x9UL)


/* TWIS_ADDRESS: TWI slave address n */
  #define TWIS_ADDRESS_MaxCount (2UL)
  #define TWIS_ADDRESS_MaxIndex (1UL)
  #define TWIS_ADDRESS_MinIndex (0UL)
  #define TWIS_ADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..6 : TWI slave address */
  #define TWIS_ADDRESS_ADDRESS_Pos (0UL)
  #define TWIS_ADDRESS_ADDRESS_Msk (0x7FUL << TWIS_ADDRESS_ADDRESS_Pos)


/* TWIS_CONFIG: Configuration register for the address match mechanism */
  #define TWIS_CONFIG_ResetValue (0x00000001UL)

