pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* END @Bit 0 : Generated after all MAXCNT bytes have been transferred */
  #define UARTE_EVENTS_DMA_TX_END_END_Pos (0UL)
  #define UARTE_EVENTS_DMA_TX_END_END_Msk (0x1UL << UARTE_EVENTS_DMA_TX_END_END_Pos)
  #define UARTE_EVENTS_DMA_TX_END_END_Min (0x0UL)
  #define UARTE_EVENTS_DMA_TX_END_END_Max (0x1UL)
  #define UARTE_EVENTS_DMA_TX_END_END_NotGenerated (0x0UL)
  #define UARTE_EVENTS_DMA_TX_END_END_Generated (0x1UL)


/* UARTE_EVENTS_DMA_TX_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                               to be written to prepare for the next sequence. */

  #define UARTE_EVENTS_DMA_TX_READY_ResetValue (0x00000000UL)

/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */

  #define UARTE_EVENTS_DMA_TX_READY_READY_Pos (0UL)
  #define UARTE_EVENTS_DMA_TX_READY_READY_Msk (0x1UL << UARTE_EVENTS_DMA_TX_READY_READY_Pos)
  #define UARTE_EVENTS_DMA_TX_READY_READY_Min (0x0UL)
  #define UARTE_EVENTS_DMA_TX_READY_READY_Max (0x1UL)
  #define UARTE_EVENTS_DMA_TX_READY_READY_NotGenerated (0x0UL)
  #define UARTE_EVENTS_DMA_TX_READY_READY_Generated (0x1UL)


/* UARTE_EVENTS_DMA_TX_BUSERROR: An error occured during the bus transfer. */
  #define UARTE_EVENTS_DMA_TX_BUSERROR_ResetValue (0x00000000UL)

/* BUSERROR @Bit 0 : An error occured during the bus transfer. */
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Pos (0UL)
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Msk (0x1UL << UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Pos) /*!< Bit mask of
                                                                            BUSERROR field.*/
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Min (0x0UL)
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Max (0x1UL)
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_NotGenerated (0x0UL)
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Generated (0x1UL)



/* ================================================= Struct UARTE_EVENTS_DMA ================================================= */
/**
  * @brief EVENTS_DMA [UARTE_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM NRF_UARTE_EVENTS_DMA_RX_Type RX;
  __IOM NRF_UARTE_EVENTS_DMA_TX_Type TX;
} NRF_UARTE_EVENTS_DMA_Type;


/* =============================================== Struct UARTE_PUBLISH_DMA_RX =============================================== */
/**
  * @brief RX [UARTE_PUBLISH_DMA_RX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;
  __IOM uint32_t  BUSERROR;
  __IOM uint32_t  MATCH[4];
} NRF_UARTE_PUBLISH_DMA_RX_Type;

/* UARTE_PUBLISH_DMA_RX_END: Publish configuration for event END */
  #define UARTE_PUBLISH_DMA_RX_END_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define UARTE_PUBLISH_DMA_RX_END_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_DMA_RX_END_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_RX_END_CHIDX_Pos)
  #define UARTE_PUBLISH_DMA_RX_END_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_DMA_RX_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_RX_END_EN_Pos (31UL)
  #define UARTE_PUBLISH_DMA_RX_END_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_RX_END_EN_Pos)
  #define UARTE_PUBLISH_DMA_RX_END_EN_Min (0x0UL)
  #define UARTE_PUBLISH_DMA_RX_END_EN_Max (0x1UL)
  #define UARTE_PUBLISH_DMA_RX_END_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_DMA_RX_END_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_DMA_RX_READY: Publish configuration for event READY */
  #define UARTE_PUBLISH_DMA_RX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define UARTE_PUBLISH_DMA_RX_READY_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_DMA_RX_READY_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_RX_READY_CHIDX_Pos)
  #define UARTE_PUBLISH_DMA_RX_READY_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_DMA_RX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Pos (31UL)
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_RX_READY_EN_Pos)
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Min (0x0UL)
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Max (0x1UL)
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_DMA_RX_BUSERROR: Publish configuration for event BUSERROR */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Pos (31UL)
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Pos)
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Min (0x0UL)
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Max (0x1UL)
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_DMA_RX_BUSERROR_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_DMA_RX_MATCH: Publish configuration for event MATCH[n] */
  #define UARTE_PUBLISH_DMA_RX_MATCH_MaxCount (4UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_MaxIndex (3UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_MinIndex (0UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event MATCH[n] will publish to */
  #define UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Pos)
  #define UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Pos (31UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_RX_MATCH_EN_Pos)
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Min (0x0UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Max (0x1UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_DMA_RX_MATCH_EN_Enabled (0x1UL)



/* =============================================== Struct UARTE_PUBLISH_DMA_TX =============================================== */
/**
  * @brief TX [UARTE_PUBLISH_DMA_TX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;
  __IOM uint32_t  READY;
  __IOM uint32_t  BUSERROR;
} NRF_UARTE_PUBLISH_DMA_TX_Type;

/* UARTE_PUBLISH_DMA_TX_END: Publish configuration for event END */
  #define UARTE_PUBLISH_DMA_TX_END_ResetValue (0x00000000UL)

