pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define UARTE_PUBLISH_DMA_TX_END_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_DMA_TX_END_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_TX_END_CHIDX_Pos)
  #define UARTE_PUBLISH_DMA_TX_END_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_DMA_TX_END_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_TX_END_EN_Pos (31UL)
  #define UARTE_PUBLISH_DMA_TX_END_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_TX_END_EN_Pos)
  #define UARTE_PUBLISH_DMA_TX_END_EN_Min (0x0UL)
  #define UARTE_PUBLISH_DMA_TX_END_EN_Max (0x1UL)
  #define UARTE_PUBLISH_DMA_TX_END_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_DMA_TX_END_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_DMA_TX_READY: Publish configuration for event READY */
  #define UARTE_PUBLISH_DMA_TX_READY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define UARTE_PUBLISH_DMA_TX_READY_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_DMA_TX_READY_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_TX_READY_CHIDX_Pos)
  #define UARTE_PUBLISH_DMA_TX_READY_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_DMA_TX_READY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_TX_READY_EN_Pos (31UL)
  #define UARTE_PUBLISH_DMA_TX_READY_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_TX_READY_EN_Pos)
  #define UARTE_PUBLISH_DMA_TX_READY_EN_Min (0x0UL)
  #define UARTE_PUBLISH_DMA_TX_READY_EN_Max (0x1UL)
  #define UARTE_PUBLISH_DMA_TX_READY_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_DMA_TX_READY_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_DMA_TX_BUSERROR: Publish configuration for event BUSERROR */
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR will publish to */
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_TX_BUSERROR_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_EN_Pos (31UL)
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_TX_BUSERROR_EN_Pos)
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_EN_Min (0x0UL)
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_EN_Max (0x1UL)
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_DMA_TX_BUSERROR_EN_Enabled (0x1UL)



/* ================================================ Struct UARTE_PUBLISH_DMA ================================================= */
/**
  * @brief PUBLISH_DMA [UARTE_PUBLISH_DMA] Publish configuration for events
  */
typedef struct {
  __IOM NRF_UARTE_PUBLISH_DMA_RX_Type RX;
  __IOM NRF_UARTE_PUBLISH_DMA_TX_Type TX;
} NRF_UARTE_PUBLISH_DMA_Type;


/* ==================================================== Struct UARTE_PSEL ==================================================== */
/**
  * @brief PSEL [UARTE_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  TXD;
  __IOM uint32_t  CTS;
  __IOM uint32_t  RXD;
  __IOM uint32_t  RTS;
} NRF_UARTE_PSEL_Type;

/* UARTE_PSEL_TXD: Pin select for TXD signal */
  #define UARTE_PSEL_TXD_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define UARTE_PSEL_TXD_PIN_Pos (0UL)
  #define UARTE_PSEL_TXD_PIN_Msk (0x1FUL << UARTE_PSEL_TXD_PIN_Pos)
  #define UARTE_PSEL_TXD_PIN_Min (0x00UL)
  #define UARTE_PSEL_TXD_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define UARTE_PSEL_TXD_PORT_Pos (5UL)
  #define UARTE_PSEL_TXD_PORT_Msk (0xFUL << UARTE_PSEL_TXD_PORT_Pos)
  #define UARTE_PSEL_TXD_PORT_Min (0x0UL)
  #define UARTE_PSEL_TXD_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define UARTE_PSEL_TXD_CONNECT_Pos (31UL)
  #define UARTE_PSEL_TXD_CONNECT_Msk (0x1UL << UARTE_PSEL_TXD_CONNECT_Pos)
  #define UARTE_PSEL_TXD_CONNECT_Min (0x0UL)
  #define UARTE_PSEL_TXD_CONNECT_Max (0x1UL)
  #define UARTE_PSEL_TXD_CONNECT_Disconnected (0x1UL)
  #define UARTE_PSEL_TXD_CONNECT_Connected (0x0UL)


/* UARTE_PSEL_CTS: Pin select for CTS signal */
  #define UARTE_PSEL_CTS_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define UARTE_PSEL_CTS_PIN_Pos (0UL)
  #define UARTE_PSEL_CTS_PIN_Msk (0x1FUL << UARTE_PSEL_CTS_PIN_Pos)
  #define UARTE_PSEL_CTS_PIN_Min (0x00UL)
  #define UARTE_PSEL_CTS_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define UARTE_PSEL_CTS_PORT_Pos (5UL)
  #define UARTE_PSEL_CTS_PORT_Msk (0xFUL << UARTE_PSEL_CTS_PORT_Pos)
  #define UARTE_PSEL_CTS_PORT_Min (0x0UL)
  #define UARTE_PSEL_CTS_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define UARTE_PSEL_CTS_CONNECT_Pos (31UL)
  #define UARTE_PSEL_CTS_CONNECT_Msk (0x1UL << UARTE_PSEL_CTS_CONNECT_Pos)
  #define UARTE_PSEL_CTS_CONNECT_Min (0x0UL)
  #define UARTE_PSEL_CTS_CONNECT_Max (0x1UL)
  #define UARTE_PSEL_CTS_CONNECT_Disconnected (0x1UL)
  #define UARTE_PSEL_CTS_CONNECT_Connected (0x0UL)


/* UARTE_PSEL_RXD: Pin select for RXD signal */
  #define UARTE_PSEL_RXD_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define UARTE_PSEL_RXD_PIN_Pos (0UL)
  #define UARTE_PSEL_RXD_PIN_Msk (0x1FUL << UARTE_PSEL_RXD_PIN_Pos)
  #define UARTE_PSEL_RXD_PIN_Min (0x00UL)
  #define UARTE_PSEL_RXD_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define UARTE_PSEL_RXD_PORT_Pos (5UL)
  #define UARTE_PSEL_RXD_PORT_Msk (0xFUL << UARTE_PSEL_RXD_PORT_Pos)
  #define UARTE_PSEL_RXD_PORT_Min (0x0UL)
  #define UARTE_PSEL_RXD_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define UARTE_PSEL_RXD_CONNECT_Pos (31UL)
  #define UARTE_PSEL_RXD_CONNECT_Msk (0x1UL << UARTE_PSEL_RXD_CONNECT_Pos)
  #define UARTE_PSEL_RXD_CONNECT_Min (0x0UL)
  #define UARTE_PSEL_RXD_CONNECT_Max (0x1UL)
  #define UARTE_PSEL_RXD_CONNECT_Disconnected (0x1UL)
  #define UARTE_PSEL_RXD_CONNECT_Connected (0x0UL)


/* UARTE_PSEL_RTS: Pin select for RTS signal */
  #define UARTE_PSEL_RTS_ResetValue (0xFFFFFFFFUL)

/* PIN @Bits 0..4 : Pin number */
  #define UARTE_PSEL_RTS_PIN_Pos (0UL)
  #define UARTE_PSEL_RTS_PIN_Msk (0x1FUL << UARTE_PSEL_RTS_PIN_Pos)
  #define UARTE_PSEL_RTS_PIN_Min (0x00UL)
  #define UARTE_PSEL_RTS_PIN_Max (0x1FUL)

/* PORT @Bits 5..8 : Port number */
  #define UARTE_PSEL_RTS_PORT_Pos (5UL)
  #define UARTE_PSEL_RTS_PORT_Msk (0xFUL << UARTE_PSEL_RTS_PORT_Pos)
  #define UARTE_PSEL_RTS_PORT_Min (0x0UL)
  #define UARTE_PSEL_RTS_PORT_Max (0xFUL)

/* CONNECT @Bit 31 : Connection */
  #define UARTE_PSEL_RTS_CONNECT_Pos (31UL)
  #define UARTE_PSEL_RTS_CONNECT_Msk (0x1UL << UARTE_PSEL_RTS_CONNECT_Pos)
  #define UARTE_PSEL_RTS_CONNECT_Min (0x0UL)
  #define UARTE_PSEL_RTS_CONNECT_Max (0x1UL)
  #define UARTE_PSEL_RTS_CONNECT_Disconnected (0x1UL)
  #define UARTE_PSEL_RTS_CONNECT_Connected (0x0UL)



/* ================================================ Struct UARTE_DMA_RX_MATCH ================================================ */
/**
  * @brief MATCH [UARTE_DMA_RX_MATCH] Registers to control the behavior of the pattern matcher engine
  */
typedef struct {
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  CANDIDATE[4];                      /*!< (@ 0x00000004) The data to look for - any match will trigger the
                                                                         MATCH[n] event, if enabled.*/
} NRF_UARTE_DMA_RX_MATCH_Type;

/* UARTE_DMA_RX_MATCH_CONFIG: Configure individual match events */
  #define UARTE_DMA_RX_MATCH_CONFIG_ResetValue (0x00000000UL)

