pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* UARTE_DMA_TX_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos (0UL)
  #define UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UARTE_DMA_TX_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/



/* ==================================================== Struct UARTE_DMA ===================================================== */
/**
  * @brief DMA [UARTE_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_UARTE_DMA_RX_Type RX;
  __IOM NRF_UARTE_DMA_TX_Type TX;
} NRF_UARTE_DMA_Type;

/* ====================================================== Struct UARTE ======================================================= */
/**
  * @brief UART with EasyDMA
  */
  typedef struct {
    __IM uint32_t RESERVED[7];
    __OM uint32_t TASKS_FLUSHRX;
    __IM uint32_t RESERVED1[2];
    __OM NRF_UARTE_TASKS_DMA_Type TASKS_DMA;
    __IM uint32_t RESERVED2[17];
    __IOM uint32_t SUBSCRIBE_FLUSHRX;
    __IM uint32_t RESERVED3[2];
    __IOM NRF_UARTE_SUBSCRIBE_DMA_Type SUBSCRIBE_DMA;
    __IM uint32_t RESERVED4[10];
    __IOM uint32_t EVENTS_CTS;
    __IOM uint32_t EVENTS_NCTS;
    __IM uint32_t RESERVED5;
    __IOM uint32_t EVENTS_TXDRDY;
    __IOM uint32_t EVENTS_RXDRDY;                    /*!< (@ 0x00000110) Data received in RXD (but potentially not yet
                                                                         transferred to Data RAM)*/
    __IOM uint32_t EVENTS_ERROR;
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t EVENTS_RXTO;
    __IM uint32_t RESERVED7[2];
    __IOM uint32_t EVENTS_TXSTOPPED;
    __IM uint32_t RESERVED8[6];
    __IOM NRF_UARTE_EVENTS_DMA_Type EVENTS_DMA;
    __IOM uint32_t EVENTS_FRAMETIMEOUT;
    __IM uint32_t RESERVED9[2];
    __IOM uint32_t PUBLISH_CTS;
    __IOM uint32_t PUBLISH_NCTS;
    __IM uint32_t RESERVED10;
    __IOM uint32_t PUBLISH_TXDRDY;
    __IOM uint32_t PUBLISH_RXDRDY;
    __IOM uint32_t PUBLISH_ERROR;
    __IM uint32_t RESERVED11[3];
    __IOM uint32_t PUBLISH_RXTO;
    __IM uint32_t RESERVED12[2];
    __IOM uint32_t PUBLISH_TXSTOPPED;
    __IM uint32_t RESERVED13[6];
    __IOM NRF_UARTE_PUBLISH_DMA_Type PUBLISH_DMA;
    __IOM uint32_t PUBLISH_FRAMETIMEOUT;
    __IM uint32_t RESERVED14[2];
    __IOM uint32_t SHORTS;
    __IM uint32_t RESERVED15[63];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED16[93];
    __IOM uint32_t ERRORSRC;
    __IM uint32_t RESERVED17[31];
    __IOM uint32_t ENABLE;
    __IM uint32_t RESERVED18[8];
    __IOM uint32_t BAUDRATE;                         /*!< (@ 0x00000524) Baud rate. Accuracy depends on the HFCLK source
                                                                         selected.*/
    __IM uint32_t RESERVED19[17];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000056C) Configuration of parity, hardware flow control,
                                                                         framesize, and packet timeout.*/
    __IM uint32_t RESERVED20;
    __IOM uint32_t ADDRESS;                          /*!< (@ 0x00000574) Set the address of the UARTE for RX when used in 9 bit
                                                                         data frame mode.*/
    __IOM uint32_t FRAMETIMEOUT;                     /*!< (@ 0x00000578) Set the number of UARTE bits to count before triggering
                                                                         packet timeout.*/
    __IM uint32_t RESERVED21[34];
    __IOM NRF_UARTE_PSEL_Type PSEL;
    __IM uint32_t RESERVED22[59];
    __IOM NRF_UARTE_DMA_Type DMA;
  } NRF_UARTE_Type;

/* UARTE_TASKS_FLUSHRX: Flush RX FIFO into RX buffer */
  #define UARTE_TASKS_FLUSHRX_ResetValue (0x00000000UL)

/* TASKS_FLUSHRX @Bit 0 : Flush RX FIFO into RX buffer */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos (0UL)
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Msk (0x1UL << UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos) /*!< Bit mask of TASKS_FLUSHRX
                                                                            field.*/
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Min (0x1UL)
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Max (0x1UL)
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Trigger (0x1UL)


/* UARTE_SUBSCRIBE_FLUSHRX: Subscribe configuration for task FLUSHRX */
  #define UARTE_SUBSCRIBE_FLUSHRX_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task FLUSHRX will subscribe to */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Pos (0UL)
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Pos)
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Min (0x00UL)
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Pos (31UL)
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Msk (0x1UL << UARTE_SUBSCRIBE_FLUSHRX_EN_Pos)
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Min (0x0UL)
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Max (0x1UL)
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Disabled (0x0UL)
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Enabled (0x1UL)


/* UARTE_EVENTS_CTS: CTS is activated (set low). Clear To Send. */
  #define UARTE_EVENTS_CTS_ResetValue (0x00000000UL)

/* EVENTS_CTS @Bit 0 : CTS is activated (set low). Clear To Send. */
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Pos (0UL)
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Msk (0x1UL << UARTE_EVENTS_CTS_EVENTS_CTS_Pos)
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Min (0x0UL)
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Max (0x1UL)
  #define UARTE_EVENTS_CTS_EVENTS_CTS_NotGenerated (0x0UL)
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Generated (0x1UL)


/* UARTE_EVENTS_NCTS: CTS is deactivated (set high). Not Clear To Send. */
  #define UARTE_EVENTS_NCTS_ResetValue (0x00000000UL)

/* EVENTS_NCTS @Bit 0 : CTS is deactivated (set high). Not Clear To Send. */
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Pos (0UL)
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Msk (0x1UL << UARTE_EVENTS_NCTS_EVENTS_NCTS_Pos)
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Min (0x0UL)
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Max (0x1UL)
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_NotGenerated (0x0UL)
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Generated (0x1UL)


/* UARTE_EVENTS_TXDRDY: Data sent from TXD */
  #define UARTE_EVENTS_TXDRDY_ResetValue (0x00000000UL)

/* EVENTS_TXDRDY @Bit 0 : Data sent from TXD */
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Pos (0UL)
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Msk (0x1UL << UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Pos) /*!< Bit mask of EVENTS_TXDRDY
                                                                            field.*/
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Min (0x0UL)
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Max (0x1UL)
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_NotGenerated (0x0UL)
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Generated (0x1UL)


/* UARTE_EVENTS_RXDRDY: Data received in RXD (but potentially not yet transferred to Data RAM) */
  #define UARTE_EVENTS_RXDRDY_ResetValue (0x00000000UL)

/* EVENTS_RXDRDY @Bit 0 : Data received in RXD (but potentially not yet transferred to Data RAM) */
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Pos (0UL)
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Msk (0x1UL << UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Pos) /*!< Bit mask of EVENTS_RXDRDY
                                                                            field.*/
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Min (0x0UL)
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Max (0x1UL)
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_NotGenerated (0x0UL)
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Generated (0x1UL)


/* UARTE_EVENTS_ERROR: Error detected */
  #define UARTE_EVENTS_ERROR_ResetValue (0x00000000UL)

/* EVENTS_ERROR @Bit 0 : Error detected */
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << UARTE_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR
                                                                            field.*/
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL)
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL)


