pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* UARTE_EVENTS_RXTO: Receiver timeout */
  #define UARTE_EVENTS_RXTO_ResetValue (0x00000000UL)

/* EVENTS_RXTO @Bit 0 : Receiver timeout */
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Pos (0UL)
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Msk (0x1UL << UARTE_EVENTS_RXTO_EVENTS_RXTO_Pos)
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Min (0x0UL)
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Max (0x1UL)
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_NotGenerated (0x0UL)
  #define UARTE_EVENTS_RXTO_EVENTS_RXTO_Generated (0x1UL)


/* UARTE_EVENTS_TXSTOPPED: Transmitter stopped */
  #define UARTE_EVENTS_TXSTOPPED_ResetValue (0x00000000UL)

/* EVENTS_TXSTOPPED @Bit 0 : Transmitter stopped */
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Pos (0UL)
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Msk (0x1UL << UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_TXSTOPPED field.*/
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Min (0x0UL)
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Max (0x1UL)
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_NotGenerated (0x0UL)
  #define UARTE_EVENTS_TXSTOPPED_EVENTS_TXSTOPPED_Generated (0x1UL)


/* UARTE_EVENTS_FRAMETIMEOUT: Timed out due to bus being idle while receiving data. */
  #define UARTE_EVENTS_FRAMETIMEOUT_ResetValue (0x00000000UL)

/* EVENTS_FRAMETIMEOUT @Bit 0 : Timed out due to bus being idle while receiving data. */
  #define UARTE_EVENTS_FRAMETIMEOUT_EVENTS_FRAMETIMEOUT_Pos (0UL)
  #define UARTE_EVENTS_FRAMETIMEOUT_EVENTS_FRAMETIMEOUT_Msk (0x1UL << UARTE_EVENTS_FRAMETIMEOUT_EVENTS_FRAMETIMEOUT_Pos) /*!<
                                                                            Bit mask of EVENTS_FRAMETIMEOUT field.*/
  #define UARTE_EVENTS_FRAMETIMEOUT_EVENTS_FRAMETIMEOUT_Min (0x0UL)
  #define UARTE_EVENTS_FRAMETIMEOUT_EVENTS_FRAMETIMEOUT_Max (0x1UL)
  #define UARTE_EVENTS_FRAMETIMEOUT_EVENTS_FRAMETIMEOUT_NotGenerated (0x0UL)
  #define UARTE_EVENTS_FRAMETIMEOUT_EVENTS_FRAMETIMEOUT_Generated (0x1UL)


/* UARTE_PUBLISH_CTS: Publish configuration for event CTS */
  #define UARTE_PUBLISH_CTS_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event CTS will publish to */
  #define UARTE_PUBLISH_CTS_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_CTS_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_CTS_CHIDX_Pos)
  #define UARTE_PUBLISH_CTS_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_CTS_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_CTS_EN_Pos (31UL)
  #define UARTE_PUBLISH_CTS_EN_Msk (0x1UL << UARTE_PUBLISH_CTS_EN_Pos)
  #define UARTE_PUBLISH_CTS_EN_Min (0x0UL)
  #define UARTE_PUBLISH_CTS_EN_Max (0x1UL)
  #define UARTE_PUBLISH_CTS_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_CTS_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_NCTS: Publish configuration for event NCTS */
  #define UARTE_PUBLISH_NCTS_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event NCTS will publish to */
  #define UARTE_PUBLISH_NCTS_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_NCTS_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_NCTS_CHIDX_Pos)
  #define UARTE_PUBLISH_NCTS_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_NCTS_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_NCTS_EN_Pos (31UL)
  #define UARTE_PUBLISH_NCTS_EN_Msk (0x1UL << UARTE_PUBLISH_NCTS_EN_Pos)
  #define UARTE_PUBLISH_NCTS_EN_Min (0x0UL)
  #define UARTE_PUBLISH_NCTS_EN_Max (0x1UL)
  #define UARTE_PUBLISH_NCTS_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_NCTS_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_TXDRDY: Publish configuration for event TXDRDY */
  #define UARTE_PUBLISH_TXDRDY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event TXDRDY will publish to */
  #define UARTE_PUBLISH_TXDRDY_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_TXDRDY_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_TXDRDY_CHIDX_Pos)
  #define UARTE_PUBLISH_TXDRDY_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_TXDRDY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_TXDRDY_EN_Pos (31UL)
  #define UARTE_PUBLISH_TXDRDY_EN_Msk (0x1UL << UARTE_PUBLISH_TXDRDY_EN_Pos)
  #define UARTE_PUBLISH_TXDRDY_EN_Min (0x0UL)
  #define UARTE_PUBLISH_TXDRDY_EN_Max (0x1UL)
  #define UARTE_PUBLISH_TXDRDY_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_TXDRDY_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_RXDRDY: Publish configuration for event RXDRDY */
  #define UARTE_PUBLISH_RXDRDY_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event RXDRDY will publish to */
  #define UARTE_PUBLISH_RXDRDY_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_RXDRDY_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_RXDRDY_CHIDX_Pos)
  #define UARTE_PUBLISH_RXDRDY_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_RXDRDY_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_RXDRDY_EN_Pos (31UL)
  #define UARTE_PUBLISH_RXDRDY_EN_Msk (0x1UL << UARTE_PUBLISH_RXDRDY_EN_Pos)
  #define UARTE_PUBLISH_RXDRDY_EN_Min (0x0UL)
  #define UARTE_PUBLISH_RXDRDY_EN_Max (0x1UL)
  #define UARTE_PUBLISH_RXDRDY_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_RXDRDY_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_ERROR: Publish configuration for event ERROR */
  #define UARTE_PUBLISH_ERROR_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event ERROR will publish to */
  #define UARTE_PUBLISH_ERROR_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_ERROR_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_ERROR_CHIDX_Pos)
  #define UARTE_PUBLISH_ERROR_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_ERROR_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_ERROR_EN_Pos (31UL)
  #define UARTE_PUBLISH_ERROR_EN_Msk (0x1UL << UARTE_PUBLISH_ERROR_EN_Pos)
  #define UARTE_PUBLISH_ERROR_EN_Min (0x0UL)
  #define UARTE_PUBLISH_ERROR_EN_Max (0x1UL)
  #define UARTE_PUBLISH_ERROR_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_ERROR_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_RXTO: Publish configuration for event RXTO */
  #define UARTE_PUBLISH_RXTO_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event RXTO will publish to */
  #define UARTE_PUBLISH_RXTO_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_RXTO_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_RXTO_CHIDX_Pos)
  #define UARTE_PUBLISH_RXTO_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_RXTO_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_RXTO_EN_Pos (31UL)
  #define UARTE_PUBLISH_RXTO_EN_Msk (0x1UL << UARTE_PUBLISH_RXTO_EN_Pos)
  #define UARTE_PUBLISH_RXTO_EN_Min (0x0UL)
  #define UARTE_PUBLISH_RXTO_EN_Max (0x1UL)
  #define UARTE_PUBLISH_RXTO_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_RXTO_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_TXSTOPPED: Publish configuration for event TXSTOPPED */
  #define UARTE_PUBLISH_TXSTOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event TXSTOPPED will publish to */
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_TXSTOPPED_CHIDX_Pos)
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_TXSTOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_TXSTOPPED_EN_Pos (31UL)
  #define UARTE_PUBLISH_TXSTOPPED_EN_Msk (0x1UL << UARTE_PUBLISH_TXSTOPPED_EN_Pos)
  #define UARTE_PUBLISH_TXSTOPPED_EN_Min (0x0UL)
  #define UARTE_PUBLISH_TXSTOPPED_EN_Max (0x1UL)
  #define UARTE_PUBLISH_TXSTOPPED_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_TXSTOPPED_EN_Enabled (0x1UL)


/* UARTE_PUBLISH_FRAMETIMEOUT: Publish configuration for event FRAMETIMEOUT */
  #define UARTE_PUBLISH_FRAMETIMEOUT_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event FRAMETIMEOUT will publish to */
  #define UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Pos (0UL)
  #define UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Pos)
  #define UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Min (0x00UL)
  #define UARTE_PUBLISH_FRAMETIMEOUT_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Pos (31UL)
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Msk (0x1UL << UARTE_PUBLISH_FRAMETIMEOUT_EN_Pos)
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Min (0x0UL)
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Max (0x1UL)
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Disabled (0x0UL)
  #define UARTE_PUBLISH_FRAMETIMEOUT_EN_Enabled (0x1UL)


/* UARTE_SHORTS: Shortcuts between local events and tasks */
  #define UARTE_SHORTS_ResetValue (0x00000000UL)

