pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TXDRDY @Bit 3 : Enable or disable interrupt for event TXDRDY */
  #define UARTE_INTEN_TXDRDY_Pos (3UL)
  #define UARTE_INTEN_TXDRDY_Msk (0x1UL << UARTE_INTEN_TXDRDY_Pos)
  #define UARTE_INTEN_TXDRDY_Min (0x0UL)
  #define UARTE_INTEN_TXDRDY_Max (0x1UL)
  #define UARTE_INTEN_TXDRDY_Disabled (0x0UL)
  #define UARTE_INTEN_TXDRDY_Enabled (0x1UL)

/* RXDRDY @Bit 4 : Enable or disable interrupt for event RXDRDY */
  #define UARTE_INTEN_RXDRDY_Pos (4UL)
  #define UARTE_INTEN_RXDRDY_Msk (0x1UL << UARTE_INTEN_RXDRDY_Pos)
  #define UARTE_INTEN_RXDRDY_Min (0x0UL)
  #define UARTE_INTEN_RXDRDY_Max (0x1UL)
  #define UARTE_INTEN_RXDRDY_Disabled (0x0UL)
  #define UARTE_INTEN_RXDRDY_Enabled (0x1UL)

/* ERROR @Bit 5 : Enable or disable interrupt for event ERROR */
  #define UARTE_INTEN_ERROR_Pos (5UL)
  #define UARTE_INTEN_ERROR_Msk (0x1UL << UARTE_INTEN_ERROR_Pos)
  #define UARTE_INTEN_ERROR_Min (0x0UL)
  #define UARTE_INTEN_ERROR_Max (0x1UL)
  #define UARTE_INTEN_ERROR_Disabled (0x0UL)
  #define UARTE_INTEN_ERROR_Enabled (0x1UL)

/* RXTO @Bit 9 : Enable or disable interrupt for event RXTO */
  #define UARTE_INTEN_RXTO_Pos (9UL)
  #define UARTE_INTEN_RXTO_Msk (0x1UL << UARTE_INTEN_RXTO_Pos)
  #define UARTE_INTEN_RXTO_Min (0x0UL)
  #define UARTE_INTEN_RXTO_Max (0x1UL)
  #define UARTE_INTEN_RXTO_Disabled (0x0UL)
  #define UARTE_INTEN_RXTO_Enabled (0x1UL)

/* TXSTOPPED @Bit 12 : Enable or disable interrupt for event TXSTOPPED */
  #define UARTE_INTEN_TXSTOPPED_Pos (12UL)
  #define UARTE_INTEN_TXSTOPPED_Msk (0x1UL << UARTE_INTEN_TXSTOPPED_Pos)
  #define UARTE_INTEN_TXSTOPPED_Min (0x0UL)
  #define UARTE_INTEN_TXSTOPPED_Max (0x1UL)
  #define UARTE_INTEN_TXSTOPPED_Disabled (0x0UL)
  #define UARTE_INTEN_TXSTOPPED_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Enable or disable interrupt for event DMARXEND */
  #define UARTE_INTEN_DMARXEND_Pos (19UL)
  #define UARTE_INTEN_DMARXEND_Msk (0x1UL << UARTE_INTEN_DMARXEND_Pos)
  #define UARTE_INTEN_DMARXEND_Min (0x0UL)
  #define UARTE_INTEN_DMARXEND_Max (0x1UL)
  #define UARTE_INTEN_DMARXEND_Disabled (0x0UL)
  #define UARTE_INTEN_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Enable or disable interrupt for event DMARXREADY */
  #define UARTE_INTEN_DMARXREADY_Pos (20UL)
  #define UARTE_INTEN_DMARXREADY_Msk (0x1UL << UARTE_INTEN_DMARXREADY_Pos)
  #define UARTE_INTEN_DMARXREADY_Min (0x0UL)
  #define UARTE_INTEN_DMARXREADY_Max (0x1UL)
  #define UARTE_INTEN_DMARXREADY_Disabled (0x0UL)
  #define UARTE_INTEN_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Enable or disable interrupt for event DMARXBUSERROR */
  #define UARTE_INTEN_DMARXBUSERROR_Pos (21UL)
  #define UARTE_INTEN_DMARXBUSERROR_Msk (0x1UL << UARTE_INTEN_DMARXBUSERROR_Pos)
  #define UARTE_INTEN_DMARXBUSERROR_Min (0x0UL)
  #define UARTE_INTEN_DMARXBUSERROR_Max (0x1UL)
  #define UARTE_INTEN_DMARXBUSERROR_Disabled (0x0UL)
  #define UARTE_INTEN_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Enable or disable interrupt for event DMARXMATCH[0] */
  #define UARTE_INTEN_DMARXMATCH0_Pos (22UL)
  #define UARTE_INTEN_DMARXMATCH0_Msk (0x1UL << UARTE_INTEN_DMARXMATCH0_Pos)
  #define UARTE_INTEN_DMARXMATCH0_Min (0x0UL)
  #define UARTE_INTEN_DMARXMATCH0_Max (0x1UL)
  #define UARTE_INTEN_DMARXMATCH0_Disabled (0x0UL)
  #define UARTE_INTEN_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Enable or disable interrupt for event DMARXMATCH[1] */
  #define UARTE_INTEN_DMARXMATCH1_Pos (23UL)
  #define UARTE_INTEN_DMARXMATCH1_Msk (0x1UL << UARTE_INTEN_DMARXMATCH1_Pos)
  #define UARTE_INTEN_DMARXMATCH1_Min (0x0UL)
  #define UARTE_INTEN_DMARXMATCH1_Max (0x1UL)
  #define UARTE_INTEN_DMARXMATCH1_Disabled (0x0UL)
  #define UARTE_INTEN_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Enable or disable interrupt for event DMARXMATCH[2] */
  #define UARTE_INTEN_DMARXMATCH2_Pos (24UL)
  #define UARTE_INTEN_DMARXMATCH2_Msk (0x1UL << UARTE_INTEN_DMARXMATCH2_Pos)
  #define UARTE_INTEN_DMARXMATCH2_Min (0x0UL)
  #define UARTE_INTEN_DMARXMATCH2_Max (0x1UL)
  #define UARTE_INTEN_DMARXMATCH2_Disabled (0x0UL)
  #define UARTE_INTEN_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Enable or disable interrupt for event DMARXMATCH[3] */
  #define UARTE_INTEN_DMARXMATCH3_Pos (25UL)
  #define UARTE_INTEN_DMARXMATCH3_Msk (0x1UL << UARTE_INTEN_DMARXMATCH3_Pos)
  #define UARTE_INTEN_DMARXMATCH3_Min (0x0UL)
  #define UARTE_INTEN_DMARXMATCH3_Max (0x1UL)
  #define UARTE_INTEN_DMARXMATCH3_Disabled (0x0UL)
  #define UARTE_INTEN_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Enable or disable interrupt for event DMATXEND */
  #define UARTE_INTEN_DMATXEND_Pos (26UL)
  #define UARTE_INTEN_DMATXEND_Msk (0x1UL << UARTE_INTEN_DMATXEND_Pos)
  #define UARTE_INTEN_DMATXEND_Min (0x0UL)
  #define UARTE_INTEN_DMATXEND_Max (0x1UL)
  #define UARTE_INTEN_DMATXEND_Disabled (0x0UL)
  #define UARTE_INTEN_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Enable or disable interrupt for event DMATXREADY */
  #define UARTE_INTEN_DMATXREADY_Pos (27UL)
  #define UARTE_INTEN_DMATXREADY_Msk (0x1UL << UARTE_INTEN_DMATXREADY_Pos)
  #define UARTE_INTEN_DMATXREADY_Min (0x0UL)
  #define UARTE_INTEN_DMATXREADY_Max (0x1UL)
  #define UARTE_INTEN_DMATXREADY_Disabled (0x0UL)
  #define UARTE_INTEN_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Enable or disable interrupt for event DMATXBUSERROR */
  #define UARTE_INTEN_DMATXBUSERROR_Pos (28UL)
  #define UARTE_INTEN_DMATXBUSERROR_Msk (0x1UL << UARTE_INTEN_DMATXBUSERROR_Pos)
  #define UARTE_INTEN_DMATXBUSERROR_Min (0x0UL)
  #define UARTE_INTEN_DMATXBUSERROR_Max (0x1UL)
  #define UARTE_INTEN_DMATXBUSERROR_Disabled (0x0UL)
  #define UARTE_INTEN_DMATXBUSERROR_Enabled (0x1UL)

/* FRAMETIMEOUT @Bit 29 : Enable or disable interrupt for event FRAMETIMEOUT */
  #define UARTE_INTEN_FRAMETIMEOUT_Pos (29UL)
  #define UARTE_INTEN_FRAMETIMEOUT_Msk (0x1UL << UARTE_INTEN_FRAMETIMEOUT_Pos)
  #define UARTE_INTEN_FRAMETIMEOUT_Min (0x0UL)
  #define UARTE_INTEN_FRAMETIMEOUT_Max (0x1UL)
  #define UARTE_INTEN_FRAMETIMEOUT_Disabled (0x0UL)
  #define UARTE_INTEN_FRAMETIMEOUT_Enabled (0x1UL)


/* UARTE_INTENSET: Enable interrupt */
  #define UARTE_INTENSET_ResetValue (0x00000000UL)

/* CTS @Bit 0 : Write '1' to enable interrupt for event CTS */
  #define UARTE_INTENSET_CTS_Pos (0UL)
  #define UARTE_INTENSET_CTS_Msk (0x1UL << UARTE_INTENSET_CTS_Pos)
  #define UARTE_INTENSET_CTS_Min (0x0UL)
  #define UARTE_INTENSET_CTS_Max (0x1UL)
  #define UARTE_INTENSET_CTS_Set (0x1UL)
  #define UARTE_INTENSET_CTS_Disabled (0x0UL)
  #define UARTE_INTENSET_CTS_Enabled (0x1UL)

/* NCTS @Bit 1 : Write '1' to enable interrupt for event NCTS */
  #define UARTE_INTENSET_NCTS_Pos (1UL)
  #define UARTE_INTENSET_NCTS_Msk (0x1UL << UARTE_INTENSET_NCTS_Pos)
  #define UARTE_INTENSET_NCTS_Min (0x0UL)
  #define UARTE_INTENSET_NCTS_Max (0x1UL)
  #define UARTE_INTENSET_NCTS_Set (0x1UL)
  #define UARTE_INTENSET_NCTS_Disabled (0x0UL)
  #define UARTE_INTENSET_NCTS_Enabled (0x1UL)

/* TXDRDY @Bit 3 : Write '1' to enable interrupt for event TXDRDY */
  #define UARTE_INTENSET_TXDRDY_Pos (3UL)
  #define UARTE_INTENSET_TXDRDY_Msk (0x1UL << UARTE_INTENSET_TXDRDY_Pos)
  #define UARTE_INTENSET_TXDRDY_Min (0x0UL)
  #define UARTE_INTENSET_TXDRDY_Max (0x1UL)
  #define UARTE_INTENSET_TXDRDY_Set (0x1UL)
  #define UARTE_INTENSET_TXDRDY_Disabled (0x0UL)
  #define UARTE_INTENSET_TXDRDY_Enabled (0x1UL)

/* RXDRDY @Bit 4 : Write '1' to enable interrupt for event RXDRDY */
  #define UARTE_INTENSET_RXDRDY_Pos (4UL)
  #define UARTE_INTENSET_RXDRDY_Msk (0x1UL << UARTE_INTENSET_RXDRDY_Pos)
  #define UARTE_INTENSET_RXDRDY_Min (0x0UL)
  #define UARTE_INTENSET_RXDRDY_Max (0x1UL)
  #define UARTE_INTENSET_RXDRDY_Set (0x1UL)
  #define UARTE_INTENSET_RXDRDY_Disabled (0x0UL)
  #define UARTE_INTENSET_RXDRDY_Enabled (0x1UL)

