pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ERROR @Bit 5 : Write '1' to enable interrupt for event ERROR */
  #define UARTE_INTENSET_ERROR_Pos (5UL)
  #define UARTE_INTENSET_ERROR_Msk (0x1UL << UARTE_INTENSET_ERROR_Pos)
  #define UARTE_INTENSET_ERROR_Min (0x0UL)
  #define UARTE_INTENSET_ERROR_Max (0x1UL)
  #define UARTE_INTENSET_ERROR_Set (0x1UL)
  #define UARTE_INTENSET_ERROR_Disabled (0x0UL)
  #define UARTE_INTENSET_ERROR_Enabled (0x1UL)

/* RXTO @Bit 9 : Write '1' to enable interrupt for event RXTO */
  #define UARTE_INTENSET_RXTO_Pos (9UL)
  #define UARTE_INTENSET_RXTO_Msk (0x1UL << UARTE_INTENSET_RXTO_Pos)
  #define UARTE_INTENSET_RXTO_Min (0x0UL)
  #define UARTE_INTENSET_RXTO_Max (0x1UL)
  #define UARTE_INTENSET_RXTO_Set (0x1UL)
  #define UARTE_INTENSET_RXTO_Disabled (0x0UL)
  #define UARTE_INTENSET_RXTO_Enabled (0x1UL)

/* TXSTOPPED @Bit 12 : Write '1' to enable interrupt for event TXSTOPPED */
  #define UARTE_INTENSET_TXSTOPPED_Pos (12UL)
  #define UARTE_INTENSET_TXSTOPPED_Msk (0x1UL << UARTE_INTENSET_TXSTOPPED_Pos)
  #define UARTE_INTENSET_TXSTOPPED_Min (0x0UL)
  #define UARTE_INTENSET_TXSTOPPED_Max (0x1UL)
  #define UARTE_INTENSET_TXSTOPPED_Set (0x1UL)
  #define UARTE_INTENSET_TXSTOPPED_Disabled (0x0UL)
  #define UARTE_INTENSET_TXSTOPPED_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Write '1' to enable interrupt for event DMARXEND */
  #define UARTE_INTENSET_DMARXEND_Pos (19UL)
  #define UARTE_INTENSET_DMARXEND_Msk (0x1UL << UARTE_INTENSET_DMARXEND_Pos)
  #define UARTE_INTENSET_DMARXEND_Min (0x0UL)
  #define UARTE_INTENSET_DMARXEND_Max (0x1UL)
  #define UARTE_INTENSET_DMARXEND_Set (0x1UL)
  #define UARTE_INTENSET_DMARXEND_Disabled (0x0UL)
  #define UARTE_INTENSET_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Write '1' to enable interrupt for event DMARXREADY */
  #define UARTE_INTENSET_DMARXREADY_Pos (20UL)
  #define UARTE_INTENSET_DMARXREADY_Msk (0x1UL << UARTE_INTENSET_DMARXREADY_Pos)
  #define UARTE_INTENSET_DMARXREADY_Min (0x0UL)
  #define UARTE_INTENSET_DMARXREADY_Max (0x1UL)
  #define UARTE_INTENSET_DMARXREADY_Set (0x1UL)
  #define UARTE_INTENSET_DMARXREADY_Disabled (0x0UL)
  #define UARTE_INTENSET_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Write '1' to enable interrupt for event DMARXBUSERROR */
  #define UARTE_INTENSET_DMARXBUSERROR_Pos (21UL)
  #define UARTE_INTENSET_DMARXBUSERROR_Msk (0x1UL << UARTE_INTENSET_DMARXBUSERROR_Pos)
  #define UARTE_INTENSET_DMARXBUSERROR_Min (0x0UL)
  #define UARTE_INTENSET_DMARXBUSERROR_Max (0x1UL)
  #define UARTE_INTENSET_DMARXBUSERROR_Set (0x1UL)
  #define UARTE_INTENSET_DMARXBUSERROR_Disabled (0x0UL)
  #define UARTE_INTENSET_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Write '1' to enable interrupt for event DMARXMATCH[0] */
  #define UARTE_INTENSET_DMARXMATCH0_Pos (22UL)
  #define UARTE_INTENSET_DMARXMATCH0_Msk (0x1UL << UARTE_INTENSET_DMARXMATCH0_Pos)
  #define UARTE_INTENSET_DMARXMATCH0_Min (0x0UL)
  #define UARTE_INTENSET_DMARXMATCH0_Max (0x1UL)
  #define UARTE_INTENSET_DMARXMATCH0_Set (0x1UL)
  #define UARTE_INTENSET_DMARXMATCH0_Disabled (0x0UL)
  #define UARTE_INTENSET_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Write '1' to enable interrupt for event DMARXMATCH[1] */
  #define UARTE_INTENSET_DMARXMATCH1_Pos (23UL)
  #define UARTE_INTENSET_DMARXMATCH1_Msk (0x1UL << UARTE_INTENSET_DMARXMATCH1_Pos)
  #define UARTE_INTENSET_DMARXMATCH1_Min (0x0UL)
  #define UARTE_INTENSET_DMARXMATCH1_Max (0x1UL)
  #define UARTE_INTENSET_DMARXMATCH1_Set (0x1UL)
  #define UARTE_INTENSET_DMARXMATCH1_Disabled (0x0UL)
  #define UARTE_INTENSET_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Write '1' to enable interrupt for event DMARXMATCH[2] */
  #define UARTE_INTENSET_DMARXMATCH2_Pos (24UL)
  #define UARTE_INTENSET_DMARXMATCH2_Msk (0x1UL << UARTE_INTENSET_DMARXMATCH2_Pos)
  #define UARTE_INTENSET_DMARXMATCH2_Min (0x0UL)
  #define UARTE_INTENSET_DMARXMATCH2_Max (0x1UL)
  #define UARTE_INTENSET_DMARXMATCH2_Set (0x1UL)
  #define UARTE_INTENSET_DMARXMATCH2_Disabled (0x0UL)
  #define UARTE_INTENSET_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Write '1' to enable interrupt for event DMARXMATCH[3] */
  #define UARTE_INTENSET_DMARXMATCH3_Pos (25UL)
  #define UARTE_INTENSET_DMARXMATCH3_Msk (0x1UL << UARTE_INTENSET_DMARXMATCH3_Pos)
  #define UARTE_INTENSET_DMARXMATCH3_Min (0x0UL)
  #define UARTE_INTENSET_DMARXMATCH3_Max (0x1UL)
  #define UARTE_INTENSET_DMARXMATCH3_Set (0x1UL)
  #define UARTE_INTENSET_DMARXMATCH3_Disabled (0x0UL)
  #define UARTE_INTENSET_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Write '1' to enable interrupt for event DMATXEND */
  #define UARTE_INTENSET_DMATXEND_Pos (26UL)
  #define UARTE_INTENSET_DMATXEND_Msk (0x1UL << UARTE_INTENSET_DMATXEND_Pos)
  #define UARTE_INTENSET_DMATXEND_Min (0x0UL)
  #define UARTE_INTENSET_DMATXEND_Max (0x1UL)
  #define UARTE_INTENSET_DMATXEND_Set (0x1UL)
  #define UARTE_INTENSET_DMATXEND_Disabled (0x0UL)
  #define UARTE_INTENSET_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Write '1' to enable interrupt for event DMATXREADY */
  #define UARTE_INTENSET_DMATXREADY_Pos (27UL)
  #define UARTE_INTENSET_DMATXREADY_Msk (0x1UL << UARTE_INTENSET_DMATXREADY_Pos)
  #define UARTE_INTENSET_DMATXREADY_Min (0x0UL)
  #define UARTE_INTENSET_DMATXREADY_Max (0x1UL)
  #define UARTE_INTENSET_DMATXREADY_Set (0x1UL)
  #define UARTE_INTENSET_DMATXREADY_Disabled (0x0UL)
  #define UARTE_INTENSET_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Write '1' to enable interrupt for event DMATXBUSERROR */
  #define UARTE_INTENSET_DMATXBUSERROR_Pos (28UL)
  #define UARTE_INTENSET_DMATXBUSERROR_Msk (0x1UL << UARTE_INTENSET_DMATXBUSERROR_Pos)
  #define UARTE_INTENSET_DMATXBUSERROR_Min (0x0UL)
  #define UARTE_INTENSET_DMATXBUSERROR_Max (0x1UL)
  #define UARTE_INTENSET_DMATXBUSERROR_Set (0x1UL)
  #define UARTE_INTENSET_DMATXBUSERROR_Disabled (0x0UL)
  #define UARTE_INTENSET_DMATXBUSERROR_Enabled (0x1UL)

/* FRAMETIMEOUT @Bit 29 : Write '1' to enable interrupt for event FRAMETIMEOUT */
  #define UARTE_INTENSET_FRAMETIMEOUT_Pos (29UL)
  #define UARTE_INTENSET_FRAMETIMEOUT_Msk (0x1UL << UARTE_INTENSET_FRAMETIMEOUT_Pos)
  #define UARTE_INTENSET_FRAMETIMEOUT_Min (0x0UL)
  #define UARTE_INTENSET_FRAMETIMEOUT_Max (0x1UL)
  #define UARTE_INTENSET_FRAMETIMEOUT_Set (0x1UL)
  #define UARTE_INTENSET_FRAMETIMEOUT_Disabled (0x0UL)
  #define UARTE_INTENSET_FRAMETIMEOUT_Enabled (0x1UL)


/* UARTE_INTENCLR: Disable interrupt */
  #define UARTE_INTENCLR_ResetValue (0x00000000UL)

/* CTS @Bit 0 : Write '1' to disable interrupt for event CTS */
  #define UARTE_INTENCLR_CTS_Pos (0UL)
  #define UARTE_INTENCLR_CTS_Msk (0x1UL << UARTE_INTENCLR_CTS_Pos)
  #define UARTE_INTENCLR_CTS_Min (0x0UL)
  #define UARTE_INTENCLR_CTS_Max (0x1UL)
  #define UARTE_INTENCLR_CTS_Clear (0x1UL)
  #define UARTE_INTENCLR_CTS_Disabled (0x0UL)
  #define UARTE_INTENCLR_CTS_Enabled (0x1UL)

