pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* NCTS @Bit 1 : Write '1' to disable interrupt for event NCTS */
  #define UARTE_INTENCLR_NCTS_Pos (1UL)
  #define UARTE_INTENCLR_NCTS_Msk (0x1UL << UARTE_INTENCLR_NCTS_Pos)
  #define UARTE_INTENCLR_NCTS_Min (0x0UL)
  #define UARTE_INTENCLR_NCTS_Max (0x1UL)
  #define UARTE_INTENCLR_NCTS_Clear (0x1UL)
  #define UARTE_INTENCLR_NCTS_Disabled (0x0UL)
  #define UARTE_INTENCLR_NCTS_Enabled (0x1UL)

/* TXDRDY @Bit 3 : Write '1' to disable interrupt for event TXDRDY */
  #define UARTE_INTENCLR_TXDRDY_Pos (3UL)
  #define UARTE_INTENCLR_TXDRDY_Msk (0x1UL << UARTE_INTENCLR_TXDRDY_Pos)
  #define UARTE_INTENCLR_TXDRDY_Min (0x0UL)
  #define UARTE_INTENCLR_TXDRDY_Max (0x1UL)
  #define UARTE_INTENCLR_TXDRDY_Clear (0x1UL)
  #define UARTE_INTENCLR_TXDRDY_Disabled (0x0UL)
  #define UARTE_INTENCLR_TXDRDY_Enabled (0x1UL)

/* RXDRDY @Bit 4 : Write '1' to disable interrupt for event RXDRDY */
  #define UARTE_INTENCLR_RXDRDY_Pos (4UL)
  #define UARTE_INTENCLR_RXDRDY_Msk (0x1UL << UARTE_INTENCLR_RXDRDY_Pos)
  #define UARTE_INTENCLR_RXDRDY_Min (0x0UL)
  #define UARTE_INTENCLR_RXDRDY_Max (0x1UL)
  #define UARTE_INTENCLR_RXDRDY_Clear (0x1UL)
  #define UARTE_INTENCLR_RXDRDY_Disabled (0x0UL)
  #define UARTE_INTENCLR_RXDRDY_Enabled (0x1UL)

/* ERROR @Bit 5 : Write '1' to disable interrupt for event ERROR */
  #define UARTE_INTENCLR_ERROR_Pos (5UL)
  #define UARTE_INTENCLR_ERROR_Msk (0x1UL << UARTE_INTENCLR_ERROR_Pos)
  #define UARTE_INTENCLR_ERROR_Min (0x0UL)
  #define UARTE_INTENCLR_ERROR_Max (0x1UL)
  #define UARTE_INTENCLR_ERROR_Clear (0x1UL)
  #define UARTE_INTENCLR_ERROR_Disabled (0x0UL)
  #define UARTE_INTENCLR_ERROR_Enabled (0x1UL)

/* RXTO @Bit 9 : Write '1' to disable interrupt for event RXTO */
  #define UARTE_INTENCLR_RXTO_Pos (9UL)
  #define UARTE_INTENCLR_RXTO_Msk (0x1UL << UARTE_INTENCLR_RXTO_Pos)
  #define UARTE_INTENCLR_RXTO_Min (0x0UL)
  #define UARTE_INTENCLR_RXTO_Max (0x1UL)
  #define UARTE_INTENCLR_RXTO_Clear (0x1UL)
  #define UARTE_INTENCLR_RXTO_Disabled (0x0UL)
  #define UARTE_INTENCLR_RXTO_Enabled (0x1UL)

/* TXSTOPPED @Bit 12 : Write '1' to disable interrupt for event TXSTOPPED */
  #define UARTE_INTENCLR_TXSTOPPED_Pos (12UL)
  #define UARTE_INTENCLR_TXSTOPPED_Msk (0x1UL << UARTE_INTENCLR_TXSTOPPED_Pos)
  #define UARTE_INTENCLR_TXSTOPPED_Min (0x0UL)
  #define UARTE_INTENCLR_TXSTOPPED_Max (0x1UL)
  #define UARTE_INTENCLR_TXSTOPPED_Clear (0x1UL)
  #define UARTE_INTENCLR_TXSTOPPED_Disabled (0x0UL)
  #define UARTE_INTENCLR_TXSTOPPED_Enabled (0x1UL)

/* DMARXEND @Bit 19 : Write '1' to disable interrupt for event DMARXEND */
  #define UARTE_INTENCLR_DMARXEND_Pos (19UL)
  #define UARTE_INTENCLR_DMARXEND_Msk (0x1UL << UARTE_INTENCLR_DMARXEND_Pos)
  #define UARTE_INTENCLR_DMARXEND_Min (0x0UL)
  #define UARTE_INTENCLR_DMARXEND_Max (0x1UL)
  #define UARTE_INTENCLR_DMARXEND_Clear (0x1UL)
  #define UARTE_INTENCLR_DMARXEND_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMARXEND_Enabled (0x1UL)

/* DMARXREADY @Bit 20 : Write '1' to disable interrupt for event DMARXREADY */
  #define UARTE_INTENCLR_DMARXREADY_Pos (20UL)
  #define UARTE_INTENCLR_DMARXREADY_Msk (0x1UL << UARTE_INTENCLR_DMARXREADY_Pos)
  #define UARTE_INTENCLR_DMARXREADY_Min (0x0UL)
  #define UARTE_INTENCLR_DMARXREADY_Max (0x1UL)
  #define UARTE_INTENCLR_DMARXREADY_Clear (0x1UL)
  #define UARTE_INTENCLR_DMARXREADY_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMARXREADY_Enabled (0x1UL)

/* DMARXBUSERROR @Bit 21 : Write '1' to disable interrupt for event DMARXBUSERROR */
  #define UARTE_INTENCLR_DMARXBUSERROR_Pos (21UL)
  #define UARTE_INTENCLR_DMARXBUSERROR_Msk (0x1UL << UARTE_INTENCLR_DMARXBUSERROR_Pos)
  #define UARTE_INTENCLR_DMARXBUSERROR_Min (0x0UL)
  #define UARTE_INTENCLR_DMARXBUSERROR_Max (0x1UL)
  #define UARTE_INTENCLR_DMARXBUSERROR_Clear (0x1UL)
  #define UARTE_INTENCLR_DMARXBUSERROR_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMARXBUSERROR_Enabled (0x1UL)

/* DMARXMATCH0 @Bit 22 : Write '1' to disable interrupt for event DMARXMATCH[0] */
  #define UARTE_INTENCLR_DMARXMATCH0_Pos (22UL)
  #define UARTE_INTENCLR_DMARXMATCH0_Msk (0x1UL << UARTE_INTENCLR_DMARXMATCH0_Pos)
  #define UARTE_INTENCLR_DMARXMATCH0_Min (0x0UL)
  #define UARTE_INTENCLR_DMARXMATCH0_Max (0x1UL)
  #define UARTE_INTENCLR_DMARXMATCH0_Clear (0x1UL)
  #define UARTE_INTENCLR_DMARXMATCH0_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMARXMATCH0_Enabled (0x1UL)

/* DMARXMATCH1 @Bit 23 : Write '1' to disable interrupt for event DMARXMATCH[1] */
  #define UARTE_INTENCLR_DMARXMATCH1_Pos (23UL)
  #define UARTE_INTENCLR_DMARXMATCH1_Msk (0x1UL << UARTE_INTENCLR_DMARXMATCH1_Pos)
  #define UARTE_INTENCLR_DMARXMATCH1_Min (0x0UL)
  #define UARTE_INTENCLR_DMARXMATCH1_Max (0x1UL)
  #define UARTE_INTENCLR_DMARXMATCH1_Clear (0x1UL)
  #define UARTE_INTENCLR_DMARXMATCH1_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMARXMATCH1_Enabled (0x1UL)

/* DMARXMATCH2 @Bit 24 : Write '1' to disable interrupt for event DMARXMATCH[2] */
  #define UARTE_INTENCLR_DMARXMATCH2_Pos (24UL)
  #define UARTE_INTENCLR_DMARXMATCH2_Msk (0x1UL << UARTE_INTENCLR_DMARXMATCH2_Pos)
  #define UARTE_INTENCLR_DMARXMATCH2_Min (0x0UL)
  #define UARTE_INTENCLR_DMARXMATCH2_Max (0x1UL)
  #define UARTE_INTENCLR_DMARXMATCH2_Clear (0x1UL)
  #define UARTE_INTENCLR_DMARXMATCH2_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMARXMATCH2_Enabled (0x1UL)

/* DMARXMATCH3 @Bit 25 : Write '1' to disable interrupt for event DMARXMATCH[3] */
  #define UARTE_INTENCLR_DMARXMATCH3_Pos (25UL)
  #define UARTE_INTENCLR_DMARXMATCH3_Msk (0x1UL << UARTE_INTENCLR_DMARXMATCH3_Pos)
  #define UARTE_INTENCLR_DMARXMATCH3_Min (0x0UL)
  #define UARTE_INTENCLR_DMARXMATCH3_Max (0x1UL)
  #define UARTE_INTENCLR_DMARXMATCH3_Clear (0x1UL)
  #define UARTE_INTENCLR_DMARXMATCH3_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMARXMATCH3_Enabled (0x1UL)

/* DMATXEND @Bit 26 : Write '1' to disable interrupt for event DMATXEND */
  #define UARTE_INTENCLR_DMATXEND_Pos (26UL)
  #define UARTE_INTENCLR_DMATXEND_Msk (0x1UL << UARTE_INTENCLR_DMATXEND_Pos)
  #define UARTE_INTENCLR_DMATXEND_Min (0x0UL)
  #define UARTE_INTENCLR_DMATXEND_Max (0x1UL)
  #define UARTE_INTENCLR_DMATXEND_Clear (0x1UL)
  #define UARTE_INTENCLR_DMATXEND_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMATXEND_Enabled (0x1UL)

/* DMATXREADY @Bit 27 : Write '1' to disable interrupt for event DMATXREADY */
  #define UARTE_INTENCLR_DMATXREADY_Pos (27UL)
  #define UARTE_INTENCLR_DMATXREADY_Msk (0x1UL << UARTE_INTENCLR_DMATXREADY_Pos)
  #define UARTE_INTENCLR_DMATXREADY_Min (0x0UL)
  #define UARTE_INTENCLR_DMATXREADY_Max (0x1UL)
  #define UARTE_INTENCLR_DMATXREADY_Clear (0x1UL)
  #define UARTE_INTENCLR_DMATXREADY_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMATXREADY_Enabled (0x1UL)

/* DMATXBUSERROR @Bit 28 : Write '1' to disable interrupt for event DMATXBUSERROR */
  #define UARTE_INTENCLR_DMATXBUSERROR_Pos (28UL)
  #define UARTE_INTENCLR_DMATXBUSERROR_Msk (0x1UL << UARTE_INTENCLR_DMATXBUSERROR_Pos)
  #define UARTE_INTENCLR_DMATXBUSERROR_Min (0x0UL)
  #define UARTE_INTENCLR_DMATXBUSERROR_Max (0x1UL)
  #define UARTE_INTENCLR_DMATXBUSERROR_Clear (0x1UL)
  #define UARTE_INTENCLR_DMATXBUSERROR_Disabled (0x0UL)
  #define UARTE_INTENCLR_DMATXBUSERROR_Enabled (0x1UL)

