pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* FRAMETIMEOUT @Bit 29 : Write '1' to disable interrupt for event FRAMETIMEOUT */
  #define UARTE_INTENCLR_FRAMETIMEOUT_Pos (29UL)
  #define UARTE_INTENCLR_FRAMETIMEOUT_Msk (0x1UL << UARTE_INTENCLR_FRAMETIMEOUT_Pos)
  #define UARTE_INTENCLR_FRAMETIMEOUT_Min (0x0UL)
  #define UARTE_INTENCLR_FRAMETIMEOUT_Max (0x1UL)
  #define UARTE_INTENCLR_FRAMETIMEOUT_Clear (0x1UL)
  #define UARTE_INTENCLR_FRAMETIMEOUT_Disabled (0x0UL)
  #define UARTE_INTENCLR_FRAMETIMEOUT_Enabled (0x1UL)


/* UARTE_ERRORSRC: Error source */
  #define UARTE_ERRORSRC_ResetValue (0x00000000UL)

/* OVERRUN @Bit 0 : Overrun error */
  #define UARTE_ERRORSRC_OVERRUN_Pos (0UL)
  #define UARTE_ERRORSRC_OVERRUN_Msk (0x1UL << UARTE_ERRORSRC_OVERRUN_Pos)
  #define UARTE_ERRORSRC_OVERRUN_Min (0x0UL)
  #define UARTE_ERRORSRC_OVERRUN_Max (0x1UL)
  #define UARTE_ERRORSRC_OVERRUN_NotPresent (0x0UL)
  #define UARTE_ERRORSRC_OVERRUN_Present (0x1UL)

/* PARITY @Bit 1 : Parity error */
  #define UARTE_ERRORSRC_PARITY_Pos (1UL)
  #define UARTE_ERRORSRC_PARITY_Msk (0x1UL << UARTE_ERRORSRC_PARITY_Pos)
  #define UARTE_ERRORSRC_PARITY_Min (0x0UL)
  #define UARTE_ERRORSRC_PARITY_Max (0x1UL)
  #define UARTE_ERRORSRC_PARITY_NotPresent (0x0UL)
  #define UARTE_ERRORSRC_PARITY_Present (0x1UL)

/* FRAMING @Bit 2 : Framing error occurred */
  #define UARTE_ERRORSRC_FRAMING_Pos (2UL)
  #define UARTE_ERRORSRC_FRAMING_Msk (0x1UL << UARTE_ERRORSRC_FRAMING_Pos)
  #define UARTE_ERRORSRC_FRAMING_Min (0x0UL)
  #define UARTE_ERRORSRC_FRAMING_Max (0x1UL)
  #define UARTE_ERRORSRC_FRAMING_NotPresent (0x0UL)
  #define UARTE_ERRORSRC_FRAMING_Present (0x1UL)

/* BREAK @Bit 3 : Break condition */
  #define UARTE_ERRORSRC_BREAK_Pos (3UL)
  #define UARTE_ERRORSRC_BREAK_Msk (0x1UL << UARTE_ERRORSRC_BREAK_Pos)
  #define UARTE_ERRORSRC_BREAK_Min (0x0UL)
  #define UARTE_ERRORSRC_BREAK_Max (0x1UL)
  #define UARTE_ERRORSRC_BREAK_NotPresent (0x0UL)
  #define UARTE_ERRORSRC_BREAK_Present (0x1UL)


/* UARTE_ENABLE: Enable UART */
  #define UARTE_ENABLE_ResetValue (0x00000000UL)

/* ENABLE @Bits 0..3 : Enable or disable UARTE */
  #define UARTE_ENABLE_ENABLE_Pos (0UL)
  #define UARTE_ENABLE_ENABLE_Msk (0xFUL << UARTE_ENABLE_ENABLE_Pos)
  #define UARTE_ENABLE_ENABLE_Min (0x0UL)
  #define UARTE_ENABLE_ENABLE_Max (0x8UL)
  #define UARTE_ENABLE_ENABLE_Disabled (0x0UL)
  #define UARTE_ENABLE_ENABLE_Enabled (0x8UL)


/* UARTE_BAUDRATE: Baud rate. Accuracy depends on the HFCLK source selected. */
  #define UARTE_BAUDRATE_ResetValue (0x04000000UL)

/* BAUDRATE @Bits 0..31 : Baud rate */
  #define UARTE_BAUDRATE_BAUDRATE_Pos (0UL)
  #define UARTE_BAUDRATE_BAUDRATE_Msk (0xFFFFFFFFUL << UARTE_BAUDRATE_BAUDRATE_Pos)
  #define UARTE_BAUDRATE_BAUDRATE_Min (0x4F000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Max (0x10000000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud1200 (0x0004F000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud2400 (0x0009D000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud4800 (0x0013B000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud9600 (0x00275000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud14400 (0x003AF000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud19200 (0x004EA000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud28800 (0x0075C000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud31250 (0x00800000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud38400 (0x009D0000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud56000 (0x00E50000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud57600 (0x00EB0000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud76800 (0x013A9000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud115200 (0x01D60000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud230400 (0x03B00000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud250000 (0x04000000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud460800 (0x07400000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud921600 (0x0F000000UL)
  #define UARTE_BAUDRATE_BAUDRATE_Baud1M (0x10000000UL)


/* UARTE_CONFIG: Configuration of parity, hardware flow control, framesize, and packet timeout. */
  #define UARTE_CONFIG_ResetValue (0x00001000UL)

/* HWFC @Bit 0 : Hardware flow control */
  #define UARTE_CONFIG_HWFC_Pos (0UL)
  #define UARTE_CONFIG_HWFC_Msk (0x1UL << UARTE_CONFIG_HWFC_Pos)
  #define UARTE_CONFIG_HWFC_Min (0x0UL)
  #define UARTE_CONFIG_HWFC_Max (0x1UL)
  #define UARTE_CONFIG_HWFC_Disabled (0x0UL)
  #define UARTE_CONFIG_HWFC_Enabled (0x1UL)

/* PARITY @Bits 1..3 : Parity */
  #define UARTE_CONFIG_PARITY_Pos (1UL)
  #define UARTE_CONFIG_PARITY_Msk (0x7UL << UARTE_CONFIG_PARITY_Pos)
  #define UARTE_CONFIG_PARITY_Min (0x0UL)
  #define UARTE_CONFIG_PARITY_Max (0x7UL)
  #define UARTE_CONFIG_PARITY_Excluded (0x0UL)
  #define UARTE_CONFIG_PARITY_Included (0x7UL)

/* STOP @Bit 4 : Stop bits */
  #define UARTE_CONFIG_STOP_Pos (4UL)
  #define UARTE_CONFIG_STOP_Msk (0x1UL << UARTE_CONFIG_STOP_Pos)
  #define UARTE_CONFIG_STOP_Min (0x0UL)
  #define UARTE_CONFIG_STOP_Max (0x1UL)
  #define UARTE_CONFIG_STOP_One (0x0UL)
  #define UARTE_CONFIG_STOP_Two (0x1UL)

/* PARITYTYPE @Bit 8 : Even or odd parity type */
  #define UARTE_CONFIG_PARITYTYPE_Pos (8UL)
  #define UARTE_CONFIG_PARITYTYPE_Msk (0x1UL << UARTE_CONFIG_PARITYTYPE_Pos)
  #define UARTE_CONFIG_PARITYTYPE_Min (0x0UL)
  #define UARTE_CONFIG_PARITYTYPE_Max (0x1UL)
  #define UARTE_CONFIG_PARITYTYPE_Even (0x0UL)
  #define UARTE_CONFIG_PARITYTYPE_Odd (0x1UL)

/* FRAMESIZE @Bits 9..12 : Set the data frame size */
  #define UARTE_CONFIG_FRAMESIZE_Pos (9UL)
  #define UARTE_CONFIG_FRAMESIZE_Msk (0xFUL << UARTE_CONFIG_FRAMESIZE_Pos)
  #define UARTE_CONFIG_FRAMESIZE_Min (0x4UL)
  #define UARTE_CONFIG_FRAMESIZE_Max (0x9UL)
  #define UARTE_CONFIG_FRAMESIZE_9bit (0x9UL)
  #define UARTE_CONFIG_FRAMESIZE_8bit (0x8UL)
  #define UARTE_CONFIG_FRAMESIZE_7bit (0x7UL)
  #define UARTE_CONFIG_FRAMESIZE_6bit (0x6UL)
  #define UARTE_CONFIG_FRAMESIZE_5bit (0x5UL)
  #define UARTE_CONFIG_FRAMESIZE_4bit (0x4UL)

/* ENDIAN @Bit 13 : Select if data is trimmed from MSB or LSB end when the data frame size is less than 8. */
  #define UARTE_CONFIG_ENDIAN_Pos (13UL)
  #define UARTE_CONFIG_ENDIAN_Msk (0x1UL << UARTE_CONFIG_ENDIAN_Pos)
  #define UARTE_CONFIG_ENDIAN_Min (0x0UL)
  #define UARTE_CONFIG_ENDIAN_Max (0x1UL)
  #define UARTE_CONFIG_ENDIAN_MSB (0x0UL)
  #define UARTE_CONFIG_ENDIAN_LSB (0x1UL)

/* FRAMETIMEOUT @Bit 14 : Enable packet timeout. */
  #define UARTE_CONFIG_FRAMETIMEOUT_Pos (14UL)
  #define UARTE_CONFIG_FRAMETIMEOUT_Msk (0x1UL << UARTE_CONFIG_FRAMETIMEOUT_Pos)
  #define UARTE_CONFIG_FRAMETIMEOUT_Min (0x0UL)
  #define UARTE_CONFIG_FRAMETIMEOUT_Max (0x1UL)
  #define UARTE_CONFIG_FRAMETIMEOUT_DISABLED (0x0UL)
  #define UARTE_CONFIG_FRAMETIMEOUT_ENABLED (0x1UL)


/* UARTE_ADDRESS: Set the address of the UARTE for RX when used in 9 bit data frame mode. */
  #define UARTE_ADDRESS_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..7 : Set address */
  #define UARTE_ADDRESS_ADDRESS_Pos (0UL)
  #define UARTE_ADDRESS_ADDRESS_Msk (0xFFUL << UARTE_ADDRESS_ADDRESS_Pos)


/* UARTE_FRAMETIMEOUT: Set the number of UARTE bits to count before triggering packet timeout. */
  #define UARTE_FRAMETIMEOUT_ResetValue (0x00000010UL)

/* COUNTERTOP @Bits 0..9 : Number of UARTE bits before timeout. */
  #define UARTE_FRAMETIMEOUT_COUNTERTOP_Pos (0UL)
  #define UARTE_FRAMETIMEOUT_COUNTERTOP_Msk (0x3FFUL << UARTE_FRAMETIMEOUT_COUNTERTOP_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           UICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct UICR_MEM ===================================================== */
/**
  * @brief MEM [UICR_MEM] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;
  __IOM uint32_t  SIZE;
} NRF_UICR_MEM_Type;
  #define UICR_MEM_MaxCount (16UL)
  #define UICR_MEM_MaxIndex (15UL)
  #define UICR_MEM_MinIndex (0UL)

/* UICR_MEM_CONFIG: Memory configuration of the memory region */
  #define UICR_MEM_CONFIG_ResetValue (0xFFFFFFFFUL)

/* READ @Bit 0 : (unspecified) */
  #define UICR_MEM_CONFIG_READ_Pos (0UL)
  #define UICR_MEM_CONFIG_READ_Msk (0x1UL << UICR_MEM_CONFIG_READ_Pos)
  #define UICR_MEM_CONFIG_READ_Min (0x0UL)
  #define UICR_MEM_CONFIG_READ_Max (0x1UL)
  #define UICR_MEM_CONFIG_READ_NotAllowed (0x1UL)
  #define UICR_MEM_CONFIG_READ_Allowed (0x0UL)

/* WRITE @Bit 1 : (unspecified) */
  #define UICR_MEM_CONFIG_WRITE_Pos (1UL)
  #define UICR_MEM_CONFIG_WRITE_Msk (0x1UL << UICR_MEM_CONFIG_WRITE_Pos)
  #define UICR_MEM_CONFIG_WRITE_Min (0x0UL)
  #define UICR_MEM_CONFIG_WRITE_Max (0x1UL)
  #define UICR_MEM_CONFIG_WRITE_NotAllowed (0x1UL)
  #define UICR_MEM_CONFIG_WRITE_Allowed (0x0UL)

/* EXECUTE @Bit 2 : (unspecified) */
  #define UICR_MEM_CONFIG_EXECUTE_Pos (2UL)
  #define UICR_MEM_CONFIG_EXECUTE_Msk (0x1UL << UICR_MEM_CONFIG_EXECUTE_Pos)
  #define UICR_MEM_CONFIG_EXECUTE_Min (0x0UL)
  #define UICR_MEM_CONFIG_EXECUTE_Max (0x1UL)
  #define UICR_MEM_CONFIG_EXECUTE_NotAllowed (0x1UL)
  #define UICR_MEM_CONFIG_EXECUTE_Allowed (0x0UL)

/* SECURE @Bit 3 : (unspecified) */
  #define UICR_MEM_CONFIG_SECURE_Pos (3UL)
  #define UICR_MEM_CONFIG_SECURE_Msk (0x1UL << UICR_MEM_CONFIG_SECURE_Pos)
  #define UICR_MEM_CONFIG_SECURE_Min (0x0UL)
  #define UICR_MEM_CONFIG_SECURE_Max (0x1UL)
  #define UICR_MEM_CONFIG_SECURE_Secure (0x1UL)
  #define UICR_MEM_CONFIG_SECURE_NonSecure (0x0UL)

