pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* NSC @Bit 4 : (unspecified) */
  #define UICR_MEM_CONFIG_NSC_Pos (4UL)
  #define UICR_MEM_CONFIG_NSC_Msk (0x1UL << UICR_MEM_CONFIG_NSC_Pos)
  #define UICR_MEM_CONFIG_NSC_Min (0x0UL)
  #define UICR_MEM_CONFIG_NSC_Max (0x1UL)
  #define UICR_MEM_CONFIG_NSC_Disabled (0x1UL)
  #define UICR_MEM_CONFIG_NSC_Enabled (0x0UL)

/* OWNERID @Bits 8..11 : Memory owner identification */
  #define UICR_MEM_CONFIG_OWNERID_Pos (8UL)
  #define UICR_MEM_CONFIG_OWNERID_Msk (0xFUL << UICR_MEM_CONFIG_OWNERID_Pos)
  #define UICR_MEM_CONFIG_OWNERID_Min (0x0UL)
  #define UICR_MEM_CONFIG_OWNERID_Max (0xFUL)

/* ADDRESS @Bits 12..31 : Memory region start address, bits [31:12] */
  #define UICR_MEM_CONFIG_ADDRESS_Pos (12UL)
  #define UICR_MEM_CONFIG_ADDRESS_Msk (0xFFFFFUL << UICR_MEM_CONFIG_ADDRESS_Pos)


/* UICR_MEM_SIZE: Size of the memory region */
  #define UICR_MEM_SIZE_ResetValue (0xFFFFFFFFUL)

/* SIZE @Bits 0..31 : Memory size in bytes */
  #define UICR_MEM_SIZE_SIZE_Pos (0UL)
  #define UICR_MEM_SIZE_SIZE_Msk (0xFFFFFFFFUL << UICR_MEM_SIZE_SIZE_Pos)



/* =================================================== Struct UICR_PERIPH ==================================================== */
/**
  * @brief PERIPH [UICR_PERIPH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONFIG;
} NRF_UICR_PERIPH_Type;
  #define UICR_PERIPH_MaxCount (192UL)
  #define UICR_PERIPH_MaxIndex (191UL)
  #define UICR_PERIPH_MinIndex (0UL)

/* UICR_PERIPH_CONFIG: Peripheral configuration */
  #define UICR_PERIPH_CONFIG_ResetValue (0xFFFFFFFFUL)

/* SECURE @Bit 3 : Peripheral security mapping */
  #define UICR_PERIPH_CONFIG_SECURE_Pos (3UL)
  #define UICR_PERIPH_CONFIG_SECURE_Msk (0x1UL << UICR_PERIPH_CONFIG_SECURE_Pos)
  #define UICR_PERIPH_CONFIG_SECURE_Min (0x0UL)
  #define UICR_PERIPH_CONFIG_SECURE_Max (0x1UL)
  #define UICR_PERIPH_CONFIG_SECURE_Secure (0x1UL)
  #define UICR_PERIPH_CONFIG_SECURE_NonSecure (0x0UL)

/* DMASEC @Bit 5 : Security attribution for the DMA transfer */
  #define UICR_PERIPH_CONFIG_DMASEC_Pos (5UL)
  #define UICR_PERIPH_CONFIG_DMASEC_Msk (0x1UL << UICR_PERIPH_CONFIG_DMASEC_Pos)
  #define UICR_PERIPH_CONFIG_DMASEC_Min (0x0UL)
  #define UICR_PERIPH_CONFIG_DMASEC_Max (0x1UL)
  #define UICR_PERIPH_CONFIG_DMASEC_Secure (0x1UL)   /*!< DMA transfers initiated by this peripheral have the secure attribute
                                                          set*/
  #define UICR_PERIPH_CONFIG_DMASEC_NonSecure (0x0UL) /*!< DMA transfers initiated by this peripheral have the non-secure
                                                           attribute set*/

/* PROCESSOR @Bits 8..11 : Processor ID of the processor that will receive the peripheral IRQ */
  #define UICR_PERIPH_CONFIG_PROCESSOR_Pos (8UL)
  #define UICR_PERIPH_CONFIG_PROCESSOR_Msk (0xFUL << UICR_PERIPH_CONFIG_PROCESSOR_Pos)

/* ADDRESS @Bits 12..31 : Peripheral address, bits [31:12] */
  #define UICR_PERIPH_CONFIG_ADDRESS_Pos (12UL)
  #define UICR_PERIPH_CONFIG_ADDRESS_Msk (0xFFFFFUL << UICR_PERIPH_CONFIG_ADDRESS_Pos)



/* ================================================== Struct UICR_GPIOTE_CH ================================================== */
/**
  * @brief CH [UICR_GPIOTE_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;
  __IOM uint32_t  SECURE;
} NRF_UICR_GPIOTE_CH_Type;

/* UICR_GPIOTE_CH_OWN: Request ownership of the channels of GPIOTE[n] */
  #define UICR_GPIOTE_CH_OWN_ResetValue (0xFFFFFFFFUL)

/* CH0 @Bit 0 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH0_Pos (0UL)
  #define UICR_GPIOTE_CH_OWN_CH0_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH0_Pos)
  #define UICR_GPIOTE_CH_OWN_CH0_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH0_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH0_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH0_Own (0x0UL)

/* CH1 @Bit 1 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH1_Pos (1UL)
  #define UICR_GPIOTE_CH_OWN_CH1_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH1_Pos)
  #define UICR_GPIOTE_CH_OWN_CH1_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH1_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH1_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH1_Own (0x0UL)

/* CH2 @Bit 2 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH2_Pos (2UL)
  #define UICR_GPIOTE_CH_OWN_CH2_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH2_Pos)
  #define UICR_GPIOTE_CH_OWN_CH2_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH2_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH2_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH2_Own (0x0UL)

/* CH3 @Bit 3 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH3_Pos (3UL)
  #define UICR_GPIOTE_CH_OWN_CH3_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH3_Pos)
  #define UICR_GPIOTE_CH_OWN_CH3_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH3_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH3_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH3_Own (0x0UL)

/* CH4 @Bit 4 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH4_Pos (4UL)
  #define UICR_GPIOTE_CH_OWN_CH4_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH4_Pos)
  #define UICR_GPIOTE_CH_OWN_CH4_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH4_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH4_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH4_Own (0x0UL)

/* CH5 @Bit 5 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH5_Pos (5UL)
  #define UICR_GPIOTE_CH_OWN_CH5_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH5_Pos)
  #define UICR_GPIOTE_CH_OWN_CH5_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH5_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH5_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH5_Own (0x0UL)

/* CH6 @Bit 6 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH6_Pos (6UL)
  #define UICR_GPIOTE_CH_OWN_CH6_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH6_Pos)
  #define UICR_GPIOTE_CH_OWN_CH6_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH6_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH6_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH6_Own (0x0UL)

/* CH7 @Bit 7 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH7_Pos (7UL)
  #define UICR_GPIOTE_CH_OWN_CH7_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH7_Pos)
  #define UICR_GPIOTE_CH_OWN_CH7_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH7_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH7_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH7_Own (0x0UL)

