pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH8 @Bit 8 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH8_Pos (8UL)
  #define UICR_GPIOTE_CH_OWN_CH8_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH8_Pos)
  #define UICR_GPIOTE_CH_OWN_CH8_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH8_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH8_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH8_Own (0x0UL)

/* CH9 @Bit 9 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH9_Pos (9UL)
  #define UICR_GPIOTE_CH_OWN_CH9_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH9_Pos)
  #define UICR_GPIOTE_CH_OWN_CH9_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH9_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH9_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH9_Own (0x0UL)

/* CH10 @Bit 10 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH10_Pos (10UL)
  #define UICR_GPIOTE_CH_OWN_CH10_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH10_Pos)
  #define UICR_GPIOTE_CH_OWN_CH10_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH10_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH10_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH10_Own (0x0UL)

/* CH11 @Bit 11 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH11_Pos (11UL)
  #define UICR_GPIOTE_CH_OWN_CH11_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH11_Pos)
  #define UICR_GPIOTE_CH_OWN_CH11_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH11_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH11_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH11_Own (0x0UL)

/* CH12 @Bit 12 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH12_Pos (12UL)
  #define UICR_GPIOTE_CH_OWN_CH12_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH12_Pos)
  #define UICR_GPIOTE_CH_OWN_CH12_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH12_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH12_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH12_Own (0x0UL)

/* CH13 @Bit 13 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH13_Pos (13UL)
  #define UICR_GPIOTE_CH_OWN_CH13_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH13_Pos)
  #define UICR_GPIOTE_CH_OWN_CH13_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH13_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH13_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH13_Own (0x0UL)

/* CH14 @Bit 14 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH14_Pos (14UL)
  #define UICR_GPIOTE_CH_OWN_CH14_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH14_Pos)
  #define UICR_GPIOTE_CH_OWN_CH14_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH14_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH14_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH14_Own (0x0UL)

/* CH15 @Bit 15 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH15_Pos (15UL)
  #define UICR_GPIOTE_CH_OWN_CH15_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH15_Pos)
  #define UICR_GPIOTE_CH_OWN_CH15_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH15_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH15_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH15_Own (0x0UL)

/* CH16 @Bit 16 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH16_Pos (16UL)
  #define UICR_GPIOTE_CH_OWN_CH16_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH16_Pos)
  #define UICR_GPIOTE_CH_OWN_CH16_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH16_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH16_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH16_Own (0x0UL)

/* CH17 @Bit 17 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH17_Pos (17UL)
  #define UICR_GPIOTE_CH_OWN_CH17_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH17_Pos)
  #define UICR_GPIOTE_CH_OWN_CH17_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH17_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH17_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH17_Own (0x0UL)

/* CH18 @Bit 18 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH18_Pos (18UL)
  #define UICR_GPIOTE_CH_OWN_CH18_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH18_Pos)
  #define UICR_GPIOTE_CH_OWN_CH18_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH18_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH18_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH18_Own (0x0UL)

/* CH19 @Bit 19 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH19_Pos (19UL)
  #define UICR_GPIOTE_CH_OWN_CH19_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH19_Pos)
  #define UICR_GPIOTE_CH_OWN_CH19_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH19_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH19_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH19_Own (0x0UL)

/* CH20 @Bit 20 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH20_Pos (20UL)
  #define UICR_GPIOTE_CH_OWN_CH20_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH20_Pos)
  #define UICR_GPIOTE_CH_OWN_CH20_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH20_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH20_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH20_Own (0x0UL)

/* CH21 @Bit 21 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH21_Pos (21UL)
  #define UICR_GPIOTE_CH_OWN_CH21_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH21_Pos)
  #define UICR_GPIOTE_CH_OWN_CH21_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH21_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH21_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH21_Own (0x0UL)

/* CH22 @Bit 22 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH22_Pos (22UL)
  #define UICR_GPIOTE_CH_OWN_CH22_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH22_Pos)
  #define UICR_GPIOTE_CH_OWN_CH22_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH22_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH22_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH22_Own (0x0UL)

/* CH23 @Bit 23 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH23_Pos (23UL)
  #define UICR_GPIOTE_CH_OWN_CH23_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH23_Pos)
  #define UICR_GPIOTE_CH_OWN_CH23_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH23_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH23_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH23_Own (0x0UL)

/* CH24 @Bit 24 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH24_Pos (24UL)
  #define UICR_GPIOTE_CH_OWN_CH24_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH24_Pos)
  #define UICR_GPIOTE_CH_OWN_CH24_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH24_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH24_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH24_Own (0x0UL)

/* CH25 @Bit 25 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH25_Pos (25UL)
  #define UICR_GPIOTE_CH_OWN_CH25_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH25_Pos)
  #define UICR_GPIOTE_CH_OWN_CH25_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH25_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH25_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH25_Own (0x0UL)

/* CH26 @Bit 26 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH26_Pos (26UL)
  #define UICR_GPIOTE_CH_OWN_CH26_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH26_Pos)
  #define UICR_GPIOTE_CH_OWN_CH26_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH26_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH26_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH26_Own (0x0UL)

