pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH27 @Bit 27 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH27_Pos (27UL)
  #define UICR_GPIOTE_CH_OWN_CH27_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH27_Pos)
  #define UICR_GPIOTE_CH_OWN_CH27_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH27_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH27_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH27_Own (0x0UL)

/* CH28 @Bit 28 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH28_Pos (28UL)
  #define UICR_GPIOTE_CH_OWN_CH28_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH28_Pos)
  #define UICR_GPIOTE_CH_OWN_CH28_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH28_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH28_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH28_Own (0x0UL)

/* CH29 @Bit 29 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH29_Pos (29UL)
  #define UICR_GPIOTE_CH_OWN_CH29_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH29_Pos)
  #define UICR_GPIOTE_CH_OWN_CH29_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH29_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH29_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH29_Own (0x0UL)

/* CH30 @Bit 30 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH30_Pos (30UL)
  #define UICR_GPIOTE_CH_OWN_CH30_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH30_Pos)
  #define UICR_GPIOTE_CH_OWN_CH30_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH30_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH30_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH30_Own (0x0UL)

/* CH31 @Bit 31 : Channel number */
  #define UICR_GPIOTE_CH_OWN_CH31_Pos (31UL)
  #define UICR_GPIOTE_CH_OWN_CH31_Msk (0x1UL << UICR_GPIOTE_CH_OWN_CH31_Pos)
  #define UICR_GPIOTE_CH_OWN_CH31_Min (0x0UL)
  #define UICR_GPIOTE_CH_OWN_CH31_Max (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH31_NotOwn (0x1UL)
  #define UICR_GPIOTE_CH_OWN_CH31_Own (0x0UL)


/* UICR_GPIOTE_CH_SECURE: Request permission for the channels of GPIOTE[n] */
  #define UICR_GPIOTE_CH_SECURE_ResetValue (0xFFFFFFFFUL)

/* CH0 @Bit 0 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH0_Pos (0UL)
  #define UICR_GPIOTE_CH_SECURE_CH0_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH0_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH0_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH0_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH0_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH0_NonSecure (0x0UL)

/* CH1 @Bit 1 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH1_Pos (1UL)
  #define UICR_GPIOTE_CH_SECURE_CH1_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH1_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH1_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH1_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH1_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH1_NonSecure (0x0UL)

/* CH2 @Bit 2 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH2_Pos (2UL)
  #define UICR_GPIOTE_CH_SECURE_CH2_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH2_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH2_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH2_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH2_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH2_NonSecure (0x0UL)

/* CH3 @Bit 3 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH3_Pos (3UL)
  #define UICR_GPIOTE_CH_SECURE_CH3_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH3_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH3_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH3_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH3_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH3_NonSecure (0x0UL)

/* CH4 @Bit 4 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH4_Pos (4UL)
  #define UICR_GPIOTE_CH_SECURE_CH4_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH4_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH4_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH4_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH4_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH4_NonSecure (0x0UL)

/* CH5 @Bit 5 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH5_Pos (5UL)
  #define UICR_GPIOTE_CH_SECURE_CH5_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH5_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH5_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH5_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH5_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH5_NonSecure (0x0UL)

/* CH6 @Bit 6 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH6_Pos (6UL)
  #define UICR_GPIOTE_CH_SECURE_CH6_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH6_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH6_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH6_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH6_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH6_NonSecure (0x0UL)

/* CH7 @Bit 7 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH7_Pos (7UL)
  #define UICR_GPIOTE_CH_SECURE_CH7_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH7_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH7_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH7_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH7_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH7_NonSecure (0x0UL)

/* CH8 @Bit 8 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH8_Pos (8UL)
  #define UICR_GPIOTE_CH_SECURE_CH8_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH8_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH8_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH8_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH8_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH8_NonSecure (0x0UL)

/* CH9 @Bit 9 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH9_Pos (9UL)
  #define UICR_GPIOTE_CH_SECURE_CH9_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH9_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH9_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH9_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH9_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH9_NonSecure (0x0UL)

/* CH10 @Bit 10 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH10_Pos (10UL)
  #define UICR_GPIOTE_CH_SECURE_CH10_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH10_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH10_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH10_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH10_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH10_NonSecure (0x0UL)

/* CH11 @Bit 11 : Channel number */
  #define UICR_GPIOTE_CH_SECURE_CH11_Pos (11UL)
  #define UICR_GPIOTE_CH_SECURE_CH11_Msk (0x1UL << UICR_GPIOTE_CH_SECURE_CH11_Pos)
  #define UICR_GPIOTE_CH_SECURE_CH11_Min (0x0UL)
  #define UICR_GPIOTE_CH_SECURE_CH11_Max (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH11_Secure (0x1UL)
  #define UICR_GPIOTE_CH_SECURE_CH11_NonSecure (0x0UL)

