pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define UICR_GPIOTE_MaxCount (4UL)
  #define UICR_GPIOTE_MaxIndex (3UL)
  #define UICR_GPIOTE_MinIndex (0UL)

/* UICR_GPIOTE_INSTANCE: Address of the GPIOTE instance associated with GPIOTE[n] */
  #define UICR_GPIOTE_INSTANCE_ResetValue (0xFFFFFFFFUL)

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICR_GPIOTE_INSTANCE_ADDRESS_Pos (0UL)
  #define UICR_GPIOTE_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICR_GPIOTE_INSTANCE_ADDRESS_Pos)



/* ================================================ Struct UICR_IPCT_LOCAL_CH ================================================ */
/**
  * @brief CH [UICR_IPCT_LOCAL_CH] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000000) Request permission for the channels of IPCT in the
                                                                         local domain*/
} NRF_UICR_IPCT_LOCAL_CH_Type;

/* UICR_IPCT_LOCAL_CH_SECURE: Request permission for the channels of IPCT in the local domain */
  #define UICR_IPCT_LOCAL_CH_SECURE_ResetValue (0xFFFFFFFFUL)

/* CH0 @Bit 0 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Pos (0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH0_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH0_NonSecure (0x0UL)

/* CH1 @Bit 1 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Pos (1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH1_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH1_NonSecure (0x0UL)

/* CH2 @Bit 2 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Pos (2UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH2_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH2_NonSecure (0x0UL)

/* CH3 @Bit 3 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Pos (3UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH3_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH3_NonSecure (0x0UL)

/* CH4 @Bit 4 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Pos (4UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH4_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH4_NonSecure (0x0UL)

/* CH5 @Bit 5 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Pos (5UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH5_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH5_NonSecure (0x0UL)

/* CH6 @Bit 6 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Pos (6UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH6_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH6_NonSecure (0x0UL)

/* CH7 @Bit 7 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Pos (7UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH7_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH7_NonSecure (0x0UL)

/* CH8 @Bit 8 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH8_Pos (8UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH8_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH8_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH8_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH8_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH8_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH8_NonSecure (0x0UL)

/* CH9 @Bit 9 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH9_Pos (9UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH9_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH9_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH9_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH9_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH9_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH9_NonSecure (0x0UL)

/* CH10 @Bit 10 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH10_Pos (10UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH10_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH10_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH10_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH10_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH10_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH10_NonSecure (0x0UL)

/* CH11 @Bit 11 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH11_Pos (11UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH11_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH11_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH11_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH11_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH11_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH11_NonSecure (0x0UL)

/* CH12 @Bit 12 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH12_Pos (12UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH12_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH12_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH12_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH12_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH12_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH12_NonSecure (0x0UL)

/* CH13 @Bit 13 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH13_Pos (13UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH13_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH13_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH13_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH13_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH13_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH13_NonSecure (0x0UL)

/* CH14 @Bit 14 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH14_Pos (14UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH14_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH14_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH14_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH14_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH14_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH14_NonSecure (0x0UL)

/* CH15 @Bit 15 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH15_Pos (15UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH15_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH15_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH15_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH15_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH15_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH15_NonSecure (0x0UL)

/* CH16 @Bit 16 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH16_Pos (16UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH16_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH16_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH16_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH16_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH16_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH16_NonSecure (0x0UL)

