pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH17 @Bit 17 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH17_Pos (17UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH17_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH17_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH17_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH17_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH17_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH17_NonSecure (0x0UL)

/* CH18 @Bit 18 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH18_Pos (18UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH18_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH18_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH18_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH18_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH18_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH18_NonSecure (0x0UL)

/* CH19 @Bit 19 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH19_Pos (19UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH19_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH19_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH19_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH19_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH19_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH19_NonSecure (0x0UL)

/* CH20 @Bit 20 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH20_Pos (20UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH20_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH20_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH20_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH20_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH20_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH20_NonSecure (0x0UL)

/* CH21 @Bit 21 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH21_Pos (21UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH21_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH21_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH21_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH21_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH21_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH21_NonSecure (0x0UL)

/* CH22 @Bit 22 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH22_Pos (22UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH22_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH22_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH22_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH22_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH22_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH22_NonSecure (0x0UL)

/* CH23 @Bit 23 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH23_Pos (23UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH23_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH23_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH23_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH23_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH23_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH23_NonSecure (0x0UL)

/* CH24 @Bit 24 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH24_Pos (24UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH24_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH24_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH24_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH24_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH24_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH24_NonSecure (0x0UL)

/* CH25 @Bit 25 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH25_Pos (25UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH25_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH25_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH25_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH25_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH25_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH25_NonSecure (0x0UL)

/* CH26 @Bit 26 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH26_Pos (26UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH26_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH26_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH26_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH26_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH26_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH26_NonSecure (0x0UL)

/* CH27 @Bit 27 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Pos (27UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH27_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH27_NonSecure (0x0UL)

/* CH28 @Bit 28 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Pos (28UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH28_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH28_NonSecure (0x0UL)

/* CH29 @Bit 29 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Pos (29UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH29_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH29_NonSecure (0x0UL)

/* CH30 @Bit 30 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Pos (30UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH30_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH30_NonSecure (0x0UL)

/* CH31 @Bit 31 : Channel number */
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Pos (31UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Msk (0x1UL << UICR_IPCT_LOCAL_CH_SECURE_CH31_Pos)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Min (0x0UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Max (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_CH_SECURE_CH31_NonSecure (0x0UL)



/* ============================================ Struct UICR_IPCT_LOCAL_INTERRUPT ============================================= */
/**
  * @brief INTERRUPT [UICR_IPCT_LOCAL_INTERRUPT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000000) Request permission for the interrupts of IPCT in the
                                                                         local domain*/
} NRF_UICR_IPCT_LOCAL_INTERRUPT_Type;

/* UICR_IPCT_LOCAL_INTERRUPT_SECURE: Request permission for the interrupts of IPCT in the local domain */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_ResetValue (0xFFFFFFFFUL)

/* INT0 @Bit 0 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Pos (0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Pos) /*!< Bit mask of INT0
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT0_NonSecure (0x0UL)

/* INT1 @Bit 1 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Pos (1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Pos) /*!< Bit mask of INT1
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT1_NonSecure (0x0UL)

/* INT2 @Bit 2 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Pos (2UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Pos) /*!< Bit mask of INT2
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT2_NonSecure (0x0UL)

/* INT3 @Bit 3 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Pos (3UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Pos) /*!< Bit mask of INT3
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT3_NonSecure (0x0UL)

