pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INT4 @Bit 4 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT4_Pos (4UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT4_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT4_Pos) /*!< Bit mask of INT4
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT4_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT4_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT4_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT4_NonSecure (0x0UL)

/* INT5 @Bit 5 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT5_Pos (5UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT5_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT5_Pos) /*!< Bit mask of INT5
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT5_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT5_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT5_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT5_NonSecure (0x0UL)

/* INT6 @Bit 6 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT6_Pos (6UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT6_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT6_Pos) /*!< Bit mask of INT6
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT6_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT6_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT6_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT6_NonSecure (0x0UL)

/* INT7 @Bit 7 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT7_Pos (7UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT7_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT7_Pos) /*!< Bit mask of INT7
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT7_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT7_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT7_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT7_NonSecure (0x0UL)

/* INT8 @Bit 8 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT8_Pos (8UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT8_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT8_Pos) /*!< Bit mask of INT8
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT8_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT8_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT8_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT8_NonSecure (0x0UL)

/* INT9 @Bit 9 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT9_Pos (9UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT9_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT9_Pos) /*!< Bit mask of INT9
                                                                            field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT9_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT9_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT9_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT9_NonSecure (0x0UL)

/* INT10 @Bit 10 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT10_Pos (10UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT10_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT10_Pos) /*!< Bit mask of
                                                                            INT10 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT10_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT10_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT10_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT10_NonSecure (0x0UL)

/* INT11 @Bit 11 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT11_Pos (11UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT11_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT11_Pos) /*!< Bit mask of
                                                                            INT11 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT11_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT11_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT11_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT11_NonSecure (0x0UL)

/* INT12 @Bit 12 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT12_Pos (12UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT12_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT12_Pos) /*!< Bit mask of
                                                                            INT12 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT12_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT12_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT12_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT12_NonSecure (0x0UL)

/* INT13 @Bit 13 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT13_Pos (13UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT13_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT13_Pos) /*!< Bit mask of
                                                                            INT13 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT13_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT13_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT13_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT13_NonSecure (0x0UL)

/* INT14 @Bit 14 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT14_Pos (14UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT14_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT14_Pos) /*!< Bit mask of
                                                                            INT14 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT14_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT14_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT14_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT14_NonSecure (0x0UL)

/* INT15 @Bit 15 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT15_Pos (15UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT15_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT15_Pos) /*!< Bit mask of
                                                                            INT15 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT15_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT15_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT15_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT15_NonSecure (0x0UL)

