pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INT16 @Bit 16 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Pos (16UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Pos) /*!< Bit mask of
                                                                            INT16 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT16_NonSecure (0x0UL)

/* INT17 @Bit 17 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Pos (17UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Pos) /*!< Bit mask of
                                                                            INT17 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT17_NonSecure (0x0UL)

/* INT18 @Bit 18 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Pos (18UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Pos) /*!< Bit mask of
                                                                            INT18 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT18_NonSecure (0x0UL)

/* INT19 @Bit 19 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Pos (19UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Pos) /*!< Bit mask of
                                                                            INT19 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT19_NonSecure (0x0UL)

/* INT20 @Bit 20 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Pos (20UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Pos) /*!< Bit mask of
                                                                            INT20 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT20_NonSecure (0x0UL)

/* INT21 @Bit 21 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Pos (21UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Pos) /*!< Bit mask of
                                                                            INT21 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT21_NonSecure (0x0UL)

/* INT22 @Bit 22 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Pos (22UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Pos) /*!< Bit mask of
                                                                            INT22 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT22_NonSecure (0x0UL)

/* INT23 @Bit 23 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Pos (23UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Pos) /*!< Bit mask of
                                                                            INT23 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT23_NonSecure (0x0UL)

/* INT24 @Bit 24 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Pos (24UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Pos) /*!< Bit mask of
                                                                            INT24 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT24_NonSecure (0x0UL)

/* INT25 @Bit 25 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Pos (25UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Pos) /*!< Bit mask of
                                                                            INT25 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT25_NonSecure (0x0UL)

/* INT26 @Bit 26 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Pos (26UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Pos) /*!< Bit mask of
                                                                            INT26 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT26_NonSecure (0x0UL)

/* INT27 @Bit 27 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Pos (27UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Pos) /*!< Bit mask of
                                                                            INT27 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT27_NonSecure (0x0UL)

/* INT28 @Bit 28 : Interrupt number */
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Pos (28UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Msk (0x1UL << UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Pos) /*!< Bit mask of
                                                                            INT28 field.*/
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Min (0x0UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Max (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_Secure (0x1UL)
  #define UICR_IPCT_LOCAL_INTERRUPT_SECURE_INT28_NonSecure (0x0UL)

