pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH12 @Bit 12 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH12_Pos (12UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH12_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH12_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH12_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH12_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH12_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH12_Own (0x0UL)

/* CH13 @Bit 13 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH13_Pos (13UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH13_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH13_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH13_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH13_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH13_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH13_Own (0x0UL)

/* CH14 @Bit 14 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH14_Pos (14UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH14_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH14_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH14_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH14_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH14_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH14_Own (0x0UL)

/* CH15 @Bit 15 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH15_Pos (15UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH15_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH15_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH15_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH15_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH15_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH15_Own (0x0UL)

/* CH16 @Bit 16 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH16_Pos (16UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH16_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH16_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH16_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH16_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH16_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH16_Own (0x0UL)

/* CH17 @Bit 17 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH17_Pos (17UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH17_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH17_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH17_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH17_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH17_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH17_Own (0x0UL)

/* CH18 @Bit 18 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH18_Pos (18UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH18_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH18_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH18_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH18_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH18_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH18_Own (0x0UL)

/* CH19 @Bit 19 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH19_Pos (19UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH19_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH19_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH19_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH19_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH19_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH19_Own (0x0UL)

/* CH20 @Bit 20 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH20_Pos (20UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH20_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH20_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH20_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH20_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH20_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH20_Own (0x0UL)

/* CH21 @Bit 21 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH21_Pos (21UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH21_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH21_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH21_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH21_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH21_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH21_Own (0x0UL)

/* CH22 @Bit 22 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH22_Pos (22UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH22_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH22_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH22_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH22_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH22_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH22_Own (0x0UL)

/* CH23 @Bit 23 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH23_Pos (23UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH23_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH23_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH23_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH23_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH23_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH23_Own (0x0UL)

/* CH24 @Bit 24 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH24_Pos (24UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH24_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH24_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH24_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH24_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH24_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH24_Own (0x0UL)

/* CH25 @Bit 25 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH25_Pos (25UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH25_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH25_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH25_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH25_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH25_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH25_Own (0x0UL)

/* CH26 @Bit 26 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH26_Pos (26UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH26_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH26_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH26_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH26_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH26_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH26_Own (0x0UL)

/* CH27 @Bit 27 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH27_Pos (27UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH27_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH27_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH27_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH27_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH27_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH27_Own (0x0UL)

/* CH28 @Bit 28 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH28_Pos (28UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH28_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH28_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH28_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH28_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH28_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH28_Own (0x0UL)

/* CH29 @Bit 29 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH29_Pos (29UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH29_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH29_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH29_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH29_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH29_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH29_Own (0x0UL)

/* CH30 @Bit 30 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH30_Pos (30UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH30_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH30_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH30_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH30_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH30_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH30_Own (0x0UL)

/* CH31 @Bit 31 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_OWN_CH31_Pos (31UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH31_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_OWN_CH31_Pos)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH31_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH31_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH31_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_OWN_CH31_Own (0x0UL)


/* UICR_IPCT_GLOBAL_CH_SECURE: Request permission for the channels of IPCT[n] in Global domain */
  #define UICR_IPCT_GLOBAL_CH_SECURE_ResetValue (0xFFFFFFFFUL)

/* CH0 @Bit 0 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH0_Pos (0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH0_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH0_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH0_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH0_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH0_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH0_NonSecure (0x0UL)

/* CH1 @Bit 1 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH1_Pos (1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH1_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH1_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH1_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH1_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH1_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH1_NonSecure (0x0UL)

/* CH2 @Bit 2 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH2_Pos (2UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH2_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH2_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH2_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH2_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH2_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH2_NonSecure (0x0UL)

/* CH3 @Bit 3 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH3_Pos (3UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH3_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH3_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH3_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH3_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH3_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH3_NonSecure (0x0UL)

/* CH4 @Bit 4 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH4_Pos (4UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH4_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH4_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH4_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH4_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH4_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH4_NonSecure (0x0UL)

/* CH5 @Bit 5 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH5_Pos (5UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH5_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH5_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH5_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH5_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH5_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH5_NonSecure (0x0UL)

/* CH6 @Bit 6 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH6_Pos (6UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH6_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH6_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH6_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH6_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH6_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH6_NonSecure (0x0UL)

/* CH7 @Bit 7 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH7_Pos (7UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH7_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH7_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH7_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH7_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH7_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH7_NonSecure (0x0UL)

