pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH27 @Bit 27 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH27_Pos (27UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH27_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH27_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH27_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH27_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH27_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH27_NonSecure (0x0UL)

/* CH28 @Bit 28 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH28_Pos (28UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH28_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH28_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH28_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH28_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH28_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH28_NonSecure (0x0UL)

/* CH29 @Bit 29 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH29_Pos (29UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH29_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH29_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH29_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH29_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH29_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH29_NonSecure (0x0UL)

/* CH30 @Bit 30 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH30_Pos (30UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH30_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH30_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH30_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH30_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH30_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH30_NonSecure (0x0UL)

/* CH31 @Bit 31 : Channel number */
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH31_Pos (31UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH31_Msk (0x1UL << UICR_IPCT_GLOBAL_CH_SECURE_CH31_Pos)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH31_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH31_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH31_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_CH_SECURE_CH31_NonSecure (0x0UL)



/* ============================================ Struct UICR_IPCT_GLOBAL_INTERRUPT ============================================ */
/**
  * @brief INTERRUPT [UICR_IPCT_GLOBAL_INTERRUPT] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;                               /*!< (@ 0x00000000) Request ownership of the interrupts of IPCT[n] in
                                                                         Global domain*/
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000004) Request permission for the interrupts of IPCT[n] in
                                                                         Global domain*/
} NRF_UICR_IPCT_GLOBAL_INTERRUPT_Type;

/* UICR_IPCT_GLOBAL_INTERRUPT_OWN: Request ownership of the interrupts of IPCT[n] in Global domain */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_ResetValue (0xFFFFFFFFUL)

/* INT0 @Bit 0 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT0_Pos (0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT0_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT0_Pos) /*!< Bit mask of INT0
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT0_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT0_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT0_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT0_Own (0x0UL)

/* INT1 @Bit 1 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT1_Pos (1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT1_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT1_Pos) /*!< Bit mask of INT1
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT1_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT1_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT1_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT1_Own (0x0UL)

/* INT2 @Bit 2 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT2_Pos (2UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT2_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT2_Pos) /*!< Bit mask of INT2
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT2_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT2_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT2_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT2_Own (0x0UL)

/* INT3 @Bit 3 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT3_Pos (3UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT3_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT3_Pos) /*!< Bit mask of INT3
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT3_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT3_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT3_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT3_Own (0x0UL)

/* INT4 @Bit 4 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Pos (4UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Pos) /*!< Bit mask of INT4
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT4_Own (0x0UL)

/* INT5 @Bit 5 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Pos (5UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Pos) /*!< Bit mask of INT5
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT5_Own (0x0UL)

/* INT6 @Bit 6 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Pos (6UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Pos) /*!< Bit mask of INT6
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT6_Own (0x0UL)

/* INT7 @Bit 7 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Pos (7UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Pos) /*!< Bit mask of INT7
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT7_Own (0x0UL)

