pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INT8 @Bit 8 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Pos (8UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Pos) /*!< Bit mask of INT8
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT8_Own (0x0UL)

/* INT9 @Bit 9 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Pos (9UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Pos) /*!< Bit mask of INT9
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT9_Own (0x0UL)

/* INT10 @Bit 10 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Pos (10UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Pos) /*!< Bit mask of INT10
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT10_Own (0x0UL)

/* INT11 @Bit 11 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Pos (11UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Pos) /*!< Bit mask of INT11
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT11_Own (0x0UL)

/* INT12 @Bit 12 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Pos (12UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Pos) /*!< Bit mask of INT12
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT12_Own (0x0UL)

/* INT13 @Bit 13 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Pos (13UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Pos) /*!< Bit mask of INT13
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT13_Own (0x0UL)

/* INT14 @Bit 14 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Pos (14UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Pos) /*!< Bit mask of INT14
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT14_Own (0x0UL)

/* INT15 @Bit 15 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Pos (15UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Pos) /*!< Bit mask of INT15
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT15_Own (0x0UL)

/* INT16 @Bit 16 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Pos (16UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Pos) /*!< Bit mask of INT16
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT16_Own (0x0UL)

/* INT17 @Bit 17 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Pos (17UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Pos) /*!< Bit mask of INT17
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT17_Own (0x0UL)

/* INT18 @Bit 18 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Pos (18UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Pos) /*!< Bit mask of INT18
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT18_Own (0x0UL)

/* INT19 @Bit 19 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Pos (19UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Pos) /*!< Bit mask of INT19
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT19_Own (0x0UL)

/* INT20 @Bit 20 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Pos (20UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Pos) /*!< Bit mask of INT20
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT20_Own (0x0UL)

/* INT21 @Bit 21 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Pos (21UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Pos) /*!< Bit mask of INT21
                                                                            field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_NotOwn (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_OWN_INT21_Own (0x0UL)

