pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INT29 @Bit 29 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Pos (29UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Pos) /*!< Bit mask of
                                                                            INT29 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT29_NonSecure (0x0UL)

/* INT30 @Bit 30 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Pos (30UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Pos) /*!< Bit mask of
                                                                            INT30 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT30_NonSecure (0x0UL)

/* INT31 @Bit 31 : Interrupt number */
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Pos (31UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Msk (0x1UL << UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Pos) /*!< Bit mask of
                                                                            INT31 field.*/
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Min (0x0UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Max (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_Secure (0x1UL)
  #define UICR_IPCT_GLOBAL_INTERRUPT_SECURE_INT31_NonSecure (0x0UL)



/* ================================================= Struct UICR_IPCT_GLOBAL ================================================= */
/**
  * @brief GLOBAL [UICR_IPCT_GLOBAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;                          /*!< (@ 0x00000000) Address of the IPCT instance associated with
                                                                         IPCT[n].GLOBAL*/
  __IOM NRF_UICR_IPCT_GLOBAL_CH_Type CH;
  __IOM NRF_UICR_IPCT_GLOBAL_INTERRUPT_Type INTERRUPT;
} NRF_UICR_IPCT_GLOBAL_Type;
  #define UICR_IPCT_GLOBAL_MaxCount (2UL)
  #define UICR_IPCT_GLOBAL_MaxIndex (1UL)
  #define UICR_IPCT_GLOBAL_MinIndex (0UL)

/* UICR_IPCT_GLOBAL_INSTANCE: Address of the IPCT instance associated with IPCT[n].GLOBAL */
  #define UICR_IPCT_GLOBAL_INSTANCE_ResetValue (0xFFFFFFFFUL)

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICR_IPCT_GLOBAL_INSTANCE_ADDRESS_Pos (0UL)
  #define UICR_IPCT_GLOBAL_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICR_IPCT_GLOBAL_INSTANCE_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/



/* ==================================================== Struct UICR_IPCT ===================================================== */
/**
  * @brief IPCT [UICR_IPCT] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_IPCT_LOCAL_Type LOCAL;
  __IOM NRF_UICR_IPCT_GLOBAL_Type GLOBAL[2];
} NRF_UICR_IPCT_Type;


/* ============================================= Struct UICR_DPPI_LOCAL_CH_LINK ============================================== */
/**
  * @brief LINK [UICR_DPPI_LOCAL_CH_LINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIR;                               /*!< (@ 0x00000000) Request linking the channels of DPPI[n] in local domain
                                                                         as source or sink*/
  __IOM uint32_t  EN;                                /*!< (@ 0x00000004) Request linking of the channels of DPPI[n] in the local
                                                                         domain*/
} NRF_UICR_DPPI_LOCAL_CH_LINK_Type;

/* UICR_DPPI_LOCAL_CH_LINK_DIR: Request linking the channels of DPPI[n] in local domain as source or sink */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_ResetValue (0xFFFFFFFFUL)

/* CH0 @Bit 0 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Pos (0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH0_Sink (0x0UL)

/* CH1 @Bit 1 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Pos (1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH1_Sink (0x0UL)

/* CH2 @Bit 2 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Pos (2UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH2_Sink (0x0UL)

/* CH3 @Bit 3 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Pos (3UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH3_Sink (0x0UL)

/* CH4 @Bit 4 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Pos (4UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH4_Sink (0x0UL)

