pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH5 @Bit 5 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH5_Pos (5UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH5_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH5_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH5_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH5_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH5_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH5_Sink (0x0UL)

/* CH6 @Bit 6 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH6_Pos (6UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH6_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH6_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH6_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH6_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH6_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH6_Sink (0x0UL)

/* CH7 @Bit 7 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH7_Pos (7UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH7_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH7_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH7_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH7_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH7_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH7_Sink (0x0UL)

/* CH8 @Bit 8 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH8_Pos (8UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH8_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH8_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH8_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH8_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH8_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH8_Sink (0x0UL)

/* CH9 @Bit 9 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH9_Pos (9UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH9_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH9_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH9_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH9_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH9_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH9_Sink (0x0UL)

/* CH10 @Bit 10 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH10_Pos (10UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH10_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH10_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH10_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH10_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH10_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH10_Sink (0x0UL)

/* CH11 @Bit 11 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH11_Pos (11UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH11_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH11_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH11_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH11_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH11_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH11_Sink (0x0UL)

/* CH12 @Bit 12 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH12_Pos (12UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH12_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH12_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH12_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH12_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH12_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH12_Sink (0x0UL)

/* CH13 @Bit 13 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH13_Pos (13UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH13_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH13_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH13_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH13_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH13_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH13_Sink (0x0UL)

/* CH14 @Bit 14 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH14_Pos (14UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH14_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH14_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH14_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH14_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH14_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH14_Sink (0x0UL)

/* CH15 @Bit 15 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH15_Pos (15UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH15_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH15_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH15_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH15_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH15_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH15_Sink (0x0UL)

/* CH16 @Bit 16 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH16_Pos (16UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH16_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH16_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH16_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH16_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH16_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH16_Sink (0x0UL)

/* CH17 @Bit 17 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH17_Pos (17UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH17_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH17_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH17_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH17_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH17_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH17_Sink (0x0UL)

/* CH18 @Bit 18 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH18_Pos (18UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH18_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH18_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH18_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH18_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH18_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH18_Sink (0x0UL)

/* CH19 @Bit 19 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH19_Pos (19UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH19_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH19_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH19_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH19_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH19_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH19_Sink (0x0UL)

/* CH20 @Bit 20 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH20_Pos (20UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH20_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH20_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH20_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH20_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH20_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH20_Sink (0x0UL)

/* CH21 @Bit 21 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH21_Pos (21UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH21_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH21_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH21_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH21_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH21_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH21_Sink (0x0UL)

/* CH22 @Bit 22 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH22_Pos (22UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH22_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH22_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH22_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH22_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH22_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH22_Sink (0x0UL)

