pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH23 @Bit 23 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Pos (23UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH23_Sink (0x0UL)

/* CH24 @Bit 24 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Pos (24UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH24_Sink (0x0UL)

/* CH25 @Bit 25 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Pos (25UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH25_Sink (0x0UL)

/* CH26 @Bit 26 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Pos (26UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH26_Sink (0x0UL)

/* CH27 @Bit 27 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Pos (27UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH27_Sink (0x0UL)

/* CH28 @Bit 28 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Pos (28UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH28_Sink (0x0UL)

/* CH29 @Bit 29 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Pos (29UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH29_Sink (0x0UL)

/* CH30 @Bit 30 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Pos (30UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH30_Sink (0x0UL)

/* CH31 @Bit 31 : Link direction */
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Pos (31UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Source (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_DIR_CH31_Sink (0x0UL)


/* UICR_DPPI_LOCAL_CH_LINK_EN: Request linking of the channels of DPPI[n] in the local domain */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_ResetValue (0xFFFFFFFFUL)

/* CH0 @Bit 0 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Pos (0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH0_Enabled (0x0UL)

/* CH1 @Bit 1 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Pos (1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH1_Enabled (0x0UL)

/* CH2 @Bit 2 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH2_Pos (2UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH2_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH2_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH2_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH2_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH2_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH2_Enabled (0x0UL)

/* CH3 @Bit 3 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH3_Pos (3UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH3_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH3_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH3_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH3_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH3_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH3_Enabled (0x0UL)

/* CH4 @Bit 4 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH4_Pos (4UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH4_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH4_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH4_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH4_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH4_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH4_Enabled (0x0UL)

/* CH5 @Bit 5 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH5_Pos (5UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH5_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH5_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH5_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH5_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH5_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH5_Enabled (0x0UL)

/* CH6 @Bit 6 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH6_Pos (6UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH6_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH6_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH6_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH6_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH6_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH6_Enabled (0x0UL)

/* CH7 @Bit 7 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH7_Pos (7UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH7_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH7_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH7_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH7_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH7_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH7_Enabled (0x0UL)

/* CH8 @Bit 8 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH8_Pos (8UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH8_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH8_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH8_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH8_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH8_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH8_Enabled (0x0UL)

/* CH9 @Bit 9 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH9_Pos (9UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH9_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH9_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH9_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH9_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH9_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH9_Enabled (0x0UL)

/* CH10 @Bit 10 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH10_Pos (10UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH10_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH10_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH10_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH10_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH10_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH10_Enabled (0x0UL)

/* CH11 @Bit 11 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH11_Pos (11UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH11_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH11_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH11_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH11_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH11_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH11_Enabled (0x0UL)

/* CH12 @Bit 12 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH12_Pos (12UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH12_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH12_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH12_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH12_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH12_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH12_Enabled (0x0UL)

/* CH13 @Bit 13 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH13_Pos (13UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH13_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH13_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH13_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH13_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH13_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH13_Enabled (0x0UL)

/* CH14 @Bit 14 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH14_Pos (14UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH14_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH14_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH14_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH14_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH14_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH14_Enabled (0x0UL)

/* CH15 @Bit 15 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH15_Pos (15UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH15_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH15_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH15_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH15_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH15_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH15_Enabled (0x0UL)

/* CH16 @Bit 16 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH16_Pos (16UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH16_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH16_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH16_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH16_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH16_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH16_Enabled (0x0UL)

/* CH17 @Bit 17 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH17_Pos (17UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH17_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH17_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH17_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH17_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH17_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH17_Enabled (0x0UL)

/* CH18 @Bit 18 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH18_Pos (18UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH18_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH18_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH18_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH18_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH18_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH18_Enabled (0x0UL)

/* CH19 @Bit 19 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH19_Pos (19UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH19_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH19_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH19_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH19_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH19_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH19_Enabled (0x0UL)

/* CH20 @Bit 20 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH20_Pos (20UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH20_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH20_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH20_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH20_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH20_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH20_Enabled (0x0UL)

/* CH21 @Bit 21 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH21_Pos (21UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH21_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH21_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH21_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH21_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH21_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH21_Enabled (0x0UL)

/* CH22 @Bit 22 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH22_Pos (22UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH22_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH22_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH22_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH22_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH22_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH22_Enabled (0x0UL)

/* CH23 @Bit 23 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH23_Pos (23UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH23_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH23_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH23_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH23_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH23_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH23_Enabled (0x0UL)

/* CH24 @Bit 24 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH24_Pos (24UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH24_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH24_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH24_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH24_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH24_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH24_Enabled (0x0UL)

/* CH25 @Bit 25 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH25_Pos (25UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH25_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH25_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH25_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH25_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH25_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH25_Enabled (0x0UL)

/* CH26 @Bit 26 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH26_Pos (26UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH26_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH26_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH26_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH26_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH26_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH26_Enabled (0x0UL)

/* CH27 @Bit 27 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH27_Pos (27UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH27_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH27_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH27_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH27_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH27_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH27_Enabled (0x0UL)

/* CH28 @Bit 28 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH28_Pos (28UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH28_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH28_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH28_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH28_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH28_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH28_Enabled (0x0UL)

/* CH29 @Bit 29 : Link enable */
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH29_Pos (29UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH29_Msk (0x1UL << UICR_DPPI_LOCAL_CH_LINK_EN_CH29_Pos)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH29_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH29_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH29_Disabled (0x1UL)
  #define UICR_DPPI_LOCAL_CH_LINK_EN_CH29_Enabled (0x0UL)

