pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CH27 @Bit 27 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Pos (27UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH27_Pos)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH27_NonSecure (0x0UL)

/* CH28 @Bit 28 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Pos (28UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH28_Pos)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH28_NonSecure (0x0UL)

/* CH29 @Bit 29 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Pos (29UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH29_Pos)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH29_NonSecure (0x0UL)

/* CH30 @Bit 30 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Pos (30UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH30_Pos)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH30_NonSecure (0x0UL)

/* CH31 @Bit 31 : Channel number */
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Pos (31UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Msk (0x1UL << UICR_DPPI_LOCAL_CH_SECURE_CH31_Pos)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CH_SECURE_CH31_NonSecure (0x0UL)



/* =============================================== Struct UICR_DPPI_LOCAL_CHG ================================================ */
/**
  * @brief CHG [UICR_DPPI_LOCAL_CHG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SECURE;                            /*!< (@ 0x00000000) Request permission for the channel groups of DPPI[n] in
                                                                         the local domain*/
} NRF_UICR_DPPI_LOCAL_CHG_Type;

/* UICR_DPPI_LOCAL_CHG_SECURE: Request permission for the channel groups of DPPI[n] in the local domain */
  #define UICR_DPPI_LOCAL_CHG_SECURE_ResetValue (0xFFFFFFFFUL)

/* CHG0 @Bit 0 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Pos (0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG0_NonSecure (0x0UL)

/* CHG1 @Bit 1 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Pos (1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG1_NonSecure (0x0UL)

/* CHG2 @Bit 2 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG2_Pos (2UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG2_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG2_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG2_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG2_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG2_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG2_NonSecure (0x0UL)

/* CHG3 @Bit 3 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG3_Pos (3UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG3_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG3_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG3_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG3_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG3_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG3_NonSecure (0x0UL)

/* CHG4 @Bit 4 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG4_Pos (4UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG4_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG4_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG4_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG4_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG4_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG4_NonSecure (0x0UL)

/* CHG5 @Bit 5 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG5_Pos (5UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG5_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG5_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG5_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG5_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG5_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG5_NonSecure (0x0UL)

/* CHG6 @Bit 6 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG6_Pos (6UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG6_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG6_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG6_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG6_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG6_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG6_NonSecure (0x0UL)

/* CHG7 @Bit 7 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG7_Pos (7UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG7_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG7_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG7_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG7_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG7_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG7_NonSecure (0x0UL)

/* CHG8 @Bit 8 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG8_Pos (8UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG8_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG8_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG8_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG8_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG8_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG8_NonSecure (0x0UL)

/* CHG9 @Bit 9 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG9_Pos (9UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG9_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG9_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG9_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG9_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG9_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG9_NonSecure (0x0UL)

/* CHG10 @Bit 10 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG10_Pos (10UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG10_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG10_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG10_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG10_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG10_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG10_NonSecure (0x0UL)

/* CHG11 @Bit 11 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG11_Pos (11UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG11_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG11_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG11_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG11_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG11_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG11_NonSecure (0x0UL)

/* CHG12 @Bit 12 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG12_Pos (12UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG12_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG12_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG12_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG12_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG12_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG12_NonSecure (0x0UL)

