pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHG28 @Bit 28 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Pos (28UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG28_NonSecure (0x0UL)

/* CHG29 @Bit 29 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Pos (29UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG29_NonSecure (0x0UL)

/* CHG30 @Bit 30 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Pos (30UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG30_NonSecure (0x0UL)

/* CHG31 @Bit 31 : Channel group number */
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Pos (31UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Msk (0x1UL << UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Pos)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Min (0x0UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Max (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_Secure (0x1UL)
  #define UICR_DPPI_LOCAL_CHG_SECURE_CHG31_NonSecure (0x0UL)



/* ================================================= Struct UICR_DPPI_LOCAL ================================================== */
/**
  * @brief LOCAL [UICR_DPPI_LOCAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;                          /*!< (@ 0x00000000) Address of the DPPI instance associated with
                                                                         DPPI[n].LOCAL*/
  __IOM NRF_UICR_DPPI_LOCAL_CH_Type CH;
  __IOM NRF_UICR_DPPI_LOCAL_CHG_Type CHG;
} NRF_UICR_DPPI_LOCAL_Type;
  #define UICR_DPPI_LOCAL_MaxCount (2UL)
  #define UICR_DPPI_LOCAL_MaxIndex (1UL)
  #define UICR_DPPI_LOCAL_MinIndex (0UL)

/* UICR_DPPI_LOCAL_INSTANCE: Address of the DPPI instance associated with DPPI[n].LOCAL */
  #define UICR_DPPI_LOCAL_INSTANCE_ResetValue (0xFFFFFFFFUL)

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICR_DPPI_LOCAL_INSTANCE_ADDRESS_Pos (0UL)
  #define UICR_DPPI_LOCAL_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICR_DPPI_LOCAL_INSTANCE_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/



/* ============================================= Struct UICR_DPPI_GLOBAL_CH_LINK ============================================= */
/**
  * @brief LINK [UICR_DPPI_GLOBAL_CH_LINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DIR;                               /*!< (@ 0x00000000) Request linking the channels of DPPI[n] in Global
                                                                         domain as source or sink*/
  __IOM uint32_t  EN;                                /*!< (@ 0x00000004) Request linking of the channels of DPPI[n] in the
                                                                         Global domain*/
} NRF_UICR_DPPI_GLOBAL_CH_LINK_Type;

/* UICR_DPPI_GLOBAL_CH_LINK_DIR: Request linking the channels of DPPI[n] in Global domain as source or sink */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_ResetValue (0xFFFFFFFFUL)

/* CH0 @Bit 0 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Pos (0UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Pos)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Source (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH0_Sink (0x0UL)

/* CH1 @Bit 1 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Pos (1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Pos)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Source (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH1_Sink (0x0UL)

/* CH2 @Bit 2 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Pos (2UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Pos)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Source (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH2_Sink (0x0UL)

/* CH3 @Bit 3 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Pos (3UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Pos)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Source (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH3_Sink (0x0UL)

/* CH4 @Bit 4 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Pos (4UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Pos)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Source (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH4_Sink (0x0UL)

/* CH5 @Bit 5 : Link direction */
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Pos (5UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Msk (0x1UL << UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Pos)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Source (0x1UL)
  #define UICR_DPPI_GLOBAL_CH_LINK_DIR_CH5_Sink (0x0UL)

