pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHG13 @Bit 13 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG13_Pos (13UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG13_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG13_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG13_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG13_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG13_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG13_Own (0x0UL)

/* CHG14 @Bit 14 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG14_Pos (14UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG14_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG14_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG14_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG14_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG14_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG14_Own (0x0UL)

/* CHG15 @Bit 15 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG15_Pos (15UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG15_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG15_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG15_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG15_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG15_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG15_Own (0x0UL)

/* CHG16 @Bit 16 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG16_Pos (16UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG16_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG16_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG16_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG16_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG16_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG16_Own (0x0UL)

/* CHG17 @Bit 17 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG17_Pos (17UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG17_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG17_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG17_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG17_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG17_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG17_Own (0x0UL)

/* CHG18 @Bit 18 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG18_Pos (18UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG18_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG18_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG18_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG18_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG18_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG18_Own (0x0UL)

/* CHG19 @Bit 19 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG19_Pos (19UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG19_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG19_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG19_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG19_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG19_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG19_Own (0x0UL)

/* CHG20 @Bit 20 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG20_Pos (20UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG20_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG20_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG20_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG20_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG20_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG20_Own (0x0UL)

/* CHG21 @Bit 21 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG21_Pos (21UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG21_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG21_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG21_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG21_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG21_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG21_Own (0x0UL)

/* CHG22 @Bit 22 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Pos (22UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG22_Own (0x0UL)

/* CHG23 @Bit 23 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Pos (23UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG23_Own (0x0UL)

/* CHG24 @Bit 24 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Pos (24UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG24_Own (0x0UL)

/* CHG25 @Bit 25 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Pos (25UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG25_Own (0x0UL)

/* CHG26 @Bit 26 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Pos (26UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG26_Own (0x0UL)

/* CHG27 @Bit 27 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Pos (27UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Pos)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_NotOwn (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_OWN_CHG27_Own (0x0UL)

