pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CHG28 @Bit 28 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Pos (28UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Pos)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_Secure (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG28_NonSecure (0x0UL)

/* CHG29 @Bit 29 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Pos (29UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Pos)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_Secure (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG29_NonSecure (0x0UL)

/* CHG30 @Bit 30 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Pos (30UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Pos)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_Secure (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG30_NonSecure (0x0UL)

/* CHG31 @Bit 31 : Channel group number */
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Pos (31UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Msk (0x1UL << UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Pos)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Min (0x0UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Max (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_Secure (0x1UL)
  #define UICR_DPPI_GLOBAL_CHG_SECURE_CHG31_NonSecure (0x0UL)



/* ================================================= Struct UICR_DPPI_GLOBAL ================================================= */
/**
  * @brief GLOBAL [UICR_DPPI_GLOBAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;                          /*!< (@ 0x00000000) Address of the DPPI instance associated with
                                                                         DPPI[n].GLOBAL*/
  __IOM NRF_UICR_DPPI_GLOBAL_CH_Type CH;
  __IOM NRF_UICR_DPPI_GLOBAL_CHG_Type CHG;
} NRF_UICR_DPPI_GLOBAL_Type;
  #define UICR_DPPI_GLOBAL_MaxCount (12UL)
  #define UICR_DPPI_GLOBAL_MaxIndex (11UL)
  #define UICR_DPPI_GLOBAL_MinIndex (0UL)

/* UICR_DPPI_GLOBAL_INSTANCE: Address of the DPPI instance associated with DPPI[n].GLOBAL */
  #define UICR_DPPI_GLOBAL_INSTANCE_ResetValue (0xFFFFFFFFUL)

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICR_DPPI_GLOBAL_INSTANCE_ADDRESS_Pos (0UL)
  #define UICR_DPPI_GLOBAL_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICR_DPPI_GLOBAL_INSTANCE_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/



/* ==================================================== Struct UICR_DPPI ===================================================== */
/**
  * @brief DPPI [UICR_DPPI] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_DPPI_LOCAL_Type LOCAL[2];
  __IOM NRF_UICR_DPPI_GLOBAL_Type GLOBAL[12];
} NRF_UICR_DPPI_Type;


/* =================================================== Struct UICR_GRTC_CC =================================================== */
/**
  * @brief CC [UICR_GRTC_CC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  OWN;
  __IOM uint32_t  SECURE;
} NRF_UICR_GRTC_CC_Type;

/* UICR_GRTC_CC_OWN: Request ownership of the CCs of GRTCGRTC */
  #define UICR_GRTC_CC_OWN_ResetValue (0xFFFFFFFFUL)

/* CC0 @Bit 0 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC0_Pos (0UL)
  #define UICR_GRTC_CC_OWN_CC0_Msk (0x1UL << UICR_GRTC_CC_OWN_CC0_Pos)
  #define UICR_GRTC_CC_OWN_CC0_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC0_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC0_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC0_Own (0x0UL)

/* CC1 @Bit 1 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC1_Pos (1UL)
  #define UICR_GRTC_CC_OWN_CC1_Msk (0x1UL << UICR_GRTC_CC_OWN_CC1_Pos)
  #define UICR_GRTC_CC_OWN_CC1_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC1_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC1_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC1_Own (0x0UL)

/* CC2 @Bit 2 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC2_Pos (2UL)
  #define UICR_GRTC_CC_OWN_CC2_Msk (0x1UL << UICR_GRTC_CC_OWN_CC2_Pos)
  #define UICR_GRTC_CC_OWN_CC2_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC2_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC2_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC2_Own (0x0UL)

/* CC3 @Bit 3 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC3_Pos (3UL)
  #define UICR_GRTC_CC_OWN_CC3_Msk (0x1UL << UICR_GRTC_CC_OWN_CC3_Pos)
  #define UICR_GRTC_CC_OWN_CC3_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC3_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC3_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC3_Own (0x0UL)

/* CC4 @Bit 4 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC4_Pos (4UL)
  #define UICR_GRTC_CC_OWN_CC4_Msk (0x1UL << UICR_GRTC_CC_OWN_CC4_Pos)
  #define UICR_GRTC_CC_OWN_CC4_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC4_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC4_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC4_Own (0x0UL)

/* CC5 @Bit 5 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC5_Pos (5UL)
  #define UICR_GRTC_CC_OWN_CC5_Msk (0x1UL << UICR_GRTC_CC_OWN_CC5_Pos)
  #define UICR_GRTC_CC_OWN_CC5_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC5_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC5_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC5_Own (0x0UL)

/* CC6 @Bit 6 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC6_Pos (6UL)
  #define UICR_GRTC_CC_OWN_CC6_Msk (0x1UL << UICR_GRTC_CC_OWN_CC6_Pos)
  #define UICR_GRTC_CC_OWN_CC6_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC6_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC6_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC6_Own (0x0UL)

/* CC7 @Bit 7 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC7_Pos (7UL)
  #define UICR_GRTC_CC_OWN_CC7_Msk (0x1UL << UICR_GRTC_CC_OWN_CC7_Pos)
  #define UICR_GRTC_CC_OWN_CC7_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC7_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC7_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC7_Own (0x0UL)

/* CC8 @Bit 8 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC8_Pos (8UL)
  #define UICR_GRTC_CC_OWN_CC8_Msk (0x1UL << UICR_GRTC_CC_OWN_CC8_Pos)
  #define UICR_GRTC_CC_OWN_CC8_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC8_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC8_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC8_Own (0x0UL)

