pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CC9 @Bit 9 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC9_Pos (9UL)
  #define UICR_GRTC_CC_OWN_CC9_Msk (0x1UL << UICR_GRTC_CC_OWN_CC9_Pos)
  #define UICR_GRTC_CC_OWN_CC9_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC9_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC9_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC9_Own (0x0UL)

/* CC10 @Bit 10 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC10_Pos (10UL)
  #define UICR_GRTC_CC_OWN_CC10_Msk (0x1UL << UICR_GRTC_CC_OWN_CC10_Pos)
  #define UICR_GRTC_CC_OWN_CC10_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC10_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC10_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC10_Own (0x0UL)

/* CC11 @Bit 11 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC11_Pos (11UL)
  #define UICR_GRTC_CC_OWN_CC11_Msk (0x1UL << UICR_GRTC_CC_OWN_CC11_Pos)
  #define UICR_GRTC_CC_OWN_CC11_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC11_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC11_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC11_Own (0x0UL)

/* CC12 @Bit 12 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC12_Pos (12UL)
  #define UICR_GRTC_CC_OWN_CC12_Msk (0x1UL << UICR_GRTC_CC_OWN_CC12_Pos)
  #define UICR_GRTC_CC_OWN_CC12_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC12_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC12_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC12_Own (0x0UL)

/* CC13 @Bit 13 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC13_Pos (13UL)
  #define UICR_GRTC_CC_OWN_CC13_Msk (0x1UL << UICR_GRTC_CC_OWN_CC13_Pos)
  #define UICR_GRTC_CC_OWN_CC13_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC13_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC13_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC13_Own (0x0UL)

/* CC14 @Bit 14 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC14_Pos (14UL)
  #define UICR_GRTC_CC_OWN_CC14_Msk (0x1UL << UICR_GRTC_CC_OWN_CC14_Pos)
  #define UICR_GRTC_CC_OWN_CC14_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC14_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC14_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC14_Own (0x0UL)

/* CC15 @Bit 15 : Capture/compare register number */
  #define UICR_GRTC_CC_OWN_CC15_Pos (15UL)
  #define UICR_GRTC_CC_OWN_CC15_Msk (0x1UL << UICR_GRTC_CC_OWN_CC15_Pos)
  #define UICR_GRTC_CC_OWN_CC15_Min (0x0UL)
  #define UICR_GRTC_CC_OWN_CC15_Max (0x1UL)
  #define UICR_GRTC_CC_OWN_CC15_NotOwn (0x1UL)
  #define UICR_GRTC_CC_OWN_CC15_Own (0x0UL)


/* UICR_GRTC_CC_SECURE: Request permission for the CCs of GRTC */
  #define UICR_GRTC_CC_SECURE_ResetValue (0xFFFFFFFFUL)

/* CC0 @Bit 0 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC0_Pos (0UL)
  #define UICR_GRTC_CC_SECURE_CC0_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC0_Pos)
  #define UICR_GRTC_CC_SECURE_CC0_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC0_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC0_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC0_NonSecure (0x0UL)

/* CC1 @Bit 1 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC1_Pos (1UL)
  #define UICR_GRTC_CC_SECURE_CC1_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC1_Pos)
  #define UICR_GRTC_CC_SECURE_CC1_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC1_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC1_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC1_NonSecure (0x0UL)

/* CC2 @Bit 2 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC2_Pos (2UL)
  #define UICR_GRTC_CC_SECURE_CC2_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC2_Pos)
  #define UICR_GRTC_CC_SECURE_CC2_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC2_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC2_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC2_NonSecure (0x0UL)

/* CC3 @Bit 3 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC3_Pos (3UL)
  #define UICR_GRTC_CC_SECURE_CC3_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC3_Pos)
  #define UICR_GRTC_CC_SECURE_CC3_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC3_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC3_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC3_NonSecure (0x0UL)

/* CC4 @Bit 4 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC4_Pos (4UL)
  #define UICR_GRTC_CC_SECURE_CC4_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC4_Pos)
  #define UICR_GRTC_CC_SECURE_CC4_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC4_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC4_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC4_NonSecure (0x0UL)

/* CC5 @Bit 5 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC5_Pos (5UL)
  #define UICR_GRTC_CC_SECURE_CC5_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC5_Pos)
  #define UICR_GRTC_CC_SECURE_CC5_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC5_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC5_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC5_NonSecure (0x0UL)

/* CC6 @Bit 6 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC6_Pos (6UL)
  #define UICR_GRTC_CC_SECURE_CC6_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC6_Pos)
  #define UICR_GRTC_CC_SECURE_CC6_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC6_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC6_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC6_NonSecure (0x0UL)

/* CC7 @Bit 7 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC7_Pos (7UL)
  #define UICR_GRTC_CC_SECURE_CC7_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC7_Pos)
  #define UICR_GRTC_CC_SECURE_CC7_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC7_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC7_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC7_NonSecure (0x0UL)

/* CC8 @Bit 8 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC8_Pos (8UL)
  #define UICR_GRTC_CC_SECURE_CC8_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC8_Pos)
  #define UICR_GRTC_CC_SECURE_CC8_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC8_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC8_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC8_NonSecure (0x0UL)

/* CC9 @Bit 9 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC9_Pos (9UL)
  #define UICR_GRTC_CC_SECURE_CC9_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC9_Pos)
  #define UICR_GRTC_CC_SECURE_CC9_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC9_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC9_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC9_NonSecure (0x0UL)

