pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CC10 @Bit 10 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC10_Pos (10UL)
  #define UICR_GRTC_CC_SECURE_CC10_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC10_Pos)
  #define UICR_GRTC_CC_SECURE_CC10_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC10_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC10_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC10_NonSecure (0x0UL)

/* CC11 @Bit 11 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC11_Pos (11UL)
  #define UICR_GRTC_CC_SECURE_CC11_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC11_Pos)
  #define UICR_GRTC_CC_SECURE_CC11_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC11_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC11_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC11_NonSecure (0x0UL)

/* CC12 @Bit 12 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC12_Pos (12UL)
  #define UICR_GRTC_CC_SECURE_CC12_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC12_Pos)
  #define UICR_GRTC_CC_SECURE_CC12_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC12_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC12_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC12_NonSecure (0x0UL)

/* CC13 @Bit 13 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC13_Pos (13UL)
  #define UICR_GRTC_CC_SECURE_CC13_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC13_Pos)
  #define UICR_GRTC_CC_SECURE_CC13_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC13_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC13_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC13_NonSecure (0x0UL)

/* CC14 @Bit 14 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC14_Pos (14UL)
  #define UICR_GRTC_CC_SECURE_CC14_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC14_Pos)
  #define UICR_GRTC_CC_SECURE_CC14_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC14_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC14_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC14_NonSecure (0x0UL)

/* CC15 @Bit 15 : Capture/compare register number */
  #define UICR_GRTC_CC_SECURE_CC15_Pos (15UL)
  #define UICR_GRTC_CC_SECURE_CC15_Msk (0x1UL << UICR_GRTC_CC_SECURE_CC15_Pos)
  #define UICR_GRTC_CC_SECURE_CC15_Min (0x0UL)
  #define UICR_GRTC_CC_SECURE_CC15_Max (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC15_Secure (0x1UL)
  #define UICR_GRTC_CC_SECURE_CC15_NonSecure (0x0UL)



/* ==================================================== Struct UICR_GRTC ===================================================== */
/**
  * @brief GRTC [UICR_GRTC] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_GRTC_CC_Type CC;
} NRF_UICR_GRTC_Type;


/* =================================================== Struct UICR_MAILBOX =================================================== */
/**
  * @brief MAILBOX [UICR_MAILBOX] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ADDRESS;
  __IOM uint32_t  CONFIG;
} NRF_UICR_MAILBOX_Type;
  #define UICR_MAILBOX_MaxCount (8UL)
  #define UICR_MAILBOX_MaxIndex (7UL)
  #define UICR_MAILBOX_MinIndex (0UL)

/* UICR_MAILBOX_ADDRESS: Memory start address of mailbox n */
  #define UICR_MAILBOX_ADDRESS_ResetValue (0xFFFFFFFFUL)

/* ADDRESS @Bits 0..31 : Memory address */
  #define UICR_MAILBOX_ADDRESS_ADDRESS_Pos (0UL)
  #define UICR_MAILBOX_ADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << UICR_MAILBOX_ADDRESS_ADDRESS_Pos)


/* UICR_MAILBOX_CONFIG: Configuration of mailbox n */
  #define UICR_MAILBOX_CONFIG_ResetValue (0xFFFFFFFFUL)

/* SECURE @Bit 3 : Permission */
  #define UICR_MAILBOX_CONFIG_SECURE_Pos (3UL)
  #define UICR_MAILBOX_CONFIG_SECURE_Msk (0x1UL << UICR_MAILBOX_CONFIG_SECURE_Pos)
  #define UICR_MAILBOX_CONFIG_SECURE_Min (0x0UL)
  #define UICR_MAILBOX_CONFIG_SECURE_Max (0x1UL)
  #define UICR_MAILBOX_CONFIG_SECURE_Secure (0x1UL)
  #define UICR_MAILBOX_CONFIG_SECURE_NonSecure (0x0UL)

/* OWNERID @Bits 8..11 : Remote owner identification */
  #define UICR_MAILBOX_CONFIG_OWNERID_Pos (8UL)
  #define UICR_MAILBOX_CONFIG_OWNERID_Msk (0xFUL << UICR_MAILBOX_CONFIG_OWNERID_Pos)
  #define UICR_MAILBOX_CONFIG_OWNERID_Min (0x0UL)
  #define UICR_MAILBOX_CONFIG_OWNERID_Max (0xFUL)

/* SIZE @Bits 16..31 : Memory size */
  #define UICR_MAILBOX_CONFIG_SIZE_Pos (16UL)
  #define UICR_MAILBOX_CONFIG_SIZE_Msk (0xFFFFUL << UICR_MAILBOX_CONFIG_SIZE_Pos)



/* ================================================ Struct UICR_TRACE_ETBSINK ================================================ */
/**
  * @brief ETBSINK [UICR_TRACE_ETBSINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SOURCES;
} NRF_UICR_TRACE_ETBSINK_Type;

/* UICR_TRACE_ETBSINK_SOURCES: (unspecified) */
  #define UICR_TRACE_ETBSINK_SOURCES_ResetValue (0xFFFFFFFFUL)

/* STMMAINCORE @Bit 0 : STM trace from the domain main CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Pos (0UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Pos) /*!< Bit mask of
                                                                            STMMAINCORE field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Min (0x0UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Max (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_NotRequested (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMMAINCORE_Requested (0x0UL)

/* ETMMAINCORE @Bit 1 : ETM trace from the domain main CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Pos (1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Pos) /*!< Bit mask of
                                                                            ETMMAINCORE field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Min (0x0UL)
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Max (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_NotRequested (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_ETMMAINCORE_Requested (0x0UL)

/* STMHWEVENTS @Bit 2 : STM HW events trace */
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Pos (2UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Pos) /*!< Bit mask of
                                                                            STMHWEVENTS field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Min (0x0UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Max (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_NotRequested (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMHWEVENTS_Requested (0x0UL)

/* STMPPR @Bit 3 : STM trace from PPR CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Pos (3UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMPPR_Pos)
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Min (0x0UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Max (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_NotRequested (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMPPR_Requested (0x0UL)

/* STMFLPR @Bit 4 : STM trace from FLPR CPU */
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Pos (4UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Msk (0x1UL << UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Pos) /*!< Bit mask of STMFLPR
                                                                            field.*/
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Min (0x0UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Max (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_NotRequested (0x1UL)
  #define UICR_TRACE_ETBSINK_SOURCES_STMFLPR_Requested (0x0UL)



/* =============================================== Struct UICR_TRACE_TPIUSINK ================================================ */
/**
  * @brief TPIUSINK [UICR_TRACE_TPIUSINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SOURCES;
} NRF_UICR_TRACE_TPIUSINK_Type;

