pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* UICR_TRACE_TPIUSINK_SOURCES: (unspecified) */
  #define UICR_TRACE_TPIUSINK_SOURCES_ResetValue (0xFFFFFFFFUL)

/* STMMAINCORE @Bit 0 : STM trace from the domain main CPU */
  #define UICR_TRACE_TPIUSINK_SOURCES_STMMAINCORE_Pos (0UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMMAINCORE_Msk (0x1UL << UICR_TRACE_TPIUSINK_SOURCES_STMMAINCORE_Pos) /*!< Bit mask of
                                                                            STMMAINCORE field.*/
  #define UICR_TRACE_TPIUSINK_SOURCES_STMMAINCORE_Min (0x0UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMMAINCORE_Max (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMMAINCORE_NotRequested (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMMAINCORE_Requested (0x0UL)

/* ETMMAINCORE @Bit 1 : ETM trace from the domain main CPU */
  #define UICR_TRACE_TPIUSINK_SOURCES_ETMMAINCORE_Pos (1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_ETMMAINCORE_Msk (0x1UL << UICR_TRACE_TPIUSINK_SOURCES_ETMMAINCORE_Pos) /*!< Bit mask of
                                                                            ETMMAINCORE field.*/
  #define UICR_TRACE_TPIUSINK_SOURCES_ETMMAINCORE_Min (0x0UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_ETMMAINCORE_Max (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_ETMMAINCORE_NotRequested (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_ETMMAINCORE_Requested (0x0UL)

/* STMHWEVENTS @Bit 2 : STM HW events trace */
  #define UICR_TRACE_TPIUSINK_SOURCES_STMHWEVENTS_Pos (2UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMHWEVENTS_Msk (0x1UL << UICR_TRACE_TPIUSINK_SOURCES_STMHWEVENTS_Pos) /*!< Bit mask of
                                                                            STMHWEVENTS field.*/
  #define UICR_TRACE_TPIUSINK_SOURCES_STMHWEVENTS_Min (0x0UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMHWEVENTS_Max (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMHWEVENTS_NotRequested (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMHWEVENTS_Requested (0x0UL)

/* STMPPR @Bit 3 : STM trace from PPR CPU */
  #define UICR_TRACE_TPIUSINK_SOURCES_STMPPR_Pos (3UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMPPR_Msk (0x1UL << UICR_TRACE_TPIUSINK_SOURCES_STMPPR_Pos) /*!< Bit mask of STMPPR
                                                                            field.*/
  #define UICR_TRACE_TPIUSINK_SOURCES_STMPPR_Min (0x0UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMPPR_Max (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMPPR_NotRequested (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMPPR_Requested (0x0UL)

/* STMFLPR @Bit 4 : STM trace from FLPR CPU */
  #define UICR_TRACE_TPIUSINK_SOURCES_STMFLPR_Pos (4UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMFLPR_Msk (0x1UL << UICR_TRACE_TPIUSINK_SOURCES_STMFLPR_Pos) /*!< Bit mask of STMFLPR
                                                                            field.*/
  #define UICR_TRACE_TPIUSINK_SOURCES_STMFLPR_Min (0x0UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMFLPR_Max (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMFLPR_NotRequested (0x1UL)
  #define UICR_TRACE_TPIUSINK_SOURCES_STMFLPR_Requested (0x0UL)



/* ================================================ Struct UICR_TRACE_ETRSINK ================================================ */
/**
  * @brief ETRSINK [UICR_TRACE_ETRSINK] (unspecified)
  */
typedef struct {
  __IOM uint32_t  SOURCES;
} NRF_UICR_TRACE_ETRSINK_Type;

/* UICR_TRACE_ETRSINK_SOURCES: (unspecified) */
  #define UICR_TRACE_ETRSINK_SOURCES_ResetValue (0xFFFFFFFFUL)

/* STMMAINCORE @Bit 0 : STM trace from the domain main CPU */
  #define UICR_TRACE_ETRSINK_SOURCES_STMMAINCORE_Pos (0UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMMAINCORE_Msk (0x1UL << UICR_TRACE_ETRSINK_SOURCES_STMMAINCORE_Pos) /*!< Bit mask of
                                                                            STMMAINCORE field.*/
  #define UICR_TRACE_ETRSINK_SOURCES_STMMAINCORE_Min (0x0UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMMAINCORE_Max (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMMAINCORE_NotRequested (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMMAINCORE_Requested (0x0UL)

/* ETMMAINCORE @Bit 1 : ETM trace from the domain main CPU */
  #define UICR_TRACE_ETRSINK_SOURCES_ETMMAINCORE_Pos (1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_ETMMAINCORE_Msk (0x1UL << UICR_TRACE_ETRSINK_SOURCES_ETMMAINCORE_Pos) /*!< Bit mask of
                                                                            ETMMAINCORE field.*/
  #define UICR_TRACE_ETRSINK_SOURCES_ETMMAINCORE_Min (0x0UL)
  #define UICR_TRACE_ETRSINK_SOURCES_ETMMAINCORE_Max (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_ETMMAINCORE_NotRequested (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_ETMMAINCORE_Requested (0x0UL)

/* STMHWEVENTS @Bit 2 : STM HW events trace */
  #define UICR_TRACE_ETRSINK_SOURCES_STMHWEVENTS_Pos (2UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMHWEVENTS_Msk (0x1UL << UICR_TRACE_ETRSINK_SOURCES_STMHWEVENTS_Pos) /*!< Bit mask of
                                                                            STMHWEVENTS field.*/
  #define UICR_TRACE_ETRSINK_SOURCES_STMHWEVENTS_Min (0x0UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMHWEVENTS_Max (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMHWEVENTS_NotRequested (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMHWEVENTS_Requested (0x0UL)

/* STMPPR @Bit 3 : STM trace from PPR CPU */
  #define UICR_TRACE_ETRSINK_SOURCES_STMPPR_Pos (3UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMPPR_Msk (0x1UL << UICR_TRACE_ETRSINK_SOURCES_STMPPR_Pos)
  #define UICR_TRACE_ETRSINK_SOURCES_STMPPR_Min (0x0UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMPPR_Max (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMPPR_NotRequested (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMPPR_Requested (0x0UL)

/* STMFLPR @Bit 4 : STM trace from FLPR CPU */
  #define UICR_TRACE_ETRSINK_SOURCES_STMFLPR_Pos (4UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMFLPR_Msk (0x1UL << UICR_TRACE_ETRSINK_SOURCES_STMFLPR_Pos) /*!< Bit mask of STMFLPR
                                                                            field.*/
  #define UICR_TRACE_ETRSINK_SOURCES_STMFLPR_Min (0x0UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMFLPR_Max (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMFLPR_NotRequested (0x1UL)
  #define UICR_TRACE_ETRSINK_SOURCES_STMFLPR_Requested (0x0UL)



/* ==================================================== Struct UICR_TRACE ==================================================== */
/**
  * @brief TRACE [UICR_TRACE] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_TRACE_ETBSINK_Type ETBSINK;
  __IOM NRF_UICR_TRACE_TPIUSINK_Type TPIUSINK;
  __IOM NRF_UICR_TRACE_ETRSINK_Type ETRSINK;
  __IOM uint32_t  PORTCONFIG;
} NRF_UICR_TRACE_Type;

