pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* UICR_TRACE_PORTCONFIG: Trace port speed configuration */
  #define UICR_TRACE_PORTCONFIG_ResetValue (0xFFFFFFFFUL)

/* PORTCONFIG @Bits 0..1 : (unspecified) */
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Pos (0UL)
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Msk (0x3UL << UICR_TRACE_PORTCONFIG_PORTCONFIG_Pos) /*!< Bit mask of PORTCONFIG
                                                                            field.*/
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Min (0x0UL)
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_Max (0x3UL)
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_FullSpeed (0x3UL)
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_HalfSpeed (0x2UL)
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_QuarterSpeed (0x1UL)
  #define UICR_TRACE_PORTCONFIG_PORTCONFIG_EightSpeed (0x0UL)



/* ============================================== Struct UICR_TAMPER_DETECTION =============================================== */
/**
  * @brief DETECTION [UICR_TAMPER_DETECTION] Tamper policy configuration for detected security events.
  */
typedef struct {
  __IOM uint32_t  ENABLE;
  __IOM uint32_t  RESPONSE0;
  __IOM uint32_t  RESPONSE1;
  __IOM uint32_t  TEMPDETECTORCONFIG;
} NRF_UICR_TAMPER_DETECTION_Type;

/* UICR_TAMPER_DETECTION_ENABLE: (unspecified) */
  #define UICR_TAMPER_DETECTION_ENABLE_ResetValue (0xFFFFFFFFUL)

/* GlobalEnable @Bit 0 : Enable tamper detection. When disabled all tamper enable and policy switches are ignored. */
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Pos (0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Pos) /*!< Bit mask
                                                                            of GlobalEnable field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Min (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Max (0x1UL)
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Enable (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_GlobalEnable_Disable (0x1UL)

/* VoltageLevel @Bit 1 : Enable voltage level detectors (VDETs) on supply lines. An automatic system reset is issued when
                         voltage on the corresponding supply line is too low. */

  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Pos (1UL)
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Pos) /*!< Bit mask
                                                                            of VoltageLevel field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Min (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Max (0x1UL)
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Enable (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_VoltageLevel_Disable (0x1UL)

/* ExternalActiveShield @Bit 4 : Enable external active shield detector. */
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Pos (4UL)
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Pos)
                                                                            /*!< Bit mask of ExternalActiveShield field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Min (0x0UL) /*!< Min enumerator value of ExternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Max (0x1UL) /*!< Max enumerator value of ExternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Enable (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_ExternalActiveShield_Disable (0x1UL)

/* HardFault @Bit 7 : Configure if tamper prevention should react on hard faults. */
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Pos (7UL)
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_HardFault_Pos) /*!< Bit mask of
                                                                            HardFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Min (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Max (0x1UL)
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Enable (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_HardFault_Disable (0x1UL)

/* ApiFault @Bit 8 : Configure if tamper prevention should react on invalid API usage. */
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Pos (8UL)
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_ApiFault_Pos) /*!< Bit mask of
                                                                            ApiFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Min (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Max (0x1UL)
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Enable (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_ApiFault_Disable (0x1UL)

/* AdacFault @Bit 9 : Configure if tamper prevention should react on invalid ADAC usage. */
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Pos (9UL)
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_AdacFault_Pos) /*!< Bit mask of
                                                                            AdacFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Min (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Max (0x1UL)
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Enable (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_AdacFault_Disable (0x1UL)

/* StateFault @Bit 10 : Configure if tamper prevention should react on invalid firmware execution state. */
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Pos (10UL)
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_StateFault_Pos) /*!< Bit mask of
                                                                            StateFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Min (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Max (0x1UL)
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Enable (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_StateFault_Disable (0x1UL)

