pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TemperatureFault @Bit 11 : Configure if tamper prevention should react when on-die temperature exceeds a valid range. */
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Pos (11UL)
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Msk (0x1UL << UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Pos) /*!<
                                                                            Bit mask of TemperatureFault field.*/
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Min (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Max (0x1UL)
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Enable (0x0UL)
  #define UICR_TAMPER_DETECTION_ENABLE_TemperatureFault_Disable (0x1UL)


/* UICR_TAMPER_DETECTION_RESPONSE0: (unspecified) */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ResetValue (0xFFFFFFFFUL)

/* VoltageLevel @Bits 0..3 : Configure tamper policy for invalid voltage level on supply lines. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Pos (0UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Pos) /*!< Bit
                                                                            mask of VoltageLevel field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Min (0x2UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_Max (0xFUL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_15Minutes (0x3UL) /*!< Block secure services until device has been
                                                                            powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_1Hour (0x4UL) /*!< Block secure services until device has been powered
                                                                          and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this
                                                                            bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_VoltageLevel_ResetOnly (0xFUL)

/* Watchdog @Bits 4..7 : Configure tamper policy for watchdog timer. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Pos (4UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Pos) /*!< Bit mask of
                                                                            Watchdog field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Min (0x2UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_Max (0xFUL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                           device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                          and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                      idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_Watchdog_ResetOnly (0xFUL)

/* ExternalActiveShield @Bits 12..15 : Configure tamper policy for external active shield. BICR is used to specify which
                                       channels (GPIOs) are enabled. */

  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Pos (12UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Pos)
                                                                            /*!< Bit mask of ExternalActiveShield field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Min (0x1UL) /*!< Min enumerator value of ExternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Max (0xFUL) /*!< Max enumerator value of ExternalActiveShield
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_Manual (0x1UL) /*!< Block secure services until requested to
                                                                            unblock secure services. Allows user application to
                                                                            take required actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_PowerCycle (0x2UL) /*!< Block secure services until power cycling
                                                                            the device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_15Minutes (0x3UL) /*!< Block secure services until device has
                                                                            been powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_1Hour (0x4UL) /*!< Block secure services until device has been
                                                                            powered and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning,
                                                                            this bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ExternalActiveShield_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic
                                                                            reset.*/

/* InternalDetectors @Bits 20..23 : Configure tamper policy for internal detectors including glitch detector, signal protector
                                    and CRACEN detector. See for more information. An automatic reset is issued upon detection.
                                    */

