pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Pos (20UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Pos)
                                                                            /*!< Bit mask of InternalDetectors field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Min (0x2UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_Max (0xFUL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_PowerCycle (0x2UL) /*!< Block secure services until power cycling
                                                                            the device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_15Minutes (0x3UL) /*!< Block secure services until device has been
                                                                            powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_1Hour (0x4UL) /*!< Block secure services until device has been
                                                                            powered and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this
                                                                            bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_InternalDetectors_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic
                                                                            reset.*/

/* HardFault @Bits 24..27 : Configure tamper policy for hard fault. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Pos (24UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Pos) /*!< Bit mask
                                                                            of HardFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Min (0x1UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Max (0xFUL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_Manual (0x1UL) /*!< Block secure services until requested to unblock secure
                                                                        services. Allows user application to take required
                                                                        actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                           and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                       idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_HardFault_ResetOnly (0xFUL)

/* ApiFault @Bits 28..31 : Configure tamper policy for invalid API usage. */
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Pos (28UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Pos) /*!< Bit mask of
                                                                            ApiFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Min (0x1UL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Max (0xFUL)
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_Manual (0x1UL) /*!< Block secure services until requested to unblock secure
                                                                       services. Allows user application to take required
                                                                       actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                           device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                          and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                      idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE0_ApiFault_ResetOnly (0xFUL)


/* UICR_TAMPER_DETECTION_RESPONSE1: (unspecified) */
  #define UICR_TAMPER_DETECTION_RESPONSE1_ResetValue (0xFFFFFFFFUL)

/* AdacFault @Bits 0..3 : Configure tamper policy for invalid ADAC usage. */
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Pos (0UL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Pos) /*!< Bit mask
                                                                            of AdacFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Min (0x1UL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Max (0xFUL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_Manual (0x1UL) /*!< Block secure services until requested to unblock secure
                                                                        services. Allows user application to take required
                                                                        actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                           and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                       idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_AdacFault_ResetOnly (0xFUL)

