pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* StateFault @Bits 4..7 : Configure tamper policy for illegal firmware execution state. Automatic reset is issued be secure
                           domain before secure services are permitted again. */

  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Pos (4UL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Pos) /*!< Bit mask
                                                                            of StateFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Min (0x1UL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Max (0xFUL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_Manual (0x1UL) /*!< Block secure services until requested to unblock secure
                                                                         services. Allows user application to take required
                                                                         actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_15Minutes (0x3UL) /*!< Block secure services until device has been powered
                                                                            and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_1Hour (0x4UL) /*!< Block secure services until device has been powered and
                                                                        idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this bricks
                                                                            the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_StateFault_ResetOnly (0xFUL)

/* TemperatureFault @Bits 8..11 : Configure out-of-range on-die temperature tamper policy. A reset is required to continue
                                  providing secure services once the on-temperature is within valid operating conditions again.
                                  This reset is automatically triggered by the secure domain. */

  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Pos (8UL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Msk (0xFUL << UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Pos)
                                                                            /*!< Bit mask of TemperatureFault field.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Min (0x1UL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Max (0xFUL)
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_Manual (0x1UL) /*!< Block secure services until requested to unblock
                                                                            secure services. Allows user application to take
                                                                            required actions.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_PowerCycle (0x2UL) /*!< Block secure services until power cycling the
                                                                            device.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_15Minutes (0x3UL) /*!< Block secure services until device has been
                                                                            powered and idle for 15 minutes.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_1Hour (0x4UL) /*!< Block secure services until device has been
                                                                            powered and idle for one hour.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_LCSDiscarded (0xAUL) /*!< Transition to LCS Discarded. Warning, this
                                                                            bricks the device permanently.*/
  #define UICR_TAMPER_DETECTION_RESPONSE1_TemperatureFault_ResetOnly (0xFUL) /*!< No addition penalty besides the automatic
                                                                            reset.*/


/* UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG: (unspecified) */
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_ResetValue (0xFFFFFFFFUL)

/* TemperatureDetectionStrategy @Bits 0..1 : Configure when on-die temperature sensor should check the temperature. */
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Pos (0UL) /*!< Position of
                                                                            TemperatureDetectionStrategy field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Msk (0x3UL << UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Pos)
                                                                            /*!< Bit mask of TemperatureDetectionStrategy
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Min (0x1UL) /*!< Min enumerator value of
                                                                            TemperatureDetectionStrategy field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Max (0x3UL) /*!< Max enumerator value of
                                                                            TemperatureDetectionStrategy field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_Periodically (0x1UL) /*!< On-die temperature
                                                                            sensor is read periodically with selected interval.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_OnServiceCallAndPeriodically (0x2UL) /*!< On-die
                                                                            temperature sensor is read before each secure
                                                                            service call and periodically with selected
                                                                            interval.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionStrategy_OnServiceCallOnly (0x3UL) /*!< On-die
                                                                            temperature sensor is read before each secure
                                                                            service call.*/

/* TemperatureDetectionInterval @Bits 2..3 : Configure interval for on-die temperature reading if periodic reading is enabled. */
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Pos (2UL) /*!< Position of
                                                                            TemperatureDetectionInterval field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Msk (0x3UL << UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Pos)
                                                                            /*!< Bit mask of TemperatureDetectionInterval
                                                                            field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Min (0x0UL) /*!< Min enumerator value of
                                                                            TemperatureDetectionInterval field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_Max (0x3UL) /*!< Max enumerator value of
                                                                            TemperatureDetectionInterval field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_1Minute (0x0UL) /*!< On-die temperature sensor
                                                                            is read with one minute intervals.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_15Minutes (0x2UL) /*!< On-die temperature sensor
                                                                            is read with 15 minutes intervals.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_TemperatureDetectionInterval_1Hour (0x3UL) /*!< On-die temperature sensor is
                                                                            read with one hour intervals.*/

/* LowTemperatureThresholdShift @Bits 4..11 : Low temperature detection threshold shift in degrees Celsius. The low temperature
                                              threshold is calculated by adding the threshold shift to the minimum operating
                                              temperature of the SoC. */

  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_LowTemperatureThresholdShift_Pos (4UL) /*!< Position of
                                                                            LowTemperatureThresholdShift field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_LowTemperatureThresholdShift_Msk (0xFFUL << UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_LowTemperatureThresholdShift_Pos)
                                                                            /*!< Bit mask of LowTemperatureThresholdShift
                                                                            field.*/

/* HighTemperatureThresholdShift @Bits 12..19 : High temperature detection threshold shift in degrees Celsius. The high
                                                temperature threshold is calculated by subtracting the threshold shift from the
                                                maximum operating temperature of the SoC. */

  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_HighTemperatureThresholdShift_Pos (12UL) /*!< Position of
                                                                            HighTemperatureThresholdShift field.*/
  #define UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_HighTemperatureThresholdShift_Msk (0xFFUL << UICR_TAMPER_DETECTION_TEMPDETECTORCONFIG_HighTemperatureThresholdShift_Pos)
                                                                            /*!< Bit mask of HighTemperatureThresholdShift
                                                                            field.*/



/* =========================================== Struct UICR_TAMPER_COUNTERMEASURES ============================================ */
/**
  * @brief COUNTERMEASURES [UICR_TAMPER_COUNTERMEASURES] Configuration of countermeasures.
  */
typedef struct {
  __IOM uint32_t  ENABLE;
} NRF_UICR_TAMPER_COUNTERMEASURES_Type;

/* UICR_TAMPER_COUNTERMEASURES_ENABLE: (unspecified) */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ResetValue (0xFFFFFFFFUL)

/* DPAAES @Bit 0 : Configure Differential Power Analysis countermeasure for CRACEN AES. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Pos (0UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Pos) /*!< Bit mask
                                                                            of DPAAES field.*/
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Min (0x0UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Max (0x1UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Enable (0x0UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAAES_Disable (0x1UL)

/* DPAPK @Bit 1 : Configure Differential Power Analysis countermeasure for CRACEN PK. */
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Pos (1UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Pos) /*!< Bit mask of
                                                                            DPAPK field.*/
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Min (0x0UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Max (0x1UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Enable (0x0UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_DPAPK_Disable (0x1UL)

/* ClockDithering @Bit 9 : Configure the clock dithering countermeasure. When enabled clock will be randomly jittered based on
                           TRNG. */

  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Pos (9UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Msk (0x1UL << UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Pos)
                                                                            /*!< Bit mask of ClockDithering field.*/
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Min (0x0UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Max (0x1UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Enable (0x0UL)
  #define UICR_TAMPER_COUNTERMEASURES_ENABLE_ClockDithering_Disable (0x1UL)



/* =================================================== Struct UICR_TAMPER ==================================================== */
/**
  * @brief TAMPER [UICR_TAMPER] (unspecified)
  */
typedef struct {
  __IOM NRF_UICR_TAMPER_DETECTION_Type DETECTION;    /*!< (@ 0x00000000) Tamper policy configuration for detected security
                                                                         events.*/
  __IOM NRF_UICR_TAMPER_COUNTERMEASURES_Type COUNTERMEASURES;
} NRF_UICR_TAMPER_Type;

/* ======================================================= Struct UICR ======================================================= */
/**
  * @brief User information configuration registers
  */
  typedef struct {
    __IOM NRF_UICR_MEM_Type MEM[16];
    __IM uint32_t RESERVED[32];
    __IOM NRF_UICR_PERIPH_Type PERIPH[192];
    __IM uint32_t RESERVED1[32];
    __IOM NRF_UICR_GPIOTE_Type GPIOTE[4];
    __IOM NRF_UICR_IPCT_Type IPCT;
    __IOM NRF_UICR_DPPI_Type DPPI;
    __IM uint32_t RESERVED2[2];
    __IOM NRF_UICR_GRTC_Type GRTC;
    __IM uint32_t RESERVED3[6];
    __IOM uint32_t IPCMAP[16];
    __IM uint32_t RESERVED4[16];
    __IOM NRF_UICR_MAILBOX_Type MAILBOX[8];
    __IOM NRF_UICR_TRACE_Type TRACE;
    __IM uint32_t RESERVED5[4];
    __IOM NRF_UICR_TAMPER_Type TAMPER;
    __IM uint32_t RESERVED6[3];
    __IOM uint32_t INITSVTOR;                        /*!< (@ 0x00000780) Initial value of the secure VTOR (Vector Table Offset
                                                                         Register) after CPU reset.*/
    __IOM uint32_t INITNSVTOR;                       /*!< (@ 0x00000784) Initial value of the non-secure VTOR (Vector Table
                                                                         Offset Register).*/
    __IM uint32_t RESERVED7[29];
    __IOM uint32_t PTREXTUICR;
  } NRF_UICR_Type;

/* UICR_IPCMAP: Request configuration for the channel n of IPCMAP */
  #define UICR_IPCMAP_MaxCount (16UL)
  #define UICR_IPCMAP_MaxIndex (15UL)
  #define UICR_IPCMAP_MinIndex (0UL)
  #define UICR_IPCMAP_ResetValue (0xFFFFFFFFUL)

