pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* IPCTCHSINK @Bits 0..7 : IPCT channel number (sink side) */
  #define UICR_IPCMAP_IPCTCHSINK_Pos (0UL)
  #define UICR_IPCMAP_IPCTCHSINK_Msk (0xFFUL << UICR_IPCMAP_IPCTCHSINK_Pos)

/* DOMAINIDSINK @Bits 8..11 : Domain ID (sink side) */
  #define UICR_IPCMAP_DOMAINIDSINK_Pos (8UL)
  #define UICR_IPCMAP_DOMAINIDSINK_Msk (0xFUL << UICR_IPCMAP_DOMAINIDSINK_Pos)

/* IPCTCHSOURCE @Bits 16..23 : IPCT channel number (source side) */
  #define UICR_IPCMAP_IPCTCHSOURCE_Pos (16UL)
  #define UICR_IPCMAP_IPCTCHSOURCE_Msk (0xFFUL << UICR_IPCMAP_IPCTCHSOURCE_Pos)

/* DOMAINIDSOURCE @Bits 24..27 : Domain ID (source side) */
  #define UICR_IPCMAP_DOMAINIDSOURCE_Pos (24UL)
  #define UICR_IPCMAP_DOMAINIDSOURCE_Msk (0xFUL << UICR_IPCMAP_DOMAINIDSOURCE_Pos)


/* UICR_INITSVTOR: Initial value of the secure VTOR (Vector Table Offset Register) after CPU reset. */
  #define UICR_INITSVTOR_ResetValue (0xFFFFFFFFUL)

/* INITSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define UICR_INITSVTOR_INITSVTOR_Pos (0UL)
  #define UICR_INITSVTOR_INITSVTOR_Msk (0xFFFFFFFFUL << UICR_INITSVTOR_INITSVTOR_Pos)


/* UICR_INITNSVTOR: Initial value of the non-secure VTOR (Vector Table Offset Register). */
  #define UICR_INITNSVTOR_ResetValue (0xFFFFFFFFUL)

/* INITNSVTOR @Bits 0..31 : Initial value of the VTOR. */
  #define UICR_INITNSVTOR_INITNSVTOR_Pos (0UL)
  #define UICR_INITNSVTOR_INITNSVTOR_Msk (0xFFFFFFFFUL << UICR_INITNSVTOR_INITNSVTOR_Pos)


/* UICR_PTREXTUICR: Pointer to extended UICR. */
  #define UICR_PTREXTUICR_ResetValue (0xFFFFFFFFUL)

/* PTREXTUICR @Bits 0..31 : Pointer to extended UICR. */
  #define UICR_PTREXTUICR_PTREXTUICR_Pos (0UL)
  #define UICR_PTREXTUICR_PTREXTUICR_Msk (0xFFFFFFFFUL << UICR_PTREXTUICR_PTREXTUICR_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                       UICREXTENDED                                       ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================== Struct UICREXTENDED_GPIO_PIN =============================================== */
/**
  * @brief PIN [UICREXTENDED_GPIO_PIN] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRLSEL;
} NRF_UICREXTENDED_GPIO_PIN_Type;
  #define UICREXTENDED_GPIO_PIN_MaxCount (14UL)
  #define UICREXTENDED_GPIO_PIN_MaxIndex (13UL)
  #define UICREXTENDED_GPIO_PIN_MinIndex (0UL)

/* UICREXTENDED_GPIO_PIN_CTRLSEL: CTRLSEL values for PIN[o] of GPIO port P[n] */

/* CTRLSEL @Bits 0..2 : CTRLSEL value */
  #define UICREXTENDED_GPIO_PIN_CTRLSEL_CTRLSEL_Pos (0UL)
  #define UICREXTENDED_GPIO_PIN_CTRLSEL_CTRLSEL_Msk (0x7UL << UICREXTENDED_GPIO_PIN_CTRLSEL_CTRLSEL_Pos) /*!< Bit mask of
                                                                            CTRLSEL field.*/



/* ================================================ Struct UICREXTENDED_GPIO ================================================= */
/**
  * @brief GPIO [UICREXTENDED_GPIO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INSTANCE;
  __IOM uint32_t  OWN;
  __IOM uint32_t  SECURE;
  __IOM NRF_UICREXTENDED_GPIO_PIN_Type PIN[14];
} NRF_UICREXTENDED_GPIO_Type;
  #define UICREXTENDED_GPIO_MaxCount (14UL)
  #define UICREXTENDED_GPIO_MaxIndex (13UL)
  #define UICREXTENDED_GPIO_MinIndex (0UL)

/* UICREXTENDED_GPIO_INSTANCE: Address of the GPIO instance associated with GPIO[n] */

/* ADDRESS @Bits 0..31 : Instance address */
  #define UICREXTENDED_GPIO_INSTANCE_ADDRESS_Pos (0UL)
  #define UICREXTENDED_GPIO_INSTANCE_ADDRESS_Msk (0xFFFFFFFFUL << UICREXTENDED_GPIO_INSTANCE_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/


/* UICREXTENDED_GPIO_OWN: Request ownership of the pins at GPIO port P[n] */

/* PIN0 @Bit 0 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN0_Pos (0UL)
  #define UICREXTENDED_GPIO_OWN_PIN0_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN0_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN0_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN0_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN0_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN0_Own (0x0UL)

/* PIN1 @Bit 1 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN1_Pos (1UL)
  #define UICREXTENDED_GPIO_OWN_PIN1_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN1_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN1_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN1_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN1_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN1_Own (0x0UL)

/* PIN2 @Bit 2 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN2_Pos (2UL)
  #define UICREXTENDED_GPIO_OWN_PIN2_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN2_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN2_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN2_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN2_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN2_Own (0x0UL)

/* PIN3 @Bit 3 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN3_Pos (3UL)
  #define UICREXTENDED_GPIO_OWN_PIN3_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN3_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN3_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN3_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN3_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN3_Own (0x0UL)

/* PIN4 @Bit 4 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN4_Pos (4UL)
  #define UICREXTENDED_GPIO_OWN_PIN4_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN4_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN4_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN4_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN4_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN4_Own (0x0UL)

/* PIN5 @Bit 5 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN5_Pos (5UL)
  #define UICREXTENDED_GPIO_OWN_PIN5_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN5_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN5_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN5_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN5_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN5_Own (0x0UL)

/* PIN6 @Bit 6 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN6_Pos (6UL)
  #define UICREXTENDED_GPIO_OWN_PIN6_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN6_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN6_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN6_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN6_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN6_Own (0x0UL)

/* PIN7 @Bit 7 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN7_Pos (7UL)
  #define UICREXTENDED_GPIO_OWN_PIN7_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN7_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN7_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN7_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN7_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN7_Own (0x0UL)

/* PIN8 @Bit 8 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN8_Pos (8UL)
  #define UICREXTENDED_GPIO_OWN_PIN8_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN8_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN8_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN8_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN8_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN8_Own (0x0UL)

/* PIN9 @Bit 9 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN9_Pos (9UL)
  #define UICREXTENDED_GPIO_OWN_PIN9_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN9_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN9_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN9_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN9_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN9_Own (0x0UL)

