pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN10 @Bit 10 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN10_Pos (10UL)
  #define UICREXTENDED_GPIO_OWN_PIN10_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN10_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN10_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN10_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN10_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN10_Own (0x0UL)

/* PIN11 @Bit 11 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN11_Pos (11UL)
  #define UICREXTENDED_GPIO_OWN_PIN11_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN11_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN11_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN11_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN11_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN11_Own (0x0UL)

/* PIN12 @Bit 12 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN12_Pos (12UL)
  #define UICREXTENDED_GPIO_OWN_PIN12_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN12_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN12_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN12_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN12_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN12_Own (0x0UL)

/* PIN13 @Bit 13 : Pin number */
  #define UICREXTENDED_GPIO_OWN_PIN13_Pos (13UL)
  #define UICREXTENDED_GPIO_OWN_PIN13_Msk (0x1UL << UICREXTENDED_GPIO_OWN_PIN13_Pos)
  #define UICREXTENDED_GPIO_OWN_PIN13_Min (0x0UL)
  #define UICREXTENDED_GPIO_OWN_PIN13_Max (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN13_NotOwn (0x1UL)
  #define UICREXTENDED_GPIO_OWN_PIN13_Own (0x0UL)


/* UICREXTENDED_GPIO_SECURE: Request permission for the pins at GPIO port P[n] */

/* PIN0 @Bit 0 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN0_Pos (0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN0_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN0_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN0_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN0_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN0_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN0_NonSecure (0x0UL)

/* PIN1 @Bit 1 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN1_Pos (1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN1_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN1_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN1_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN1_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN1_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN1_NonSecure (0x0UL)

/* PIN2 @Bit 2 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN2_Pos (2UL)
  #define UICREXTENDED_GPIO_SECURE_PIN2_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN2_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN2_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN2_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN2_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN2_NonSecure (0x0UL)

/* PIN3 @Bit 3 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN3_Pos (3UL)
  #define UICREXTENDED_GPIO_SECURE_PIN3_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN3_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN3_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN3_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN3_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN3_NonSecure (0x0UL)

/* PIN4 @Bit 4 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN4_Pos (4UL)
  #define UICREXTENDED_GPIO_SECURE_PIN4_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN4_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN4_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN4_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN4_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN4_NonSecure (0x0UL)

/* PIN5 @Bit 5 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN5_Pos (5UL)
  #define UICREXTENDED_GPIO_SECURE_PIN5_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN5_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN5_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN5_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN5_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN5_NonSecure (0x0UL)

/* PIN6 @Bit 6 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN6_Pos (6UL)
  #define UICREXTENDED_GPIO_SECURE_PIN6_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN6_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN6_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN6_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN6_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN6_NonSecure (0x0UL)

/* PIN7 @Bit 7 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN7_Pos (7UL)
  #define UICREXTENDED_GPIO_SECURE_PIN7_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN7_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN7_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN7_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN7_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN7_NonSecure (0x0UL)

/* PIN8 @Bit 8 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN8_Pos (8UL)
  #define UICREXTENDED_GPIO_SECURE_PIN8_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN8_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN8_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN8_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN8_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN8_NonSecure (0x0UL)

/* PIN9 @Bit 9 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN9_Pos (9UL)
  #define UICREXTENDED_GPIO_SECURE_PIN9_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN9_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN9_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN9_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN9_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN9_NonSecure (0x0UL)

/* PIN10 @Bit 10 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN10_Pos (10UL)
  #define UICREXTENDED_GPIO_SECURE_PIN10_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN10_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN10_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN10_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN10_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN10_NonSecure (0x0UL)

/* PIN11 @Bit 11 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN11_Pos (11UL)
  #define UICREXTENDED_GPIO_SECURE_PIN11_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN11_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN11_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN11_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN11_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN11_NonSecure (0x0UL)

/* PIN12 @Bit 12 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN12_Pos (12UL)
  #define UICREXTENDED_GPIO_SECURE_PIN12_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN12_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN12_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN12_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN12_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN12_NonSecure (0x0UL)

/* PIN13 @Bit 13 : Pin number */
  #define UICREXTENDED_GPIO_SECURE_PIN13_Pos (13UL)
  #define UICREXTENDED_GPIO_SECURE_PIN13_Msk (0x1UL << UICREXTENDED_GPIO_SECURE_PIN13_Pos)
  #define UICREXTENDED_GPIO_SECURE_PIN13_Min (0x0UL)
  #define UICREXTENDED_GPIO_SECURE_PIN13_Max (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN13_Secure (0x1UL)
  #define UICREXTENDED_GPIO_SECURE_PIN13_NonSecure (0x0UL)


