pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* =================================================== Struct UICREXTENDED =================================================== */
/**
  * @brief Extended UICR.
  */
  typedef struct {
    __IOM NRF_UICREXTENDED_GPIO_Type GPIO[14];
  } NRF_UICREXTENDED_Type;

#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           USBHS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct USBHS ======================================================= */
/**
  * @brief USBHS
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __IM uint32_t RESERVED[63];
    __IOM uint32_t EVENTS_CORE;                      /*!< (@ 0x00000100) Event indicating that interrupt triggered at USBHS
                                                                         core*/
    __IM uint32_t RESERVED1[127];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t ENABLE;
  } NRF_USBHS_Type;

/* USBHS_TASKS_START: Start the USB peripheral. */
  #define USBHS_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start the USB peripheral. */
  #define USBHS_TASKS_START_TASKS_START_Pos (0UL)
  #define USBHS_TASKS_START_TASKS_START_Msk (0x1UL << USBHS_TASKS_START_TASKS_START_Pos)
  #define USBHS_TASKS_START_TASKS_START_Min (0x1UL)
  #define USBHS_TASKS_START_TASKS_START_Max (0x1UL)
  #define USBHS_TASKS_START_TASKS_START_Trigger (0x1UL)


/* USBHS_EVENTS_CORE: Event indicating that interrupt triggered at USBHS core */
  #define USBHS_EVENTS_CORE_ResetValue (0x00000000UL)

/* EVENTS_CORE @Bit 0 : Event indicating that interrupt triggered at USBHS core */
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Pos (0UL)
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Msk (0x1UL << USBHS_EVENTS_CORE_EVENTS_CORE_Pos)
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Min (0x0UL)
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Max (0x1UL)
  #define USBHS_EVENTS_CORE_EVENTS_CORE_NotGenerated (0x0UL)
  #define USBHS_EVENTS_CORE_EVENTS_CORE_Generated (0x1UL)


/* USBHS_INTEN: Enable or disable interrupt */
  #define USBHS_INTEN_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Enable or disable interrupt for event CORE */
  #define USBHS_INTEN_CORE_Pos (0UL)
  #define USBHS_INTEN_CORE_Msk (0x1UL << USBHS_INTEN_CORE_Pos)
  #define USBHS_INTEN_CORE_Min (0x0UL)
  #define USBHS_INTEN_CORE_Max (0x1UL)
  #define USBHS_INTEN_CORE_Disabled (0x0UL)
  #define USBHS_INTEN_CORE_Enabled (0x1UL)


/* USBHS_INTENSET: Enable interrupt */
  #define USBHS_INTENSET_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Write '1' to enable interrupt for event CORE */
  #define USBHS_INTENSET_CORE_Pos (0UL)
  #define USBHS_INTENSET_CORE_Msk (0x1UL << USBHS_INTENSET_CORE_Pos)
  #define USBHS_INTENSET_CORE_Min (0x0UL)
  #define USBHS_INTENSET_CORE_Max (0x1UL)
  #define USBHS_INTENSET_CORE_Set (0x1UL)
  #define USBHS_INTENSET_CORE_Disabled (0x0UL)
  #define USBHS_INTENSET_CORE_Enabled (0x1UL)


/* USBHS_INTENCLR: Disable interrupt */
  #define USBHS_INTENCLR_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Write '1' to disable interrupt for event CORE */
  #define USBHS_INTENCLR_CORE_Pos (0UL)
  #define USBHS_INTENCLR_CORE_Msk (0x1UL << USBHS_INTENCLR_CORE_Pos)
  #define USBHS_INTENCLR_CORE_Min (0x0UL)
  #define USBHS_INTENCLR_CORE_Max (0x1UL)
  #define USBHS_INTENCLR_CORE_Clear (0x1UL)
  #define USBHS_INTENCLR_CORE_Disabled (0x0UL)
  #define USBHS_INTENCLR_CORE_Enabled (0x1UL)


/* USBHS_INTPEND: Pending interrupts */
  #define USBHS_INTPEND_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Read pending status of interrupt for event CORE */
  #define USBHS_INTPEND_CORE_Pos (0UL)
  #define USBHS_INTPEND_CORE_Msk (0x1UL << USBHS_INTPEND_CORE_Pos)
  #define USBHS_INTPEND_CORE_Min (0x0UL)
  #define USBHS_INTPEND_CORE_Max (0x1UL)
  #define USBHS_INTPEND_CORE_NotPending (0x0UL)
  #define USBHS_INTPEND_CORE_Pending (0x1UL)


/* USBHS_ENABLE: Enable USB peripheral. */
  #define USBHS_ENABLE_ResetValue (0x00000000UL)

/* CORE @Bit 0 : Enable USB Controller */
  #define USBHS_ENABLE_CORE_Pos (0UL)
  #define USBHS_ENABLE_CORE_Msk (0x1UL << USBHS_ENABLE_CORE_Pos)
  #define USBHS_ENABLE_CORE_Min (0x0UL)
  #define USBHS_ENABLE_CORE_Max (0x1UL)
  #define USBHS_ENABLE_CORE_Disabled (0x0UL)
  #define USBHS_ENABLE_CORE_Enabled (0x1UL)

/* PHY @Bit 1 : Enable USB PHY */
  #define USBHS_ENABLE_PHY_Pos (1UL)
  #define USBHS_ENABLE_PHY_Msk (0x1UL << USBHS_ENABLE_PHY_Pos)
  #define USBHS_ENABLE_PHY_Min (0x0UL)
  #define USBHS_ENABLE_PHY_Max (0x1UL)
  #define USBHS_ENABLE_PHY_Disabled (0x0UL)
  #define USBHS_ENABLE_PHY_Enabled (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         USBHSCORE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct USBHSCORE_HC =================================================== */
/**
  * @brief HC [USBHSCORE_HC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CHAR;
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  INT;
  __IOM uint32_t  INTMSK;
  __IOM uint32_t  TSIZ;
  __IOM uint32_t  DMA;
} NRF_USBHSCORE_HC_Type;
  #define USBHSCORE_HC_MaxCount (16UL)
  #define USBHSCORE_HC_MaxIndex (15UL)
  #define USBHSCORE_HC_MinIndex (0UL)

/* USBHSCORE_HC_CHAR: Host Channel Characteristics Register */
  #define USBHSCORE_HC_CHAR_ResetValue (0x00000000UL)

