pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_HC_CHAR_MPS_Pos (0UL)
  #define USBHSCORE_HC_CHAR_MPS_Msk (0x7FFUL << USBHSCORE_HC_CHAR_MPS_Pos)

/* EPNUM @Bits 11..14 : Endpoint Number (EPNum) */
  #define USBHSCORE_HC_CHAR_EPNUM_Pos (11UL)
  #define USBHSCORE_HC_CHAR_EPNUM_Msk (0xFUL << USBHSCORE_HC_CHAR_EPNUM_Pos)
  #define USBHSCORE_HC_CHAR_EPNUM_Min (0x0UL)
  #define USBHSCORE_HC_CHAR_EPNUM_Max (0xFUL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT0 (0x0UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT1 (0x1UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT2 (0x2UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT3 (0x3UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT4 (0x4UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT5 (0x5UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT6 (0x6UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT7 (0x7UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT8 (0x8UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT9 (0x9UL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT10 (0xAUL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT11 (0xBUL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT12 (0xCUL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT13 (0xDUL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT14 (0xEUL)
  #define USBHSCORE_HC_CHAR_EPNUM_ENDPT15 (0xFUL)

/* EPDIR @Bit 15 : Endpoint Direction (EPDir) */
  #define USBHSCORE_HC_CHAR_EPDIR_Pos (15UL)
  #define USBHSCORE_HC_CHAR_EPDIR_Msk (0x1UL << USBHSCORE_HC_CHAR_EPDIR_Pos)
  #define USBHSCORE_HC_CHAR_EPDIR_Min (0x0UL)
  #define USBHSCORE_HC_CHAR_EPDIR_Max (0x1UL)
  #define USBHSCORE_HC_CHAR_EPDIR_OUT (0x0UL)
  #define USBHSCORE_HC_CHAR_EPDIR_IN (0x1UL)

/* LSPDDEV @Bit 17 : Low-Speed Device (LSpdDev) */
  #define USBHSCORE_HC_CHAR_LSPDDEV_Pos (17UL)
  #define USBHSCORE_HC_CHAR_LSPDDEV_Msk (0x1UL << USBHSCORE_HC_CHAR_LSPDDEV_Pos)
  #define USBHSCORE_HC_CHAR_LSPDDEV_Min (0x0UL)
  #define USBHSCORE_HC_CHAR_LSPDDEV_Max (0x1UL)
  #define USBHSCORE_HC_CHAR_LSPDDEV_DISABLED (0x0UL)
  #define USBHSCORE_HC_CHAR_LSPDDEV_ENABLED (0x1UL)

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_HC_CHAR_EPTYPE_Pos (18UL)
  #define USBHSCORE_HC_CHAR_EPTYPE_Msk (0x3UL << USBHSCORE_HC_CHAR_EPTYPE_Pos)
  #define USBHSCORE_HC_CHAR_EPTYPE_Min (0x0UL)
  #define USBHSCORE_HC_CHAR_EPTYPE_Max (0x3UL)
  #define USBHSCORE_HC_CHAR_EPTYPE_CTRL (0x0UL)
  #define USBHSCORE_HC_CHAR_EPTYPE_ISOC (0x1UL)
  #define USBHSCORE_HC_CHAR_EPTYPE_BULK (0x2UL)
  #define USBHSCORE_HC_CHAR_EPTYPE_INTERR (0x3UL)

/* EC @Bits 20..21 : Multi Count (MC) / Error Count (EC) */
  #define USBHSCORE_HC_CHAR_EC_Pos (20UL)
  #define USBHSCORE_HC_CHAR_EC_Msk (0x3UL << USBHSCORE_HC_CHAR_EC_Pos)
  #define USBHSCORE_HC_CHAR_EC_Min (0x1UL)
  #define USBHSCORE_HC_CHAR_EC_Max (0x3UL)
  #define USBHSCORE_HC_CHAR_EC_TRANSONE (0x1UL)
  #define USBHSCORE_HC_CHAR_EC_TRANSTWO (0x2UL)
  #define USBHSCORE_HC_CHAR_EC_TRANSTHREE (0x3UL)

/* DEVADDR @Bits 22..28 : Device Address (DevAddr) */
  #define USBHSCORE_HC_CHAR_DEVADDR_Pos (22UL)
  #define USBHSCORE_HC_CHAR_DEVADDR_Msk (0x7FUL << USBHSCORE_HC_CHAR_DEVADDR_Pos)

/* ODDFRM @Bit 29 : Odd Frame (OddFrm) */
  #define USBHSCORE_HC_CHAR_ODDFRM_Pos (29UL)
  #define USBHSCORE_HC_CHAR_ODDFRM_Msk (0x1UL << USBHSCORE_HC_CHAR_ODDFRM_Pos)
  #define USBHSCORE_HC_CHAR_ODDFRM_Min (0x0UL)
  #define USBHSCORE_HC_CHAR_ODDFRM_Max (0x1UL)
  #define USBHSCORE_HC_CHAR_ODDFRM_EFRAME (0x0UL)
  #define USBHSCORE_HC_CHAR_ODDFRM_OFRAME (0x1UL)

/* CHDIS @Bit 30 : Channel Disable (ChDis) */
  #define USBHSCORE_HC_CHAR_CHDIS_Pos (30UL)
  #define USBHSCORE_HC_CHAR_CHDIS_Msk (0x1UL << USBHSCORE_HC_CHAR_CHDIS_Pos)
  #define USBHSCORE_HC_CHAR_CHDIS_Min (0x0UL)
  #define USBHSCORE_HC_CHAR_CHDIS_Max (0x1UL)
  #define USBHSCORE_HC_CHAR_CHDIS_INACTIVE (0x0UL)
  #define USBHSCORE_HC_CHAR_CHDIS_ACTIVE (0x1UL)

/* CHENA @Bit 31 : Channel Enable (ChEna) */
  #define USBHSCORE_HC_CHAR_CHENA_Pos (31UL)
  #define USBHSCORE_HC_CHAR_CHENA_Msk (0x1UL << USBHSCORE_HC_CHAR_CHENA_Pos)
  #define USBHSCORE_HC_CHAR_CHENA_Min (0x0UL)
  #define USBHSCORE_HC_CHAR_CHENA_Max (0x1UL)
  #define USBHSCORE_HC_CHAR_CHENA_DISABLED (0x0UL)   /*!< If Scatter/Gather mode is enabled, indicates that the descriptor
                                                          structure is not yet ready. If Scatter/Gather mode is disabled,
                                                          indicates that the channel is disabled.*/
  #define USBHSCORE_HC_CHAR_CHENA_ENABLED (0x1UL)    /*!< If Scatter/Gather mode is enabled, indicates that the descriptor
                                                          structure and data buffer with data is set up and this channel can
                                                          access the descriptor. If Scatter/Gather mode is disabled, indicates
                                                          that the channel is enabled.*/


/* USBHSCORE_HC_INT: Host Channel Interrupt Register */
  #define USBHSCORE_HC_INT_ResetValue (0x00000000UL)

/* XFERCOMPL @Bit 0 : Transfer Completed (XferCompl) */
  #define USBHSCORE_HC_INT_XFERCOMPL_Pos (0UL)
  #define USBHSCORE_HC_INT_XFERCOMPL_Msk (0x1UL << USBHSCORE_HC_INT_XFERCOMPL_Pos)
  #define USBHSCORE_HC_INT_XFERCOMPL_Min (0x0UL)
  #define USBHSCORE_HC_INT_XFERCOMPL_Max (0x1UL)
  #define USBHSCORE_HC_INT_XFERCOMPL_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_XFERCOMPL_ACTIVE (0x1UL)

/* CHHLTD @Bit 1 : Channel Halted (ChHltd) */
  #define USBHSCORE_HC_INT_CHHLTD_Pos (1UL)
  #define USBHSCORE_HC_INT_CHHLTD_Msk (0x1UL << USBHSCORE_HC_INT_CHHLTD_Pos)
  #define USBHSCORE_HC_INT_CHHLTD_Min (0x0UL)
  #define USBHSCORE_HC_INT_CHHLTD_Max (0x1UL)
  #define USBHSCORE_HC_INT_CHHLTD_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_CHHLTD_ACTIVE (0x1UL)

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_HC_INT_AHBERR_Pos (2UL)
  #define USBHSCORE_HC_INT_AHBERR_Msk (0x1UL << USBHSCORE_HC_INT_AHBERR_Pos)
  #define USBHSCORE_HC_INT_AHBERR_Min (0x0UL)
  #define USBHSCORE_HC_INT_AHBERR_Max (0x1UL)
  #define USBHSCORE_HC_INT_AHBERR_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_AHBERR_ACTIVE (0x1UL)

/* STALL @Bit 3 : STALL Response Received Interrupt (STALL) */
  #define USBHSCORE_HC_INT_STALL_Pos (3UL)
  #define USBHSCORE_HC_INT_STALL_Msk (0x1UL << USBHSCORE_HC_INT_STALL_Pos)
  #define USBHSCORE_HC_INT_STALL_Min (0x0UL)
  #define USBHSCORE_HC_INT_STALL_Max (0x1UL)
  #define USBHSCORE_HC_INT_STALL_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_STALL_ACTIVE (0x1UL)

