pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* NAK @Bit 4 : NAK Response Received Interrupt (NAK) */
  #define USBHSCORE_HC_INT_NAK_Pos (4UL)
  #define USBHSCORE_HC_INT_NAK_Msk (0x1UL << USBHSCORE_HC_INT_NAK_Pos)
  #define USBHSCORE_HC_INT_NAK_Min (0x0UL)
  #define USBHSCORE_HC_INT_NAK_Max (0x1UL)
  #define USBHSCORE_HC_INT_NAK_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_NAK_ACTIVE (0x1UL)

/* ACK @Bit 5 : ACK Response Received/Transmitted Interrupt (ACK) */
  #define USBHSCORE_HC_INT_ACK_Pos (5UL)
  #define USBHSCORE_HC_INT_ACK_Msk (0x1UL << USBHSCORE_HC_INT_ACK_Pos)
  #define USBHSCORE_HC_INT_ACK_Min (0x0UL)
  #define USBHSCORE_HC_INT_ACK_Max (0x1UL)
  #define USBHSCORE_HC_INT_ACK_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_ACK_ACTIVE (0x1UL)

/* NYET @Bit 6 : NYET Response Received Interrupt (NYET) */
  #define USBHSCORE_HC_INT_NYET_Pos (6UL)
  #define USBHSCORE_HC_INT_NYET_Msk (0x1UL << USBHSCORE_HC_INT_NYET_Pos)
  #define USBHSCORE_HC_INT_NYET_Min (0x0UL)
  #define USBHSCORE_HC_INT_NYET_Max (0x1UL)
  #define USBHSCORE_HC_INT_NYET_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_NYET_ACTIVE (0x1UL)

/* XACTERR @Bit 7 : Transaction Error (XactErr) */
  #define USBHSCORE_HC_INT_XACTERR_Pos (7UL)
  #define USBHSCORE_HC_INT_XACTERR_Msk (0x1UL << USBHSCORE_HC_INT_XACTERR_Pos)
  #define USBHSCORE_HC_INT_XACTERR_Min (0x0UL)
  #define USBHSCORE_HC_INT_XACTERR_Max (0x1UL)
  #define USBHSCORE_HC_INT_XACTERR_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_XACTERR_ACTIVE (0x1UL)

/* BBLERR @Bit 8 : Babble Error (BblErr) */
  #define USBHSCORE_HC_INT_BBLERR_Pos (8UL)
  #define USBHSCORE_HC_INT_BBLERR_Msk (0x1UL << USBHSCORE_HC_INT_BBLERR_Pos)
  #define USBHSCORE_HC_INT_BBLERR_Min (0x0UL)
  #define USBHSCORE_HC_INT_BBLERR_Max (0x1UL)
  #define USBHSCORE_HC_INT_BBLERR_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_BBLERR_ACTIVE (0x1UL)

/* FRMOVRUN @Bit 9 : Frame Overrun (FrmOvrun). */
  #define USBHSCORE_HC_INT_FRMOVRUN_Pos (9UL)
  #define USBHSCORE_HC_INT_FRMOVRUN_Msk (0x1UL << USBHSCORE_HC_INT_FRMOVRUN_Pos)
  #define USBHSCORE_HC_INT_FRMOVRUN_Min (0x0UL)
  #define USBHSCORE_HC_INT_FRMOVRUN_Max (0x1UL)
  #define USBHSCORE_HC_INT_FRMOVRUN_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_FRMOVRUN_ACTIVE (0x1UL)

/* DATATGLERR @Bit 10 : (unspecified) */
  #define USBHSCORE_HC_INT_DATATGLERR_Pos (10UL)
  #define USBHSCORE_HC_INT_DATATGLERR_Msk (0x1UL << USBHSCORE_HC_INT_DATATGLERR_Pos)
  #define USBHSCORE_HC_INT_DATATGLERR_Min (0x0UL)
  #define USBHSCORE_HC_INT_DATATGLERR_Max (0x1UL)
  #define USBHSCORE_HC_INT_DATATGLERR_INACTIVE (0x0UL)
  #define USBHSCORE_HC_INT_DATATGLERR_ACTIVE (0x1UL)


/* USBHSCORE_HC_INTMSK: Host Channel Interrupt Mask Register */
  #define USBHSCORE_HC_INTMSK_ResetValue (0x00000000UL)

/* XFERCOMPLMSK @Bit 0 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Pos (0UL)
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Pos) /*!< Bit mask of XFERCOMPLMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_XFERCOMPLMSK_NOMASK (0x1UL)

/* CHHLTDMSK @Bit 1 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Pos (1UL)
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_CHHLTDMSK_Pos)
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_CHHLTDMSK_NOMASK (0x1UL)

/* AHBERRMSK @Bit 2 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Pos (2UL)
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_AHBERRMSK_Pos)
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_AHBERRMSK_NOMASK (0x1UL)

/* STALLMSK @Bit 3 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_STALLMSK_Pos (3UL)
  #define USBHSCORE_HC_INTMSK_STALLMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_STALLMSK_Pos)
  #define USBHSCORE_HC_INTMSK_STALLMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_STALLMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_STALLMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_STALLMSK_NOMASK (0x1UL)

/* NAKMSK @Bit 4 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_NAKMSK_Pos (4UL)
  #define USBHSCORE_HC_INTMSK_NAKMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_NAKMSK_Pos)
  #define USBHSCORE_HC_INTMSK_NAKMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_NAKMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_NAKMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_NAKMSK_NOMASK (0x1UL)

/* ACKMSK @Bit 5 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_ACKMSK_Pos (5UL)
  #define USBHSCORE_HC_INTMSK_ACKMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_ACKMSK_Pos)
  #define USBHSCORE_HC_INTMSK_ACKMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_ACKMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_ACKMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_ACKMSK_NOMASK (0x1UL)

/* NYETMSK @Bit 6 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_NYETMSK_Pos (6UL)
  #define USBHSCORE_HC_INTMSK_NYETMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_NYETMSK_Pos)
  #define USBHSCORE_HC_INTMSK_NYETMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_NYETMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_NYETMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_NYETMSK_NOMASK (0x1UL)

/* XACTERRMSK @Bit 7 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Pos (7UL)
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_XACTERRMSK_Pos)
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_XACTERRMSK_NOMASK (0x1UL)

/* BBLERRMSK @Bit 8 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Pos (8UL)
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_BBLERRMSK_Pos)
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_BBLERRMSK_NOMASK (0x1UL)

