pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* FRMOVRUNMSK @Bit 9 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Pos (9UL)
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Pos) /*!< Bit mask of FRMOVRUNMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_FRMOVRUNMSK_NOMASK (0x1UL)

/* DATATGLERRMSK @Bit 10 : (unspecified) */
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Pos (10UL)
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Msk (0x1UL << USBHSCORE_HC_INTMSK_DATATGLERRMSK_Pos) /*!< Bit mask of DATATGLERRMSK
                                                                            field.*/
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Min (0x0UL)
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_Max (0x1UL)
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_MASK (0x0UL)
  #define USBHSCORE_HC_INTMSK_DATATGLERRMSK_NOMASK (0x1UL)


/* USBHSCORE_HC_TSIZ: Host Channel Transfer Size Register */
  #define USBHSCORE_HC_TSIZ_ResetValue (0x00000000UL)

/* XFERSIZE @Bits 0..18 : Non-Scatter/Gather DMA Mode: */
  #define USBHSCORE_HC_TSIZ_XFERSIZE_Pos (0UL)
  #define USBHSCORE_HC_TSIZ_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_HC_TSIZ_XFERSIZE_Pos)

/* PKTCNT @Bits 19..28 : Non-Scatter/Gather DMA Mode: */
  #define USBHSCORE_HC_TSIZ_PKTCNT_Pos (19UL)
  #define USBHSCORE_HC_TSIZ_PKTCNT_Msk (0x3FFUL << USBHSCORE_HC_TSIZ_PKTCNT_Pos)

/* PID @Bits 29..30 : PID (Pid) */
  #define USBHSCORE_HC_TSIZ_PID_Pos (29UL)
  #define USBHSCORE_HC_TSIZ_PID_Msk (0x3UL << USBHSCORE_HC_TSIZ_PID_Pos)
  #define USBHSCORE_HC_TSIZ_PID_Min (0x0UL)
  #define USBHSCORE_HC_TSIZ_PID_Max (0x3UL)
  #define USBHSCORE_HC_TSIZ_PID_DATA0 (0x0UL)
  #define USBHSCORE_HC_TSIZ_PID_DATA2 (0x1UL)
  #define USBHSCORE_HC_TSIZ_PID_DATA1 (0x2UL)
  #define USBHSCORE_HC_TSIZ_PID_MDATA (0x3UL)

/* DOPNG @Bit 31 : Do Ping (DoPng) */
  #define USBHSCORE_HC_TSIZ_DOPNG_Pos (31UL)
  #define USBHSCORE_HC_TSIZ_DOPNG_Msk (0x1UL << USBHSCORE_HC_TSIZ_DOPNG_Pos)
  #define USBHSCORE_HC_TSIZ_DOPNG_Min (0x0UL)
  #define USBHSCORE_HC_TSIZ_DOPNG_Max (0x1UL)
  #define USBHSCORE_HC_TSIZ_DOPNG_NOPING (0x0UL)
  #define USBHSCORE_HC_TSIZ_DOPNG_PING (0x1UL)


/* USBHSCORE_HC_DMA: Host Channel DMA Address Register */
  #define USBHSCORE_HC_DMA_ResetValue (0x00000000UL)

/* DMAADDR @Bits 0..31 : In Buffer DMA Mode: */
  #define USBHSCORE_HC_DMA_DMAADDR_Pos (0UL)
  #define USBHSCORE_HC_DMA_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_HC_DMA_DMAADDR_Pos)



/* ============================================== Struct USBHSCORE_DWCOTGDFIFO =============================================== */
/**
  * @brief DWCOTGDFIFO [USBHSCORE_DWCOTGDFIFO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[1024];
} NRF_USBHSCORE_DWCOTGDFIFO_Type;
  #define USBHSCORE_DWCOTGDFIFO_MaxCount (16UL)
  #define USBHSCORE_DWCOTGDFIFO_MaxIndex (15UL)
  #define USBHSCORE_DWCOTGDFIFO_MinIndex (0UL)


/* ======================================== Struct USBHSCORE_DWCOTGDFIFODIRECTACCESS ========================================= */
/**
  * @brief DWCOTGDFIFODIRECTACCESS [USBHSCORE_DWCOTGDFIFODIRECTACCESS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[32768];
} NRF_USBHSCORE_DWCOTGDFIFODIRECTACCESS_Type;

/* ==================================================== Struct USBHSCORE ===================================================== */
/**
  * @brief USBHSCORE
  */
  typedef struct {
    __IOM uint32_t GOTGCTL;
    __IOM uint32_t GOTGINT;
    __IOM uint32_t GAHBCFG;
    __IOM uint32_t GUSBCFG;
    __IOM uint32_t GRSTCTL;
    __IOM uint32_t GINTSTS;
    __IOM uint32_t GINTMSK;
    __IOM uint32_t GRXSTSR;
    __IOM uint32_t GRXSTSP;
    __IOM uint32_t GRXFSIZ;
    __IOM uint32_t GNPTXFSIZ;
    __IOM uint32_t GNPTXSTS;
    __IM uint32_t RESERVED[2];
    __IOM uint32_t GGPIO;
    __IOM uint32_t GUID;
    __IOM uint32_t GSNPSID;
    __IOM uint32_t GHWCFG1;
    __IOM uint32_t GHWCFG2;
    __IOM uint32_t GHWCFG3;
    __IOM uint32_t GHWCFG4;
    __IOM uint32_t GLPMCFG;
    __IOM uint32_t GPWRDN;
    __IOM uint32_t GDFIFOCFG;
    __IM uint32_t RESERVED1[2];
    __IOM uint32_t GINTMSK2;
    __IOM uint32_t GINTSTS2;
    __IM uint32_t RESERVED2[36];
    __IOM uint32_t HPTXFSIZ;
    __IOM uint32_t DIEPTXF[8];
    __IM uint32_t RESERVED3[183];
    __IOM uint32_t HCFG;
    __IOM uint32_t HFIR;
    __IOM uint32_t HFNUM;
    __IM uint32_t RESERVED4[2];
    __IOM uint32_t HAINT;
    __IOM uint32_t HAINTMSK;
    __IM uint32_t RESERVED5[9];
    __IOM uint32_t HPRT;
    __IM uint32_t RESERVED6[47];
    __IOM NRF_USBHSCORE_HC_Type HC[16];
    __IM uint32_t RESERVED7[96];
    __IOM uint32_t DCFG;
    __IOM uint32_t DCTL;
    __IOM uint32_t DSTS;
    __IM uint32_t RESERVED8;
    __IOM uint32_t DIEPMSK;
    __IOM uint32_t DOEPMSK;
    __IOM uint32_t DAINT;
    __IOM uint32_t DAINTMSK;
    __IM uint32_t RESERVED9[2];
    __IOM uint32_t DVBUSDIS;
    __IOM uint32_t DVBUSPULSE;
    __IOM uint32_t DTHRCTL;
    __IOM uint32_t DIEPEMPMSK;
    __IM uint32_t RESERVED10[50];
    __IOM uint32_t DIEPCTL0;
    __IM uint32_t RESERVED11;
    __IOM uint32_t DIEPINT0;
    __IM uint32_t RESERVED12;
    __IOM uint32_t DIEPTSIZ0;
    __IOM uint32_t DIEPDMA0;
    __IOM uint32_t DTXFSTS0;
    __IM uint32_t RESERVED13;
    __IOM uint32_t DIEPCTL1;
    __IM uint32_t RESERVED14;
    __IOM uint32_t DIEPINT1;
    __IM uint32_t RESERVED15;
    __IOM uint32_t DIEPTSIZ1;
    __IOM uint32_t DIEPDMA1;
    __IOM uint32_t DTXFSTS1;
    __IM uint32_t RESERVED16;
    __IOM uint32_t DIEPCTL2;
    __IM uint32_t RESERVED17;
    __IOM uint32_t DIEPINT2;
    __IM uint32_t RESERVED18;
    __IOM uint32_t DIEPTSIZ2;
    __IOM uint32_t DIEPDMA2;
    __IOM uint32_t DTXFSTS2;
    __IM uint32_t RESERVED19;
    __IOM uint32_t DIEPCTL3;
    __IM uint32_t RESERVED20;
    __IOM uint32_t DIEPINT3;
    __IM uint32_t RESERVED21;
    __IOM uint32_t DIEPTSIZ3;
    __IOM uint32_t DIEPDMA3;
    __IOM uint32_t DTXFSTS3;
    __IM uint32_t RESERVED22;
    __IOM uint32_t DIEPCTL4;
    __IM uint32_t RESERVED23;
    __IOM uint32_t DIEPINT4;
    __IM uint32_t RESERVED24;
    __IOM uint32_t DIEPTSIZ4;
    __IOM uint32_t DIEPDMA4;
    __IOM uint32_t DTXFSTS4;
    __IM uint32_t RESERVED25;
    __IOM uint32_t DIEPCTL5;
    __IM uint32_t RESERVED26;
    __IOM uint32_t DIEPINT5;
    __IM uint32_t RESERVED27;
    __IOM uint32_t DIEPTSIZ5;
    __IOM uint32_t DIEPDMA5;
    __IOM uint32_t DTXFSTS5;
    __IM uint32_t RESERVED28;
    __IOM uint32_t DIEPCTL6;
    __IM uint32_t RESERVED29;
    __IOM uint32_t DIEPINT6;
    __IM uint32_t RESERVED30;
    __IOM uint32_t DIEPTSIZ6;
    __IOM uint32_t DIEPDMA6;
    __IOM uint32_t DTXFSTS6;
    __IM uint32_t RESERVED31;
    __IOM uint32_t DIEPCTL7;
    __IM uint32_t RESERVED32;
    __IOM uint32_t DIEPINT7;
    __IM uint32_t RESERVED33;
    __IOM uint32_t DIEPTSIZ7;
    __IOM uint32_t DIEPDMA7;
    __IOM uint32_t DTXFSTS7;
    __IM uint32_t RESERVED34;
    __IOM uint32_t DIEPCTL8;
    __IM uint32_t RESERVED35;
    __IOM uint32_t DIEPINT8;
    __IM uint32_t RESERVED36;
    __IOM uint32_t DIEPTSIZ8;
    __IOM uint32_t DIEPDMA8;
    __IOM uint32_t DTXFSTS8;
    __IM uint32_t RESERVED37;
    __IOM uint32_t DIEPCTL9;
    __IM uint32_t RESERVED38;
    __IOM uint32_t DIEPINT9;
    __IM uint32_t RESERVED39;
    __IOM uint32_t DIEPTSIZ9;
    __IOM uint32_t DIEPDMA9;
    __IOM uint32_t DTXFSTS9;
    __IM uint32_t RESERVED40;
    __IOM uint32_t DIEPCTL10;
    __IM uint32_t RESERVED41;
    __IOM uint32_t DIEPINT10;
    __IM uint32_t RESERVED42;
    __IOM uint32_t DIEPTSIZ10;
    __IOM uint32_t DIEPDMA10;
    __IOM uint32_t DTXFSTS10;
    __IM uint32_t RESERVED43;
    __IOM uint32_t DIEPCTL11;
    __IM uint32_t RESERVED44;
    __IOM uint32_t DIEPINT11;
    __IM uint32_t RESERVED45;
    __IOM uint32_t DIEPTSIZ11;
    __IOM uint32_t DIEPDMA11;
    __IOM uint32_t DTXFSTS11;
    __IM uint32_t RESERVED46[33];
    __IOM uint32_t DOEPCTL0;
    __IM uint32_t RESERVED47;
    __IOM uint32_t DOEPINT0;
    __IM uint32_t RESERVED48;
    __IOM uint32_t DOEPTSIZ0;
    __IOM uint32_t DOEPDMA0;
    __IM uint32_t RESERVED49[2];
    __IOM uint32_t DOEPCTL1;
    __IM uint32_t RESERVED50;
    __IOM uint32_t DOEPINT1;
    __IM uint32_t RESERVED51;
    __IOM uint32_t DOEPTSIZ1;
    __IOM uint32_t DOEPDMA1;
    __IM uint32_t RESERVED52[2];
    __IOM uint32_t DOEPCTL2;
    __IM uint32_t RESERVED53;
    __IOM uint32_t DOEPINT2;
    __IM uint32_t RESERVED54;
    __IOM uint32_t DOEPTSIZ2;
    __IOM uint32_t DOEPDMA2;
    __IM uint32_t RESERVED55[2];
    __IOM uint32_t DOEPCTL3;
    __IM uint32_t RESERVED56;
    __IOM uint32_t DOEPINT3;
    __IM uint32_t RESERVED57;
    __IOM uint32_t DOEPTSIZ3;
    __IOM uint32_t DOEPDMA3;
    __IM uint32_t RESERVED58[2];
    __IOM uint32_t DOEPCTL4;
    __IM uint32_t RESERVED59;
    __IOM uint32_t DOEPINT4;
    __IM uint32_t RESERVED60;
    __IOM uint32_t DOEPTSIZ4;
    __IOM uint32_t DOEPDMA4;
    __IM uint32_t RESERVED61[2];
    __IOM uint32_t DOEPCTL5;
    __IM uint32_t RESERVED62;
    __IOM uint32_t DOEPINT5;
    __IM uint32_t RESERVED63;
    __IOM uint32_t DOEPTSIZ5;
    __IOM uint32_t DOEPDMA5;
    __IM uint32_t RESERVED64[50];
    __IOM uint32_t DOEPCTL12;
    __IM uint32_t RESERVED65;
    __IOM uint32_t DOEPINT12;
    __IM uint32_t RESERVED66;
    __IOM uint32_t DOEPTSIZ12;
    __IOM uint32_t DOEPDMA12;
    __IM uint32_t RESERVED67[2];
    __IOM uint32_t DOEPCTL13;
    __IM uint32_t RESERVED68;
    __IOM uint32_t DOEPINT13;
    __IM uint32_t RESERVED69;
    __IOM uint32_t DOEPTSIZ13;
    __IOM uint32_t DOEPDMA13;
    __IM uint32_t RESERVED70[2];
    __IOM uint32_t DOEPCTL14;
    __IM uint32_t RESERVED71;
    __IOM uint32_t DOEPINT14;
    __IM uint32_t RESERVED72;
    __IOM uint32_t DOEPTSIZ14;
    __IOM uint32_t DOEPDMA14;
    __IM uint32_t RESERVED73[2];
    __IOM uint32_t DOEPCTL15;
    __IM uint32_t RESERVED74;
    __IOM uint32_t DOEPINT15;
    __IM uint32_t RESERVED75;
    __IOM uint32_t DOEPTSIZ15;
    __IOM uint32_t DOEPDMA15;
    __IM uint32_t RESERVED76[66];
    __IOM uint32_t PCGCCTL;
    __IM uint32_t RESERVED77[63];
    __IOM uint32_t GSTARFXDIS;
    __IM uint32_t RESERVED78[63];
    __IOM NRF_USBHSCORE_DWCOTGDFIFO_Type DWCOTGDFIFO[16];
    __IM uint32_t RESERVED79[15360];
    __IOM NRF_USBHSCORE_DWCOTGDFIFODIRECTACCESS_Type DWCOTGDFIFODIRECTACCESS;
  } NRF_USBHSCORE_Type;

