pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* USBHSCORE_GOTGCTL: Control and Status Register */
  #define USBHSCORE_GOTGCTL_ResetValue (0x000D0000UL)

/* VBVALIDOVEN @Bit 2 : Mode: Host only. VBUS Valid Override Enable (VbvalidOvEn) */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Pos (2UL)
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_VBVALIDOVEN_Pos)
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_DISABLED (0x0UL) /*!< Override is disabled and bvalid signal from the respective PHY
                                                              selected is used internally by the controller*/
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_ENABLED (0x1UL) /*!< The vbus-valid signal received from the PHY is overridden with
                                                             GOTGCTL.VbvalidOvVal*/

/* VBVALIDOVVAL @Bit 3 : Mode: Host only. VBUS Valid OverrideValue (VbvalidOvVal) */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Pos (3UL)
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_VBVALIDOVVAL_Pos)
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_SET0 (0x0UL)
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_SET1 (0x1UL)

/* AVALIDOVEN @Bit 4 : Mode: Host only. A-Peripheral Session Valid Override Enable (AvalidOvEn) */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Pos (4UL)
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_AVALIDOVEN_Pos)
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_DISABLED (0x0UL)
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_ENABLED (0x1UL)

/* AVALIDOVVAL @Bit 5 : Mode: Host only. A-Peripheral Session Valid OverrideValue (AvalidOvVal) */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Pos (5UL)
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_AVALIDOVVAL_Pos)
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_VALUE0 (0x0UL)
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_VALUE1 (0x1UL)

/* BVALIDOVEN @Bit 6 : Mode: Device only. B-Peripheral Session Valid Override Value (BvalidOvEn) */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Pos (6UL)
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_BVALIDOVEN_Pos)
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_DISABLED (0x0UL) /*!< Override is disabled and bvalid signal from the respective PHY
                                                             selected is used internally by the core*/
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_ENABLED (0x1UL) /*!< Internally Bvalid received from the PHY is overridden with
                                                            GOTGCTL.BvalidOvVal*/

/* BVALIDOVVAL @Bit 7 : Mode: Device only. B-Peripheral Session Valid OverrideValue (BvalidOvVal) */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Pos (7UL)
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_BVALIDOVVAL_Pos)
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_VALUE0 (0x0UL)
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_VALUE1 (0x1UL)

/* DBNCEFLTRBYPASS @Bit 15 : Mode: Host and Device. Debounce Filter Bypass */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Pos (15UL)
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Msk (0x1UL << USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Pos) /*!< Bit mask of
                                                                            DBNCEFLTRBYPASS field.*/
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_DISABLED (0x0UL)
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_ENABLED (0x1UL)

/* CONIDSTS @Bit 16 : Mode: Host and Device. Connector ID Status (ConIDSts) */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Pos (16UL)
  #define USBHSCORE_GOTGCTL_CONIDSTS_Msk (0x1UL << USBHSCORE_GOTGCTL_CONIDSTS_Pos)
  #define USBHSCORE_GOTGCTL_CONIDSTS_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_CONIDSTS_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_CONIDSTS_MODEA (0x0UL)
  #define USBHSCORE_GOTGCTL_CONIDSTS_MODEB (0x1UL)

/* DBNCTIME @Bit 17 : Mode: Host only. Long/Short Debounce Time (DbncTime) */
  #define USBHSCORE_GOTGCTL_DBNCTIME_Pos (17UL)
  #define USBHSCORE_GOTGCTL_DBNCTIME_Msk (0x1UL << USBHSCORE_GOTGCTL_DBNCTIME_Pos)
  #define USBHSCORE_GOTGCTL_DBNCTIME_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_DBNCTIME_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_DBNCTIME_LONG (0x0UL)    /*!< Long debounce time, used for physical connections (100 ms + 2.5
                                                          micro-sec)*/
  #define USBHSCORE_GOTGCTL_DBNCTIME_SHORT (0x1UL)

/* ASESVLD @Bit 18 : Mode: Host only. A-Session Valid (ASesVld) */
  #define USBHSCORE_GOTGCTL_ASESVLD_Pos (18UL)
  #define USBHSCORE_GOTGCTL_ASESVLD_Msk (0x1UL << USBHSCORE_GOTGCTL_ASESVLD_Pos)
  #define USBHSCORE_GOTGCTL_ASESVLD_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_ASESVLD_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_ASESVLD_NOTVALID (0x0UL)
  #define USBHSCORE_GOTGCTL_ASESVLD_VALID (0x1UL)

/* BSESVLD @Bit 19 : Mode: Device only. B-Session Valid (BSesVld) */
  #define USBHSCORE_GOTGCTL_BSESVLD_Pos (19UL)
  #define USBHSCORE_GOTGCTL_BSESVLD_Msk (0x1UL << USBHSCORE_GOTGCTL_BSESVLD_Pos)
  #define USBHSCORE_GOTGCTL_BSESVLD_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_BSESVLD_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_BSESVLD_NOTVALID (0x0UL)
  #define USBHSCORE_GOTGCTL_BSESVLD_VALID (0x1UL)

/* OTGVER @Bit 20 : OTG Version (OTGVer) */
  #define USBHSCORE_GOTGCTL_OTGVER_Pos (20UL)
  #define USBHSCORE_GOTGCTL_OTGVER_Msk (0x1UL << USBHSCORE_GOTGCTL_OTGVER_Pos)
  #define USBHSCORE_GOTGCTL_OTGVER_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_OTGVER_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_OTGVER_VER13 (0x0UL)
  #define USBHSCORE_GOTGCTL_OTGVER_VER20 (0x1UL)

