pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* CURMOD @Bit 21 : Current Mode of Operation (CurMod) */
  #define USBHSCORE_GOTGCTL_CURMOD_Pos (21UL)
  #define USBHSCORE_GOTGCTL_CURMOD_Msk (0x1UL << USBHSCORE_GOTGCTL_CURMOD_Pos)
  #define USBHSCORE_GOTGCTL_CURMOD_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_CURMOD_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_CURMOD_DEVICEMODE (0x0UL)
  #define USBHSCORE_GOTGCTL_CURMOD_HOSTMODE (0x1UL)

/* MULTVALIDBC @Bits 22..26 : Mode: Host and Device. Multi Valued ID pin (MultValIdBC) */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_Pos (22UL)
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_Msk (0x1FUL << USBHSCORE_GOTGCTL_MULTVALIDBC_Pos)
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_Min (0x1UL)
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_Max (0x10UL)
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RID_C (0x01UL)
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RID_B (0x02UL)
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RID_A (0x04UL)
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RID_GND (0x08UL)
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RID_FLOAT (0x10UL)

/* CHIRPEN @Bit 27 : Mode: Device Only. This bit when programmed to 1'b1 results in the core asserting chirp_on before sending
                     an actual Chirp 'K' signal on USB. This bit is present only if OTG_BC_SUPPORT = 1.If OTG_BC_SUPPORT!=1,
                     this bit is a reserved bit. Do not set this bit when core is operating in HSIC mode because HSIC always
                     operates at High Speed and High speed chirp is not used */

  #define USBHSCORE_GOTGCTL_CHIRPEN_Pos (27UL)
  #define USBHSCORE_GOTGCTL_CHIRPEN_Msk (0x1UL << USBHSCORE_GOTGCTL_CHIRPEN_Pos)
  #define USBHSCORE_GOTGCTL_CHIRPEN_Min (0x0UL)
  #define USBHSCORE_GOTGCTL_CHIRPEN_Max (0x1UL)
  #define USBHSCORE_GOTGCTL_CHIRPEN_CHIRP_DISABLE (0x0UL) /*!< The controller does not assert chirp_on before sending an actual
                                                               Chirp 'K' signal on USB.*/
  #define USBHSCORE_GOTGCTL_CHIRPEN_CHIRP_ENABLE (0x1UL) /*!< The controller asserts chirp_on before sending an actual Chirp 'K'
                                                              signal on USB.*/


/* USBHSCORE_GOTGINT: Interrupt Register */
  #define USBHSCORE_GOTGINT_ResetValue (0x00000000UL)

/* SESENDDET @Bit 2 : Mode: Host and Device. Session End Detected (SesEndDet) */
  #define USBHSCORE_GOTGINT_SESENDDET_Pos (2UL)
  #define USBHSCORE_GOTGINT_SESENDDET_Msk (0x1UL << USBHSCORE_GOTGINT_SESENDDET_Pos)
  #define USBHSCORE_GOTGINT_SESENDDET_Min (0x0UL)
  #define USBHSCORE_GOTGINT_SESENDDET_Max (0x1UL)
  #define USBHSCORE_GOTGINT_SESENDDET_INACTIVE (0x0UL)
  #define USBHSCORE_GOTGINT_SESENDDET_ACTIVE (0x1UL)

/* SESREQSUCSTSCHNG @Bit 8 : Mode: Host and Device. Session Request Success Status Change (SesReqSucStsChng) */
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Pos (8UL)
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Msk (0x1UL << USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Pos) /*!< Bit mask of
                                                                            SESREQSUCSTSCHNG field.*/
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Min (0x0UL)
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Max (0x1UL)
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_INACTIVE (0x0UL)
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_ACTIVE (0x1UL)

/* HSTNEGSUCSTSCHNG @Bit 9 : Mode: Host and Device. Host Negotiation Success Status Change (HstNegSucStsChng) */
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Pos (9UL)
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Msk (0x1UL << USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Pos) /*!< Bit mask of
                                                                            HSTNEGSUCSTSCHNG field.*/
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Min (0x0UL)
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Max (0x1UL)
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_INACTIVE (0x0UL)
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_ACTIVE (0x1UL)

/* HSTNEGDET @Bit 17 : Mode:Host and Device. Host Negotiation Detected (HstNegDet) */
  #define USBHSCORE_GOTGINT_HSTNEGDET_Pos (17UL)
  #define USBHSCORE_GOTGINT_HSTNEGDET_Msk (0x1UL << USBHSCORE_GOTGINT_HSTNEGDET_Pos)
  #define USBHSCORE_GOTGINT_HSTNEGDET_Min (0x0UL)
  #define USBHSCORE_GOTGINT_HSTNEGDET_Max (0x1UL)
  #define USBHSCORE_GOTGINT_HSTNEGDET_INACTIVE (0x0UL)
  #define USBHSCORE_GOTGINT_HSTNEGDET_ACTIVE (0x1UL)

/* ADEVTOUTCHG @Bit 18 : Mode: Host and Device. A-Device Timeout Change (ADevTOUTChg) */
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_Pos (18UL)
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_Msk (0x1UL << USBHSCORE_GOTGINT_ADEVTOUTCHG_Pos)
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_Min (0x0UL)
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_Max (0x1UL)
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_INACTIVE (0x0UL)
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_ACTIVE (0x1UL)

/* DBNCEDONE @Bit 19 : Mode: Host only. Debounce Done (DbnceDone) */
  #define USBHSCORE_GOTGINT_DBNCEDONE_Pos (19UL)
  #define USBHSCORE_GOTGINT_DBNCEDONE_Msk (0x1UL << USBHSCORE_GOTGINT_DBNCEDONE_Pos)
  #define USBHSCORE_GOTGINT_DBNCEDONE_Min (0x0UL)
  #define USBHSCORE_GOTGINT_DBNCEDONE_Max (0x1UL)
  #define USBHSCORE_GOTGINT_DBNCEDONE_INACTIVE (0x0UL)
  #define USBHSCORE_GOTGINT_DBNCEDONE_ACTIVE (0x1UL)

/* MULTVALIPCHNG @Bit 20 : This bit when set indicates that there is a change in the value of at least one ACA pin value. */
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_Pos (20UL)
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_Msk (0x1UL << USBHSCORE_GOTGINT_MULTVALIPCHNG_Pos) /*!< Bit mask of MULTVALIPCHNG
                                                                            field.*/
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_Min (0x0UL)
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_Max (0x1UL)
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_NO_ACA_PIN_CHANGE (0x0UL)
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_ACA_PIN_CHANGE (0x1UL)


/* USBHSCORE_GAHBCFG: AHB Configuration Register */
  #define USBHSCORE_GAHBCFG_ResetValue (0x00000000UL)

/* GLBLINTRMSK @Bit 0 : Mode: Host and device. Global Interrupt Mask (GlblIntrMsk) */
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_Pos (0UL)
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_Msk (0x1UL << USBHSCORE_GAHBCFG_GLBLINTRMSK_Pos)
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_Min (0x0UL)
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_Max (0x1UL)
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_MASK (0x0UL)
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_NOMASK (0x1UL)

/* HBSTLEN @Bits 1..4 : Mode: Host and device. Burst Length/Type (HBstLen) */
  #define USBHSCORE_GAHBCFG_HBSTLEN_Pos (1UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_Msk (0xFUL << USBHSCORE_GAHBCFG_HBSTLEN_Pos)
  #define USBHSCORE_GAHBCFG_HBSTLEN_Min (0x0UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_Max (0x8UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD1ORSINGLE (0x0UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD4ORINCR (0x1UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD8 (0x2UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD16ORINCR4 (0x3UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD32 (0x4UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD64ORINCR8 (0x5UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD128 (0x6UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD256ORINCR16 (0x7UL)
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORDX (0x8UL)

