pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DMAEN @Bit 5 : Mode: Host and device. DMA Enable (DMAEn) */
  #define USBHSCORE_GAHBCFG_DMAEN_Pos (5UL)
  #define USBHSCORE_GAHBCFG_DMAEN_Msk (0x1UL << USBHSCORE_GAHBCFG_DMAEN_Pos)
  #define USBHSCORE_GAHBCFG_DMAEN_Min (0x0UL)
  #define USBHSCORE_GAHBCFG_DMAEN_Max (0x1UL)
  #define USBHSCORE_GAHBCFG_DMAEN_SLAVEMODE (0x0UL)
  #define USBHSCORE_GAHBCFG_DMAEN_DMAMODE (0x1UL)

/* NPTXFEMPLVL @Bit 7 : Mode: Host and device. Non-Periodic TxFIFO Empty Level (NPTxFEmpLvl) */
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Pos (7UL)
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Msk (0x1UL << USBHSCORE_GAHBCFG_NPTXFEMPLVL_Pos)
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Min (0x0UL)
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_Max (0x1UL)
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_HALFEMPTY (0x0UL) /*!< DIEPINTn.TxFEmp interrupt indicates that the Non-Periodic TxFIFO
                                                               is half empty or that the IN Endpoint TxFIFO is half empty.*/
  #define USBHSCORE_GAHBCFG_NPTXFEMPLVL_EMPTY (0x1UL) /*!< GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is
                                                           completely empty or that the IN Endpoint TxFIFO is completely empty.*/

/* REMMEMSUPP @Bit 21 : Mode: Host and Device. Remote Memory Support (RemMemSupp) */
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Pos (21UL)
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Msk (0x1UL << USBHSCORE_GAHBCFG_REMMEMSUPP_Pos)
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Min (0x0UL)
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_Max (0x1UL)
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_DISABLED (0x0UL)
  #define USBHSCORE_GAHBCFG_REMMEMSUPP_ENABLED (0x1UL)

/* NOTIALLDMAWRIT @Bit 22 : Mode: Host and Device. Notify All DMA Write Transactions (NotiAllDmaWrit) */
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Pos (22UL)
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Msk (0x1UL << USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Pos) /*!< Bit mask of NOTIALLDMAWRIT
                                                                            field.*/
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Min (0x0UL)
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_Max (0x1UL)
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_LASTTRANS (0x0UL)
  #define USBHSCORE_GAHBCFG_NOTIALLDMAWRIT_ALLTRANS (0x1UL) /*!< The core asserts int_dma_req for all the DMA write transactions
                                                                 on the AHB interface along with int_dma_done,
                                                                 chep_last_transact and chep_number signal informations. The
                                                                 core waits for sys_dma_done signal for all the DMA write
                                                                 transactions in order to complete the transfer of a particular
                                                                 Channel/Endpoint*/

/* AHBSINGLE @Bit 23 : Mode: Host and Device. AHB Single Support (AHBSingle) */
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Pos (23UL)
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Msk (0x1UL << USBHSCORE_GAHBCFG_AHBSINGLE_Pos)
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Min (0x0UL)
  #define USBHSCORE_GAHBCFG_AHBSINGLE_Max (0x1UL)
  #define USBHSCORE_GAHBCFG_AHBSINGLE_INCRBURST (0x0UL)
  #define USBHSCORE_GAHBCFG_AHBSINGLE_SINGLEBURST (0x1UL) /*!< The remaining data in the transfer is sent using Single burst
                                                               size*/


/* USBHSCORE_GUSBCFG: USB Configuration Register */
  #define USBHSCORE_GUSBCFG_ResetValue (0x10001400UL)

/* TOUTCAL @Bits 0..2 : Mode: Host and Device. HS/FS Timeout Calibration (TOutCal) */
  #define USBHSCORE_GUSBCFG_TOUTCAL_Pos (0UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_Msk (0x7UL << USBHSCORE_GUSBCFG_TOUTCAL_Pos)
  #define USBHSCORE_GUSBCFG_TOUTCAL_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_Max (0x7UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_ZERO (0x0UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_ONE (0x1UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_TWO (0x2UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_THREE (0x3UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_FOUR (0x4UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_FIVE (0x5UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_SIX (0x6UL)
  #define USBHSCORE_GUSBCFG_TOUTCAL_SEVEN (0x7UL)

/* PHYIF @Bit 3 : Mode: Host and Device. PHY Interface (PHYIf) */
  #define USBHSCORE_GUSBCFG_PHYIF_Pos (3UL)
  #define USBHSCORE_GUSBCFG_PHYIF_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYIF_Pos)
  #define USBHSCORE_GUSBCFG_PHYIF_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_PHYIF_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_PHYIF_BITS8 (0x0UL)
  #define USBHSCORE_GUSBCFG_PHYIF_BITS16 (0x1UL)

/* ULPIUTMISEL @Bit 4 : Mode: Host and Device. ULPI or UTMI+ Select (ULPI_UTMI_Sel) */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Pos (4UL)
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Msk (0x1UL << USBHSCORE_GUSBCFG_ULPIUTMISEL_Pos)
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_UTMI (0x0UL)
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_ULPI (0x1UL)

/* FSINTF @Bit 5 : Mode: Host and Device. Full-Speed Serial Interface Select (FSIntf) */
  #define USBHSCORE_GUSBCFG_FSINTF_Pos (5UL)
  #define USBHSCORE_GUSBCFG_FSINTF_Msk (0x1UL << USBHSCORE_GUSBCFG_FSINTF_Pos)
  #define USBHSCORE_GUSBCFG_FSINTF_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_FSINTF_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_FSINTF_FS6PIN (0x0UL)
  #define USBHSCORE_GUSBCFG_FSINTF_FS3PIN (0x1UL)

/* PHYSEL @Bit 6 : PHYSel */
  #define USBHSCORE_GUSBCFG_PHYSEL_Pos (6UL)
  #define USBHSCORE_GUSBCFG_PHYSEL_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYSEL_Pos)
  #define USBHSCORE_GUSBCFG_PHYSEL_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_PHYSEL_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_PHYSEL_USB20 (0x0UL)
  #define USBHSCORE_GUSBCFG_PHYSEL_USB11 (0x1UL)

/* USBTRDTIM @Bits 10..13 : Mode: Device only. USB Turnaround Time (USBTrdTim) */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Pos (10UL)
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Msk (0xFUL << USBHSCORE_GUSBCFG_USBTRDTIM_Pos)
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Min (0x5UL)
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Max (0x9UL)
  #define USBHSCORE_GUSBCFG_USBTRDTIM_TURNTIME16BIT (0x5UL)
  #define USBHSCORE_GUSBCFG_USBTRDTIM_TURNTIME8BIT (0x9UL)

/* PHYLPWRCLKSEL @Bit 15 : PHY Low-Power Clock Select (PhyLPwrClkSel) */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Pos (15UL)
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Pos) /*!< Bit mask of PHYLPWRCLKSEL
                                                                            field.*/
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_INTPLLCLK (0x0UL)
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_EXTCLK (0x1UL)

