pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TERMSELDLPULSE @Bit 22 : Mode: Device only. TermSel DLine Pulsing Selection (TermSelDLPulse) */
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Pos (22UL)
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Msk (0x1UL << USBHSCORE_GUSBCFG_TERMSELDLPULSE_Pos) /*!< Bit mask of TERMSELDLPULSE
                                                                            field.*/
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_TXVALID (0x0UL)
  #define USBHSCORE_GUSBCFG_TERMSELDLPULSE_TERMSEL (0x1UL)

/* ICUSBCAP @Bit 26 : Mode: Host and Device. IC_USB-Capable (IC_USBCap) */
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Pos (26UL)
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Msk (0x1UL << USBHSCORE_GUSBCFG_ICUSBCAP_Pos)
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_ICUSBCAP_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_ICUSBCAP_NOTSELECTED (0x0UL)
  #define USBHSCORE_GUSBCFG_ICUSBCAP_SELECTED (0x1UL)

/* TXENDDELAY @Bit 28 : Mode: Device only. Tx End Delay (TxEndDelay) */
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Pos (28UL)
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Msk (0x1UL << USBHSCORE_GUSBCFG_TXENDDELAY_Pos)
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_TXENDDELAY_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_TXENDDELAY_DISABLED (0x0UL)
  #define USBHSCORE_GUSBCFG_TXENDDELAY_ENABLED (0x1UL)

/* FORCEHSTMODE @Bit 29 : Mode: Host and device. Force Host Mode (ForceHstMode) */
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Pos (29UL)
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Msk (0x1UL << USBHSCORE_GUSBCFG_FORCEHSTMODE_Pos)
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_DISABLED (0x0UL)
  #define USBHSCORE_GUSBCFG_FORCEHSTMODE_ENABLED (0x1UL)

/* FORCEDEVMODE @Bit 30 : Mode:Host and device. Force Device Mode (ForceDevMode) */
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Pos (30UL)
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Msk (0x1UL << USBHSCORE_GUSBCFG_FORCEDEVMODE_Pos)
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_DISABLED (0x0UL)
  #define USBHSCORE_GUSBCFG_FORCEDEVMODE_ENABLED (0x1UL)

/* CORRUPTTXPKT @Bit 31 : Mode: Host and device. Corrupt Tx packet (CorruptTxPkt) */
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Pos (31UL)
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Msk (0x1UL << USBHSCORE_GUSBCFG_CORRUPTTXPKT_Pos)
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Min (0x0UL)
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Max (0x1UL)
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Disabled (0x0UL)
  #define USBHSCORE_GUSBCFG_CORRUPTTXPKT_Enabled (0x1UL)


/* USBHSCORE_GRSTCTL: Reset Register */
  #define USBHSCORE_GRSTCTL_ResetValue (0x80000000UL)

/* CSFTRST @Bit 0 : Mode: Host and Device. Core Soft Reset (CSftRst) */
  #define USBHSCORE_GRSTCTL_CSFTRST_Pos (0UL)
  #define USBHSCORE_GRSTCTL_CSFTRST_Msk (0x1UL << USBHSCORE_GRSTCTL_CSFTRST_Pos)
  #define USBHSCORE_GRSTCTL_CSFTRST_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_CSFTRST_Max (0x1UL)
  #define USBHSCORE_GRSTCTL_CSFTRST_NOTACTIVE (0x0UL)
  #define USBHSCORE_GRSTCTL_CSFTRST_ACTIVE (0x1UL)

/* PIUFSSFTRST @Bit 1 : Mode: Host and Device. PIU FS Dedicated Controller Soft Reset (PIUFSSftRst) */
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Pos (1UL)
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Msk (0x1UL << USBHSCORE_GRSTCTL_PIUFSSFTRST_Pos)
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_Max (0x1UL)
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_RESET_INACTIVE (0x0UL)
  #define USBHSCORE_GRSTCTL_PIUFSSFTRST_RESET_ACTIVE (0x1UL)

/* FRMCNTRRST @Bit 2 : Mode: Host only. Host Frame Counter Reset (FrmCntrRst) */
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Pos (2UL)
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Msk (0x1UL << USBHSCORE_GRSTCTL_FRMCNTRRST_Pos)
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_Max (0x1UL)
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_NOTACTIVE (0x0UL)
  #define USBHSCORE_GRSTCTL_FRMCNTRRST_ACTIVE (0x1UL)

/* RXFFLSH @Bit 4 : Mode: Host and Device. RxFIFO Flush (RxFFlsh) */
  #define USBHSCORE_GRSTCTL_RXFFLSH_Pos (4UL)
  #define USBHSCORE_GRSTCTL_RXFFLSH_Msk (0x1UL << USBHSCORE_GRSTCTL_RXFFLSH_Pos)
  #define USBHSCORE_GRSTCTL_RXFFLSH_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_RXFFLSH_Max (0x1UL)
  #define USBHSCORE_GRSTCTL_RXFFLSH_INACTIVE (0x0UL)
  #define USBHSCORE_GRSTCTL_RXFFLSH_ACTIVE (0x1UL)

/* TXFFLSH @Bit 5 : Mode: Host and Device. TxFIFO Flush (TxFFlsh) */
  #define USBHSCORE_GRSTCTL_TXFFLSH_Pos (5UL)
  #define USBHSCORE_GRSTCTL_TXFFLSH_Msk (0x1UL << USBHSCORE_GRSTCTL_TXFFLSH_Pos)
  #define USBHSCORE_GRSTCTL_TXFFLSH_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_TXFFLSH_Max (0x1UL)
  #define USBHSCORE_GRSTCTL_TXFFLSH_INACTIVE (0x0UL)
  #define USBHSCORE_GRSTCTL_TXFFLSH_ACTIVE (0x1UL)

/* TXFNUM @Bits 6..10 : Mode: Host and Device. TxFIFO Number (TxFNum) */
  #define USBHSCORE_GRSTCTL_TXFNUM_Pos (6UL)
  #define USBHSCORE_GRSTCTL_TXFNUM_Msk (0x1FUL << USBHSCORE_GRSTCTL_TXFNUM_Pos)
  #define USBHSCORE_GRSTCTL_TXFNUM_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_TXFNUM_Max (0x10UL)
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF0 (0x00UL)     /*!< -Periodic TxFIFO flush in host mode -Periodic TxFIFO 0 flush in device
                                                          mode when in shared FIFO operation -TXFIFO 0 flush in device mode when
                                                          in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF1 (0x01UL)     /*!< -Periodic TxFIFO flush in host mode -Periodic TxFIFO 1 flush in device
                                                          mode when in shared FIFO operation -TXFIFO 1 flush in device mode when
                                                          in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF2 (0x02UL)     /*!< -Periodic TxFIFO 2 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 2 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF3 (0x03UL)     /*!< -Periodic TxFIFO 3 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 3 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF4 (0x04UL)     /*!< -Periodic TxFIFO 4 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 4 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF5 (0x05UL)     /*!< -Periodic TxFIFO 5 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 5 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF6 (0x06UL)     /*!< -Periodic TxFIFO 6 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 6 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF7 (0x07UL)     /*!< -Periodic TxFIFO 7 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 7 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF8 (0x08UL)     /*!< -Periodic TxFIFO 8 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 8 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF9 (0x09UL)     /*!< -Periodic TxFIFO 9 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 9 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF10 (0x0AUL)    /*!< -Periodic TxFIFO 10 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 10 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF11 (0x0BUL)    /*!< -Periodic TxFIFO 11 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 11 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF12 (0x0CUL)    /*!< -Periodic TxFIFO 12 flush in device mode when in shared FIFO operation
                                                          -TXFIFO 12 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF13 (0x0DUL)    /*!< -Periodic TxFIFO 13 flush in Device mode when in shared FIFO operation
                                                          -TXFIFO 13 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF14 (0x0EUL)    /*!< -Periodic TxFIFO 14 flush in Device mode when in shared FIFO operation
                                                          -TXFIFO 14 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF15 (0x0FUL)    /*!< -Periodic TxFIFO 15 flush in Device mode when in shared FIFO operation
                                                          - TXFIFO 15 flush in device mode when in dedicated FIFO mode*/
  #define USBHSCORE_GRSTCTL_TXFNUM_TXF16 (0x10UL)

/* CSFTRSTDONE @Bit 29 : Mode: Host and Device. Core Soft Reset Done (CSftRstDone) */
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Pos (29UL)
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Msk (0x1UL << USBHSCORE_GRSTCTL_CSFTRSTDONE_Pos)
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_Max (0x1UL)
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_INACTIVE (0x0UL)
  #define USBHSCORE_GRSTCTL_CSFTRSTDONE_ACTIVE (0x1UL)

/* DMAREQ @Bit 30 : Mode: Host and Device. DMA Request Signal (DMAReq) */
  #define USBHSCORE_GRSTCTL_DMAREQ_Pos (30UL)
  #define USBHSCORE_GRSTCTL_DMAREQ_Msk (0x1UL << USBHSCORE_GRSTCTL_DMAREQ_Pos)
  #define USBHSCORE_GRSTCTL_DMAREQ_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_DMAREQ_Max (0x1UL)
  #define USBHSCORE_GRSTCTL_DMAREQ_INACTIVE (0x0UL)
  #define USBHSCORE_GRSTCTL_DMAREQ_ACTIVE (0x1UL)

/* AHBIDLE @Bit 31 : Mode: Host and Device. AHB Master Idle (AHBIdle) */
  #define USBHSCORE_GRSTCTL_AHBIDLE_Pos (31UL)
  #define USBHSCORE_GRSTCTL_AHBIDLE_Msk (0x1UL << USBHSCORE_GRSTCTL_AHBIDLE_Pos)
  #define USBHSCORE_GRSTCTL_AHBIDLE_Min (0x0UL)
  #define USBHSCORE_GRSTCTL_AHBIDLE_Max (0x1UL)
  #define USBHSCORE_GRSTCTL_AHBIDLE_INACTIVE (0x0UL)
  #define USBHSCORE_GRSTCTL_AHBIDLE_ACTIVE (0x1UL)


/* USBHSCORE_GINTSTS: Interrupt Register */
  #define USBHSCORE_GINTSTS_ResetValue (0x00000020UL)

/* CURMOD @Bit 0 : Mode: Host and Device. Current Mode of Operation (CurMod) */
  #define USBHSCORE_GINTSTS_CURMOD_Pos (0UL)
  #define USBHSCORE_GINTSTS_CURMOD_Msk (0x1UL << USBHSCORE_GINTSTS_CURMOD_Pos)
  #define USBHSCORE_GINTSTS_CURMOD_Min (0x0UL)
  #define USBHSCORE_GINTSTS_CURMOD_Max (0x1UL)
  #define USBHSCORE_GINTSTS_CURMOD_DEVICE (0x0UL)
  #define USBHSCORE_GINTSTS_CURMOD_HOST (0x1UL)

/* MODEMIS @Bit 1 : Mode: Host and Device. Mode Mismatch Interrupt (ModeMis) */
  #define USBHSCORE_GINTSTS_MODEMIS_Pos (1UL)
  #define USBHSCORE_GINTSTS_MODEMIS_Msk (0x1UL << USBHSCORE_GINTSTS_MODEMIS_Pos)
  #define USBHSCORE_GINTSTS_MODEMIS_Min (0x0UL)
  #define USBHSCORE_GINTSTS_MODEMIS_Max (0x1UL)
  #define USBHSCORE_GINTSTS_MODEMIS_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_MODEMIS_ACTIVE (0x1UL)

/* OTGINT @Bit 2 : Mode: Host and Device. OTG Interrupt (OTGInt) */
  #define USBHSCORE_GINTSTS_OTGINT_Pos (2UL)
  #define USBHSCORE_GINTSTS_OTGINT_Msk (0x1UL << USBHSCORE_GINTSTS_OTGINT_Pos)
  #define USBHSCORE_GINTSTS_OTGINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_OTGINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_OTGINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_OTGINT_ACTIVE (0x1UL)

