pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SOF @Bit 3 : Mode: Host and Device. Start of (micro)Frame (Sof) */
  #define USBHSCORE_GINTSTS_SOF_Pos (3UL)
  #define USBHSCORE_GINTSTS_SOF_Msk (0x1UL << USBHSCORE_GINTSTS_SOF_Pos)
  #define USBHSCORE_GINTSTS_SOF_Min (0x0UL)
  #define USBHSCORE_GINTSTS_SOF_Max (0x1UL)
  #define USBHSCORE_GINTSTS_SOF_INTACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_SOF_ACTIVE (0x1UL)

/* RXFLVL @Bit 4 : Mode: Host and Device. RxFIFO Non-Empty (RxFLvl) */
  #define USBHSCORE_GINTSTS_RXFLVL_Pos (4UL)
  #define USBHSCORE_GINTSTS_RXFLVL_Msk (0x1UL << USBHSCORE_GINTSTS_RXFLVL_Pos)
  #define USBHSCORE_GINTSTS_RXFLVL_Min (0x0UL)
  #define USBHSCORE_GINTSTS_RXFLVL_Max (0x1UL)
  #define USBHSCORE_GINTSTS_RXFLVL_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_RXFLVL_ACTIVE (0x1UL)

/* NPTXFEMP @Bit 5 : Mode: Host and Device. Non-periodic TxFIFO Empty (NPTxFEmp) */
  #define USBHSCORE_GINTSTS_NPTXFEMP_Pos (5UL)
  #define USBHSCORE_GINTSTS_NPTXFEMP_Msk (0x1UL << USBHSCORE_GINTSTS_NPTXFEMP_Pos)
  #define USBHSCORE_GINTSTS_NPTXFEMP_Min (0x0UL)
  #define USBHSCORE_GINTSTS_NPTXFEMP_Max (0x1UL)
  #define USBHSCORE_GINTSTS_NPTXFEMP_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_NPTXFEMP_ACTIVE (0x1UL)

/* GINNAKEFF @Bit 6 : Mode: Device only. Global IN Non-periodic NAK Effective (GINNakEff) */
  #define USBHSCORE_GINTSTS_GINNAKEFF_Pos (6UL)
  #define USBHSCORE_GINTSTS_GINNAKEFF_Msk (0x1UL << USBHSCORE_GINTSTS_GINNAKEFF_Pos)
  #define USBHSCORE_GINTSTS_GINNAKEFF_Min (0x0UL)
  #define USBHSCORE_GINTSTS_GINNAKEFF_Max (0x1UL)
  #define USBHSCORE_GINTSTS_GINNAKEFF_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_GINNAKEFF_ACTIVE (0x1UL)

/* GOUTNAKEFF @Bit 7 : Mode: Device only. Global OUT NAK Effective (GOUTNakEff) */
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_Pos (7UL)
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_Msk (0x1UL << USBHSCORE_GINTSTS_GOUTNAKEFF_Pos)
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_Min (0x0UL)
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_Max (0x1UL)
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_GOUTNAKEFF_ACTIVE (0x1UL)

/* ERLYSUSP @Bit 10 : Mode: Device only. Early Suspend (ErlySusp) */
  #define USBHSCORE_GINTSTS_ERLYSUSP_Pos (10UL)
  #define USBHSCORE_GINTSTS_ERLYSUSP_Msk (0x1UL << USBHSCORE_GINTSTS_ERLYSUSP_Pos)
  #define USBHSCORE_GINTSTS_ERLYSUSP_Min (0x0UL)
  #define USBHSCORE_GINTSTS_ERLYSUSP_Max (0x1UL)
  #define USBHSCORE_GINTSTS_ERLYSUSP_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_ERLYSUSP_ACTIVE (0x1UL)

/* USBSUSP @Bit 11 : Mode: Device only. USB Suspend (USBSusp) */
  #define USBHSCORE_GINTSTS_USBSUSP_Pos (11UL)
  #define USBHSCORE_GINTSTS_USBSUSP_Msk (0x1UL << USBHSCORE_GINTSTS_USBSUSP_Pos)
  #define USBHSCORE_GINTSTS_USBSUSP_Min (0x0UL)
  #define USBHSCORE_GINTSTS_USBSUSP_Max (0x1UL)
  #define USBHSCORE_GINTSTS_USBSUSP_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_USBSUSP_ACTIVE (0x1UL)

/* USBRST @Bit 12 : Mode: Device only. USB Reset (USBRst) */
  #define USBHSCORE_GINTSTS_USBRST_Pos (12UL)
  #define USBHSCORE_GINTSTS_USBRST_Msk (0x1UL << USBHSCORE_GINTSTS_USBRST_Pos)
  #define USBHSCORE_GINTSTS_USBRST_Min (0x0UL)
  #define USBHSCORE_GINTSTS_USBRST_Max (0x1UL)
  #define USBHSCORE_GINTSTS_USBRST_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_USBRST_ACTIVE (0x1UL)

/* ENUMDONE @Bit 13 : Mode: Device only. Enumeration Done (EnumDone) */
  #define USBHSCORE_GINTSTS_ENUMDONE_Pos (13UL)
  #define USBHSCORE_GINTSTS_ENUMDONE_Msk (0x1UL << USBHSCORE_GINTSTS_ENUMDONE_Pos)
  #define USBHSCORE_GINTSTS_ENUMDONE_Min (0x0UL)
  #define USBHSCORE_GINTSTS_ENUMDONE_Max (0x1UL)
  #define USBHSCORE_GINTSTS_ENUMDONE_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_ENUMDONE_ACTIVE (0x1UL)

/* ISOOUTDROP @Bit 14 : Mode: Device only. Isochronous OUT Packet Dropped Interrupt (ISOOutDrop) */
  #define USBHSCORE_GINTSTS_ISOOUTDROP_Pos (14UL)
  #define USBHSCORE_GINTSTS_ISOOUTDROP_Msk (0x1UL << USBHSCORE_GINTSTS_ISOOUTDROP_Pos)
  #define USBHSCORE_GINTSTS_ISOOUTDROP_Min (0x0UL)
  #define USBHSCORE_GINTSTS_ISOOUTDROP_Max (0x1UL)
  #define USBHSCORE_GINTSTS_ISOOUTDROP_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_ISOOUTDROP_ACTIVE (0x1UL)

/* EOPF @Bit 15 : Mode: Device only. End of Periodic Frame Interrupt (EOPF) */
  #define USBHSCORE_GINTSTS_EOPF_Pos (15UL)
  #define USBHSCORE_GINTSTS_EOPF_Msk (0x1UL << USBHSCORE_GINTSTS_EOPF_Pos)
  #define USBHSCORE_GINTSTS_EOPF_Min (0x0UL)
  #define USBHSCORE_GINTSTS_EOPF_Max (0x1UL)
  #define USBHSCORE_GINTSTS_EOPF_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_EOPF_ACTIVE (0x1UL)

/* RSTRDONEINT @Bit 16 : Mode: Device only. Restore Done Interrupt (RstrDoneInt) */
  #define USBHSCORE_GINTSTS_RSTRDONEINT_Pos (16UL)
  #define USBHSCORE_GINTSTS_RSTRDONEINT_Msk (0x1UL << USBHSCORE_GINTSTS_RSTRDONEINT_Pos)
  #define USBHSCORE_GINTSTS_RSTRDONEINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_RSTRDONEINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_RSTRDONEINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_RSTRDONEINT_ACTIVE (0x1UL)

/* EPMIS @Bit 17 : Mode: Device only. Endpoint Mismatch Interrupt (EPMis) */
  #define USBHSCORE_GINTSTS_EPMIS_Pos (17UL)
  #define USBHSCORE_GINTSTS_EPMIS_Msk (0x1UL << USBHSCORE_GINTSTS_EPMIS_Pos)
  #define USBHSCORE_GINTSTS_EPMIS_Min (0x0UL)
  #define USBHSCORE_GINTSTS_EPMIS_Max (0x1UL)
  #define USBHSCORE_GINTSTS_EPMIS_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_EPMIS_ACTIVE (0x1UL)

/* IEPINT @Bit 18 : Mode: Device only. IN Endpoints Interrupt (IEPInt) */
  #define USBHSCORE_GINTSTS_IEPINT_Pos (18UL)
  #define USBHSCORE_GINTSTS_IEPINT_Msk (0x1UL << USBHSCORE_GINTSTS_IEPINT_Pos)
  #define USBHSCORE_GINTSTS_IEPINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_IEPINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_IEPINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_IEPINT_ACTIVE (0x1UL)

/* OEPINT @Bit 19 : Mode: Device only. OUT Endpoints Interrupt (OEPInt) */
  #define USBHSCORE_GINTSTS_OEPINT_Pos (19UL)
  #define USBHSCORE_GINTSTS_OEPINT_Msk (0x1UL << USBHSCORE_GINTSTS_OEPINT_Pos)
  #define USBHSCORE_GINTSTS_OEPINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_OEPINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_OEPINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_OEPINT_ACTIVE (0x1UL)

/* INCOMPISOIN @Bit 20 : Mode: Device only. Incomplete Isochronous IN Transfer (incompISOIN) */
  #define USBHSCORE_GINTSTS_INCOMPISOIN_Pos (20UL)
  #define USBHSCORE_GINTSTS_INCOMPISOIN_Msk (0x1UL << USBHSCORE_GINTSTS_INCOMPISOIN_Pos)
  #define USBHSCORE_GINTSTS_INCOMPISOIN_Min (0x0UL)
  #define USBHSCORE_GINTSTS_INCOMPISOIN_Max (0x1UL)
  #define USBHSCORE_GINTSTS_INCOMPISOIN_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_INCOMPISOIN_ACTIVE (0x1UL)

