pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INCOMPLP @Bit 21 : Incomplete Periodic Transfer (incomplP) */
  #define USBHSCORE_GINTSTS_INCOMPLP_Pos (21UL)
  #define USBHSCORE_GINTSTS_INCOMPLP_Msk (0x1UL << USBHSCORE_GINTSTS_INCOMPLP_Pos)
  #define USBHSCORE_GINTSTS_INCOMPLP_Min (0x0UL)
  #define USBHSCORE_GINTSTS_INCOMPLP_Max (0x1UL)
  #define USBHSCORE_GINTSTS_INCOMPLP_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_INCOMPLP_ACTIVE (0x1UL)

/* FETSUSP @Bit 22 : Mode: Device only. Data Fetch Suspended (FetSusp) */
  #define USBHSCORE_GINTSTS_FETSUSP_Pos (22UL)
  #define USBHSCORE_GINTSTS_FETSUSP_Msk (0x1UL << USBHSCORE_GINTSTS_FETSUSP_Pos)
  #define USBHSCORE_GINTSTS_FETSUSP_Min (0x0UL)
  #define USBHSCORE_GINTSTS_FETSUSP_Max (0x1UL)
  #define USBHSCORE_GINTSTS_FETSUSP_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_FETSUSP_ACTIVE (0x1UL)

/* RESETDET @Bit 23 : Mode: Device only. Reset detected Interrupt (ResetDet) */
  #define USBHSCORE_GINTSTS_RESETDET_Pos (23UL)
  #define USBHSCORE_GINTSTS_RESETDET_Msk (0x1UL << USBHSCORE_GINTSTS_RESETDET_Pos)
  #define USBHSCORE_GINTSTS_RESETDET_Min (0x0UL)
  #define USBHSCORE_GINTSTS_RESETDET_Max (0x1UL)
  #define USBHSCORE_GINTSTS_RESETDET_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_RESETDET_ACTIVE (0x1UL)

/* PRTINT @Bit 24 : Mode: Host only. Host Port Interrupt (PrtInt) */
  #define USBHSCORE_GINTSTS_PRTINT_Pos (24UL)
  #define USBHSCORE_GINTSTS_PRTINT_Msk (0x1UL << USBHSCORE_GINTSTS_PRTINT_Pos)
  #define USBHSCORE_GINTSTS_PRTINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_PRTINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_PRTINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_PRTINT_ACTIVE (0x1UL)

/* HCHINT @Bit 25 : Mode: Host only. Host Channels Interrupt (HChInt) */
  #define USBHSCORE_GINTSTS_HCHINT_Pos (25UL)
  #define USBHSCORE_GINTSTS_HCHINT_Msk (0x1UL << USBHSCORE_GINTSTS_HCHINT_Pos)
  #define USBHSCORE_GINTSTS_HCHINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_HCHINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_HCHINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_HCHINT_ACTIVE (0x1UL)

/* LPMINT @Bit 27 : Mode: Host and Device. LPM Transaction Received Interrupt (LPM_Int). */
  #define USBHSCORE_GINTSTS_LPMINT_Pos (27UL)
  #define USBHSCORE_GINTSTS_LPMINT_Msk (0x1UL << USBHSCORE_GINTSTS_LPMINT_Pos)
  #define USBHSCORE_GINTSTS_LPMINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_LPMINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_LPMINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_LPMINT_ACTIVE (0x1UL)

/* CONIDSTSCHNG @Bit 28 : Mode: Host and Device. Connector ID Status Change (ConIDStsChng) */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Pos (28UL)
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Msk (0x1UL << USBHSCORE_GINTSTS_CONIDSTSCHNG_Pos)
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Min (0x0UL)
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Max (0x1UL)
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_ACTIVE (0x1UL)

/* DISCONNINT @Bit 29 : Mode: Host only. Disconnect Detected Interrupt (DisconnInt) */
  #define USBHSCORE_GINTSTS_DISCONNINT_Pos (29UL)
  #define USBHSCORE_GINTSTS_DISCONNINT_Msk (0x1UL << USBHSCORE_GINTSTS_DISCONNINT_Pos)
  #define USBHSCORE_GINTSTS_DISCONNINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_DISCONNINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_DISCONNINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_DISCONNINT_ACTIVE (0x1UL)

/* SESSREQINT @Bit 30 : Mode: Host and Device. Session Request/New Session Detected Interrupt (SessReqInt) */
  #define USBHSCORE_GINTSTS_SESSREQINT_Pos (30UL)
  #define USBHSCORE_GINTSTS_SESSREQINT_Msk (0x1UL << USBHSCORE_GINTSTS_SESSREQINT_Pos)
  #define USBHSCORE_GINTSTS_SESSREQINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_SESSREQINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_SESSREQINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_SESSREQINT_ACTIVE (0x1UL)

/* WKUPINT @Bit 31 : Mode: Host and Device. Resume/Remote Wakeup Detected Interrupt (WkUpInt) */
  #define USBHSCORE_GINTSTS_WKUPINT_Pos (31UL)
  #define USBHSCORE_GINTSTS_WKUPINT_Msk (0x1UL << USBHSCORE_GINTSTS_WKUPINT_Pos)
  #define USBHSCORE_GINTSTS_WKUPINT_Min (0x0UL)
  #define USBHSCORE_GINTSTS_WKUPINT_Max (0x1UL)
  #define USBHSCORE_GINTSTS_WKUPINT_INACTIVE (0x0UL)
  #define USBHSCORE_GINTSTS_WKUPINT_ACTIVE (0x1UL)


/* USBHSCORE_GINTMSK: Interrupt Mask Register */
  #define USBHSCORE_GINTMSK_ResetValue (0x00000000UL)

/* MODEMISMSK @Bit 1 : Mode: Host and Device. Mode Mismatch Interrupt Mask (ModeMisMsk) */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Pos (1UL)
  #define USBHSCORE_GINTMSK_MODEMISMSK_Msk (0x1UL << USBHSCORE_GINTMSK_MODEMISMSK_Pos)
  #define USBHSCORE_GINTMSK_MODEMISMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_MODEMISMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_MODEMISMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_MODEMISMSK_NOMASK (0x1UL)

/* OTGINTMSK @Bit 2 : Mode: Host and Device. OTG Interrupt Mask (OTGIntMsk) */
  #define USBHSCORE_GINTMSK_OTGINTMSK_Pos (2UL)
  #define USBHSCORE_GINTMSK_OTGINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_OTGINTMSK_Pos)
  #define USBHSCORE_GINTMSK_OTGINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_OTGINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_OTGINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_OTGINTMSK_NOMASK (0x1UL)

/* SOFMSK @Bit 3 : Mode: Host and Device. Start of (micro)Frame Mask (SofMsk) */
  #define USBHSCORE_GINTMSK_SOFMSK_Pos (3UL)
  #define USBHSCORE_GINTMSK_SOFMSK_Msk (0x1UL << USBHSCORE_GINTMSK_SOFMSK_Pos)
  #define USBHSCORE_GINTMSK_SOFMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_SOFMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_SOFMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_SOFMSK_NOMASK (0x1UL)

/* RXFLVLMSK @Bit 4 : Mode: Host and Device. Receive FIFO Non-Empty Mask (RxFLvlMsk) */
  #define USBHSCORE_GINTMSK_RXFLVLMSK_Pos (4UL)
  #define USBHSCORE_GINTMSK_RXFLVLMSK_Msk (0x1UL << USBHSCORE_GINTMSK_RXFLVLMSK_Pos)
  #define USBHSCORE_GINTMSK_RXFLVLMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_RXFLVLMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_RXFLVLMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_RXFLVLMSK_NOMASK (0x1UL)

/* NPTXFEMPMSK @Bit 5 : Mode: Host and Device. Non-periodic TxFIFO Empty Mask (NPTxFEmpMsk) */
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_Pos (5UL)
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_NPTXFEMPMSK_Pos)
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_NPTXFEMPMSK_NOMASK (0x1UL)

/* GINNAKEFFMSK @Bit 6 : Mode: Device only,. Global Non-periodic IN NAK Effective Mask (GINNakEffMsk) */
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_Pos (6UL)
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_Msk (0x1UL << USBHSCORE_GINTMSK_GINNAKEFFMSK_Pos)
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_GINNAKEFFMSK_NOMASK (0x1UL)

/* GOUTNAKEFFMSK @Bit 7 : Mode: Device only. Global OUT NAK Effective Mask (GOUTNakEffMsk) */
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Pos (7UL)
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Msk (0x1UL << USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Pos) /*!< Bit mask of GOUTNAKEFFMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_GOUTNAKEFFMSK_NOMASK (0x1UL)

/* ERLYSUSPMSK @Bit 10 : Mode: Device only. Early Suspend Mask (ErlySuspMsk) */
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_Pos (10UL)
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_ERLYSUSPMSK_Pos)
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_ERLYSUSPMSK_NOMASK (0x1UL)

/* USBSUSPMSK @Bit 11 : Mode: Device only. USB Suspend Mask (USBSuspMsk) */
  #define USBHSCORE_GINTMSK_USBSUSPMSK_Pos (11UL)
  #define USBHSCORE_GINTMSK_USBSUSPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_USBSUSPMSK_Pos)
  #define USBHSCORE_GINTMSK_USBSUSPMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_USBSUSPMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_USBSUSPMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_USBSUSPMSK_NOMASK (0x1UL)

/* USBRSTMSK @Bit 12 : Mode: Device only. USB Reset Mask (USBRstMsk) */
  #define USBHSCORE_GINTMSK_USBRSTMSK_Pos (12UL)
  #define USBHSCORE_GINTMSK_USBRSTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_USBRSTMSK_Pos)
  #define USBHSCORE_GINTMSK_USBRSTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_USBRSTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_USBRSTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_USBRSTMSK_NOMASK (0x1UL)

/* ENUMDONEMSK @Bit 13 : Mode: Device only. Enumeration Done Mask (EnumDoneMsk) */
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_Pos (13UL)
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_Msk (0x1UL << USBHSCORE_GINTMSK_ENUMDONEMSK_Pos)
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_ENUMDONEMSK_NOMASK (0x1UL)

/* ISOOUTDROPMSK @Bit 14 : Mode: Device only. Isochronous OUT Packet Dropped Interrupt Mask (ISOOutDropMsk) */
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_Pos (14UL)
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_ISOOUTDROPMSK_Pos) /*!< Bit mask of ISOOUTDROPMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_ISOOUTDROPMSK_NOMASK (0x1UL)

/* EOPFMSK @Bit 15 : Mode: Device only. End of Periodic Frame Interrupt Mask (EOPFMsk) */
  #define USBHSCORE_GINTMSK_EOPFMSK_Pos (15UL)
  #define USBHSCORE_GINTMSK_EOPFMSK_Msk (0x1UL << USBHSCORE_GINTMSK_EOPFMSK_Pos)
  #define USBHSCORE_GINTMSK_EOPFMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_EOPFMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_EOPFMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_EOPFMSK_NOMASK (0x1UL)

/* RSTRDONEINTMSK @Bit 16 : Mode: Host and Device. Restore Done Interrupt Mask (RstrDoneIntMsk) */
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_Pos (16UL)
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_RSTRDONEINTMSK_Pos) /*!< Bit mask of RSTRDONEINTMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_RSTRDONEINTMSK_NOMASK (0x1UL)

/* EPMISMSK @Bit 17 : Mode: Device only. Endpoint Mismatch Interrupt Mask (EPMisMsk) */
  #define USBHSCORE_GINTMSK_EPMISMSK_Pos (17UL)
  #define USBHSCORE_GINTMSK_EPMISMSK_Msk (0x1UL << USBHSCORE_GINTMSK_EPMISMSK_Pos)
  #define USBHSCORE_GINTMSK_EPMISMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_EPMISMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_EPMISMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_EPMISMSK_NOMASK (0x1UL)

/* IEPINTMSK @Bit 18 : Mode: Device only. IN Endpoints Interrupt Mask (IEPIntMsk) */
  #define USBHSCORE_GINTMSK_IEPINTMSK_Pos (18UL)
  #define USBHSCORE_GINTMSK_IEPINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_IEPINTMSK_Pos)
  #define USBHSCORE_GINTMSK_IEPINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_IEPINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_IEPINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_IEPINTMSK_NOMASK (0x1UL)

/* OEPINTMSK @Bit 19 : Mode: Device only. OUT Endpoints Interrupt Mask (OEPIntMsk) */
  #define USBHSCORE_GINTMSK_OEPINTMSK_Pos (19UL)
  #define USBHSCORE_GINTMSK_OEPINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_OEPINTMSK_Pos)
  #define USBHSCORE_GINTMSK_OEPINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_OEPINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_OEPINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_OEPINTMSK_NOMASK (0x1UL)

/* INCOMPLPMSK @Bit 21 : Incomplete Periodic Transfer Mask (incomplPMsk) */
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_Pos (21UL)
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_INCOMPLPMSK_Pos)
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_MASK (0x0UL) /*!< Host mode: Incomplete Periodic Transfer MaskDevice mode: Incomplete
                                                          Isochronous OUT Transfer Mask*/
  #define USBHSCORE_GINTMSK_INCOMPLPMSK_NOMASK (0x1UL) /*!< Host mode: No Incomplete Periodic Transfer MaskDevice mode: No
                                                            Incomplete Isochronous OUT Transfer Mask*/

/* FETSUSPMSK @Bit 22 : Mode: Device only. Data Fetch Suspended Mask (FetSuspMsk) */
  #define USBHSCORE_GINTMSK_FETSUSPMSK_Pos (22UL)
  #define USBHSCORE_GINTMSK_FETSUSPMSK_Msk (0x1UL << USBHSCORE_GINTMSK_FETSUSPMSK_Pos)
  #define USBHSCORE_GINTMSK_FETSUSPMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_FETSUSPMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_FETSUSPMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_FETSUSPMSK_NOMASK (0x1UL)

/* RESETDETMSK @Bit 23 : Mode: Device only. Reset detected Interrupt Mask (ResetDetMsk) */
  #define USBHSCORE_GINTMSK_RESETDETMSK_Pos (23UL)
  #define USBHSCORE_GINTMSK_RESETDETMSK_Msk (0x1UL << USBHSCORE_GINTMSK_RESETDETMSK_Pos)
  #define USBHSCORE_GINTMSK_RESETDETMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_RESETDETMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_RESETDETMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_RESETDETMSK_NOMASK (0x1UL)

/* PRTINTMSK @Bit 24 : Mode: Host only. Host Port Interrupt Mask (PrtIntMsk) */
  #define USBHSCORE_GINTMSK_PRTINTMSK_Pos (24UL)
  #define USBHSCORE_GINTMSK_PRTINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_PRTINTMSK_Pos)
  #define USBHSCORE_GINTMSK_PRTINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_PRTINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_PRTINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_PRTINTMSK_NOMASK (0x1UL)

