pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* HCHINTMSK @Bit 25 : Mode: Host only. Host Channels Interrupt Mask (HChIntMsk) */
  #define USBHSCORE_GINTMSK_HCHINTMSK_Pos (25UL)
  #define USBHSCORE_GINTMSK_HCHINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_HCHINTMSK_Pos)
  #define USBHSCORE_GINTMSK_HCHINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_HCHINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_HCHINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_HCHINTMSK_NOMASK (0x1UL)

/* LPMINTMSK @Bit 27 : Mode: Host and Device. LPM Transaction Received Interrupt (LPM_Int) */
  #define USBHSCORE_GINTMSK_LPMINTMSK_Pos (27UL)
  #define USBHSCORE_GINTMSK_LPMINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_LPMINTMSK_Pos)
  #define USBHSCORE_GINTMSK_LPMINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_LPMINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_LPMINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_LPMINTMSK_NOMASK (0x1UL)

/* CONIDSTSCHNGMSK @Bit 28 : Mode: Host and Device. Connector ID Status Change Mask (ConIDStsChngMsk) */
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Pos (28UL)
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Msk (0x1UL << USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Pos) /*!< Bit mask of
                                                                            CONIDSTSCHNGMSK field.*/
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_CONIDSTSCHNGMSK_NOMASK (0x1UL)

/* DISCONNINTMSK @Bit 29 : Mode: Host and Device. Disconnect Detected Interrupt Mask (DisconnIntMsk) */
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Pos (29UL)
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_DISCONNINTMSK_Pos) /*!< Bit mask of DISCONNINTMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_DISCONNINTMSK_NOMASK (0x1UL)

/* SESSREQINTMSK @Bit 30 : Mode: Host and Device. Session Request/New Session Detected Interrupt Mask (SessReqIntMsk) */
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Pos (30UL)
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_SESSREQINTMSK_Pos) /*!< Bit mask of SESSREQINTMSK
                                                                            field.*/
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_SESSREQINTMSK_NOMASK (0x1UL)

/* WKUPINTMSK @Bit 31 : Mode: Host and Device. Resume/Remote Wakeup Detected Interrupt Mask (WkUpIntMsk) */
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Pos (31UL)
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_WKUPINTMSK_Pos)
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Min (0x0UL)
  #define USBHSCORE_GINTMSK_WKUPINTMSK_Max (0x1UL)
  #define USBHSCORE_GINTMSK_WKUPINTMSK_MASK (0x0UL)
  #define USBHSCORE_GINTMSK_WKUPINTMSK_NOMASK (0x1UL)


/* USBHSCORE_GRXSTSR: Receive Status Debug Read Register */
  #define USBHSCORE_GRXSTSR_ResetValue (0x00000000UL)

/* CHNUM @Bits 0..3 : Channel Number (ChNum) */
  #define USBHSCORE_GRXSTSR_CHNUM_Pos (0UL)
  #define USBHSCORE_GRXSTSR_CHNUM_Msk (0xFUL << USBHSCORE_GRXSTSR_CHNUM_Pos)
  #define USBHSCORE_GRXSTSR_CHNUM_Min (0x0UL)
  #define USBHSCORE_GRXSTSR_CHNUM_Max (0xFUL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP0 (0x0UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP1 (0x1UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP2 (0x2UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP3 (0x3UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP4 (0x4UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP5 (0x5UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP6 (0x6UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP7 (0x7UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP8 (0x8UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP9 (0x9UL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP10 (0xAUL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP11 (0xBUL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP12 (0xCUL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP13 (0xDUL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP14 (0xEUL)
  #define USBHSCORE_GRXSTSR_CHNUM_CHEP15 (0xFUL)

/* BCNT @Bits 4..14 : Byte Count (BCnt) */
  #define USBHSCORE_GRXSTSR_BCNT_Pos (4UL)
  #define USBHSCORE_GRXSTSR_BCNT_Msk (0x7FFUL << USBHSCORE_GRXSTSR_BCNT_Pos)

/* DPID @Bits 15..16 : Data PID (DPID) */
  #define USBHSCORE_GRXSTSR_DPID_Pos (15UL)
  #define USBHSCORE_GRXSTSR_DPID_Msk (0x3UL << USBHSCORE_GRXSTSR_DPID_Pos)
  #define USBHSCORE_GRXSTSR_DPID_Min (0x0UL)
  #define USBHSCORE_GRXSTSR_DPID_Max (0x3UL)
  #define USBHSCORE_GRXSTSR_DPID_DATA0 (0x0UL)
  #define USBHSCORE_GRXSTSR_DPID_DATA2 (0x1UL)
  #define USBHSCORE_GRXSTSR_DPID_DATA1 (0x2UL)
  #define USBHSCORE_GRXSTSR_DPID_MDATA (0x3UL)

/* PKTSTS @Bits 17..20 : Packet Status (PktSts) indicates the status of the received packet. */
  #define USBHSCORE_GRXSTSR_PKTSTS_Pos (17UL)
  #define USBHSCORE_GRXSTSR_PKTSTS_Msk (0xFUL << USBHSCORE_GRXSTSR_PKTSTS_Pos)
  #define USBHSCORE_GRXSTSR_PKTSTS_Min (0x1UL)
  #define USBHSCORE_GRXSTSR_PKTSTS_Max (0x7UL)
  #define USBHSCORE_GRXSTSR_PKTSTS_OUTNAK (0x1UL)
  #define USBHSCORE_GRXSTSR_PKTSTS_INOUTDPRX (0x2UL) /*!< IN data packet received in host mode and OUT data packet received in
                                                          device mode*/
  #define USBHSCORE_GRXSTSR_PKTSTS_INOUTTRCOM (0x3UL) /*!< IN or OUT transfer completed in both host and device mode (triggers
                                                           an interrupt)*/
  #define USBHSCORE_GRXSTSR_PKTSTS_DSETUPCOM (0x4UL)
  #define USBHSCORE_GRXSTSR_PKTSTS_DTTOG (0x5UL)
  #define USBHSCORE_GRXSTSR_PKTSTS_DSETUPRX (0x6UL)
  #define USBHSCORE_GRXSTSR_PKTSTS_CHHALT (0x7UL)

/* FN @Bits 21..24 : Mode: Device only. Frame Number (FN) */
  #define USBHSCORE_GRXSTSR_FN_Pos (21UL)
  #define USBHSCORE_GRXSTSR_FN_Msk (0xFUL << USBHSCORE_GRXSTSR_FN_Pos)


/* USBHSCORE_GRXSTSP: Receive Status Read/Pop Register */
  #define USBHSCORE_GRXSTSP_ResetValue (0x00000000UL)

/* CHNUM @Bits 0..3 : Channel Number (ChNum) */
  #define USBHSCORE_GRXSTSP_CHNUM_Pos (0UL)
  #define USBHSCORE_GRXSTSP_CHNUM_Msk (0xFUL << USBHSCORE_GRXSTSP_CHNUM_Pos)
  #define USBHSCORE_GRXSTSP_CHNUM_Min (0x0UL)
  #define USBHSCORE_GRXSTSP_CHNUM_Max (0xFUL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP0 (0x0UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP1 (0x1UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP2 (0x2UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP3 (0x3UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP4 (0x4UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP5 (0x5UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP6 (0x6UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP7 (0x7UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP8 (0x8UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP9 (0x9UL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP10 (0xAUL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP11 (0xBUL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP12 (0xCUL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP13 (0xDUL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP14 (0xEUL)
  #define USBHSCORE_GRXSTSP_CHNUM_CHEP15 (0xFUL)

/* BCNT @Bits 4..14 : Byte Count (BCnt) */
  #define USBHSCORE_GRXSTSP_BCNT_Pos (4UL)
  #define USBHSCORE_GRXSTSP_BCNT_Msk (0x7FFUL << USBHSCORE_GRXSTSP_BCNT_Pos)

/* DPID @Bits 15..16 : Data PID (DPID) */
  #define USBHSCORE_GRXSTSP_DPID_Pos (15UL)
  #define USBHSCORE_GRXSTSP_DPID_Msk (0x3UL << USBHSCORE_GRXSTSP_DPID_Pos)
  #define USBHSCORE_GRXSTSP_DPID_Min (0x0UL)
  #define USBHSCORE_GRXSTSP_DPID_Max (0x3UL)
  #define USBHSCORE_GRXSTSP_DPID_DATA0 (0x0UL)
  #define USBHSCORE_GRXSTSP_DPID_DATA2 (0x1UL)
  #define USBHSCORE_GRXSTSP_DPID_DATA1 (0x2UL)
  #define USBHSCORE_GRXSTSP_DPID_MDATA (0x3UL)

