pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PKTSTS @Bits 17..20 : Packet Status (PktSts) indicates the status of the received packet. */
  #define USBHSCORE_GRXSTSP_PKTSTS_Pos (17UL)
  #define USBHSCORE_GRXSTSP_PKTSTS_Msk (0xFUL << USBHSCORE_GRXSTSP_PKTSTS_Pos)
  #define USBHSCORE_GRXSTSP_PKTSTS_Min (0x1UL)
  #define USBHSCORE_GRXSTSP_PKTSTS_Max (0x5UL)
  #define USBHSCORE_GRXSTSP_PKTSTS_OUTNAK (0x1UL)
  #define USBHSCORE_GRXSTSP_PKTSTS_INOUTDPRX (0x2UL) /*!< IN data packet received in host mode and OUT data packet received in
                                                          device mode*/
  #define USBHSCORE_GRXSTSP_PKTSTS_INOUTTRCOM (0x3UL) /*!< IN or OUT transfer completed in both host and device mode (triggers
                                                           an interrupt)*/
  #define USBHSCORE_GRXSTSP_PKTSTS_DSETUPCOM (0x4UL)
  #define USBHSCORE_GRXSTSP_PKTSTS_DTTOG (0x5UL)

/* FN @Bits 21..24 : Mode: Device only. Frame Number (FN) */
  #define USBHSCORE_GRXSTSP_FN_Pos (21UL)
  #define USBHSCORE_GRXSTSP_FN_Msk (0xFUL << USBHSCORE_GRXSTSP_FN_Pos)


/* USBHSCORE_GRXFSIZ: Receive FIFO Size Register */
  #define USBHSCORE_GRXFSIZ_ResetValue (0x00000224UL)

/* RXFDEP @Bits 0..9 : Mode: Host and Device. RxFIFO Depth (RxFDep) */
  #define USBHSCORE_GRXFSIZ_RXFDEP_Pos (0UL)
  #define USBHSCORE_GRXFSIZ_RXFDEP_Msk (0x3FFUL << USBHSCORE_GRXFSIZ_RXFDEP_Pos)


/* USBHSCORE_GNPTXFSIZ: Non-periodic Transmit FIFO Size Register */
  #define USBHSCORE_GNPTXFSIZ_ResetValue (0x02000224UL)

/* NPTXFSTADDR @Bits 0..9 : Non-periodic Transmit RAM Start Address (NPTxFStAddr) */
  #define USBHSCORE_GNPTXFSIZ_NPTXFSTADDR_Pos (0UL)
  #define USBHSCORE_GNPTXFSIZ_NPTXFSTADDR_Msk (0x3FFUL << USBHSCORE_GNPTXFSIZ_NPTXFSTADDR_Pos) /*!< Bit mask of NPTXFSTADDR
                                                                            field.*/

/* NPTXFDEP @Bits 16..25 : Mode: Host only. Non-periodic TxFIFO Depth (NPTxFDep) */
  #define USBHSCORE_GNPTXFSIZ_NPTXFDEP_Pos (16UL)
  #define USBHSCORE_GNPTXFSIZ_NPTXFDEP_Msk (0x3FFUL << USBHSCORE_GNPTXFSIZ_NPTXFDEP_Pos)


/* USBHSCORE_GNPTXSTS: Non-periodic Transmit FIFO/Queue Status Register */
  #define USBHSCORE_GNPTXSTS_ResetValue (0x00080200UL)

/* NPTXFSPCAVAIL @Bits 0..15 : Non-periodic TxFIFO Space Avail (NPTxFSpcAvail) */
  #define USBHSCORE_GNPTXSTS_NPTXFSPCAVAIL_Pos (0UL)
  #define USBHSCORE_GNPTXSTS_NPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_GNPTXSTS_NPTXFSPCAVAIL_Pos) /*!< Bit mask of NPTXFSPCAVAIL
                                                                            field.*/

/* NPTXQSPCAVAIL @Bits 16..23 : Non-periodic Transmit Request Queue Space Available (NPTxQSpcAvail) */
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Pos (16UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Msk (0xFFUL << USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Pos) /*!< Bit mask of NPTXQSPCAVAIL
                                                                            field.*/
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Min (0x0UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_Max (0x8UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_FULL (0x00UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE1 (0x01UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE2 (0x02UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE3 (0x03UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE4 (0x04UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE5 (0x05UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE6 (0x06UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE7 (0x07UL)
  #define USBHSCORE_GNPTXSTS_NPTXQSPCAVAIL_QUE8 (0x08UL)

/* NPTXQTOP @Bits 24..30 : Top of the Non-periodic Transmit Request Queue (NPTxQTop) */
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_Pos (24UL)
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_Msk (0x7FUL << USBHSCORE_GNPTXSTS_NPTXQTOP_Pos)
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_Min (0x0UL)
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_Max (0x3UL)
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_INOUTTK (0x00UL)
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_ZEROTX (0x01UL)
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_PINGCSPLIT (0x02UL)
  #define USBHSCORE_GNPTXSTS_NPTXQTOP_CHNHALT (0x03UL)


/* USBHSCORE_GGPIO: General Purpose Input/Output Register */
  #define USBHSCORE_GGPIO_ResetValue (0x00000000UL)

/* GPI @Bits 0..15 : (unspecified) */
  #define USBHSCORE_GGPIO_GPI_Pos (0UL)
  #define USBHSCORE_GGPIO_GPI_Msk (0xFFFFUL << USBHSCORE_GGPIO_GPI_Pos)

/* GPO @Bits 16..31 : (unspecified) */
  #define USBHSCORE_GGPIO_GPO_Pos (16UL)
  #define USBHSCORE_GGPIO_GPO_Msk (0xFFFFUL << USBHSCORE_GGPIO_GPO_Pos)


/* USBHSCORE_GUID: User ID Register */
  #define USBHSCORE_GUID_ResetValue (0x00000000UL)

/* GUID @Bits 0..31 : User ID (UserID) Application-programmable ID field. */
  #define USBHSCORE_GUID_GUID_Pos (0UL)
  #define USBHSCORE_GUID_GUID_Msk (0xFFFFFFFFUL << USBHSCORE_GUID_GUID_Pos)


/* USBHSCORE_GSNPSID: Synopsys ID Register */
  #define USBHSCORE_GSNPSID_ResetValue (0x4F54430AUL)

/* SYNOPSYSID @Bits 0..31 : Release number of the controller being used currently. */
  #define USBHSCORE_GSNPSID_SYNOPSYSID_Pos (0UL)
  #define USBHSCORE_GSNPSID_SYNOPSYSID_Msk (0xFFFFFFFFUL << USBHSCORE_GSNPSID_SYNOPSYSID_Pos) /*!< Bit mask of SYNOPSYSID
                                                                            field.*/


/* USBHSCORE_GHWCFG1: User Hardware Configuration 1 Register */
  #define USBHSCORE_GHWCFG1_ResetValue (0xAA555000UL)

/* EPDIR @Bits 0..31 : This 32-bit field uses two bits per */
  #define USBHSCORE_GHWCFG1_EPDIR_Pos (0UL)
  #define USBHSCORE_GHWCFG1_EPDIR_Msk (0xFFFFFFFFUL << USBHSCORE_GHWCFG1_EPDIR_Pos)


/* USBHSCORE_GHWCFG2: User Hardware Configuration 2 Register */
  #define USBHSCORE_GHWCFG2_ResetValue (0x228BFC72UL)

/* OTGMODE @Bits 0..2 : Mode of Operation (OtgMode) */
  #define USBHSCORE_GHWCFG2_OTGMODE_Pos (0UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_Msk (0x7UL << USBHSCORE_GHWCFG2_OTGMODE_Pos)
  #define USBHSCORE_GHWCFG2_OTGMODE_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_Max (0x6UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_HNPSRP (0x0UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPOTG (0x1UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_NHNPNSRP (0x2UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPCAPD (0x3UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_NONOTGD (0x4UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_SRPCAPH (0x5UL)
  #define USBHSCORE_GHWCFG2_OTGMODE_NONOTGH (0x6UL)

/* OTGARCH @Bits 3..4 : Architecture (OtgArch) */
  #define USBHSCORE_GHWCFG2_OTGARCH_Pos (3UL)
  #define USBHSCORE_GHWCFG2_OTGARCH_Msk (0x3UL << USBHSCORE_GHWCFG2_OTGARCH_Pos)
  #define USBHSCORE_GHWCFG2_OTGARCH_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_OTGARCH_Max (0x2UL)
  #define USBHSCORE_GHWCFG2_OTGARCH_SLAVEMODE (0x0UL)
  #define USBHSCORE_GHWCFG2_OTGARCH_EXTERNALDMA (0x1UL)
  #define USBHSCORE_GHWCFG2_OTGARCH_INTERNALDMA (0x2UL)

