pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SINGPNT @Bit 5 : Point-to-Point (SingPnt) */
  #define USBHSCORE_GHWCFG2_SINGPNT_Pos (5UL)
  #define USBHSCORE_GHWCFG2_SINGPNT_Msk (0x1UL << USBHSCORE_GHWCFG2_SINGPNT_Pos)
  #define USBHSCORE_GHWCFG2_SINGPNT_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_SINGPNT_Max (0x1UL)
  #define USBHSCORE_GHWCFG2_SINGPNT_MULTIPOINT (0x0UL)
  #define USBHSCORE_GHWCFG2_SINGPNT_SINGLEPOINT (0x1UL)

/* HSPHYTYPE @Bits 6..7 : High-Speed PHY Interface Type (HSPhyType) */
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Pos (6UL)
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Msk (0x3UL << USBHSCORE_GHWCFG2_HSPHYTYPE_Pos)
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_Max (0x3UL)
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_NOHS (0x0UL)
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_UTMIPLUS (0x1UL)
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_ULPI (0x2UL)
  #define USBHSCORE_GHWCFG2_HSPHYTYPE_UTMIPUSULPI (0x3UL)

/* FSPHYTYPE @Bits 8..9 : Full-Speed PHY Interface Type (FSPhyType) */
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Pos (8UL)
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Msk (0x3UL << USBHSCORE_GHWCFG2_FSPHYTYPE_Pos)
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_Max (0x3UL)
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_NO_FS (0x0UL)
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FS (0x1UL)
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FSPLUSUTMI (0x2UL)
  #define USBHSCORE_GHWCFG2_FSPHYTYPE_FSPLUSULPI (0x3UL)

/* NUMDEVEPS @Bits 10..13 : Number of Device Endpoints (NumDevEps) */
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Pos (10UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Msk (0xFUL << USBHSCORE_GHWCFG2_NUMDEVEPS_Pos)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_Max (0xFUL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT0 (0x0UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT1 (0x1UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT2 (0x2UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT3 (0x3UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT4 (0x4UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT5 (0x5UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT6 (0x6UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT7 (0x7UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT8 (0x8UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT9 (0x9UL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT10 (0xAUL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT11 (0xBUL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT12 (0xCUL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT13 (0xDUL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT14 (0xEUL)
  #define USBHSCORE_GHWCFG2_NUMDEVEPS_ENDPT15 (0xFUL)

/* NUMHSTCHNL @Bits 14..17 : Number of Host Channels (NumHstChnl) */
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Pos (14UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Msk (0xFUL << USBHSCORE_GHWCFG2_NUMHSTCHNL_Pos)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_Max (0xFUL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH0 (0x0UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH1 (0x1UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH2 (0x2UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH3 (0x3UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH4 (0x4UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH5 (0x5UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH6 (0x6UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH7 (0x7UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH8 (0x8UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH9 (0x9UL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH10 (0xAUL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH11 (0xBUL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH12 (0xCUL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH13 (0xDUL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH14 (0xEUL)
  #define USBHSCORE_GHWCFG2_NUMHSTCHNL_HOSTCH15 (0xFUL)

/* PERIOSUPPORT @Bit 18 : Periodic OUT Channels Supported in Host Mode (PerioSupport) */
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Pos (18UL)
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Msk (0x1UL << USBHSCORE_GHWCFG2_PERIOSUPPORT_Pos)
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_Max (0x1UL)
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG2_PERIOSUPPORT_ENABLED (0x1UL)

/* DYNFIFOSIZING @Bit 19 : Dynamic FIFO Sizing Enabled (DynFifoSizing) */
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Pos (19UL)
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Msk (0x1UL << USBHSCORE_GHWCFG2_DYNFIFOSIZING_Pos) /*!< Bit mask of DYNFIFOSIZING
                                                                            field.*/
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_Max (0x1UL)
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG2_DYNFIFOSIZING_ENABLED (0x1UL)

/* MULTIPROCINTRPT @Bit 20 : Multi Processor Interrupt Enabled (MultiProcIntrpt) */
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Pos (20UL)
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Msk (0x1UL << USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Pos) /*!< Bit mask of
                                                                            MULTIPROCINTRPT field.*/
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_Max (0x1UL)
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG2_MULTIPROCINTRPT_ENABLED (0x1UL)

/* NPTXQDEPTH @Bits 22..23 : Non-periodic Request Queue Depth (NPTxQDepth) */
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Pos (22UL)
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Msk (0x3UL << USBHSCORE_GHWCFG2_NPTXQDEPTH_Pos)
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_Max (0x2UL)
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_TWO (0x0UL)
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_FOUR (0x1UL)
  #define USBHSCORE_GHWCFG2_NPTXQDEPTH_EIGHT (0x2UL)

/* PTXQDEPTH @Bits 24..25 : Host Mode Periodic Request Queue Depth (PTxQDepth) */
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Pos (24UL)
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Msk (0x3UL << USBHSCORE_GHWCFG2_PTXQDEPTH_Pos)
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Min (0x0UL)
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_Max (0x3UL)
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE2 (0x0UL)
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE4 (0x1UL)
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE8 (0x2UL)
  #define USBHSCORE_GHWCFG2_PTXQDEPTH_QUE16 (0x3UL)

/* TKNQDEPTH @Bits 26..30 : Device Mode IN Token Sequence Learning Queue Depth (TknQDepth) */
  #define USBHSCORE_GHWCFG2_TKNQDEPTH_Pos (26UL)
  #define USBHSCORE_GHWCFG2_TKNQDEPTH_Msk (0x1FUL << USBHSCORE_GHWCFG2_TKNQDEPTH_Pos)


/* USBHSCORE_GHWCFG3: User Hardware Configuration 3 Register */
  #define USBHSCORE_GHWCFG3_ResetValue (0x0BEAC0E8UL)

/* XFERSIZEWIDTH @Bits 0..3 : Width of Transfer Size Counters (XferSizeWidth) */
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Pos (0UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Msk (0xFUL << USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Pos) /*!< Bit mask of XFERSIZEWIDTH
                                                                            field.*/
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_Max (0x8UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH11 (0x0UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH12 (0x1UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH13 (0x2UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH14 (0x3UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH15 (0x4UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH16 (0x5UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH17 (0x6UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH18 (0x7UL)
  #define USBHSCORE_GHWCFG3_XFERSIZEWIDTH_WIDTH19 (0x8UL)

