pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PKTSIZEWIDTH @Bits 4..6 : Width of Packet Size Counters (PktSizeWidth) */
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Pos (4UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Msk (0x7UL << USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Pos)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_Max (0x6UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS4 (0x0UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS5 (0x1UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS6 (0x2UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS7 (0x3UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS8 (0x4UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS9 (0x5UL)
  #define USBHSCORE_GHWCFG3_PKTSIZEWIDTH_BITS10 (0x6UL)

/* OTGEN @Bit 7 : OTG Function Enabled (OtgEn) */
  #define USBHSCORE_GHWCFG3_OTGEN_Pos (7UL)
  #define USBHSCORE_GHWCFG3_OTGEN_Msk (0x1UL << USBHSCORE_GHWCFG3_OTGEN_Pos)
  #define USBHSCORE_GHWCFG3_OTGEN_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_OTGEN_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_OTGEN_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG3_OTGEN_ENABLED (0x1UL)

/* I2CINTSEL @Bit 8 : I2C Selection (I2CIntSel) */
  #define USBHSCORE_GHWCFG3_I2CINTSEL_Pos (8UL)
  #define USBHSCORE_GHWCFG3_I2CINTSEL_Msk (0x1UL << USBHSCORE_GHWCFG3_I2CINTSEL_Pos)
  #define USBHSCORE_GHWCFG3_I2CINTSEL_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_I2CINTSEL_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_I2CINTSEL_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG3_I2CINTSEL_ENABLED (0x1UL)

/* VNDCTLSUPT @Bit 9 : Vendor Control Interface Support (VndctlSupt) */
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_Pos (9UL)
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_Msk (0x1UL << USBHSCORE_GHWCFG3_VNDCTLSUPT_Pos)
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_ENABLED (0x1UL)

/* OPTFEATURE @Bit 10 : Optional Features Removed (OptFeature) */
  #define USBHSCORE_GHWCFG3_OPTFEATURE_Pos (10UL)
  #define USBHSCORE_GHWCFG3_OPTFEATURE_Msk (0x1UL << USBHSCORE_GHWCFG3_OPTFEATURE_Pos)
  #define USBHSCORE_GHWCFG3_OPTFEATURE_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_OPTFEATURE_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_OPTFEATURE_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG3_OPTFEATURE_ENABLED (0x1UL)

/* RSTTYPE @Bit 11 : Reset Style for Clocked always Blocks in RTL (RstType) */
  #define USBHSCORE_GHWCFG3_RSTTYPE_Pos (11UL)
  #define USBHSCORE_GHWCFG3_RSTTYPE_Msk (0x1UL << USBHSCORE_GHWCFG3_RSTTYPE_Pos)
  #define USBHSCORE_GHWCFG3_RSTTYPE_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_RSTTYPE_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_RSTTYPE_ASYNCRST (0x0UL)
  #define USBHSCORE_GHWCFG3_RSTTYPE_SYNCRST (0x1UL)

/* ADPSUPPORT @Bit 12 : This bit indicates whether ADP logic is present within or external to the controller */
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_Pos (12UL)
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_Msk (0x1UL << USBHSCORE_GHWCFG3_ADPSUPPORT_Pos)
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_ENABLED (0x1UL)

/* HSICMODE @Bit 13 : HSIC mode specified for Mode of Operation */
  #define USBHSCORE_GHWCFG3_HSICMODE_Pos (13UL)
  #define USBHSCORE_GHWCFG3_HSICMODE_Msk (0x1UL << USBHSCORE_GHWCFG3_HSICMODE_Pos)
  #define USBHSCORE_GHWCFG3_HSICMODE_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_HSICMODE_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_HSICMODE_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG3_HSICMODE_ENABLED (0x1UL)

/* BCSUPPORT @Bit 14 : This bit indicates the controller support for Battery Charger. */
  #define USBHSCORE_GHWCFG3_BCSUPPORT_Pos (14UL)
  #define USBHSCORE_GHWCFG3_BCSUPPORT_Msk (0x1UL << USBHSCORE_GHWCFG3_BCSUPPORT_Pos)
  #define USBHSCORE_GHWCFG3_BCSUPPORT_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_BCSUPPORT_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_BCSUPPORT_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG3_BCSUPPORT_ENABLED (0x1UL)

/* LPMMODE @Bit 15 : LPM mode specified for Mode of Operation. */
  #define USBHSCORE_GHWCFG3_LPMMODE_Pos (15UL)
  #define USBHSCORE_GHWCFG3_LPMMODE_Msk (0x1UL << USBHSCORE_GHWCFG3_LPMMODE_Pos)
  #define USBHSCORE_GHWCFG3_LPMMODE_Min (0x0UL)
  #define USBHSCORE_GHWCFG3_LPMMODE_Max (0x1UL)
  #define USBHSCORE_GHWCFG3_LPMMODE_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG3_LPMMODE_ENABLED (0x1UL)

/* DFIFODEPTH @Bits 16..31 : DFIFO Depth (DfifoDepth - EP_LOC_CNT) */
  #define USBHSCORE_GHWCFG3_DFIFODEPTH_Pos (16UL)
  #define USBHSCORE_GHWCFG3_DFIFODEPTH_Msk (0xFFFFUL << USBHSCORE_GHWCFG3_DFIFODEPTH_Pos)


/* USBHSCORE_GHWCFG4: User Hardware Configuration 4 Register */
  #define USBHSCORE_GHWCFG4_ResetValue (0x1E10AA60UL)

/* NUMDEVPERIOEPS @Bits 0..3 : Number of Device Mode Periodic IN Endpoints (NumDevPerioEps) */
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Pos (0UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Msk (0xFUL << USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Pos) /*!< Bit mask of NUMDEVPERIOEPS
                                                                            field.*/
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Max (0xFUL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value0 (0x0UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value1 (0x1UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value2 (0x2UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value3 (0x3UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value4 (0x4UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value5 (0x5UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value6 (0x6UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value7 (0x7UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value8 (0x8UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value9 (0x9UL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value10 (0xAUL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value11 (0xBUL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value12 (0xCUL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value13 (0xDUL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value14 (0xEUL)
  #define USBHSCORE_GHWCFG4_NUMDEVPERIOEPS_Value15 (0xFUL)

/* PARTIALPWRDN @Bit 4 : Enable Partial Power Down (PartialPwrDn) */
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_Pos (4UL)
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_Msk (0x1UL << USBHSCORE_GHWCFG4_PARTIALPWRDN_Pos)
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_PARTIALPWRDN_ENABLED (0x1UL)

