pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* AHBFREQ @Bit 5 : Minimum AHB Frequency Less Than 60 MHz (AhbFreq) */
  #define USBHSCORE_GHWCFG4_AHBFREQ_Pos (5UL)
  #define USBHSCORE_GHWCFG4_AHBFREQ_Msk (0x1UL << USBHSCORE_GHWCFG4_AHBFREQ_Pos)
  #define USBHSCORE_GHWCFG4_AHBFREQ_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_AHBFREQ_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_AHBFREQ_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_AHBFREQ_ENABLED (0x1UL)

/* HIBERNATION @Bit 6 : Enable Hibernation (Hibernation) */
  #define USBHSCORE_GHWCFG4_HIBERNATION_Pos (6UL)
  #define USBHSCORE_GHWCFG4_HIBERNATION_Msk (0x1UL << USBHSCORE_GHWCFG4_HIBERNATION_Pos)
  #define USBHSCORE_GHWCFG4_HIBERNATION_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_HIBERNATION_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_HIBERNATION_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_HIBERNATION_ENABLED (0x1UL)

/* EXTENDEDHIBERNATION @Bit 7 : Enable Hibernation */
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Pos (7UL)
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Msk (0x1UL << USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Pos) /*!< Bit mask of
                                                                            EXTENDEDHIBERNATION field.*/
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_EXTENDEDHIBERNATION_ENABLED (0x1UL)

/* ENHANCEDLPMSUPT1 @Bit 9 : Enhanced LPM Support1 (EnhancedLPMSupt1) */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Pos (9UL)
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Msk (0x1UL << USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Pos) /*!< Bit mask of
                                                                            ENHANCEDLPMSUPT1 field.*/
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_DISABLED (0x0UL) /*!< Reject L1 Request even if Non-Periodic (Bulk/Interrupt)
                                                                   TxFIFO is not empty.*/
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT1_ENABLED (0x1UL) /*!< Accept L1 Request even if Non-Periodic (Bulk/Interrupt) TxFIFO
                                                                  is not empty*/

/* SERVINTFLOW @Bit 10 : Service Interval Flow */
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_Pos (10UL)
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_Msk (0x1UL << USBHSCORE_GHWCFG4_SERVINTFLOW_Pos)
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_SERVINTFLOW_ENABLED (0x1UL)

/* IPGISOCSUPT @Bit 11 : Interpacket Gap ISOC OUT Worst-case Support (ipgisocSupt) */
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_Pos (11UL)
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_Msk (0x1UL << USBHSCORE_GHWCFG4_IPGISOCSUPT_Pos)
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_IPGISOCSUPT_ENABLED (0x1UL)

/* ACGSUPT @Bit 12 : Active Clock Gating Support */
  #define USBHSCORE_GHWCFG4_ACGSUPT_Pos (12UL)
  #define USBHSCORE_GHWCFG4_ACGSUPT_Msk (0x1UL << USBHSCORE_GHWCFG4_ACGSUPT_Pos)
  #define USBHSCORE_GHWCFG4_ACGSUPT_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_ACGSUPT_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_ACGSUPT_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_ACGSUPT_ENABLED (0x1UL)

/* ENHANCEDLPMSUPT @Bit 13 : Enhanced LPM Support (EnhancedLPMSupt) */
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Pos (13UL)
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Msk (0x1UL << USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Pos) /*!< Bit mask of
                                                                            ENHANCEDLPMSUPT field.*/
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Min (0x1UL)
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_ENHANCEDLPMSUPT_ENABLED (0x1UL)

/* PHYDATAWIDTH @Bits 14..15 : UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width */
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_Pos (14UL)
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_Msk (0x3UL << USBHSCORE_GHWCFG4_PHYDATAWIDTH_Pos)
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_Max (0x2UL)
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_WIDTH1 (0x0UL)
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_WIDTH2 (0x1UL)
  #define USBHSCORE_GHWCFG4_PHYDATAWIDTH_WIDTH3 (0x2UL)

/* NUMCTLEPS @Bits 16..19 : Number of Device Mode Control Endpoints in Addition to */
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_Pos (16UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_Msk (0xFUL << USBHSCORE_GHWCFG4_NUMCTLEPS_Pos)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_Max (0xFUL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT0 (0x0UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT1 (0x1UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT2 (0x2UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT3 (0x3UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT4 (0x4UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT5 (0x5UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT6 (0x6UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT7 (0x7UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT8 (0x8UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT9 (0x9UL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT10 (0xAUL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT11 (0xBUL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT12 (0xCUL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT13 (0xDUL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT14 (0xEUL)
  #define USBHSCORE_GHWCFG4_NUMCTLEPS_ENDPT15 (0xFUL)

/* IDDGFLTR @Bit 20 : IDDIG Filter Enable (IddgFltr) */
  #define USBHSCORE_GHWCFG4_IDDGFLTR_Pos (20UL)
  #define USBHSCORE_GHWCFG4_IDDGFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_IDDGFLTR_Pos)
  #define USBHSCORE_GHWCFG4_IDDGFLTR_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_IDDGFLTR_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_IDDGFLTR_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_IDDGFLTR_ENABLED (0x1UL)

/* VBUSVALIDFLTR @Bit 21 : VBUS Valid Filter Enabled (VBusValidFltr) */
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Pos (21UL)
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Pos) /*!< Bit mask of VBUSVALIDFLTR
                                                                            field.*/
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_VBUSVALIDFLTR_ENABLED (0x1UL)

