pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* AVALIDFLTR @Bit 22 : a_valid Filter Enabled (AValidFltr) */
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_Pos (22UL)
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_AVALIDFLTR_Pos)
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_AVALIDFLTR_ENABLED (0x1UL)

/* BVALIDFLTR @Bit 23 : b_valid Filter Enabled (BValidFltr) */
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_Pos (23UL)
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_BVALIDFLTR_Pos)
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_BVALIDFLTR_ENABLED (0x1UL)

/* SESSENDFLTR @Bit 24 : session_end Filter Enabled (SessEndFltr) */
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_Pos (24UL)
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_Msk (0x1UL << USBHSCORE_GHWCFG4_SESSENDFLTR_Pos)
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_SESSENDFLTR_ENABLED (0x1UL)

/* DEDFIFOMODE @Bit 25 : Enable Dedicated Transmit FIFO for device IN Endpoints */
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_Pos (25UL)
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_Msk (0x1UL << USBHSCORE_GHWCFG4_DEDFIFOMODE_Pos)
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_DISABLED (0x0UL)
  #define USBHSCORE_GHWCFG4_DEDFIFOMODE_ENABLED (0x1UL)

/* INEPS @Bits 26..29 : Number of Device Mode IN Endpoints Including Control Endpoints (INEps) */
  #define USBHSCORE_GHWCFG4_INEPS_Pos (26UL)
  #define USBHSCORE_GHWCFG4_INEPS_Msk (0xFUL << USBHSCORE_GHWCFG4_INEPS_Pos)
  #define USBHSCORE_GHWCFG4_INEPS_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_INEPS_Max (0xFUL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT1 (0x0UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT2 (0x1UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT3 (0x2UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT4 (0x3UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT5 (0x4UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT6 (0x5UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT7 (0x6UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT8 (0x7UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT9 (0x8UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT10 (0x9UL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT11 (0xAUL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT12 (0xBUL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT13 (0xCUL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT14 (0xDUL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT15 (0xEUL)
  #define USBHSCORE_GHWCFG4_INEPS_ENDPT16 (0xFUL)

/* DESCDMAENABLED @Bit 30 : Scatter/Gather DMA configuration */
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_Pos (30UL)
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_Msk (0x1UL << USBHSCORE_GHWCFG4_DESCDMAENABLED_Pos) /*!< Bit mask of DESCDMAENABLED
                                                                            field.*/
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_DISABLE (0x0UL)
  #define USBHSCORE_GHWCFG4_DESCDMAENABLED_ENABLE (0x1UL)

/* DESCDMA @Bit 31 : Scatter/Gather DMA configuration */
  #define USBHSCORE_GHWCFG4_DESCDMA_Pos (31UL)
  #define USBHSCORE_GHWCFG4_DESCDMA_Msk (0x1UL << USBHSCORE_GHWCFG4_DESCDMA_Pos)
  #define USBHSCORE_GHWCFG4_DESCDMA_Min (0x0UL)
  #define USBHSCORE_GHWCFG4_DESCDMA_Max (0x1UL)
  #define USBHSCORE_GHWCFG4_DESCDMA_CONFIG1 (0x0UL)
  #define USBHSCORE_GHWCFG4_DESCDMA_CONFIG2 (0x1UL)


/* USBHSCORE_GLPMCFG: LPM Config Register */
  #define USBHSCORE_GLPMCFG_ResetValue (0x00000000UL)

/* LPMCAP @Bit 0 : LPM-Capable (LPMCap) */
  #define USBHSCORE_GLPMCFG_LPMCAP_Pos (0UL)
  #define USBHSCORE_GLPMCFG_LPMCAP_Msk (0x1UL << USBHSCORE_GLPMCFG_LPMCAP_Pos)
  #define USBHSCORE_GLPMCFG_LPMCAP_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMCAP_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_LPMCAP_DISABLED (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMCAP_ENABLED (0x1UL)

/* APPL1RES @Bit 1 : Mode: Device only. LPM response programmed by application (AppL1Res) */
  #define USBHSCORE_GLPMCFG_APPL1RES_Pos (1UL)
  #define USBHSCORE_GLPMCFG_APPL1RES_Msk (0x1UL << USBHSCORE_GLPMCFG_APPL1RES_Pos)
  #define USBHSCORE_GLPMCFG_APPL1RES_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_APPL1RES_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_APPL1RES_NYET_RESP (0x0UL) /*!< The core responds with a NYET when an error is detected in either of
                                                            the LPM token packets due to corruption*/
  #define USBHSCORE_GLPMCFG_APPL1RES_ACK_RESP (0x1UL)

/* HIRD @Bits 2..5 : Host-Initiated Resume Duration (HIRD) */
  #define USBHSCORE_GLPMCFG_HIRD_Pos (2UL)
  #define USBHSCORE_GLPMCFG_HIRD_Msk (0xFUL << USBHSCORE_GLPMCFG_HIRD_Pos)

/* BREMOTEWAKE @Bit 6 : RemoteWakeEnable (bRemoteWake) */
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_Pos (6UL)
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_Msk (0x1UL << USBHSCORE_GLPMCFG_BREMOTEWAKE_Pos)
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_DISABLED (0x0UL)
  #define USBHSCORE_GLPMCFG_BREMOTEWAKE_ENABLED (0x1UL) /*!< In Host or device mode, this field takes the value of remote wake
                                                             up*/

/* ENBLSLPM @Bit 7 : Enable utmi_sleep_n (EnblSlpM) */
  #define USBHSCORE_GLPMCFG_ENBLSLPM_Pos (7UL)
  #define USBHSCORE_GLPMCFG_ENBLSLPM_Msk (0x1UL << USBHSCORE_GLPMCFG_ENBLSLPM_Pos)
  #define USBHSCORE_GLPMCFG_ENBLSLPM_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_ENBLSLPM_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_ENBLSLPM_DISABLED (0x0UL) /*!< utmi_sleep_n assertion from the core is not transferred to the
                                                           external PHY*/
  #define USBHSCORE_GLPMCFG_ENBLSLPM_ENABLED (0x1UL) /*!< utmi_sleep_n assertion from the core is transferred to the external
                                                          PHY when utmi_l1_suspend_n cannot be asserted*/

/* HIRDTHRES @Bits 8..12 : BESL/HIRD Threshold (HIRD_Thres) */
  #define USBHSCORE_GLPMCFG_HIRDTHRES_Pos (8UL)
  #define USBHSCORE_GLPMCFG_HIRDTHRES_Msk (0x1FUL << USBHSCORE_GLPMCFG_HIRDTHRES_Pos)

/* COREL1RES @Bits 13..14 : LPM Response (CoreL1Res) */
  #define USBHSCORE_GLPMCFG_COREL1RES_Pos (13UL)
  #define USBHSCORE_GLPMCFG_COREL1RES_Msk (0x3UL << USBHSCORE_GLPMCFG_COREL1RES_Pos)
  #define USBHSCORE_GLPMCFG_COREL1RES_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_COREL1RES_Max (0x3UL)
  #define USBHSCORE_GLPMCFG_COREL1RES_LPMRESP1 (0x0UL)
  #define USBHSCORE_GLPMCFG_COREL1RES_LPMRESP2 (0x1UL)
  #define USBHSCORE_GLPMCFG_COREL1RES_LPMRESP3 (0x2UL)
  #define USBHSCORE_GLPMCFG_COREL1RES_LPMRESP4 (0x3UL)

/* SLPSTS @Bit 15 : Port Sleep Status (SlpSts) */
  #define USBHSCORE_GLPMCFG_SLPSTS_Pos (15UL)
  #define USBHSCORE_GLPMCFG_SLPSTS_Msk (0x1UL << USBHSCORE_GLPMCFG_SLPSTS_Pos)
  #define USBHSCORE_GLPMCFG_SLPSTS_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_SLPSTS_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_SLPSTS_CORE_NOT_IN_L1 (0x0UL)
  #define USBHSCORE_GLPMCFG_SLPSTS_CORE_IN_L1 (0x1UL) /*!< In Host mode, this bit indicates the core transitions to Sleep state
                                                           as a successful LPM transaction. In Device mode, the core enters the
                                                           Sleep state when an ACK response is sent to an LPM transaction*/

/* L1RESUMEOK @Bit 16 : Sleep State Resume OK (L1ResumeOK) */
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_Pos (16UL)
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_Msk (0x1UL << USBHSCORE_GLPMCFG_L1RESUMEOK_Pos)
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_NOTOK (0x0UL)
  #define USBHSCORE_GLPMCFG_L1RESUMEOK_OK (0x1UL)

