pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* LPMCHNLINDX @Bits 17..20 : LPM Channel Index */
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_Pos (17UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_Msk (0xFUL << USBHSCORE_GLPMCFG_LPMCHNLINDX_Pos)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_Max (0xFUL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH0 (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH1 (0x1UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH2 (0x2UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH3 (0x3UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH4 (0x4UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH5 (0x5UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH6 (0x6UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH7 (0x7UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH8 (0x8UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH9 (0x9UL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH10 (0xAUL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH11 (0xBUL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH12 (0xCUL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH13 (0xDUL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH14 (0xEUL)
  #define USBHSCORE_GLPMCFG_LPMCHNLINDX_CH15 (0xFUL)

/* LPMRETRYCNT @Bits 21..23 : LPM Retry Count (LPM_Retry_Cnt) */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_Pos (21UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_Msk (0x7UL << USBHSCORE_GLPMCFG_LPMRETRYCNT_Pos)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_Max (0x7UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY0 (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY1 (0x1UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY2 (0x2UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY3 (0x3UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY4 (0x4UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY5 (0x5UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY6 (0x6UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNT_RETRY7 (0x7UL)

/* SNDLPM @Bit 24 : Send LPM Transaction (SndLPM) */
  #define USBHSCORE_GLPMCFG_SNDLPM_Pos (24UL)
  #define USBHSCORE_GLPMCFG_SNDLPM_Msk (0x1UL << USBHSCORE_GLPMCFG_SNDLPM_Pos)
  #define USBHSCORE_GLPMCFG_SNDLPM_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_SNDLPM_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_SNDLPM_DISABLED (0x0UL)  /*!< In host-only mode: Received the response from the device for the LPM
                                                          transaction*/
  #define USBHSCORE_GLPMCFG_SNDLPM_ENABLED (0x1UL)   /*!< In host-only mode: Sending LPM transaction containing EXT and LPM
                                                          tokens*/

/* LPMRETRYCNTSTS @Bits 25..27 : LPM Retry Count Status (LPM_RetryCnt_Sts) */
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Pos (25UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Msk (0x7UL << USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Pos) /*!< Bit mask of LPMRETRYCNTSTS
                                                                            field.*/
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_Max (0x7UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM0 (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM1 (0x1UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM2 (0x2UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM3 (0x3UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM4 (0x4UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM5 (0x5UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM6 (0x6UL)
  #define USBHSCORE_GLPMCFG_LPMRETRYCNTSTS_RETRY_REM7 (0x7UL)

/* LPMENBESL @Bit 28 : LPM Enable BESL (LPM_EnBESL) */
  #define USBHSCORE_GLPMCFG_LPMENBESL_Pos (28UL)
  #define USBHSCORE_GLPMCFG_LPMENBESL_Msk (0x1UL << USBHSCORE_GLPMCFG_LPMENBESL_Pos)
  #define USBHSCORE_GLPMCFG_LPMENBESL_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMENBESL_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_LPMENBESL_DISABLED (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMENBESL_ENABLED (0x1UL)

/* LPMRESTORESLPSTS @Bit 29 : LPM Restore Sleep Status (LPM_RestoreSlpSts) */
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Pos (29UL)
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Msk (0x1UL << USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Pos) /*!< Bit mask of
                                                                            LPMRESTORESLPSTS field.*/
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Min (0x0UL)
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Max (0x1UL)
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_DISABLED (0x0UL) /*!< Puts the core in Shallow Sleep mode based on the BESL value
                                                                   from the Host*/
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_ENABLED (0x1UL) /*!< Puts the core in Deep Sleep mode based on the BESL value from
                                                                  the Host*/


/* USBHSCORE_GPWRDN: Global Power Down Register */
  #define USBHSCORE_GPWRDN_ResetValue (0x00000010UL)

/* PMUINTSEL @Bit 0 : PMU Interrupt Select (PMUIntSel) */
  #define USBHSCORE_GPWRDN_PMUINTSEL_Pos (0UL)
  #define USBHSCORE_GPWRDN_PMUINTSEL_Msk (0x1UL << USBHSCORE_GPWRDN_PMUINTSEL_Pos)
  #define USBHSCORE_GPWRDN_PMUINTSEL_Min (0x0UL)
  #define USBHSCORE_GPWRDN_PMUINTSEL_Max (0x1UL)
  #define USBHSCORE_GPWRDN_PMUINTSEL_DISABLE (0x0UL)
  #define USBHSCORE_GPWRDN_PMUINTSEL_ENABLE (0x1UL)

/* PMUACTV @Bit 1 : PMU Active (PMUActv) */
  #define USBHSCORE_GPWRDN_PMUACTV_Pos (1UL)
  #define USBHSCORE_GPWRDN_PMUACTV_Msk (0x1UL << USBHSCORE_GPWRDN_PMUACTV_Pos)
  #define USBHSCORE_GPWRDN_PMUACTV_Min (0x0UL)
  #define USBHSCORE_GPWRDN_PMUACTV_Max (0x1UL)
  #define USBHSCORE_GPWRDN_PMUACTV_DISABLE (0x0UL)
  #define USBHSCORE_GPWRDN_PMUACTV_ENABLE (0x1UL)

/* RESTORE @Bit 2 : Restore */
  #define USBHSCORE_GPWRDN_RESTORE_Pos (2UL)
  #define USBHSCORE_GPWRDN_RESTORE_Msk (0x1UL << USBHSCORE_GPWRDN_RESTORE_Pos)
  #define USBHSCORE_GPWRDN_RESTORE_Min (0x0UL)
  #define USBHSCORE_GPWRDN_RESTORE_Max (0x1UL)
  #define USBHSCORE_GPWRDN_RESTORE_DISABLE (0x0UL)
  #define USBHSCORE_GPWRDN_RESTORE_ENABLE (0x1UL)

/* PWRDNCLMP @Bit 3 : Power Down Clamp (PwrDnClmp) */
  #define USBHSCORE_GPWRDN_PWRDNCLMP_Pos (3UL)
  #define USBHSCORE_GPWRDN_PWRDNCLMP_Msk (0x1UL << USBHSCORE_GPWRDN_PWRDNCLMP_Pos)
  #define USBHSCORE_GPWRDN_PWRDNCLMP_Min (0x0UL)
  #define USBHSCORE_GPWRDN_PWRDNCLMP_Max (0x1UL)
  #define USBHSCORE_GPWRDN_PWRDNCLMP_DISABLE (0x0UL)
  #define USBHSCORE_GPWRDN_PWRDNCLMP_ENABLE (0x1UL)

/* PWRDNRSTN @Bit 4 : Power Down ResetN (PwrDnRst_n) */
  #define USBHSCORE_GPWRDN_PWRDNRSTN_Pos (4UL)
  #define USBHSCORE_GPWRDN_PWRDNRSTN_Msk (0x1UL << USBHSCORE_GPWRDN_PWRDNRSTN_Pos)
  #define USBHSCORE_GPWRDN_PWRDNRSTN_Min (0x0UL)
  #define USBHSCORE_GPWRDN_PWRDNRSTN_Max (0x1UL)
  #define USBHSCORE_GPWRDN_PWRDNRSTN_DISABLE (0x0UL)
  #define USBHSCORE_GPWRDN_PWRDNRSTN_ENABLE (0x1UL)

