pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PWRDNSWTCH @Bit 5 : Power Down Switch (PwrDnSwtch) */
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_Pos (5UL)
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_Msk (0x1UL << USBHSCORE_GPWRDN_PWRDNSWTCH_Pos)
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_Min (0x0UL)
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_Max (0x1UL)
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_ON (0x0UL)
  #define USBHSCORE_GPWRDN_PWRDNSWTCH_OFF (0x1UL)

/* DISABLEVBUS @Bit 6 : DisableVBUS */
  #define USBHSCORE_GPWRDN_DISABLEVBUS_Pos (6UL)
  #define USBHSCORE_GPWRDN_DISABLEVBUS_Msk (0x1UL << USBHSCORE_GPWRDN_DISABLEVBUS_Pos)
  #define USBHSCORE_GPWRDN_DISABLEVBUS_Min (0x0UL)
  #define USBHSCORE_GPWRDN_DISABLEVBUS_Max (0x1UL)
  #define USBHSCORE_GPWRDN_DISABLEVBUS_DISABLED (0x0UL) /*!< Host mode:HPRT0.PrtPwr was not programmed to 0, and in Device
                                                             mode:Session Valid*/
  #define USBHSCORE_GPWRDN_DISABLEVBUS_ENABLED (0x1UL) /*!< Host mode:HPRT0.PrtPwr was programmed to 0 and in Device
                                                            mode:Session End*/

/* LNSTSCHNG @Bit 7 : Line State Change (LnStsChng) */
  #define USBHSCORE_GPWRDN_LNSTSCHNG_Pos (7UL)
  #define USBHSCORE_GPWRDN_LNSTSCHNG_Msk (0x1UL << USBHSCORE_GPWRDN_LNSTSCHNG_Pos)
  #define USBHSCORE_GPWRDN_LNSTSCHNG_Min (0x0UL)
  #define USBHSCORE_GPWRDN_LNSTSCHNG_Max (0x1UL)
  #define USBHSCORE_GPWRDN_LNSTSCHNG_DISABLED (0x0UL)
  #define USBHSCORE_GPWRDN_LNSTSCHNG_ENABLED (0x1UL)

/* LINESTAGECHANGEMSK @Bit 8 : LineStageChangeMsk */
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Pos (8UL)
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Msk (0x1UL << USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Pos) /*!< Bit mask of
                                                                            LINESTAGECHANGEMSK field.*/
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Min (0x0UL)
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_Max (0x1UL)
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_NOMASK (0x0UL)
  #define USBHSCORE_GPWRDN_LINESTAGECHANGEMSK_MASK (0x1UL)

/* RESETDETECTED @Bit 9 : ResetDetected */
  #define USBHSCORE_GPWRDN_RESETDETECTED_Pos (9UL)
  #define USBHSCORE_GPWRDN_RESETDETECTED_Msk (0x1UL << USBHSCORE_GPWRDN_RESETDETECTED_Pos) /*!< Bit mask of RESETDETECTED
                                                                            field.*/
  #define USBHSCORE_GPWRDN_RESETDETECTED_Min (0x0UL)
  #define USBHSCORE_GPWRDN_RESETDETECTED_Max (0x1UL)
  #define USBHSCORE_GPWRDN_RESETDETECTED_DISABLED (0x0UL)
  #define USBHSCORE_GPWRDN_RESETDETECTED_ENABLED (0x1UL)

/* RESETDETMSK @Bit 10 : ResetDetMsk */
  #define USBHSCORE_GPWRDN_RESETDETMSK_Pos (10UL)
  #define USBHSCORE_GPWRDN_RESETDETMSK_Msk (0x1UL << USBHSCORE_GPWRDN_RESETDETMSK_Pos)
  #define USBHSCORE_GPWRDN_RESETDETMSK_Min (0x0UL)
  #define USBHSCORE_GPWRDN_RESETDETMSK_Max (0x1UL)
  #define USBHSCORE_GPWRDN_RESETDETMSK_NOMASK (0x0UL)
  #define USBHSCORE_GPWRDN_RESETDETMSK_MASK (0x1UL)

/* DISCONNECTDETECT @Bit 11 : DisconnectDetect */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_Pos (11UL)
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_Msk (0x1UL << USBHSCORE_GPWRDN_DISCONNECTDETECT_Pos) /*!< Bit mask of
                                                                            DISCONNECTDETECT field.*/
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_Min (0x0UL)
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_Max (0x1UL)
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_DISABLED (0x0UL)
  #define USBHSCORE_GPWRDN_DISCONNECTDETECT_ENABLED (0x1UL)

/* DISCONNECTDETECTMSK @Bit 12 : DisconnectDetectMsk */
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Pos (12UL)
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Msk (0x1UL << USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Pos) /*!< Bit mask of
                                                                            DISCONNECTDETECTMSK field.*/
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Min (0x0UL)
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_Max (0x1UL)
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_NOMASK (0x0UL)
  #define USBHSCORE_GPWRDN_DISCONNECTDETECTMSK_MASK (0x1UL)

/* CONNECTDET @Bit 13 : ConnectDet */
  #define USBHSCORE_GPWRDN_CONNECTDET_Pos (13UL)
  #define USBHSCORE_GPWRDN_CONNECTDET_Msk (0x1UL << USBHSCORE_GPWRDN_CONNECTDET_Pos)
  #define USBHSCORE_GPWRDN_CONNECTDET_Min (0x0UL)
  #define USBHSCORE_GPWRDN_CONNECTDET_Max (0x1UL)
  #define USBHSCORE_GPWRDN_CONNECTDET_DISABLED (0x0UL)
  #define USBHSCORE_GPWRDN_CONNECTDET_ENABLED (0x1UL)

/* CONNDETMSK @Bit 14 : ConnDetMsk */
  #define USBHSCORE_GPWRDN_CONNDETMSK_Pos (14UL)
  #define USBHSCORE_GPWRDN_CONNDETMSK_Msk (0x1UL << USBHSCORE_GPWRDN_CONNDETMSK_Pos)
  #define USBHSCORE_GPWRDN_CONNDETMSK_Min (0x0UL)
  #define USBHSCORE_GPWRDN_CONNDETMSK_Max (0x1UL)
  #define USBHSCORE_GPWRDN_CONNDETMSK_NOMASK (0x0UL)
  #define USBHSCORE_GPWRDN_CONNDETMSK_MASK (0x1UL)

/* SRPDETECT @Bit 15 : SRPDetect */
  #define USBHSCORE_GPWRDN_SRPDETECT_Pos (15UL)
  #define USBHSCORE_GPWRDN_SRPDETECT_Msk (0x1UL << USBHSCORE_GPWRDN_SRPDETECT_Pos)
  #define USBHSCORE_GPWRDN_SRPDETECT_Min (0x0UL)
  #define USBHSCORE_GPWRDN_SRPDETECT_Max (0x1UL)
  #define USBHSCORE_GPWRDN_SRPDETECT_DISABLED (0x0UL)
  #define USBHSCORE_GPWRDN_SRPDETECT_ENABLED (0x1UL)

/* SRPDETECTMSK @Bit 16 : SRPDetectMsk */
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_Pos (16UL)
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_Msk (0x1UL << USBHSCORE_GPWRDN_SRPDETECTMSK_Pos)
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_Min (0x0UL)
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_Max (0x1UL)
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_NOMASK (0x0UL)
  #define USBHSCORE_GPWRDN_SRPDETECTMSK_MASK (0x1UL)

/* STSCHNGINT @Bit 17 : Status Change Interrupt (StsChngInt) */
  #define USBHSCORE_GPWRDN_STSCHNGINT_Pos (17UL)
  #define USBHSCORE_GPWRDN_STSCHNGINT_Msk (0x1UL << USBHSCORE_GPWRDN_STSCHNGINT_Pos)
  #define USBHSCORE_GPWRDN_STSCHNGINT_Min (0x0UL)
  #define USBHSCORE_GPWRDN_STSCHNGINT_Max (0x1UL)
  #define USBHSCORE_GPWRDN_STSCHNGINT_DISABLED (0x0UL)
  #define USBHSCORE_GPWRDN_STSCHNGINT_ENABLED (0x1UL)

/* STSCHNGINTMSK @Bit 18 : StsChngIntMsk */
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_Pos (18UL)
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_Msk (0x1UL << USBHSCORE_GPWRDN_STSCHNGINTMSK_Pos) /*!< Bit mask of STSCHNGINTMSK
                                                                            field.*/
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_Min (0x0UL)
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_Max (0x1UL)
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_NOMASK (0x0UL)
  #define USBHSCORE_GPWRDN_STSCHNGINTMSK_MASK (0x1UL)

/* LINESTATE @Bits 19..20 : LineState */
  #define USBHSCORE_GPWRDN_LINESTATE_Pos (19UL)
  #define USBHSCORE_GPWRDN_LINESTATE_Msk (0x3UL << USBHSCORE_GPWRDN_LINESTATE_Pos)
  #define USBHSCORE_GPWRDN_LINESTATE_Min (0x0UL)
  #define USBHSCORE_GPWRDN_LINESTATE_Max (0x3UL)
  #define USBHSCORE_GPWRDN_LINESTATE_LS1 (0x0UL)
  #define USBHSCORE_GPWRDN_LINESTATE_LS2 (0x1UL)
  #define USBHSCORE_GPWRDN_LINESTATE_LS3 (0x2UL)
  #define USBHSCORE_GPWRDN_LINESTATE_LS4 (0x3UL)

/* IDDIG @Bit 21 : This bit indicates the status of the signal IDDIG. The application must read this bit after receiving
                   GPWRDN.StsChngInt and decode based on the previous value stored by the application. */

