pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
  #define USBHSCORE_GPWRDN_IDDIG_Pos (21UL)
  #define USBHSCORE_GPWRDN_IDDIG_Msk (0x1UL << USBHSCORE_GPWRDN_IDDIG_Pos)
  #define USBHSCORE_GPWRDN_IDDIG_Min (0x0UL)
  #define USBHSCORE_GPWRDN_IDDIG_Max (0x1UL)
  #define USBHSCORE_GPWRDN_IDDIG_DISABLED (0x0UL)
  #define USBHSCORE_GPWRDN_IDDIG_ENABLED (0x1UL)

/* BSESSVLD @Bit 22 : B Session Valid (BSessVld) */
  #define USBHSCORE_GPWRDN_BSESSVLD_Pos (22UL)
  #define USBHSCORE_GPWRDN_BSESSVLD_Msk (0x1UL << USBHSCORE_GPWRDN_BSESSVLD_Pos)
  #define USBHSCORE_GPWRDN_BSESSVLD_Min (0x0UL)
  #define USBHSCORE_GPWRDN_BSESSVLD_Max (0x1UL)
  #define USBHSCORE_GPWRDN_BSESSVLD_NOTVALID (0x0UL)
  #define USBHSCORE_GPWRDN_BSESSVLD_VALID (0x1UL)

/* MULTVALIDBC @Bits 24..28 : MultValIdBC */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Pos (24UL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Msk (0x1FUL << USBHSCORE_GPWRDN_MULTVALIDBC_Pos)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Min (0x0UL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Max (0x1FUL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_0 (0x00UL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_C (0x01UL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_B (0x02UL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_A (0x04UL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_GND (0x08UL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_A_RID_GND (0x0CUL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_FLOAT (0x10UL)
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_C_RID_FLOAT (0x11UL) /*!< OTG device as B-device, can connect, RID_C=1 and
                                                                     RID_FLOAT=1*/
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_B_RID_FLOAT (0x12UL) /*!< OTG device as B-device, cannot connect, RID_B=1 and
                                                                     RID_FLOAT=1*/
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_1 (0x1FUL)


/* USBHSCORE_GDFIFOCFG: Global DFIFO Configuration Register */
  #define USBHSCORE_GDFIFOCFG_ResetValue (0x0BEA0C00UL)

/* GDFIFOCFG @Bits 0..15 : GDFIFOCfg */
  #define USBHSCORE_GDFIFOCFG_GDFIFOCFG_Pos (0UL)
  #define USBHSCORE_GDFIFOCFG_GDFIFOCFG_Msk (0xFFFFUL << USBHSCORE_GDFIFOCFG_GDFIFOCFG_Pos)

/* EPINFOBASEADDR @Bits 16..31 : This field provides the start address of the EP info controller. */
  #define USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Pos (16UL)
  #define USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Msk (0xFFFFUL << USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Pos) /*!< Bit mask of
                                                                            EPINFOBASEADDR field.*/


/* USBHSCORE_GINTMSK2: Interrupt Mask Register 2 */
  #define USBHSCORE_GINTMSK2_ResetValue (0x00000000UL)

/* GINTMSK2 @Bits 0..31 : (unspecified) */
  #define USBHSCORE_GINTMSK2_GINTMSK2_Pos (0UL)
  #define USBHSCORE_GINTMSK2_GINTMSK2_Msk (0xFFFFFFFFUL << USBHSCORE_GINTMSK2_GINTMSK2_Pos)


/* USBHSCORE_GINTSTS2: Interrupt Register 2 */
  #define USBHSCORE_GINTSTS2_ResetValue (0x00000000UL)

/* GINTSTS2 @Bits 0..31 : (unspecified) */
  #define USBHSCORE_GINTSTS2_GINTSTS2_Pos (0UL)
  #define USBHSCORE_GINTSTS2_GINTSTS2_Msk (0xFFFFFFFFUL << USBHSCORE_GINTSTS2_GINTSTS2_Pos)


/* USBHSCORE_HPTXFSIZ: Host Periodic Transmit FIFO Size Register */
  #define USBHSCORE_HPTXFSIZ_ResetValue (0x04000424UL)

/* PTXFSTADDR @Bits 0..10 : Host Periodic TxFIFO Start Address (PTxFStAddr) */
  #define USBHSCORE_HPTXFSIZ_PTXFSTADDR_Pos (0UL)
  #define USBHSCORE_HPTXFSIZ_PTXFSTADDR_Msk (0x7FFUL << USBHSCORE_HPTXFSIZ_PTXFSTADDR_Pos)

/* PTXFSIZE @Bits 16..26 : Host Periodic TxFIFO Depth (PTxFSize) */
  #define USBHSCORE_HPTXFSIZ_PTXFSIZE_Pos (16UL)
  #define USBHSCORE_HPTXFSIZ_PTXFSIZE_Msk (0x7FFUL << USBHSCORE_HPTXFSIZ_PTXFSIZE_Pos)


/* USBHSCORE_DIEPTXF: Device IN Endpoint Transmit FIFO Size Register */
  #define USBHSCORE_DIEPTXF_MaxCount (7UL)
  #define USBHSCORE_DIEPTXF_MaxIndex (7UL)
  #define USBHSCORE_DIEPTXF_MinIndex (1UL)
  #define USBHSCORE_DIEPTXF_ResetValue (0x02000424UL)

/* INEPNTXFSTADDR @Bits 0..10 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF_INEPNTXFSTADDR_Pos (0UL)
  #define USBHSCORE_DIEPTXF_INEPNTXFSTADDR_Msk (0x7FFUL << USBHSCORE_DIEPTXF_INEPNTXFSTADDR_Pos) /*!< Bit mask of INEPNTXFSTADDR
                                                                            field.*/

/* INEPNTXFDEP @Bits 16..25 : IN Endpoint TxFIFO Depth (INEPnTxFDep) */
  #define USBHSCORE_DIEPTXF_INEPNTXFDEP_Pos (16UL)
  #define USBHSCORE_DIEPTXF_INEPNTXFDEP_Msk (0x3FFUL << USBHSCORE_DIEPTXF_INEPNTXFDEP_Pos)


/* USBHSCORE_HCFG: Host Configuration Register */
  #define USBHSCORE_HCFG_ResetValue (0x00000200UL)

/* FSLSPCLKSEL @Bits 0..1 : FS/LS PHY Clock Select (FSLSPclkSel) */
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Pos (0UL)
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Msk (0x3UL << USBHSCORE_HCFG_FSLSPCLKSEL_Pos)
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Min (0x0UL)
  #define USBHSCORE_HCFG_FSLSPCLKSEL_Max (0x2UL)
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK3060 (0x0UL)
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK48 (0x1UL)
  #define USBHSCORE_HCFG_FSLSPCLKSEL_CLK6 (0x2UL)

/* FSLSSUPP @Bit 2 : FS- and LS-Only Support (FSLSSupp) */
  #define USBHSCORE_HCFG_FSLSSUPP_Pos (2UL)
  #define USBHSCORE_HCFG_FSLSSUPP_Msk (0x1UL << USBHSCORE_HCFG_FSLSSUPP_Pos)
  #define USBHSCORE_HCFG_FSLSSUPP_Min (0x0UL)
  #define USBHSCORE_HCFG_FSLSSUPP_Max (0x1UL)
  #define USBHSCORE_HCFG_FSLSSUPP_HSFSLS (0x0UL)     /*!< HS/FS/LS, based on the maximum speed supported by the connected
                                                          device*/
  #define USBHSCORE_HCFG_FSLSSUPP_FSLS (0x1UL)

/* ENA32KHZS @Bit 7 : Enable 32 KHz Suspend mode (Ena32KHzS) */
  #define USBHSCORE_HCFG_ENA32KHZS_Pos (7UL)
  #define USBHSCORE_HCFG_ENA32KHZS_Msk (0x1UL << USBHSCORE_HCFG_ENA32KHZS_Pos)
  #define USBHSCORE_HCFG_ENA32KHZS_Min (0x0UL)
  #define USBHSCORE_HCFG_ENA32KHZS_Max (0x1UL)
  #define USBHSCORE_HCFG_ENA32KHZS_DISABLED (0x0UL)
  #define USBHSCORE_HCFG_ENA32KHZS_ENABLED (0x1UL)

/* RESVALID @Bits 8..15 : Resume Validation Period (ResValid) */
  #define USBHSCORE_HCFG_RESVALID_Pos (8UL)
  #define USBHSCORE_HCFG_RESVALID_Msk (0xFFUL << USBHSCORE_HCFG_RESVALID_Pos)

