pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MODECHTIMEN @Bit 31 : Mode Change Ready Timer Enable (ModeChTimEn) */
  #define USBHSCORE_HCFG_MODECHTIMEN_Pos (31UL)
  #define USBHSCORE_HCFG_MODECHTIMEN_Msk (0x1UL << USBHSCORE_HCFG_MODECHTIMEN_Pos)
  #define USBHSCORE_HCFG_MODECHTIMEN_Min (0x0UL)
  #define USBHSCORE_HCFG_MODECHTIMEN_Max (0x1UL)
  #define USBHSCORE_HCFG_MODECHTIMEN_ENABLED (0x0UL) /*!< The Host core waits for either 200 PHY clock cycles or a linestate of
                                                          SE0 at the end of resume to change the opmode from 0x2 to 0x0*/
  #define USBHSCORE_HCFG_MODECHTIMEN_DISABLED (0x1UL) /*!< The Host core waits only for a linestate of SE0 at the end of resume
                                                           to change the opmode from 0x2 to 0x0*/


/* USBHSCORE_HFIR: Host Frame Interval Register */
  #define USBHSCORE_HFIR_ResetValue (0x0000EA60UL)

/* FRINT @Bits 0..15 : Frame Interval (FrInt) */
  #define USBHSCORE_HFIR_FRINT_Pos (0UL)
  #define USBHSCORE_HFIR_FRINT_Msk (0xFFFFUL << USBHSCORE_HFIR_FRINT_Pos)

/* HFIRRLDCTRL @Bit 16 : Reload Control (HFIRRldCtrl) */
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Pos (16UL)
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Msk (0x1UL << USBHSCORE_HFIR_HFIRRLDCTRL_Pos)
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Min (0x0UL)
  #define USBHSCORE_HFIR_HFIRRLDCTRL_Max (0x1UL)
  #define USBHSCORE_HFIR_HFIRRLDCTRL_DISABLED (0x0UL)
  #define USBHSCORE_HFIR_HFIRRLDCTRL_ENABLED (0x1UL)


/* USBHSCORE_HFNUM: Host Frame Number/Frame Time Remaining Register */
  #define USBHSCORE_HFNUM_ResetValue (0x00003FFFUL)

/* FRNUM @Bits 0..15 : Frame Number (FrNum) */
  #define USBHSCORE_HFNUM_FRNUM_Pos (0UL)
  #define USBHSCORE_HFNUM_FRNUM_Msk (0xFFFFUL << USBHSCORE_HFNUM_FRNUM_Pos)
  #define USBHSCORE_HFNUM_FRNUM_Min (0x0UL)
  #define USBHSCORE_HFNUM_FRNUM_Max (0x1UL)
  #define USBHSCORE_HFNUM_FRNUM_INACTIVE (0x0000UL)
  #define USBHSCORE_HFNUM_FRNUM_ACTIVE (0x0001UL)

/* FRREM @Bits 16..31 : Frame Time Remaining (FrRem) */
  #define USBHSCORE_HFNUM_FRREM_Pos (16UL)
  #define USBHSCORE_HFNUM_FRREM_Msk (0xFFFFUL << USBHSCORE_HFNUM_FRREM_Pos)


/* USBHSCORE_HAINT: Host All Channels Interrupt Register */
  #define USBHSCORE_HAINT_ResetValue (0x00000000UL)

/* HAINT @Bits 0..15 : (unspecified) */
  #define USBHSCORE_HAINT_HAINT_Pos (0UL)
  #define USBHSCORE_HAINT_HAINT_Msk (0xFFFFUL << USBHSCORE_HAINT_HAINT_Pos)
  #define USBHSCORE_HAINT_HAINT_Min (0x0UL)
  #define USBHSCORE_HAINT_HAINT_Max (0x1UL)
  #define USBHSCORE_HAINT_HAINT_INACTIVE (0x0000UL)
  #define USBHSCORE_HAINT_HAINT_ACTIVE (0x0001UL)


/* USBHSCORE_HAINTMSK: Host All Channels Interrupt Mask Register */
  #define USBHSCORE_HAINTMSK_ResetValue (0x00000000UL)

/* HAINTMSK @Bits 0..15 : Channel Interrupt Mask (HAINTMsk) */
  #define USBHSCORE_HAINTMSK_HAINTMSK_Pos (0UL)
  #define USBHSCORE_HAINTMSK_HAINTMSK_Msk (0xFFFFUL << USBHSCORE_HAINTMSK_HAINTMSK_Pos)
  #define USBHSCORE_HAINTMSK_HAINTMSK_Min (0x0UL)
  #define USBHSCORE_HAINTMSK_HAINTMSK_Max (0x1UL)
  #define USBHSCORE_HAINTMSK_HAINTMSK_UNMASK (0x0000UL)
  #define USBHSCORE_HAINTMSK_HAINTMSK_MASK (0x0001UL)


/* USBHSCORE_HPRT: Host Port Control and Status Register */
  #define USBHSCORE_HPRT_ResetValue (0x00000000UL)

/* PRTCONNSTS @Bit 0 : Port Connect Status (PrtConnSts) */
  #define USBHSCORE_HPRT_PRTCONNSTS_Pos (0UL)
  #define USBHSCORE_HPRT_PRTCONNSTS_Msk (0x1UL << USBHSCORE_HPRT_PRTCONNSTS_Pos)
  #define USBHSCORE_HPRT_PRTCONNSTS_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTCONNSTS_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTCONNSTS_NOTATTACHED (0x0UL)
  #define USBHSCORE_HPRT_PRTCONNSTS_ATTACHED (0x1UL)

/* PRTCONNDET @Bit 1 : Port Connect Detected (PrtConnDet) */
  #define USBHSCORE_HPRT_PRTCONNDET_Pos (1UL)
  #define USBHSCORE_HPRT_PRTCONNDET_Msk (0x1UL << USBHSCORE_HPRT_PRTCONNDET_Pos)
  #define USBHSCORE_HPRT_PRTCONNDET_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTCONNDET_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTCONNDET_INACTIVE (0x0UL)
  #define USBHSCORE_HPRT_PRTCONNDET_ACTIVE (0x1UL)

/* PRTENA @Bit 2 : Port Enable (PrtEna) */
  #define USBHSCORE_HPRT_PRTENA_Pos (2UL)
  #define USBHSCORE_HPRT_PRTENA_Msk (0x1UL << USBHSCORE_HPRT_PRTENA_Pos)
  #define USBHSCORE_HPRT_PRTENA_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTENA_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTENA_DISABLED (0x0UL)
  #define USBHSCORE_HPRT_PRTENA_ENABLED (0x1UL)

/* PRTENCHNG @Bit 3 : Port Enable/Disable Change (PrtEnChng) */
  #define USBHSCORE_HPRT_PRTENCHNG_Pos (3UL)
  #define USBHSCORE_HPRT_PRTENCHNG_Msk (0x1UL << USBHSCORE_HPRT_PRTENCHNG_Pos)
  #define USBHSCORE_HPRT_PRTENCHNG_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTENCHNG_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTENCHNG_INACTIVE (0x0UL)
  #define USBHSCORE_HPRT_PRTENCHNG_ACTIVE (0x1UL)

/* PRTOVRCURRACT @Bit 4 : Port Overcurrent Active (PrtOvrCurrAct) */
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Pos (4UL)
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Msk (0x1UL << USBHSCORE_HPRT_PRTOVRCURRACT_Pos)
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTOVRCURRACT_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTOVRCURRACT_INACTIVE (0x0UL)
  #define USBHSCORE_HPRT_PRTOVRCURRACT_ACTIVE (0x1UL)

/* PRTOVRCURRCHNG @Bit 5 : Port Overcurrent Change (PrtOvrCurrChng) */
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Pos (5UL)
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Msk (0x1UL << USBHSCORE_HPRT_PRTOVRCURRCHNG_Pos)
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_INACTIVE (0x0UL)
  #define USBHSCORE_HPRT_PRTOVRCURRCHNG_ACTIVE (0x1UL)

/* PRTRES @Bit 6 : Port Resume (PrtRes) */
  #define USBHSCORE_HPRT_PRTRES_Pos (6UL)
  #define USBHSCORE_HPRT_PRTRES_Msk (0x1UL << USBHSCORE_HPRT_PRTRES_Pos)
  #define USBHSCORE_HPRT_PRTRES_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTRES_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTRES_NORESUME (0x0UL)
  #define USBHSCORE_HPRT_PRTRES_RESUME (0x1UL)

/* PRTSUSP @Bit 7 : Port Suspend (PrtSusp) */
  #define USBHSCORE_HPRT_PRTSUSP_Pos (7UL)
  #define USBHSCORE_HPRT_PRTSUSP_Msk (0x1UL << USBHSCORE_HPRT_PRTSUSP_Pos)
  #define USBHSCORE_HPRT_PRTSUSP_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTSUSP_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTSUSP_INACTIVE (0x0UL)
  #define USBHSCORE_HPRT_PRTSUSP_ACTIVE (0x1UL)

/* PRTRST @Bit 8 : Port Reset (PrtRst) */
  #define USBHSCORE_HPRT_PRTRST_Pos (8UL)
  #define USBHSCORE_HPRT_PRTRST_Msk (0x1UL << USBHSCORE_HPRT_PRTRST_Pos)
  #define USBHSCORE_HPRT_PRTRST_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTRST_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTRST_DISABLED (0x0UL)
  #define USBHSCORE_HPRT_PRTRST_ENABLED (0x1UL)

/* PRTLNSTS @Bits 10..11 : Port Line Status (PrtLnSts) */
  #define USBHSCORE_HPRT_PRTLNSTS_Pos (10UL)
  #define USBHSCORE_HPRT_PRTLNSTS_Msk (0x3UL << USBHSCORE_HPRT_PRTLNSTS_Pos)
  #define USBHSCORE_HPRT_PRTLNSTS_Min (0x1UL)
  #define USBHSCORE_HPRT_PRTLNSTS_Max (0x2UL)
  #define USBHSCORE_HPRT_PRTLNSTS_PLUSD (0x1UL)
  #define USBHSCORE_HPRT_PRTLNSTS_MINUSD (0x2UL)

