pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PRTPWR @Bit 12 : Port Power (PrtPwr) */
  #define USBHSCORE_HPRT_PRTPWR_Pos (12UL)
  #define USBHSCORE_HPRT_PRTPWR_Msk (0x1UL << USBHSCORE_HPRT_PRTPWR_Pos)
  #define USBHSCORE_HPRT_PRTPWR_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTPWR_Max (0x1UL)
  #define USBHSCORE_HPRT_PRTPWR_OFF (0x0UL)
  #define USBHSCORE_HPRT_PRTPWR_ON (0x1UL)

/* PRTTSTCTL @Bits 13..16 : Port Test Control (PrtTstCtl) */
  #define USBHSCORE_HPRT_PRTTSTCTL_Pos (13UL)
  #define USBHSCORE_HPRT_PRTTSTCTL_Msk (0xFUL << USBHSCORE_HPRT_PRTTSTCTL_Pos)
  #define USBHSCORE_HPRT_PRTTSTCTL_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTTSTCTL_Max (0x5UL)
  #define USBHSCORE_HPRT_PRTTSTCTL_DISABLED (0x0UL)
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTJ (0x1UL)
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTK (0x2UL)
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTSN (0x3UL)
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTPM (0x4UL)
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTFENB (0x5UL)

/* PRTSPD @Bits 17..18 : Port Speed (PrtSpd) */
  #define USBHSCORE_HPRT_PRTSPD_Pos (17UL)
  #define USBHSCORE_HPRT_PRTSPD_Msk (0x3UL << USBHSCORE_HPRT_PRTSPD_Pos)
  #define USBHSCORE_HPRT_PRTSPD_Min (0x0UL)
  #define USBHSCORE_HPRT_PRTSPD_Max (0x2UL)
  #define USBHSCORE_HPRT_PRTSPD_HIGHSPD (0x0UL)
  #define USBHSCORE_HPRT_PRTSPD_FULLSPD (0x1UL)
  #define USBHSCORE_HPRT_PRTSPD_LOWSPD (0x2UL)


/* USBHSCORE_DCFG: Device Configuration Register */
  #define USBHSCORE_DCFG_ResetValue (0x08020000UL)

/* DEVSPD @Bits 0..1 : Device Speed (DevSpd) */
  #define USBHSCORE_DCFG_DEVSPD_Pos (0UL)
  #define USBHSCORE_DCFG_DEVSPD_Msk (0x3UL << USBHSCORE_DCFG_DEVSPD_Pos)
  #define USBHSCORE_DCFG_DEVSPD_Min (0x0UL)
  #define USBHSCORE_DCFG_DEVSPD_Max (0x3UL)
  #define USBHSCORE_DCFG_DEVSPD_USBHS20 (0x0UL)
  #define USBHSCORE_DCFG_DEVSPD_USBFS20 (0x1UL)
  #define USBHSCORE_DCFG_DEVSPD_USBLS116 (0x2UL)
  #define USBHSCORE_DCFG_DEVSPD_USBFS1148 (0x3UL)

/* NZSTSOUTHSHK @Bit 2 : Non-Zero-Length Status OUT Handshake (NZStsOUTHShk) */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Pos (2UL)
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Msk (0x1UL << USBHSCORE_DCFG_NZSTSOUTHSHK_Pos)
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Min (0x0UL)
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Max (0x1UL)
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_SENDOUT (0x0UL) /*!< Send the received OUT packet to the application (zero-length or
                                                           non-zero length) and send a handshake based on NAK and STALL bits for
                                                           the endpoint in the Devce Endpoint Control Register*/
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_SENDSTALL (0x1UL) /*!< Send a STALL handshake on a nonzero-length status OUT transaction
                                                             and do not send the received OUT packet to the application*/

/* ENA32KHZSUSP @Bit 3 : Enable 32 KHz Suspend mode (Ena32KHzSusp) */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Pos (3UL)
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Msk (0x1UL << USBHSCORE_DCFG_ENA32KHZSUSP_Pos)
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Min (0x0UL)
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Max (0x1UL)
  #define USBHSCORE_DCFG_ENA32KHZSUSP_DISABLED (0x0UL)
  #define USBHSCORE_DCFG_ENA32KHZSUSP_ENABLED (0x1UL)

/* DEVADDR @Bits 4..10 : Device Address (DevAddr) */
  #define USBHSCORE_DCFG_DEVADDR_Pos (4UL)
  #define USBHSCORE_DCFG_DEVADDR_Msk (0x7FUL << USBHSCORE_DCFG_DEVADDR_Pos)

/* PERFRINT @Bits 11..12 : Periodic Frame Interval (PerFrInt) */
  #define USBHSCORE_DCFG_PERFRINT_Pos (11UL)
  #define USBHSCORE_DCFG_PERFRINT_Msk (0x3UL << USBHSCORE_DCFG_PERFRINT_Pos)
  #define USBHSCORE_DCFG_PERFRINT_Min (0x0UL)
  #define USBHSCORE_DCFG_PERFRINT_Max (0x3UL)
  #define USBHSCORE_DCFG_PERFRINT_EOPF80 (0x0UL)
  #define USBHSCORE_DCFG_PERFRINT_EOPF85 (0x1UL)
  #define USBHSCORE_DCFG_PERFRINT_EOPF90 (0x2UL)
  #define USBHSCORE_DCFG_PERFRINT_EOPF95 (0x3UL)

/* XCVRDLY @Bit 14 : XCVRDLY */
  #define USBHSCORE_DCFG_XCVRDLY_Pos (14UL)
  #define USBHSCORE_DCFG_XCVRDLY_Msk (0x1UL << USBHSCORE_DCFG_XCVRDLY_Pos)
  #define USBHSCORE_DCFG_XCVRDLY_Min (0x0UL)
  #define USBHSCORE_DCFG_XCVRDLY_Max (0x1UL)
  #define USBHSCORE_DCFG_XCVRDLY_DISABLE (0x0UL)
  #define USBHSCORE_DCFG_XCVRDLY_ENABLE (0x1UL)

/* ERRATICINTMSK @Bit 15 : Erratic Error Interrupt Mask */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Pos (15UL)
  #define USBHSCORE_DCFG_ERRATICINTMSK_Msk (0x1UL << USBHSCORE_DCFG_ERRATICINTMSK_Pos)
  #define USBHSCORE_DCFG_ERRATICINTMSK_Min (0x0UL)
  #define USBHSCORE_DCFG_ERRATICINTMSK_Max (0x1UL)
  #define USBHSCORE_DCFG_ERRATICINTMSK_NOMASK (0x0UL)
  #define USBHSCORE_DCFG_ERRATICINTMSK_MASK (0x1UL)

/* IPGISOCSUPT @Bit 17 : Worst-Case Inter-Packet Gap ISOC OUT Support (ipgisocSupt) */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Pos (17UL)
  #define USBHSCORE_DCFG_IPGISOCSUPT_Msk (0x1UL << USBHSCORE_DCFG_IPGISOCSUPT_Pos)
  #define USBHSCORE_DCFG_IPGISOCSUPT_Min (0x0UL)
  #define USBHSCORE_DCFG_IPGISOCSUPT_Max (0x1UL)
  #define USBHSCORE_DCFG_IPGISOCSUPT_DISABLED (0x0UL)
  #define USBHSCORE_DCFG_IPGISOCSUPT_ENABLED (0x1UL)

/* PERSCHINTVL @Bits 24..25 : Periodic Scheduling Interval (PerSchIntvl) */
  #define USBHSCORE_DCFG_PERSCHINTVL_Pos (24UL)
  #define USBHSCORE_DCFG_PERSCHINTVL_Msk (0x3UL << USBHSCORE_DCFG_PERSCHINTVL_Pos)
  #define USBHSCORE_DCFG_PERSCHINTVL_Min (0x0UL)
  #define USBHSCORE_DCFG_PERSCHINTVL_Max (0x2UL)
  #define USBHSCORE_DCFG_PERSCHINTVL_MF25 (0x0UL)
  #define USBHSCORE_DCFG_PERSCHINTVL_MF50 (0x1UL)
  #define USBHSCORE_DCFG_PERSCHINTVL_MF75 (0x2UL)

/* RESVALID @Bits 26..31 : Resume Validation Period (ResValid) */
  #define USBHSCORE_DCFG_RESVALID_Pos (26UL)
  #define USBHSCORE_DCFG_RESVALID_Msk (0x3FUL << USBHSCORE_DCFG_RESVALID_Pos)


/* USBHSCORE_DCTL: Device Control Register */
  #define USBHSCORE_DCTL_ResetValue (0x00000002UL)

/* RMTWKUPSIG @Bit 0 : Remote Wakeup Signaling (RmtWkUpSig) */
  #define USBHSCORE_DCTL_RMTWKUPSIG_Pos (0UL)
  #define USBHSCORE_DCTL_RMTWKUPSIG_Msk (0x1UL << USBHSCORE_DCTL_RMTWKUPSIG_Pos)
  #define USBHSCORE_DCTL_RMTWKUPSIG_Min (0x0UL)
  #define USBHSCORE_DCTL_RMTWKUPSIG_Max (0x1UL)
  #define USBHSCORE_DCTL_RMTWKUPSIG_DISABLEDRMWKUP (0x0UL)
  #define USBHSCORE_DCTL_RMTWKUPSIG_ENABLERMWKUP (0x1UL)

/* SFTDISCON @Bit 1 : Soft Disconnect (SftDiscon) */
  #define USBHSCORE_DCTL_SFTDISCON_Pos (1UL)
  #define USBHSCORE_DCTL_SFTDISCON_Msk (0x1UL << USBHSCORE_DCTL_SFTDISCON_Pos)
  #define USBHSCORE_DCTL_SFTDISCON_Min (0x0UL)
  #define USBHSCORE_DCTL_SFTDISCON_Max (0x1UL)
  #define USBHSCORE_DCTL_SFTDISCON_NODISCONNECT (0x0UL) /*!< The core drives the phy_opmode_o signal on the UTMI+ to 2'b00,
                                                             which generates a device connect event to the USB host*/
  #define USBHSCORE_DCTL_SFTDISCON_DISCONNECT (0x1UL) /*!< The core drives the phy_opmode_o signal on the UTMI+ to 2'b01, which
                                                           generates a device disconnect event to the USB host*/

/* GNPINNAKSTS @Bit 2 : Global Non-periodic IN NAK Status (GNPINNakSts) */
  #define USBHSCORE_DCTL_GNPINNAKSTS_Pos (2UL)
  #define USBHSCORE_DCTL_GNPINNAKSTS_Msk (0x1UL << USBHSCORE_DCTL_GNPINNAKSTS_Pos)
  #define USBHSCORE_DCTL_GNPINNAKSTS_Min (0x0UL)
  #define USBHSCORE_DCTL_GNPINNAKSTS_Max (0x1UL)
  #define USBHSCORE_DCTL_GNPINNAKSTS_INACTIVE (0x0UL) /*!< A handshake is sent out based on the data availability in the
                                                           transmit FIFO*/
  #define USBHSCORE_DCTL_GNPINNAKSTS_ACTIVE (0x1UL)  /*!< A NAK handshake is sent out on all non-periodic IN endpoints,
                                                          irrespective of the data availability in the transmit FIFO.*/

/* GOUTNAKSTS @Bit 3 : Global OUT NAK Status (GOUTNakSts) */
  #define USBHSCORE_DCTL_GOUTNAKSTS_Pos (3UL)
  #define USBHSCORE_DCTL_GOUTNAKSTS_Msk (0x1UL << USBHSCORE_DCTL_GOUTNAKSTS_Pos)
  #define USBHSCORE_DCTL_GOUTNAKSTS_Min (0x0UL)
  #define USBHSCORE_DCTL_GOUTNAKSTS_Max (0x1UL)
  #define USBHSCORE_DCTL_GOUTNAKSTS_INACTIVE (0x0UL) /*!< A handshake is sent based on the FIFO Status and the NAK and STALL bit
                                                          settings.*/
  #define USBHSCORE_DCTL_GOUTNAKSTS_ACTIVE (0x1UL)   /*!< No data is written to the RxFIFO, irrespective of space availability.
                                                          Sends a NAK handshake on all packets, except on SETUP transactions.
                                                          All isochronous OUT packets are dropped.*/

