pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TSTCTL @Bits 4..6 : Test Control (TstCtl) */
  #define USBHSCORE_DCTL_TSTCTL_Pos (4UL)
  #define USBHSCORE_DCTL_TSTCTL_Msk (0x7UL << USBHSCORE_DCTL_TSTCTL_Pos)
  #define USBHSCORE_DCTL_TSTCTL_Min (0x0UL)
  #define USBHSCORE_DCTL_TSTCTL_Max (0x5UL)
  #define USBHSCORE_DCTL_TSTCTL_DISABLED (0x0UL)
  #define USBHSCORE_DCTL_TSTCTL_TESTJ (0x1UL)
  #define USBHSCORE_DCTL_TSTCTL_TESTK (0x2UL)
  #define USBHSCORE_DCTL_TSTCTL_TESTSN (0x3UL)
  #define USBHSCORE_DCTL_TSTCTL_TESTPM (0x4UL)
  #define USBHSCORE_DCTL_TSTCTL_TESTFE (0x5UL)

/* SGNPINNAK @Bit 7 : Set Global Non-periodic IN NAK (SGNPInNak) */
  #define USBHSCORE_DCTL_SGNPINNAK_Pos (7UL)
  #define USBHSCORE_DCTL_SGNPINNAK_Msk (0x1UL << USBHSCORE_DCTL_SGNPINNAK_Pos)
  #define USBHSCORE_DCTL_SGNPINNAK_Min (0x0UL)
  #define USBHSCORE_DCTL_SGNPINNAK_Max (0x1UL)
  #define USBHSCORE_DCTL_SGNPINNAK_DISABLE (0x0UL)
  #define USBHSCORE_DCTL_SGNPINNAK_ENABLE (0x1UL)

/* CGNPINNAK @Bit 8 : Clear Global Non-periodic IN NAK (CGNPInNak) */
  #define USBHSCORE_DCTL_CGNPINNAK_Pos (8UL)
  #define USBHSCORE_DCTL_CGNPINNAK_Msk (0x1UL << USBHSCORE_DCTL_CGNPINNAK_Pos)
  #define USBHSCORE_DCTL_CGNPINNAK_Min (0x0UL)
  #define USBHSCORE_DCTL_CGNPINNAK_Max (0x1UL)
  #define USBHSCORE_DCTL_CGNPINNAK_DISABLE (0x0UL)
  #define USBHSCORE_DCTL_CGNPINNAK_ENABLE (0x1UL)

/* SGOUTNAK @Bit 9 : Set Global OUT NAK (SGOUTNak) */
  #define USBHSCORE_DCTL_SGOUTNAK_Pos (9UL)
  #define USBHSCORE_DCTL_SGOUTNAK_Msk (0x1UL << USBHSCORE_DCTL_SGOUTNAK_Pos)
  #define USBHSCORE_DCTL_SGOUTNAK_Min (0x0UL)
  #define USBHSCORE_DCTL_SGOUTNAK_Max (0x1UL)
  #define USBHSCORE_DCTL_SGOUTNAK_DISABLED (0x0UL)
  #define USBHSCORE_DCTL_SGOUTNAK_ENABLED (0x1UL)

/* CGOUTNAK @Bit 10 : Clear Global OUT NAK (CGOUTNak) */
  #define USBHSCORE_DCTL_CGOUTNAK_Pos (10UL)
  #define USBHSCORE_DCTL_CGOUTNAK_Msk (0x1UL << USBHSCORE_DCTL_CGOUTNAK_Pos)
  #define USBHSCORE_DCTL_CGOUTNAK_Min (0x0UL)
  #define USBHSCORE_DCTL_CGOUTNAK_Max (0x1UL)
  #define USBHSCORE_DCTL_CGOUTNAK_DISABLED (0x0UL)
  #define USBHSCORE_DCTL_CGOUTNAK_ENABLED (0x1UL)

/* PWRONPRGDONE @Bit 11 : Power-On Programming Done (PWROnPrgDone) */
  #define USBHSCORE_DCTL_PWRONPRGDONE_Pos (11UL)
  #define USBHSCORE_DCTL_PWRONPRGDONE_Msk (0x1UL << USBHSCORE_DCTL_PWRONPRGDONE_Pos)
  #define USBHSCORE_DCTL_PWRONPRGDONE_Min (0x0UL)
  #define USBHSCORE_DCTL_PWRONPRGDONE_Max (0x1UL)
  #define USBHSCORE_DCTL_PWRONPRGDONE_NOTDONE (0x0UL)
  #define USBHSCORE_DCTL_PWRONPRGDONE_DONE (0x1UL)

/* IGNRFRMNUM @Bit 15 : Ignore Frame Number Feature for Isochronous Endpoints (IgnrFrmNum) */
  #define USBHSCORE_DCTL_IGNRFRMNUM_Pos (15UL)
  #define USBHSCORE_DCTL_IGNRFRMNUM_Msk (0x1UL << USBHSCORE_DCTL_IGNRFRMNUM_Pos)
  #define USBHSCORE_DCTL_IGNRFRMNUM_Min (0x0UL)
  #define USBHSCORE_DCTL_IGNRFRMNUM_Max (0x1UL)
  #define USBHSCORE_DCTL_IGNRFRMNUM_DISABLED (0x0UL) /*!< Scatter/Gather DMA Mode: The core transmits the packets only in the
                                                          frame number in which they are intended to be
                                                          transmitted.Non-Scatter/Gather DMA Mode: Periodic Transfer Interrupt
                                                          feature is disabled.*/
  #define USBHSCORE_DCTL_IGNRFRMNUM_ENABLED (0x1UL)  /*!< Scatter/Gather DMA Mode: The core ignores the frame number, sending
                                                          packets immediately as the packets are ready.Non-Scatter/Gather DMA
                                                          Mode: Periodic Transfer Interrupt feature is enabled.*/

/* NAKONBBLE @Bit 16 : NAK on Babble Error (NakOnBble) */
  #define USBHSCORE_DCTL_NAKONBBLE_Pos (16UL)
  #define USBHSCORE_DCTL_NAKONBBLE_Msk (0x1UL << USBHSCORE_DCTL_NAKONBBLE_Pos)
  #define USBHSCORE_DCTL_NAKONBBLE_Min (0x0UL)
  #define USBHSCORE_DCTL_NAKONBBLE_Max (0x1UL)
  #define USBHSCORE_DCTL_NAKONBBLE_DISABLED (0x0UL)
  #define USBHSCORE_DCTL_NAKONBBLE_ENABLED (0x1UL)

/* DEEPSLEEPBESLREJECT @Bit 18 : DeepSleepBESLReject */
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Pos (18UL)
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Msk (0x1UL << USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Pos) /*!< Bit mask of
                                                                            DEEPSLEEPBESLREJECT field.*/
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Min (0x0UL)
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_Max (0x1UL)
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_DISABLED (0x0UL)
  #define USBHSCORE_DCTL_DEEPSLEEPBESLREJECT_ENABLED (0x1UL)

/* SERVINT @Bit 19 : Service Interval based scheduling for Isochronous IN Endpoints */
  #define USBHSCORE_DCTL_SERVINT_Pos (19UL)
  #define USBHSCORE_DCTL_SERVINT_Msk (0x1UL << USBHSCORE_DCTL_SERVINT_Pos)
  #define USBHSCORE_DCTL_SERVINT_Min (0x0UL)
  #define USBHSCORE_DCTL_SERVINT_Max (0x1UL)
  #define USBHSCORE_DCTL_SERVINT_DISABLED (0x0UL)
  #define USBHSCORE_DCTL_SERVINT_ENABLED (0x1UL)     /*!< Scatter/Gather DMA Mode: The controller can transmit the packets in
                                                          any frame of the service interval.*/

/* UTMITXVLDCORRDIS @Bit 30 : Disable the correction to OpMode/XcvrSel/TermSel on UTMI Interface. */
  #define USBHSCORE_DCTL_UTMITXVLDCORRDIS_Pos (30UL)
  #define USBHSCORE_DCTL_UTMITXVLDCORRDIS_Msk (0x1UL << USBHSCORE_DCTL_UTMITXVLDCORRDIS_Pos) /*!< Bit mask of UTMITXVLDCORRDIS
                                                                            field.*/
  #define USBHSCORE_DCTL_UTMITXVLDCORRDIS_Min (0x0UL)
  #define USBHSCORE_DCTL_UTMITXVLDCORRDIS_Max (0x1UL)
  #define USBHSCORE_DCTL_UTMITXVLDCORRDIS_DISABLED (0x0UL) /*!< Opmode, XcvrSel, TermSel are changed by the Device Controller
                                                                after TxValid goes LOW (1'b0)on soft disconnect.*/
  #define USBHSCORE_DCTL_UTMITXVLDCORRDIS_ENABLED (0x1UL) /*!< Opmode, XcvrSel, TermSel are changed by the Device Controller
                                                               immediately on soft disconnect.*/

/* UTMITERMSELCORRDIS @Bit 31 : Disable the correction of TermSel on UTMI Interface. */
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_Pos (31UL)
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_Msk (0x1UL << USBHSCORE_DCTL_UTMITERMSELCORRDIS_Pos) /*!< Bit mask of
                                                                            UTMITERMSELCORRDIS field.*/
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_Min (0x0UL)
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_Max (0x1UL)
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_DISABLED (0x0UL) /*!< Valid Combination of XcvrSel and TermSel is driven by the
                                                                  Device Controller.*/
  #define USBHSCORE_DCTL_UTMITERMSELCORRDIS_ENABLED (0x1UL) /*!< Invalid Combination of XcvrSel and TermSel is driven by the
                                                                 Device Controller.*/


/* USBHSCORE_DSTS: Device Status Register */
  #define USBHSCORE_DSTS_ResetValue (0x00000002UL)

/* SUSPSTS @Bit 0 : Suspend Status (SuspSts) */
  #define USBHSCORE_DSTS_SUSPSTS_Pos (0UL)
  #define USBHSCORE_DSTS_SUSPSTS_Msk (0x1UL << USBHSCORE_DSTS_SUSPSTS_Pos)
  #define USBHSCORE_DSTS_SUSPSTS_Min (0x0UL)
  #define USBHSCORE_DSTS_SUSPSTS_Max (0x1UL)
  #define USBHSCORE_DSTS_SUSPSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DSTS_SUSPSTS_ACTIVE (0x1UL)

/* ENUMSPD @Bits 1..2 : Enumerated Speed (EnumSpd) */
  #define USBHSCORE_DSTS_ENUMSPD_Pos (1UL)
  #define USBHSCORE_DSTS_ENUMSPD_Msk (0x3UL << USBHSCORE_DSTS_ENUMSPD_Pos)
  #define USBHSCORE_DSTS_ENUMSPD_Min (0x0UL)
  #define USBHSCORE_DSTS_ENUMSPD_Max (0x3UL)
  #define USBHSCORE_DSTS_ENUMSPD_HS3060 (0x0UL)
  #define USBHSCORE_DSTS_ENUMSPD_FS3060 (0x1UL)
  #define USBHSCORE_DSTS_ENUMSPD_LS6 (0x2UL)
  #define USBHSCORE_DSTS_ENUMSPD_FS48 (0x3UL)

/* ERRTICERR @Bit 3 : Erratic Error (ErrticErr) */
  #define USBHSCORE_DSTS_ERRTICERR_Pos (3UL)
  #define USBHSCORE_DSTS_ERRTICERR_Msk (0x1UL << USBHSCORE_DSTS_ERRTICERR_Pos)
  #define USBHSCORE_DSTS_ERRTICERR_Min (0x0UL)
  #define USBHSCORE_DSTS_ERRTICERR_Max (0x1UL)
  #define USBHSCORE_DSTS_ERRTICERR_INACTIVE (0x0UL)
  #define USBHSCORE_DSTS_ERRTICERR_ACTIVE (0x1UL)

/* SOFFN @Bits 8..21 : Frame or Microframe Number of the Received SOF (SOFFN) */
  #define USBHSCORE_DSTS_SOFFN_Pos (8UL)
  #define USBHSCORE_DSTS_SOFFN_Msk (0x3FFFUL << USBHSCORE_DSTS_SOFFN_Pos)

/* DEVLNSTS @Bits 22..23 : Device Line Status (DevLnSts) */
  #define USBHSCORE_DSTS_DEVLNSTS_Pos (22UL)
  #define USBHSCORE_DSTS_DEVLNSTS_Msk (0x3UL << USBHSCORE_DSTS_DEVLNSTS_Pos)


/* USBHSCORE_DIEPMSK: Device IN Endpoint Common Interrupt Mask Register */
  #define USBHSCORE_DIEPMSK_ResetValue (0x00000000UL)

/* XFERCOMPLMSK @Bit 0 : Transfer Completed Interrupt Mask (XferComplMsk) */
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_Pos (0UL)
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_XFERCOMPLMSK_Pos)
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_XFERCOMPLMSK_NOMASK (0x1UL)

