pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EPDISBLDMSK @Bit 1 : Endpoint Disabled Interrupt Mask (EPDisbldMsk) */
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_Pos (1UL)
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_EPDISBLDMSK_Pos)
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_NOMASK (0x1UL)

/* AHBERRMSK @Bit 2 : AHB Error Mask (AHBErrMsk) */
  #define USBHSCORE_DIEPMSK_AHBERRMSK_Pos (2UL)
  #define USBHSCORE_DIEPMSK_AHBERRMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_AHBERRMSK_Pos)
  #define USBHSCORE_DIEPMSK_AHBERRMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_AHBERRMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_AHBERRMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_AHBERRMSK_NOMASK (0x1UL)

/* TIMEOUTMSK @Bit 3 : Timeout Condition Mask (TimeOUTMsk) (Non-isochronous endpoints) */
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_Pos (3UL)
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_TIMEOUTMSK_Pos)
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_NOMASK (0x1UL)

/* INTKNTXFEMPMSK @Bit 4 : IN Token Received When TxFIFO Empty Mask (INTknTXFEmpMsk) */
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Pos (4UL)
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Pos) /*!< Bit mask of INTKNTXFEMPMSK
                                                                            field.*/
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_NOMASK (0x1UL)

/* INTKNEPMISMSK @Bit 5 : IN Token received with EP Mismatch Mask (INTknEPMisMsk) */
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_Pos (5UL)
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_INTKNEPMISMSK_Pos) /*!< Bit mask of INTKNEPMISMSK
                                                                            field.*/
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_NOMASK (0x1UL)

/* INEPNAKEFFMSK @Bit 6 : IN Endpoint NAK Effective Mask (INEPNakEffMsk) */
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Pos (6UL)
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Pos) /*!< Bit mask of INEPNAKEFFMSK
                                                                            field.*/
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_NOMASK (0x1UL)

/* TXFIFOUNDRNMSK @Bit 8 : Fifo Underrun Mask (TxfifoUndrnMsk) */
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Pos (8UL)
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Pos) /*!< Bit mask of TXFIFOUNDRNMSK
                                                                            field.*/
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_NOMASK (0x1UL)

/* NAKMSK @Bit 13 : NAK interrupt Mask (NAKMsk) */
  #define USBHSCORE_DIEPMSK_NAKMSK_Pos (13UL)
  #define USBHSCORE_DIEPMSK_NAKMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_NAKMSK_Pos)
  #define USBHSCORE_DIEPMSK_NAKMSK_Min (0x0UL)
  #define USBHSCORE_DIEPMSK_NAKMSK_Max (0x1UL)
  #define USBHSCORE_DIEPMSK_NAKMSK_MASK (0x0UL)
  #define USBHSCORE_DIEPMSK_NAKMSK_NOMASK (0x1UL)


/* USBHSCORE_DOEPMSK: Device OUT Endpoint Common Interrupt Mask Register */
  #define USBHSCORE_DOEPMSK_ResetValue (0x00000000UL)

/* XFERCOMPLMSK @Bit 0 : Transfer Completed Interrupt Mask (XferComplMsk) */
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_Pos (0UL)
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_XFERCOMPLMSK_Pos)
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_XFERCOMPLMSK_NOMASK (0x1UL)

/* EPDISBLDMSK @Bit 1 : Endpoint Disabled Interrupt Mask (EPDisbldMsk) */
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_Pos (1UL)
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_EPDISBLDMSK_Pos)
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_EPDISBLDMSK_NOMASK (0x1UL)

/* AHBERRMSK @Bit 2 : AHB Error (AHBErrMsk) */
  #define USBHSCORE_DOEPMSK_AHBERRMSK_Pos (2UL)
  #define USBHSCORE_DOEPMSK_AHBERRMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_AHBERRMSK_Pos)
  #define USBHSCORE_DOEPMSK_AHBERRMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_AHBERRMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_AHBERRMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_AHBERRMSK_NOMASK (0x1UL)

/* SETUPMSK @Bit 3 : SETUP Phase Done Mask (SetUPMsk) */
  #define USBHSCORE_DOEPMSK_SETUPMSK_Pos (3UL)
  #define USBHSCORE_DOEPMSK_SETUPMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_SETUPMSK_Pos)
  #define USBHSCORE_DOEPMSK_SETUPMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_SETUPMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_SETUPMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_SETUPMSK_NOMASK (0x1UL)

/* OUTTKNEPDISMSK @Bit 4 : OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk) */
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Pos (4UL)
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Pos) /*!< Bit mask of OUTTKNEPDISMSK
                                                                            field.*/
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_OUTTKNEPDISMSK_NOMASK (0x1UL)

/* STSPHSERCVDMSK @Bit 5 : Status Phase Received Mask (StsPhseRcvdMsk) */
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Pos (5UL)
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Pos) /*!< Bit mask of STSPHSERCVDMSK
                                                                            field.*/
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_STSPHSERCVDMSK_NOMASK (0x1UL)

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received Mask (Back2BackSETup) */
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_Pos (6UL)
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPMSK_BACK2BACKSETUP_Pos) /*!< Bit mask of BACK2BACKSETUP
                                                                            field.*/
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_BACK2BACKSETUP_NOMASK (0x1UL)

/* OUTPKTERRMSK @Bit 8 : OUT Packet Error Mask (OutPktErrMsk) */
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_Pos (8UL)
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_OUTPKTERRMSK_Pos)
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_OUTPKTERRMSK_NOMASK (0x1UL)

/* BBLEERRMSK @Bit 12 : Babble Error interrupt Mask (BbleErrMsk) */
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_Pos (12UL)
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_BBLEERRMSK_Pos)
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_BBLEERRMSK_NOMASK (0x1UL)

