pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* NAKMSK @Bit 13 : NAK interrupt Mask (NAKMsk) */
  #define USBHSCORE_DOEPMSK_NAKMSK_Pos (13UL)
  #define USBHSCORE_DOEPMSK_NAKMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_NAKMSK_Pos)
  #define USBHSCORE_DOEPMSK_NAKMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_NAKMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_NAKMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_NAKMSK_NOMASK (0x1UL)

/* NYETMSK @Bit 14 : NYET interrupt Mask (NYETMsk) */
  #define USBHSCORE_DOEPMSK_NYETMSK_Pos (14UL)
  #define USBHSCORE_DOEPMSK_NYETMSK_Msk (0x1UL << USBHSCORE_DOEPMSK_NYETMSK_Pos)
  #define USBHSCORE_DOEPMSK_NYETMSK_Min (0x0UL)
  #define USBHSCORE_DOEPMSK_NYETMSK_Max (0x1UL)
  #define USBHSCORE_DOEPMSK_NYETMSK_MASK (0x0UL)
  #define USBHSCORE_DOEPMSK_NYETMSK_NOMASK (0x1UL)


/* USBHSCORE_DAINT: Device All Endpoints Interrupt Register */
  #define USBHSCORE_DAINT_ResetValue (0x00000000UL)

/* INEPINT0 @Bit 0 : IN Endpoint 0 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT0_Pos (0UL)
  #define USBHSCORE_DAINT_INEPINT0_Msk (0x1UL << USBHSCORE_DAINT_INEPINT0_Pos)
  #define USBHSCORE_DAINT_INEPINT0_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT0_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT0_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT0_ACTIVE (0x1UL)

/* INEPINT1 @Bit 1 : IN Endpoint 1 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT1_Pos (1UL)
  #define USBHSCORE_DAINT_INEPINT1_Msk (0x1UL << USBHSCORE_DAINT_INEPINT1_Pos)
  #define USBHSCORE_DAINT_INEPINT1_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT1_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT1_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT1_ACTIVE (0x1UL)

/* INEPINT2 @Bit 2 : IN Endpoint 2 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT2_Pos (2UL)
  #define USBHSCORE_DAINT_INEPINT2_Msk (0x1UL << USBHSCORE_DAINT_INEPINT2_Pos)
  #define USBHSCORE_DAINT_INEPINT2_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT2_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT2_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT2_ACTIVE (0x1UL)

/* INEPINT3 @Bit 3 : IN Endpoint 3 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT3_Pos (3UL)
  #define USBHSCORE_DAINT_INEPINT3_Msk (0x1UL << USBHSCORE_DAINT_INEPINT3_Pos)
  #define USBHSCORE_DAINT_INEPINT3_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT3_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT3_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT3_ACTIVE (0x1UL)

/* INEPINT4 @Bit 4 : IN Endpoint 4 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT4_Pos (4UL)
  #define USBHSCORE_DAINT_INEPINT4_Msk (0x1UL << USBHSCORE_DAINT_INEPINT4_Pos)
  #define USBHSCORE_DAINT_INEPINT4_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT4_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT4_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT4_ACTIVE (0x1UL)

/* INEPINT5 @Bit 5 : IN Endpoint 5 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT5_Pos (5UL)
  #define USBHSCORE_DAINT_INEPINT5_Msk (0x1UL << USBHSCORE_DAINT_INEPINT5_Pos)
  #define USBHSCORE_DAINT_INEPINT5_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT5_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT5_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT5_ACTIVE (0x1UL)

/* INEPINT6 @Bit 6 : IN Endpoint 6 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT6_Pos (6UL)
  #define USBHSCORE_DAINT_INEPINT6_Msk (0x1UL << USBHSCORE_DAINT_INEPINT6_Pos)
  #define USBHSCORE_DAINT_INEPINT6_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT6_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT6_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT6_ACTIVE (0x1UL)

/* INEPINT7 @Bit 7 : IN Endpoint 7 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT7_Pos (7UL)
  #define USBHSCORE_DAINT_INEPINT7_Msk (0x1UL << USBHSCORE_DAINT_INEPINT7_Pos)
  #define USBHSCORE_DAINT_INEPINT7_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT7_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT7_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT7_ACTIVE (0x1UL)

/* INEPINT8 @Bit 8 : IN Endpoint 8 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT8_Pos (8UL)
  #define USBHSCORE_DAINT_INEPINT8_Msk (0x1UL << USBHSCORE_DAINT_INEPINT8_Pos)
  #define USBHSCORE_DAINT_INEPINT8_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT8_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT8_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT8_ACTIVE (0x1UL)

/* INEPINT9 @Bit 9 : IN Endpoint 9 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT9_Pos (9UL)
  #define USBHSCORE_DAINT_INEPINT9_Msk (0x1UL << USBHSCORE_DAINT_INEPINT9_Pos)
  #define USBHSCORE_DAINT_INEPINT9_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT9_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT9_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT9_ACTIVE (0x1UL)

/* INEPINT10 @Bit 10 : IN Endpoint 10 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT10_Pos (10UL)
  #define USBHSCORE_DAINT_INEPINT10_Msk (0x1UL << USBHSCORE_DAINT_INEPINT10_Pos)
  #define USBHSCORE_DAINT_INEPINT10_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT10_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT10_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT10_ACTIVE (0x1UL)

/* INEPINT11 @Bit 11 : IN Endpoint 11 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT11_Pos (11UL)
  #define USBHSCORE_DAINT_INEPINT11_Msk (0x1UL << USBHSCORE_DAINT_INEPINT11_Pos)
  #define USBHSCORE_DAINT_INEPINT11_Min (0x0UL)
  #define USBHSCORE_DAINT_INEPINT11_Max (0x1UL)
  #define USBHSCORE_DAINT_INEPINT11_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_INEPINT11_ACTIVE (0x1UL)

/* OUTEPINT0 @Bit 16 : OUT Endpoint 0 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT0_Pos (16UL)
  #define USBHSCORE_DAINT_OUTEPINT0_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT0_Pos)
  #define USBHSCORE_DAINT_OUTEPINT0_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT0_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT0_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT0_ACTIVE (0x1UL)

/* OUTEPINT1 @Bit 17 : OUT Endpoint 1 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT1_Pos (17UL)
  #define USBHSCORE_DAINT_OUTEPINT1_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT1_Pos)
  #define USBHSCORE_DAINT_OUTEPINT1_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT1_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT1_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT1_ACTIVE (0x1UL)

