pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* OUTEPINT2 @Bit 18 : OUT Endpoint 2 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT2_Pos (18UL)
  #define USBHSCORE_DAINT_OUTEPINT2_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT2_Pos)
  #define USBHSCORE_DAINT_OUTEPINT2_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT2_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT2_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT2_ACTIVE (0x1UL)

/* OUTEPINT3 @Bit 19 : OUT Endpoint 3 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT3_Pos (19UL)
  #define USBHSCORE_DAINT_OUTEPINT3_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT3_Pos)
  #define USBHSCORE_DAINT_OUTEPINT3_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT3_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT3_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT3_ACTIVE (0x1UL)

/* OUTEPINT4 @Bit 20 : OUT Endpoint 4 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT4_Pos (20UL)
  #define USBHSCORE_DAINT_OUTEPINT4_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT4_Pos)
  #define USBHSCORE_DAINT_OUTEPINT4_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT4_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT4_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT4_ACTIVE (0x1UL)

/* OUTEPINT5 @Bit 21 : OUT Endpoint 5 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT5_Pos (21UL)
  #define USBHSCORE_DAINT_OUTEPINT5_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT5_Pos)
  #define USBHSCORE_DAINT_OUTEPINT5_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT5_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT5_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT5_ACTIVE (0x1UL)

/* OUTEPINT12 @Bit 28 : OUT Endpoint 12 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT12_Pos (28UL)
  #define USBHSCORE_DAINT_OUTEPINT12_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT12_Pos)
  #define USBHSCORE_DAINT_OUTEPINT12_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT12_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT12_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT12_ACTIVE (0x1UL)

/* OUTEPINT13 @Bit 29 : OUT Endpoint 13 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT13_Pos (29UL)
  #define USBHSCORE_DAINT_OUTEPINT13_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT13_Pos)
  #define USBHSCORE_DAINT_OUTEPINT13_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT13_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT13_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT13_ACTIVE (0x1UL)

/* OUTEPINT14 @Bit 30 : OUT Endpoint 14 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT14_Pos (30UL)
  #define USBHSCORE_DAINT_OUTEPINT14_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT14_Pos)
  #define USBHSCORE_DAINT_OUTEPINT14_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT14_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT14_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT14_ACTIVE (0x1UL)

/* OUTEPINT15 @Bit 31 : OUT Endpoint 15 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT15_Pos (31UL)
  #define USBHSCORE_DAINT_OUTEPINT15_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT15_Pos)
  #define USBHSCORE_DAINT_OUTEPINT15_Min (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT15_Max (0x1UL)
  #define USBHSCORE_DAINT_OUTEPINT15_INACTIVE (0x0UL)
  #define USBHSCORE_DAINT_OUTEPINT15_ACTIVE (0x1UL)


/* USBHSCORE_DAINTMSK: Device All Endpoints Interrupt Mask Register */
  #define USBHSCORE_DAINTMSK_ResetValue (0x00000000UL)

/* INEPMSK0 @Bit 0 : IN Endpoint 0 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK0_Pos (0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK0_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK0_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK0_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK0_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK0_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK0_NOMASK (0x1UL)

/* INEPMSK1 @Bit 1 : IN Endpoint 1 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK1_Pos (1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK1_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK1_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK1_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK1_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK1_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK1_NOMASK (0x1UL)

/* INEPMSK2 @Bit 2 : IN Endpoint 2 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK2_Pos (2UL)
  #define USBHSCORE_DAINTMSK_INEPMSK2_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK2_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK2_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK2_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK2_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK2_NOMASK (0x1UL)

/* INEPMSK3 @Bit 3 : IN Endpoint 3 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK3_Pos (3UL)
  #define USBHSCORE_DAINTMSK_INEPMSK3_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK3_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK3_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK3_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK3_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK3_NOMASK (0x1UL)

/* INEPMSK4 @Bit 4 : IN Endpoint 4 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK4_Pos (4UL)
  #define USBHSCORE_DAINTMSK_INEPMSK4_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK4_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK4_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK4_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK4_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK4_NOMASK (0x1UL)

/* INEPMSK5 @Bit 5 : IN Endpoint 5 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK5_Pos (5UL)
  #define USBHSCORE_DAINTMSK_INEPMSK5_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK5_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK5_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK5_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK5_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK5_NOMASK (0x1UL)

/* INEPMSK6 @Bit 6 : IN Endpoint 6 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK6_Pos (6UL)
  #define USBHSCORE_DAINTMSK_INEPMSK6_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK6_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK6_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK6_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK6_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK6_NOMASK (0x1UL)

/* INEPMSK7 @Bit 7 : IN Endpoint 7 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK7_Pos (7UL)
  #define USBHSCORE_DAINTMSK_INEPMSK7_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK7_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK7_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK7_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK7_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK7_NOMASK (0x1UL)

