pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INEPMSK8 @Bit 8 : IN Endpoint 8 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK8_Pos (8UL)
  #define USBHSCORE_DAINTMSK_INEPMSK8_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK8_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK8_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK8_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK8_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK8_NOMASK (0x1UL)

/* INEPMSK9 @Bit 9 : IN Endpoint 9 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK9_Pos (9UL)
  #define USBHSCORE_DAINTMSK_INEPMSK9_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK9_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK9_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK9_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK9_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK9_NOMASK (0x1UL)

/* INEPMSK10 @Bit 10 : IN Endpoint 10 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK10_Pos (10UL)
  #define USBHSCORE_DAINTMSK_INEPMSK10_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK10_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK10_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK10_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK10_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK10_NOMASK (0x1UL)

/* INEPMSK11 @Bit 11 : IN Endpoint 11 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_INEPMSK11_Pos (11UL)
  #define USBHSCORE_DAINTMSK_INEPMSK11_Msk (0x1UL << USBHSCORE_DAINTMSK_INEPMSK11_Pos)
  #define USBHSCORE_DAINTMSK_INEPMSK11_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK11_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_INEPMSK11_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_INEPMSK11_NOMASK (0x1UL)

/* OUTEPMSK0 @Bit 16 : OUT Endpoint 0 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Pos (16UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK0_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK0_NOMASK (0x1UL)

/* OUTEPMSK1 @Bit 17 : OUT Endpoint 1 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Pos (17UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK1_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK1_NOMASK (0x1UL)

/* OUTEPMSK2 @Bit 18 : OUT Endpoint 2 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Pos (18UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK2_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK2_NOMASK (0x1UL)

/* OUTEPMSK3 @Bit 19 : OUT Endpoint 3 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Pos (19UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK3_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK3_NOMASK (0x1UL)

/* OUTEPMSK4 @Bit 20 : OUT Endpoint 4 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Pos (20UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK4_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK4_NOMASK (0x1UL)

/* OUTEPMSK5 @Bit 21 : OUT Endpoint 5 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Pos (21UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK5_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_NOMASK (0x1UL)

/* OUTEPMSK12 @Bit 28 : OUT Endpoint 12 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Pos (28UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK12_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_NOMASK (0x1UL)

/* OUTEPMSK13 @Bit 29 : OUT Endpoint 13 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Pos (29UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK13_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_NOMASK (0x1UL)

/* OUTEPMSK14 @Bit 30 : OUT Endpoint 14 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Pos (30UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK14_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_NOMASK (0x1UL)

/* OUTEPMSK15 @Bit 31 : OUT Endpoint 15 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Pos (31UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK15_Pos)
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Min (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Max (0x1UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_MASK (0x0UL)
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_NOMASK (0x1UL)


/* USBHSCORE_DVBUSDIS: Device VBUS Discharge Time Register */
  #define USBHSCORE_DVBUSDIS_ResetValue (0x000017D7UL)

/* DVBUSDIS @Bits 0..15 : Device VBUS Discharge Time (DVBUSDis) */
  #define USBHSCORE_DVBUSDIS_DVBUSDIS_Pos (0UL)
  #define USBHSCORE_DVBUSDIS_DVBUSDIS_Msk (0xFFFFUL << USBHSCORE_DVBUSDIS_DVBUSDIS_Pos)


/* USBHSCORE_DVBUSPULSE: Device VBUS Pulsing Time Register */
  #define USBHSCORE_DVBUSPULSE_ResetValue (0x000005B8UL)

/* DVBUSPULSE @Bits 0..11 : Device VBUS Pulsing Time (DVBUSPulse) */
  #define USBHSCORE_DVBUSPULSE_DVBUSPULSE_Pos (0UL)
  #define USBHSCORE_DVBUSPULSE_DVBUSPULSE_Msk (0xFFFUL << USBHSCORE_DVBUSPULSE_DVBUSPULSE_Pos) /*!< Bit mask of DVBUSPULSE
                                                                            field.*/


