pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* USBHSCORE_DTHRCTL: Device Threshold Control Register */
  #define USBHSCORE_DTHRCTL_ResetValue (0x08100020UL)

/* NONISOTHREN @Bit 0 : Non-ISO IN Endpoints Threshold Enable. (NonISOThrEn) */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Pos (0UL)
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Msk (0x1UL << USBHSCORE_DTHRCTL_NONISOTHREN_Pos)
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Min (0x0UL)
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Max (0x1UL)
  #define USBHSCORE_DTHRCTL_NONISOTHREN_DISABLED (0x0UL)
  #define USBHSCORE_DTHRCTL_NONISOTHREN_ENABLED (0x1UL)

/* ISOTHREN @Bit 1 : (unspecified) */
  #define USBHSCORE_DTHRCTL_ISOTHREN_Pos (1UL)
  #define USBHSCORE_DTHRCTL_ISOTHREN_Msk (0x1UL << USBHSCORE_DTHRCTL_ISOTHREN_Pos)
  #define USBHSCORE_DTHRCTL_ISOTHREN_Min (0x0UL)
  #define USBHSCORE_DTHRCTL_ISOTHREN_Max (0x1UL)
  #define USBHSCORE_DTHRCTL_ISOTHREN_DISABLED (0x0UL)
  #define USBHSCORE_DTHRCTL_ISOTHREN_ENABLED (0x1UL)

/* TXTHRLEN @Bits 2..10 : Transmit Threshold Length (TxThrLen) */
  #define USBHSCORE_DTHRCTL_TXTHRLEN_Pos (2UL)
  #define USBHSCORE_DTHRCTL_TXTHRLEN_Msk (0x1FFUL << USBHSCORE_DTHRCTL_TXTHRLEN_Pos)

/* AHBTHRRATIO @Bits 11..12 : AHB Threshold Ratio (AHBThrRatio) */
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Pos (11UL)
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Msk (0x3UL << USBHSCORE_DTHRCTL_AHBTHRRATIO_Pos)
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Min (0x0UL)
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_Max (0x3UL)
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESZERO (0x0UL)
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESONE (0x1UL)
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESTWO (0x2UL)
  #define USBHSCORE_DTHRCTL_AHBTHRRATIO_THRESTHREE (0x3UL)

/* RXTHREN @Bit 16 : Receive Threshold Enable (RxThrEn) */
  #define USBHSCORE_DTHRCTL_RXTHREN_Pos (16UL)
  #define USBHSCORE_DTHRCTL_RXTHREN_Msk (0x1UL << USBHSCORE_DTHRCTL_RXTHREN_Pos)
  #define USBHSCORE_DTHRCTL_RXTHREN_Min (0x0UL)
  #define USBHSCORE_DTHRCTL_RXTHREN_Max (0x1UL)
  #define USBHSCORE_DTHRCTL_RXTHREN_DISABLED (0x0UL)
  #define USBHSCORE_DTHRCTL_RXTHREN_ENABLED (0x1UL)

/* RXTHRLEN @Bits 17..25 : Receive Threshold Length (RxThrLen) */
  #define USBHSCORE_DTHRCTL_RXTHRLEN_Pos (17UL)
  #define USBHSCORE_DTHRCTL_RXTHRLEN_Msk (0x1FFUL << USBHSCORE_DTHRCTL_RXTHRLEN_Pos)

/* ARBPRKEN @Bit 27 : Arbiter Parking Enable (ArbPrkEn) */
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Pos (27UL)
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Msk (0x1UL << USBHSCORE_DTHRCTL_ARBPRKEN_Pos)
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Min (0x0UL)
  #define USBHSCORE_DTHRCTL_ARBPRKEN_Max (0x1UL)
  #define USBHSCORE_DTHRCTL_ARBPRKEN_DISABLED (0x0UL)
  #define USBHSCORE_DTHRCTL_ARBPRKEN_ENABLED (0x1UL)


/* USBHSCORE_DIEPEMPMSK: Device IN Endpoint FIFO Empty Interrupt Mask Register */
  #define USBHSCORE_DIEPEMPMSK_ResetValue (0x00000000UL)

/* INEPTXFEMPMSK @Bits 0..15 : IN EP Tx FIFO Empty Interrupt Mask Bits (InEpTxfEmpMsk) */
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Pos (0UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Msk (0xFFFFUL << USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Pos) /*!< Bit mask of
                                                                            INEPTXFEMPMSK field.*/
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Min (0x1UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_Max (0x8000UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP0_MASK (0x0001UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP1_MASK (0x0002UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP2_MASK (0x0004UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP3_MASK (0x0008UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP4_MASK (0x0010UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP5_MASK (0x0020UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP6_MASK (0x0040UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP7_MASK (0x0080UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP8_MASK (0x0100UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP9_MASK (0x0200UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP10_MASK (0x0400UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP11_MASK (0x0800UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP12_MASK (0x1000UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP13_MASK (0x2000UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP14_MASK (0x4000UL)
  #define USBHSCORE_DIEPEMPMSK_INEPTXFEMPMSK_EP15_MASK (0x8000UL)


/* USBHSCORE_DIEPCTL0: Device Control IN Endpoint 0 Control Register */
  #define USBHSCORE_DIEPCTL0_ResetValue (0x00008000UL)

/* MPS @Bits 0..1 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DIEPCTL0_MPS_Pos (0UL)
  #define USBHSCORE_DIEPCTL0_MPS_Msk (0x3UL << USBHSCORE_DIEPCTL0_MPS_Pos)
  #define USBHSCORE_DIEPCTL0_MPS_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_MPS_Max (0x3UL)
  #define USBHSCORE_DIEPCTL0_MPS_BYTES64 (0x0UL)
  #define USBHSCORE_DIEPCTL0_MPS_BYTES32 (0x1UL)
  #define USBHSCORE_DIEPCTL0_MPS_BYTES16 (0x2UL)
  #define USBHSCORE_DIEPCTL0_MPS_BYTES8 (0x3UL)

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DIEPCTL0_USBACTEP_Pos (15UL)
  #define USBHSCORE_DIEPCTL0_USBACTEP_Msk (0x1UL << USBHSCORE_DIEPCTL0_USBACTEP_Pos)
  #define USBHSCORE_DIEPCTL0_USBACTEP_Min (0x1UL)
  #define USBHSCORE_DIEPCTL0_USBACTEP_Max (0x1UL)
  #define USBHSCORE_DIEPCTL0_USBACTEP_ACTIVE0 (0x1UL)

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DIEPCTL0_NAKSTS_Pos (17UL)
  #define USBHSCORE_DIEPCTL0_NAKSTS_Msk (0x1UL << USBHSCORE_DIEPCTL0_NAKSTS_Pos)
  #define USBHSCORE_DIEPCTL0_NAKSTS_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_NAKSTS_Max (0x1UL)
  #define USBHSCORE_DIEPCTL0_NAKSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL0_NAKSTS_ACTIVE (0x1UL)

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DIEPCTL0_EPTYPE_Pos (18UL)
  #define USBHSCORE_DIEPCTL0_EPTYPE_Msk (0x3UL << USBHSCORE_DIEPCTL0_EPTYPE_Pos)
  #define USBHSCORE_DIEPCTL0_EPTYPE_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_EPTYPE_Max (0x0UL)
  #define USBHSCORE_DIEPCTL0_EPTYPE_ACTIVE (0x0UL)

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DIEPCTL0_STALL_Pos (21UL)
  #define USBHSCORE_DIEPCTL0_STALL_Msk (0x1UL << USBHSCORE_DIEPCTL0_STALL_Pos)
  #define USBHSCORE_DIEPCTL0_STALL_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_STALL_Max (0x1UL)
  #define USBHSCORE_DIEPCTL0_STALL_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL0_STALL_ACTIVE (0x1UL)

/* TXFNUM @Bits 22..25 : TxFIFO Number (TxFNum) */
  #define USBHSCORE_DIEPCTL0_TXFNUM_Pos (22UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_Msk (0xFUL << USBHSCORE_DIEPCTL0_TXFNUM_Pos)
  #define USBHSCORE_DIEPCTL0_TXFNUM_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_Max (0xFUL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO0 (0x0UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO1 (0x1UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO2 (0x2UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO3 (0x3UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO4 (0x4UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO5 (0x5UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO6 (0x6UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO7 (0x7UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO8 (0x8UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO9 (0x9UL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO10 (0xAUL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO11 (0xBUL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO12 (0xCUL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO13 (0xDUL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO14 (0xEUL)
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO15 (0xFUL)

/* CNAK @Bit 26 : (unspecified) */
  #define USBHSCORE_DIEPCTL0_CNAK_Pos (26UL)
  #define USBHSCORE_DIEPCTL0_CNAK_Msk (0x1UL << USBHSCORE_DIEPCTL0_CNAK_Pos)
  #define USBHSCORE_DIEPCTL0_CNAK_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_CNAK_Max (0x1UL)
  #define USBHSCORE_DIEPCTL0_CNAK_NOCLEAR (0x0UL)
  #define USBHSCORE_DIEPCTL0_CNAK_CLEAR (0x1UL)

/* SNAK @Bit 27 : (unspecified) */
  #define USBHSCORE_DIEPCTL0_SNAK_Pos (27UL)
  #define USBHSCORE_DIEPCTL0_SNAK_Msk (0x1UL << USBHSCORE_DIEPCTL0_SNAK_Pos)
  #define USBHSCORE_DIEPCTL0_SNAK_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_SNAK_Max (0x1UL)
  #define USBHSCORE_DIEPCTL0_SNAK_NOSET (0x0UL)
  #define USBHSCORE_DIEPCTL0_SNAK_SET (0x1UL)

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DIEPCTL0_EPDIS_Pos (30UL)
  #define USBHSCORE_DIEPCTL0_EPDIS_Msk (0x1UL << USBHSCORE_DIEPCTL0_EPDIS_Pos)
  #define USBHSCORE_DIEPCTL0_EPDIS_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_EPDIS_Max (0x1UL)
  #define USBHSCORE_DIEPCTL0_EPDIS_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL0_EPDIS_ACTIVE (0x1UL)

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DIEPCTL0_EPENA_Pos (31UL)
  #define USBHSCORE_DIEPCTL0_EPENA_Msk (0x1UL << USBHSCORE_DIEPCTL0_EPENA_Pos)
  #define USBHSCORE_DIEPCTL0_EPENA_Min (0x0UL)
  #define USBHSCORE_DIEPCTL0_EPENA_Max (0x1UL)
  #define USBHSCORE_DIEPCTL0_EPENA_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL0_EPENA_ACTIVE (0x1UL)


/* USBHSCORE_DIEPINT0: Device IN Endpoint 0 Interrupt Register */
  #define USBHSCORE_DIEPINT0_ResetValue (0x00000080UL)

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DIEPINT0_XFERCOMPL_Pos (0UL)
  #define USBHSCORE_DIEPINT0_XFERCOMPL_Msk (0x1UL << USBHSCORE_DIEPINT0_XFERCOMPL_Pos)
  #define USBHSCORE_DIEPINT0_XFERCOMPL_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_XFERCOMPL_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_XFERCOMPL_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_XFERCOMPL_ACTIVE (0x1UL)

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DIEPINT0_EPDISBLD_Pos (1UL)
  #define USBHSCORE_DIEPINT0_EPDISBLD_Msk (0x1UL << USBHSCORE_DIEPINT0_EPDISBLD_Pos)
  #define USBHSCORE_DIEPINT0_EPDISBLD_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_EPDISBLD_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_EPDISBLD_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_EPDISBLD_ACTIVE (0x1UL)

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DIEPINT0_AHBERR_Pos (2UL)
  #define USBHSCORE_DIEPINT0_AHBERR_Msk (0x1UL << USBHSCORE_DIEPINT0_AHBERR_Pos)
  #define USBHSCORE_DIEPINT0_AHBERR_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_AHBERR_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_AHBERR_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_AHBERR_ACTIVE (0x1UL)

/* TIMEOUT @Bit 3 : Timeout Condition (TimeOUT) */
  #define USBHSCORE_DIEPINT0_TIMEOUT_Pos (3UL)
  #define USBHSCORE_DIEPINT0_TIMEOUT_Msk (0x1UL << USBHSCORE_DIEPINT0_TIMEOUT_Pos)
  #define USBHSCORE_DIEPINT0_TIMEOUT_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_TIMEOUT_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_TIMEOUT_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_TIMEOUT_ACTIVE (0x1UL)

/* INTKNTXFEMP @Bit 4 : IN Token Received When TxFIFO is Empty (INTknTXFEmp) */
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_Pos (4UL)
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT0_INTKNTXFEMP_Pos)
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_ACTIVE (0x1UL)

/* INTKNEPMIS @Bit 5 : IN Token Received with EP Mismatch (INTknEPMis) */
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_Pos (5UL)
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_Msk (0x1UL << USBHSCORE_DIEPINT0_INTKNEPMIS_Pos)
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_ACTIVE (0x1UL)

