pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INEPNAKEFF @Bit 6 : IN Endpoint NAK Effective (INEPNakEff) */
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_Pos (6UL)
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_Msk (0x1UL << USBHSCORE_DIEPINT0_INEPNAKEFF_Pos)
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_INEPNAKEFF_ACTIVE (0x1UL)

/* TXFEMP @Bit 7 : Transmit FIFO Empty (TxFEmp) */
  #define USBHSCORE_DIEPINT0_TXFEMP_Pos (7UL)
  #define USBHSCORE_DIEPINT0_TXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT0_TXFEMP_Pos)
  #define USBHSCORE_DIEPINT0_TXFEMP_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_TXFEMP_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_TXFEMP_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_TXFEMP_ACTIVE (0x1UL)

/* TXFIFOUNDRN @Bit 8 : Fifo Underrun (TxfifoUndrn) */
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_Pos (8UL)
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_Msk (0x1UL << USBHSCORE_DIEPINT0_TXFIFOUNDRN_Pos)
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_TXFIFOUNDRN_ACTIVE (0x1UL)

/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DIEPINT0_BNAINTR_Pos (9UL)
  #define USBHSCORE_DIEPINT0_BNAINTR_Msk (0x1UL << USBHSCORE_DIEPINT0_BNAINTR_Pos)
  #define USBHSCORE_DIEPINT0_BNAINTR_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_BNAINTR_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_BNAINTR_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_BNAINTR_ACTIVE (0x1UL)

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_Pos (11UL)
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DIEPINT0_PKTDRPSTS_Pos)
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_PKTDRPSTS_ACTIVE (0x1UL)

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DIEPINT0_BBLEERR_Pos (12UL)
  #define USBHSCORE_DIEPINT0_BBLEERR_Msk (0x1UL << USBHSCORE_DIEPINT0_BBLEERR_Pos)
  #define USBHSCORE_DIEPINT0_BBLEERR_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_BBLEERR_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_BBLEERR_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_BBLEERR_ACTIVE (0x1UL)

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DIEPINT0_NAKINTRPT_Pos (13UL)
  #define USBHSCORE_DIEPINT0_NAKINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT0_NAKINTRPT_Pos)
  #define USBHSCORE_DIEPINT0_NAKINTRPT_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_NAKINTRPT_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_NAKINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_NAKINTRPT_ACTIVE (0x1UL)

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DIEPINT0_NYETINTRPT_Pos (14UL)
  #define USBHSCORE_DIEPINT0_NYETINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT0_NYETINTRPT_Pos)
  #define USBHSCORE_DIEPINT0_NYETINTRPT_Min (0x0UL)
  #define USBHSCORE_DIEPINT0_NYETINTRPT_Max (0x1UL)
  #define USBHSCORE_DIEPINT0_NYETINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT0_NYETINTRPT_ACTIVE (0x1UL)


/* USBHSCORE_DIEPTSIZ0: Device IN Endpoint 0 Transfer Size Register */
  #define USBHSCORE_DIEPTSIZ0_ResetValue (0x00000000UL)

/* XFERSIZE @Bits 0..6 : Transfer Size (XferSize) */
  #define USBHSCORE_DIEPTSIZ0_XFERSIZE_Pos (0UL)
  #define USBHSCORE_DIEPTSIZ0_XFERSIZE_Msk (0x7FUL << USBHSCORE_DIEPTSIZ0_XFERSIZE_Pos)

/* PKTCNT @Bits 19..20 : Packet Count (PktCnt) */
  #define USBHSCORE_DIEPTSIZ0_PKTCNT_Pos (19UL)
  #define USBHSCORE_DIEPTSIZ0_PKTCNT_Msk (0x3UL << USBHSCORE_DIEPTSIZ0_PKTCNT_Pos)


/* USBHSCORE_DIEPDMA0: Device IN Endpoint 0 DMA Address Register */
  #define USBHSCORE_DIEPDMA0_ResetValue (0x00000000UL)

/* DMAADDR @Bits 0..31 : DMAAddr */
  #define USBHSCORE_DIEPDMA0_DMAADDR_Pos (0UL)
  #define USBHSCORE_DIEPDMA0_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA0_DMAADDR_Pos)


/* USBHSCORE_DTXFSTS0: Device IN Endpoint Transmit FIFO Status Register 0 */
  #define USBHSCORE_DTXFSTS0_ResetValue (0x00000200UL)

/* INEPTXFSPCAVAIL @Bits 0..15 : IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail) */
  #define USBHSCORE_DTXFSTS0_INEPTXFSPCAVAIL_Pos (0UL)
  #define USBHSCORE_DTXFSTS0_INEPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_DTXFSTS0_INEPTXFSPCAVAIL_Pos) /*!< Bit mask of
                                                                            INEPTXFSPCAVAIL field.*/


/* USBHSCORE_DIEPCTL1: Device Control IN Endpoint Control Register */
  #define USBHSCORE_DIEPCTL1_ResetValue (0x00000000UL)

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DIEPCTL1_MPS_Pos (0UL)
  #define USBHSCORE_DIEPCTL1_MPS_Msk (0x7FFUL << USBHSCORE_DIEPCTL1_MPS_Pos)

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DIEPCTL1_USBACTEP_Pos (15UL)
  #define USBHSCORE_DIEPCTL1_USBACTEP_Msk (0x1UL << USBHSCORE_DIEPCTL1_USBACTEP_Pos)
  #define USBHSCORE_DIEPCTL1_USBACTEP_Min (0x0UL)
  #define USBHSCORE_DIEPCTL1_USBACTEP_Max (0x1UL)
  #define USBHSCORE_DIEPCTL1_USBACTEP_DISABLED (0x0UL)
  #define USBHSCORE_DIEPCTL1_USBACTEP_ENABLED (0x1UL)

/* DPID @Bit 16 : (unspecified) */
  #define USBHSCORE_DIEPCTL1_DPID_Pos (16UL)
  #define USBHSCORE_DIEPCTL1_DPID_Msk (0x1UL << USBHSCORE_DIEPCTL1_DPID_Pos)
  #define USBHSCORE_DIEPCTL1_DPID_Min (0x0UL)
  #define USBHSCORE_DIEPCTL1_DPID_Max (0x1UL)
  #define USBHSCORE_DIEPCTL1_DPID_DATA0EVENFRM (0x0UL)
  #define USBHSCORE_DIEPCTL1_DPID_DATA1ODDFRM (0x1UL)

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DIEPCTL1_NAKSTS_Pos (17UL)
  #define USBHSCORE_DIEPCTL1_NAKSTS_Msk (0x1UL << USBHSCORE_DIEPCTL1_NAKSTS_Pos)
  #define USBHSCORE_DIEPCTL1_NAKSTS_Min (0x0UL)
  #define USBHSCORE_DIEPCTL1_NAKSTS_Max (0x1UL)
  #define USBHSCORE_DIEPCTL1_NAKSTS_NONNAK (0x0UL)
  #define USBHSCORE_DIEPCTL1_NAKSTS_NAK (0x1UL)

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DIEPCTL1_EPTYPE_Pos (18UL)
  #define USBHSCORE_DIEPCTL1_EPTYPE_Msk (0x3UL << USBHSCORE_DIEPCTL1_EPTYPE_Pos)
  #define USBHSCORE_DIEPCTL1_EPTYPE_Min (0x0UL)
  #define USBHSCORE_DIEPCTL1_EPTYPE_Max (0x3UL)
  #define USBHSCORE_DIEPCTL1_EPTYPE_CONTROL (0x0UL)
  #define USBHSCORE_DIEPCTL1_EPTYPE_ISOCHRONOUS (0x1UL)
  #define USBHSCORE_DIEPCTL1_EPTYPE_BULK (0x2UL)
  #define USBHSCORE_DIEPCTL1_EPTYPE_INTERRUP (0x3UL)

