pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DIEPCTL10_STALL_Pos (21UL)
  #define USBHSCORE_DIEPCTL10_STALL_Msk (0x1UL << USBHSCORE_DIEPCTL10_STALL_Pos)
  #define USBHSCORE_DIEPCTL10_STALL_Min (0x0UL)
  #define USBHSCORE_DIEPCTL10_STALL_Max (0x1UL)
  #define USBHSCORE_DIEPCTL10_STALL_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL10_STALL_ACTIVE (0x1UL)

/* TXFNUM @Bits 22..25 : TxFIFO Number (TxFNum) */
  #define USBHSCORE_DIEPCTL10_TXFNUM_Pos (22UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_Msk (0xFUL << USBHSCORE_DIEPCTL10_TXFNUM_Pos)
  #define USBHSCORE_DIEPCTL10_TXFNUM_Min (0x0UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_Max (0xFUL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO0 (0x0UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO1 (0x1UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO2 (0x2UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO3 (0x3UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO4 (0x4UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO5 (0x5UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO6 (0x6UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO7 (0x7UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO8 (0x8UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO9 (0x9UL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO10 (0xAUL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO11 (0xBUL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO12 (0xCUL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO13 (0xDUL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO14 (0xEUL)
  #define USBHSCORE_DIEPCTL10_TXFNUM_TXFIFO15 (0xFUL)

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DIEPCTL10_CNAK_Pos (26UL)
  #define USBHSCORE_DIEPCTL10_CNAK_Msk (0x1UL << USBHSCORE_DIEPCTL10_CNAK_Pos)
  #define USBHSCORE_DIEPCTL10_CNAK_Min (0x0UL)
  #define USBHSCORE_DIEPCTL10_CNAK_Max (0x1UL)
  #define USBHSCORE_DIEPCTL10_CNAK_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL10_CNAK_ACTIVE (0x1UL)

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DIEPCTL10_SNAK_Pos (27UL)
  #define USBHSCORE_DIEPCTL10_SNAK_Msk (0x1UL << USBHSCORE_DIEPCTL10_SNAK_Pos)
  #define USBHSCORE_DIEPCTL10_SNAK_Min (0x0UL)
  #define USBHSCORE_DIEPCTL10_SNAK_Max (0x1UL)
  #define USBHSCORE_DIEPCTL10_SNAK_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL10_SNAK_ACTIVE (0x1UL)

/* SETD0PID @Bit 28 : Set DATA0 PID (SetD0PID) */
  #define USBHSCORE_DIEPCTL10_SETD0PID_Pos (28UL)
  #define USBHSCORE_DIEPCTL10_SETD0PID_Msk (0x1UL << USBHSCORE_DIEPCTL10_SETD0PID_Pos)
  #define USBHSCORE_DIEPCTL10_SETD0PID_Min (0x0UL)
  #define USBHSCORE_DIEPCTL10_SETD0PID_Max (0x1UL)
  #define USBHSCORE_DIEPCTL10_SETD0PID_DISABLED (0x0UL)
  #define USBHSCORE_DIEPCTL10_SETD0PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA0 or Sets EO_FrNum field to Even
                                                            (micro)Frame*/

/* SETD1PID @Bit 29 : Set DATA1 PID (SetD1PID) */
  #define USBHSCORE_DIEPCTL10_SETD1PID_Pos (29UL)
  #define USBHSCORE_DIEPCTL10_SETD1PID_Msk (0x1UL << USBHSCORE_DIEPCTL10_SETD1PID_Pos)
  #define USBHSCORE_DIEPCTL10_SETD1PID_Min (0x0UL)
  #define USBHSCORE_DIEPCTL10_SETD1PID_Max (0x1UL)
  #define USBHSCORE_DIEPCTL10_SETD1PID_DISABLED (0x0UL)
  #define USBHSCORE_DIEPCTL10_SETD1PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA1 or Sets EO_FrNum field to Odd
                                                            (micro)Frame*/

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DIEPCTL10_EPDIS_Pos (30UL)
  #define USBHSCORE_DIEPCTL10_EPDIS_Msk (0x1UL << USBHSCORE_DIEPCTL10_EPDIS_Pos)
  #define USBHSCORE_DIEPCTL10_EPDIS_Min (0x0UL)
  #define USBHSCORE_DIEPCTL10_EPDIS_Max (0x1UL)
  #define USBHSCORE_DIEPCTL10_EPDIS_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL10_EPDIS_ACTIVE (0x1UL)

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DIEPCTL10_EPENA_Pos (31UL)
  #define USBHSCORE_DIEPCTL10_EPENA_Msk (0x1UL << USBHSCORE_DIEPCTL10_EPENA_Pos)
  #define USBHSCORE_DIEPCTL10_EPENA_Min (0x0UL)
  #define USBHSCORE_DIEPCTL10_EPENA_Max (0x1UL)
  #define USBHSCORE_DIEPCTL10_EPENA_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPCTL10_EPENA_ACTIVE (0x1UL)


/* USBHSCORE_DIEPINT10: Device IN Endpoint Interrupt Register */
  #define USBHSCORE_DIEPINT10_ResetValue (0x00000080UL)

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Pos (0UL)
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Msk (0x1UL << USBHSCORE_DIEPINT10_XFERCOMPL_Pos)
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_XFERCOMPL_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_XFERCOMPL_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_XFERCOMPL_ACTIVE (0x1UL)

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DIEPINT10_EPDISBLD_Pos (1UL)
  #define USBHSCORE_DIEPINT10_EPDISBLD_Msk (0x1UL << USBHSCORE_DIEPINT10_EPDISBLD_Pos)
  #define USBHSCORE_DIEPINT10_EPDISBLD_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_EPDISBLD_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_EPDISBLD_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_EPDISBLD_ACTIVE (0x1UL)

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DIEPINT10_AHBERR_Pos (2UL)
  #define USBHSCORE_DIEPINT10_AHBERR_Msk (0x1UL << USBHSCORE_DIEPINT10_AHBERR_Pos)
  #define USBHSCORE_DIEPINT10_AHBERR_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_AHBERR_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_AHBERR_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_AHBERR_ACTIVE (0x1UL)

/* TIMEOUT @Bit 3 : Timeout Condition (TimeOUT) */
  #define USBHSCORE_DIEPINT10_TIMEOUT_Pos (3UL)
  #define USBHSCORE_DIEPINT10_TIMEOUT_Msk (0x1UL << USBHSCORE_DIEPINT10_TIMEOUT_Pos)
  #define USBHSCORE_DIEPINT10_TIMEOUT_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_TIMEOUT_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_TIMEOUT_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_TIMEOUT_ACTIVE (0x1UL)

/* INTKNTXFEMP @Bit 4 : IN Token Received When TxFIFO is Empty (INTknTXFEmp) */
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Pos (4UL)
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT10_INTKNTXFEMP_Pos) /*!< Bit mask of INTKNTXFEMP
                                                                            field.*/
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_INTKNTXFEMP_ACTIVE (0x1UL)

/* INTKNEPMIS @Bit 5 : IN Token Received with EP Mismatch (INTknEPMis) */
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Pos (5UL)
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Msk (0x1UL << USBHSCORE_DIEPINT10_INTKNEPMIS_Pos)
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_INTKNEPMIS_ACTIVE (0x1UL)

