pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INEPNAKEFF @Bit 6 : IN Endpoint NAK Effective (INEPNakEff) */
  #define USBHSCORE_DIEPINT10_INEPNAKEFF_Pos (6UL)
  #define USBHSCORE_DIEPINT10_INEPNAKEFF_Msk (0x1UL << USBHSCORE_DIEPINT10_INEPNAKEFF_Pos)
  #define USBHSCORE_DIEPINT10_INEPNAKEFF_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_INEPNAKEFF_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_INEPNAKEFF_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_INEPNAKEFF_ACTIVE (0x1UL)

/* TXFEMP @Bit 7 : Transmit FIFO Empty (TxFEmp) */
  #define USBHSCORE_DIEPINT10_TXFEMP_Pos (7UL)
  #define USBHSCORE_DIEPINT10_TXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT10_TXFEMP_Pos)
  #define USBHSCORE_DIEPINT10_TXFEMP_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_TXFEMP_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_TXFEMP_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_TXFEMP_ACTIVE (0x1UL)

/* TXFIFOUNDRN @Bit 8 : Fifo Underrun (TxfifoUndrn) */
  #define USBHSCORE_DIEPINT10_TXFIFOUNDRN_Pos (8UL)
  #define USBHSCORE_DIEPINT10_TXFIFOUNDRN_Msk (0x1UL << USBHSCORE_DIEPINT10_TXFIFOUNDRN_Pos) /*!< Bit mask of TXFIFOUNDRN
                                                                            field.*/
  #define USBHSCORE_DIEPINT10_TXFIFOUNDRN_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_TXFIFOUNDRN_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_TXFIFOUNDRN_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_TXFIFOUNDRN_ACTIVE (0x1UL)

/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DIEPINT10_BNAINTR_Pos (9UL)
  #define USBHSCORE_DIEPINT10_BNAINTR_Msk (0x1UL << USBHSCORE_DIEPINT10_BNAINTR_Pos)
  #define USBHSCORE_DIEPINT10_BNAINTR_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_BNAINTR_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_BNAINTR_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_BNAINTR_ACTIVE (0x1UL)

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DIEPINT10_PKTDRPSTS_Pos (11UL)
  #define USBHSCORE_DIEPINT10_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DIEPINT10_PKTDRPSTS_Pos)
  #define USBHSCORE_DIEPINT10_PKTDRPSTS_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_PKTDRPSTS_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_PKTDRPSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_PKTDRPSTS_ACTIVE (0x1UL)

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DIEPINT10_BBLEERR_Pos (12UL)
  #define USBHSCORE_DIEPINT10_BBLEERR_Msk (0x1UL << USBHSCORE_DIEPINT10_BBLEERR_Pos)
  #define USBHSCORE_DIEPINT10_BBLEERR_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_BBLEERR_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_BBLEERR_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_BBLEERR_ACTIVE (0x1UL)

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DIEPINT10_NAKINTRPT_Pos (13UL)
  #define USBHSCORE_DIEPINT10_NAKINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT10_NAKINTRPT_Pos)
  #define USBHSCORE_DIEPINT10_NAKINTRPT_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_NAKINTRPT_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_NAKINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_NAKINTRPT_ACTIVE (0x1UL)

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DIEPINT10_NYETINTRPT_Pos (14UL)
  #define USBHSCORE_DIEPINT10_NYETINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT10_NYETINTRPT_Pos)
  #define USBHSCORE_DIEPINT10_NYETINTRPT_Min (0x0UL)
  #define USBHSCORE_DIEPINT10_NYETINTRPT_Max (0x1UL)
  #define USBHSCORE_DIEPINT10_NYETINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT10_NYETINTRPT_ACTIVE (0x1UL)


/* USBHSCORE_DIEPTSIZ10: Device IN Endpoint Transfer Size Register */
  #define USBHSCORE_DIEPTSIZ10_ResetValue (0x00000000UL)

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DIEPTSIZ10_XFERSIZE_Pos (0UL)
  #define USBHSCORE_DIEPTSIZ10_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DIEPTSIZ10_XFERSIZE_Pos)

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DIEPTSIZ10_PKTCNT_Pos (19UL)
  #define USBHSCORE_DIEPTSIZ10_PKTCNT_Msk (0x3FFUL << USBHSCORE_DIEPTSIZ10_PKTCNT_Pos)

/* MC @Bits 29..30 : MC */
  #define USBHSCORE_DIEPTSIZ10_MC_Pos (29UL)
  #define USBHSCORE_DIEPTSIZ10_MC_Msk (0x3UL << USBHSCORE_DIEPTSIZ10_MC_Pos)
  #define USBHSCORE_DIEPTSIZ10_MC_Min (0x1UL)
  #define USBHSCORE_DIEPTSIZ10_MC_Max (0x3UL)
  #define USBHSCORE_DIEPTSIZ10_MC_PACKETONE (0x1UL)
  #define USBHSCORE_DIEPTSIZ10_MC_PACKETTWO (0x2UL)
  #define USBHSCORE_DIEPTSIZ10_MC_PACKETTHREE (0x3UL)


/* USBHSCORE_DIEPDMA10: Device IN Endpoint DMA Address Register */
  #define USBHSCORE_DIEPDMA10_ResetValue (0x00000000UL)

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DIEPDMA10_DMAADDR_Pos (0UL)
  #define USBHSCORE_DIEPDMA10_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA10_DMAADDR_Pos)


/* USBHSCORE_DTXFSTS10: Device IN Endpoint Transmit FIFO Status Register */
  #define USBHSCORE_DTXFSTS10_ResetValue (0x00000200UL)

/* INEPTXFSPCAVAIL @Bits 0..15 : IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail) */
  #define USBHSCORE_DTXFSTS10_INEPTXFSPCAVAIL_Pos (0UL)
  #define USBHSCORE_DTXFSTS10_INEPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_DTXFSTS10_INEPTXFSPCAVAIL_Pos) /*!< Bit mask of
                                                                            INEPTXFSPCAVAIL field.*/


/* USBHSCORE_DIEPCTL11: Device Control IN Endpoint Control Register */
  #define USBHSCORE_DIEPCTL11_ResetValue (0x00000000UL)

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DIEPCTL11_MPS_Pos (0UL)
  #define USBHSCORE_DIEPCTL11_MPS_Msk (0x7FFUL << USBHSCORE_DIEPCTL11_MPS_Pos)

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DIEPCTL11_USBACTEP_Pos (15UL)
  #define USBHSCORE_DIEPCTL11_USBACTEP_Msk (0x1UL << USBHSCORE_DIEPCTL11_USBACTEP_Pos)
  #define USBHSCORE_DIEPCTL11_USBACTEP_Min (0x0UL)
  #define USBHSCORE_DIEPCTL11_USBACTEP_Max (0x1UL)
  #define USBHSCORE_DIEPCTL11_USBACTEP_DISABLED (0x0UL)
  #define USBHSCORE_DIEPCTL11_USBACTEP_ENABLED (0x1UL)

/* DPID @Bit 16 : (unspecified) */
  #define USBHSCORE_DIEPCTL11_DPID_Pos (16UL)
  #define USBHSCORE_DIEPCTL11_DPID_Msk (0x1UL << USBHSCORE_DIEPCTL11_DPID_Pos)
  #define USBHSCORE_DIEPCTL11_DPID_Min (0x0UL)
  #define USBHSCORE_DIEPCTL11_DPID_Max (0x1UL)
  #define USBHSCORE_DIEPCTL11_DPID_DATA0EVENFRM (0x0UL)
  #define USBHSCORE_DIEPCTL11_DPID_DATA1ODDFRM (0x1UL)

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DIEPCTL11_NAKSTS_Pos (17UL)
  #define USBHSCORE_DIEPCTL11_NAKSTS_Msk (0x1UL << USBHSCORE_DIEPCTL11_NAKSTS_Pos)
  #define USBHSCORE_DIEPCTL11_NAKSTS_Min (0x0UL)
  #define USBHSCORE_DIEPCTL11_NAKSTS_Max (0x1UL)
  #define USBHSCORE_DIEPCTL11_NAKSTS_NONNAK (0x0UL)
  #define USBHSCORE_DIEPCTL11_NAKSTS_NAK (0x1UL)

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DIEPCTL11_EPTYPE_Pos (18UL)
  #define USBHSCORE_DIEPCTL11_EPTYPE_Msk (0x3UL << USBHSCORE_DIEPCTL11_EPTYPE_Pos)
  #define USBHSCORE_DIEPCTL11_EPTYPE_Min (0x0UL)
  #define USBHSCORE_DIEPCTL11_EPTYPE_Max (0x3UL)
  #define USBHSCORE_DIEPCTL11_EPTYPE_CONTROL (0x0UL)
  #define USBHSCORE_DIEPCTL11_EPTYPE_ISOCHRONOUS (0x1UL)
  #define USBHSCORE_DIEPCTL11_EPTYPE_BULK (0x2UL)
  #define USBHSCORE_DIEPCTL11_EPTYPE_INTERRUP (0x3UL)

