pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INEPNAKEFF @Bit 6 : IN Endpoint NAK Effective (INEPNakEff) */
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_Pos (6UL)
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_Msk (0x1UL << USBHSCORE_DIEPINT11_INEPNAKEFF_Pos)
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_Min (0x0UL)
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_Max (0x1UL)
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT11_INEPNAKEFF_ACTIVE (0x1UL)

/* TXFEMP @Bit 7 : Transmit FIFO Empty (TxFEmp) */
  #define USBHSCORE_DIEPINT11_TXFEMP_Pos (7UL)
  #define USBHSCORE_DIEPINT11_TXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT11_TXFEMP_Pos)
  #define USBHSCORE_DIEPINT11_TXFEMP_Min (0x0UL)
  #define USBHSCORE_DIEPINT11_TXFEMP_Max (0x1UL)
  #define USBHSCORE_DIEPINT11_TXFEMP_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT11_TXFEMP_ACTIVE (0x1UL)

/* TXFIFOUNDRN @Bit 8 : Fifo Underrun (TxfifoUndrn) */
  #define USBHSCORE_DIEPINT11_TXFIFOUNDRN_Pos (8UL)
  #define USBHSCORE_DIEPINT11_TXFIFOUNDRN_Msk (0x1UL << USBHSCORE_DIEPINT11_TXFIFOUNDRN_Pos) /*!< Bit mask of TXFIFOUNDRN
                                                                            field.*/
  #define USBHSCORE_DIEPINT11_TXFIFOUNDRN_Min (0x0UL)
  #define USBHSCORE_DIEPINT11_TXFIFOUNDRN_Max (0x1UL)
  #define USBHSCORE_DIEPINT11_TXFIFOUNDRN_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT11_TXFIFOUNDRN_ACTIVE (0x1UL)

/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DIEPINT11_BNAINTR_Pos (9UL)
  #define USBHSCORE_DIEPINT11_BNAINTR_Msk (0x1UL << USBHSCORE_DIEPINT11_BNAINTR_Pos)
  #define USBHSCORE_DIEPINT11_BNAINTR_Min (0x0UL)
  #define USBHSCORE_DIEPINT11_BNAINTR_Max (0x1UL)
  #define USBHSCORE_DIEPINT11_BNAINTR_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT11_BNAINTR_ACTIVE (0x1UL)

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DIEPINT11_PKTDRPSTS_Pos (11UL)
  #define USBHSCORE_DIEPINT11_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DIEPINT11_PKTDRPSTS_Pos)
  #define USBHSCORE_DIEPINT11_PKTDRPSTS_Min (0x0UL)
  #define USBHSCORE_DIEPINT11_PKTDRPSTS_Max (0x1UL)
  #define USBHSCORE_DIEPINT11_PKTDRPSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT11_PKTDRPSTS_ACTIVE (0x1UL)

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DIEPINT11_BBLEERR_Pos (12UL)
  #define USBHSCORE_DIEPINT11_BBLEERR_Msk (0x1UL << USBHSCORE_DIEPINT11_BBLEERR_Pos)
  #define USBHSCORE_DIEPINT11_BBLEERR_Min (0x0UL)
  #define USBHSCORE_DIEPINT11_BBLEERR_Max (0x1UL)
  #define USBHSCORE_DIEPINT11_BBLEERR_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT11_BBLEERR_ACTIVE (0x1UL)

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DIEPINT11_NAKINTRPT_Pos (13UL)
  #define USBHSCORE_DIEPINT11_NAKINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT11_NAKINTRPT_Pos)
  #define USBHSCORE_DIEPINT11_NAKINTRPT_Min (0x0UL)
  #define USBHSCORE_DIEPINT11_NAKINTRPT_Max (0x1UL)
  #define USBHSCORE_DIEPINT11_NAKINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT11_NAKINTRPT_ACTIVE (0x1UL)

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DIEPINT11_NYETINTRPT_Pos (14UL)
  #define USBHSCORE_DIEPINT11_NYETINTRPT_Msk (0x1UL << USBHSCORE_DIEPINT11_NYETINTRPT_Pos)
  #define USBHSCORE_DIEPINT11_NYETINTRPT_Min (0x0UL)
  #define USBHSCORE_DIEPINT11_NYETINTRPT_Max (0x1UL)
  #define USBHSCORE_DIEPINT11_NYETINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DIEPINT11_NYETINTRPT_ACTIVE (0x1UL)


/* USBHSCORE_DIEPTSIZ11: Device IN Endpoint Transfer Size Register */
  #define USBHSCORE_DIEPTSIZ11_ResetValue (0x00000000UL)

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DIEPTSIZ11_XFERSIZE_Pos (0UL)
  #define USBHSCORE_DIEPTSIZ11_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DIEPTSIZ11_XFERSIZE_Pos)

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DIEPTSIZ11_PKTCNT_Pos (19UL)
  #define USBHSCORE_DIEPTSIZ11_PKTCNT_Msk (0x3FFUL << USBHSCORE_DIEPTSIZ11_PKTCNT_Pos)

/* MC @Bits 29..30 : MC */
  #define USBHSCORE_DIEPTSIZ11_MC_Pos (29UL)
  #define USBHSCORE_DIEPTSIZ11_MC_Msk (0x3UL << USBHSCORE_DIEPTSIZ11_MC_Pos)
  #define USBHSCORE_DIEPTSIZ11_MC_Min (0x1UL)
  #define USBHSCORE_DIEPTSIZ11_MC_Max (0x3UL)
  #define USBHSCORE_DIEPTSIZ11_MC_PACKETONE (0x1UL)
  #define USBHSCORE_DIEPTSIZ11_MC_PACKETTWO (0x2UL)
  #define USBHSCORE_DIEPTSIZ11_MC_PACKETTHREE (0x3UL)


/* USBHSCORE_DIEPDMA11: Device IN Endpoint DMA Address Register */
  #define USBHSCORE_DIEPDMA11_ResetValue (0x00000000UL)

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DIEPDMA11_DMAADDR_Pos (0UL)
  #define USBHSCORE_DIEPDMA11_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA11_DMAADDR_Pos)


/* USBHSCORE_DTXFSTS11: Device IN Endpoint Transmit FIFO Status Register */
  #define USBHSCORE_DTXFSTS11_ResetValue (0x00000200UL)

/* INEPTXFSPCAVAIL @Bits 0..15 : IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail) */
  #define USBHSCORE_DTXFSTS11_INEPTXFSPCAVAIL_Pos (0UL)
  #define USBHSCORE_DTXFSTS11_INEPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_DTXFSTS11_INEPTXFSPCAVAIL_Pos) /*!< Bit mask of
                                                                            INEPTXFSPCAVAIL field.*/


/* USBHSCORE_DOEPCTL0: Device Control OUT Endpoint 0 Control Register */
  #define USBHSCORE_DOEPCTL0_ResetValue (0x00008000UL)

/* MPS @Bits 0..1 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL0_MPS_Pos (0UL)
  #define USBHSCORE_DOEPCTL0_MPS_Msk (0x3UL << USBHSCORE_DOEPCTL0_MPS_Pos)
  #define USBHSCORE_DOEPCTL0_MPS_Min (0x0UL)
  #define USBHSCORE_DOEPCTL0_MPS_Max (0x3UL)
  #define USBHSCORE_DOEPCTL0_MPS_BYTE64 (0x0UL)
  #define USBHSCORE_DOEPCTL0_MPS_BYTE32 (0x1UL)
  #define USBHSCORE_DOEPCTL0_MPS_BYTE16 (0x2UL)
  #define USBHSCORE_DOEPCTL0_MPS_BYTE8 (0x3UL)

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Pos (15UL)
  #define USBHSCORE_DOEPCTL0_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL0_USBACTEP_Pos)
  #define USBHSCORE_DOEPCTL0_USBACTEP_Min (0x1UL)
  #define USBHSCORE_DOEPCTL0_USBACTEP_Max (0x1UL)
  #define USBHSCORE_DOEPCTL0_USBACTEP_ACTIVE (0x1UL)

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Pos (17UL)
  #define USBHSCORE_DOEPCTL0_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL0_NAKSTS_Pos)
  #define USBHSCORE_DOEPCTL0_NAKSTS_Min (0x0UL)
  #define USBHSCORE_DOEPCTL0_NAKSTS_Max (0x1UL)
  #define USBHSCORE_DOEPCTL0_NAKSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL0_NAKSTS_ACTIVE (0x1UL)

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Pos (18UL)
  #define USBHSCORE_DOEPCTL0_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL0_EPTYPE_Pos)
  #define USBHSCORE_DOEPCTL0_EPTYPE_Min (0x0UL)
  #define USBHSCORE_DOEPCTL0_EPTYPE_Max (0x0UL)
  #define USBHSCORE_DOEPCTL0_EPTYPE_ACTIVE (0x0UL)

