pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DOEPCTL0_STALL_Pos (21UL)
  #define USBHSCORE_DOEPCTL0_STALL_Msk (0x1UL << USBHSCORE_DOEPCTL0_STALL_Pos)
  #define USBHSCORE_DOEPCTL0_STALL_Min (0x0UL)
  #define USBHSCORE_DOEPCTL0_STALL_Max (0x1UL)
  #define USBHSCORE_DOEPCTL0_STALL_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL0_STALL_ACTIVE (0x1UL)

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DOEPCTL0_CNAK_Pos (26UL)
  #define USBHSCORE_DOEPCTL0_CNAK_Msk (0x1UL << USBHSCORE_DOEPCTL0_CNAK_Pos)
  #define USBHSCORE_DOEPCTL0_CNAK_Min (0x0UL)
  #define USBHSCORE_DOEPCTL0_CNAK_Max (0x1UL)
  #define USBHSCORE_DOEPCTL0_CNAK_NOCLEAR (0x0UL)
  #define USBHSCORE_DOEPCTL0_CNAK_CLEAR (0x1UL)

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DOEPCTL0_SNAK_Pos (27UL)
  #define USBHSCORE_DOEPCTL0_SNAK_Msk (0x1UL << USBHSCORE_DOEPCTL0_SNAK_Pos)
  #define USBHSCORE_DOEPCTL0_SNAK_Min (0x0UL)
  #define USBHSCORE_DOEPCTL0_SNAK_Max (0x1UL)
  #define USBHSCORE_DOEPCTL0_SNAK_NOSET (0x0UL)
  #define USBHSCORE_DOEPCTL0_SNAK_SET (0x1UL)

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DOEPCTL0_EPDIS_Pos (30UL)
  #define USBHSCORE_DOEPCTL0_EPDIS_Msk (0x1UL << USBHSCORE_DOEPCTL0_EPDIS_Pos)
  #define USBHSCORE_DOEPCTL0_EPDIS_Min (0x0UL)
  #define USBHSCORE_DOEPCTL0_EPDIS_Max (0x0UL)
  #define USBHSCORE_DOEPCTL0_EPDIS_INACTIVE (0x0UL)

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DOEPCTL0_EPENA_Pos (31UL)
  #define USBHSCORE_DOEPCTL0_EPENA_Msk (0x1UL << USBHSCORE_DOEPCTL0_EPENA_Pos)
  #define USBHSCORE_DOEPCTL0_EPENA_Min (0x0UL)
  #define USBHSCORE_DOEPCTL0_EPENA_Max (0x1UL)
  #define USBHSCORE_DOEPCTL0_EPENA_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL0_EPENA_ACTIVE (0x1UL)


/* USBHSCORE_DOEPINT0: Device OUT Endpoint 0 Interrupt Register */
  #define USBHSCORE_DOEPINT0_ResetValue (0x00000000UL)

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Pos (0UL)
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Msk (0x1UL << USBHSCORE_DOEPINT0_XFERCOMPL_Pos)
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_XFERCOMPL_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_XFERCOMPL_ACTIVE (0x1UL)

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Pos (1UL)
  #define USBHSCORE_DOEPINT0_EPDISBLD_Msk (0x1UL << USBHSCORE_DOEPINT0_EPDISBLD_Pos)
  #define USBHSCORE_DOEPINT0_EPDISBLD_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_EPDISBLD_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_EPDISBLD_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_EPDISBLD_ACTIVE (0x1UL)

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DOEPINT0_AHBERR_Pos (2UL)
  #define USBHSCORE_DOEPINT0_AHBERR_Msk (0x1UL << USBHSCORE_DOEPINT0_AHBERR_Pos)
  #define USBHSCORE_DOEPINT0_AHBERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_AHBERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_AHBERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_AHBERR_ACTIVE (0x1UL)

/* SETUP @Bit 3 : SETUP Phase Done (SetUp) */
  #define USBHSCORE_DOEPINT0_SETUP_Pos (3UL)
  #define USBHSCORE_DOEPINT0_SETUP_Msk (0x1UL << USBHSCORE_DOEPINT0_SETUP_Pos)
  #define USBHSCORE_DOEPINT0_SETUP_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_SETUP_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_SETUP_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_SETUP_ACTIVE (0x1UL)

/* OUTTKNEPDIS @Bit 4 : OUT Token Received When Endpoint Disabled (OUTTknEPdis) */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Pos (4UL)
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Msk (0x1UL << USBHSCORE_DOEPINT0_OUTTKNEPDIS_Pos)
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_ACTIVE (0x1UL)

/* STSPHSERCVD @Bit 5 : Status Phase Received for Control Write (StsPhseRcvd) */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Pos (5UL)
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Msk (0x1UL << USBHSCORE_DOEPINT0_STSPHSERCVD_Pos)
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_ACTIVE (0x1UL)

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received (Back2BackSETup) */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Pos (6UL)
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPINT0_BACK2BACKSETUP_Pos) /*!< Bit mask of BACK2BACKSETUP
                                                                            field.*/
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_ACTIVE (0x1UL)

/* OUTPKTERR @Bit 8 : OUT Packet Error (OutPktErr) */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Pos (8UL)
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Msk (0x1UL << USBHSCORE_DOEPINT0_OUTPKTERR_Pos)
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_OUTPKTERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_OUTPKTERR_ACTIVE (0x1UL)

/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DOEPINT0_BNAINTR_Pos (9UL)
  #define USBHSCORE_DOEPINT0_BNAINTR_Msk (0x1UL << USBHSCORE_DOEPINT0_BNAINTR_Pos)
  #define USBHSCORE_DOEPINT0_BNAINTR_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_BNAINTR_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_BNAINTR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_BNAINTR_ACTIVE (0x1UL)

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_Pos (11UL)
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DOEPINT0_PKTDRPSTS_Pos)
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_PKTDRPSTS_ACTIVE (0x1UL)

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DOEPINT0_BBLEERR_Pos (12UL)
  #define USBHSCORE_DOEPINT0_BBLEERR_Msk (0x1UL << USBHSCORE_DOEPINT0_BBLEERR_Pos)
  #define USBHSCORE_DOEPINT0_BBLEERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT0_BBLEERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT0_BBLEERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT0_BBLEERR_ACTIVE (0x1UL)

