pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DOEPINT3_BNAINTR_Pos (9UL)
  #define USBHSCORE_DOEPINT3_BNAINTR_Msk (0x1UL << USBHSCORE_DOEPINT3_BNAINTR_Pos)
  #define USBHSCORE_DOEPINT3_BNAINTR_Min (0x0UL)
  #define USBHSCORE_DOEPINT3_BNAINTR_Max (0x1UL)
  #define USBHSCORE_DOEPINT3_BNAINTR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT3_BNAINTR_ACTIVE (0x1UL)

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DOEPINT3_PKTDRPSTS_Pos (11UL)
  #define USBHSCORE_DOEPINT3_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DOEPINT3_PKTDRPSTS_Pos)
  #define USBHSCORE_DOEPINT3_PKTDRPSTS_Min (0x0UL)
  #define USBHSCORE_DOEPINT3_PKTDRPSTS_Max (0x1UL)
  #define USBHSCORE_DOEPINT3_PKTDRPSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT3_PKTDRPSTS_ACTIVE (0x1UL)

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DOEPINT3_BBLEERR_Pos (12UL)
  #define USBHSCORE_DOEPINT3_BBLEERR_Msk (0x1UL << USBHSCORE_DOEPINT3_BBLEERR_Pos)
  #define USBHSCORE_DOEPINT3_BBLEERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT3_BBLEERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT3_BBLEERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT3_BBLEERR_ACTIVE (0x1UL)

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DOEPINT3_NAKINTRPT_Pos (13UL)
  #define USBHSCORE_DOEPINT3_NAKINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT3_NAKINTRPT_Pos)
  #define USBHSCORE_DOEPINT3_NAKINTRPT_Min (0x0UL)
  #define USBHSCORE_DOEPINT3_NAKINTRPT_Max (0x1UL)
  #define USBHSCORE_DOEPINT3_NAKINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT3_NAKINTRPT_ACTIVE (0x1UL)

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DOEPINT3_NYETINTRPT_Pos (14UL)
  #define USBHSCORE_DOEPINT3_NYETINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT3_NYETINTRPT_Pos)
  #define USBHSCORE_DOEPINT3_NYETINTRPT_Min (0x0UL)
  #define USBHSCORE_DOEPINT3_NYETINTRPT_Max (0x1UL)
  #define USBHSCORE_DOEPINT3_NYETINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT3_NYETINTRPT_ACTIVE (0x1UL)

/* STUPPKTRCVD @Bit 15 : Setup Packet Received */
  #define USBHSCORE_DOEPINT3_STUPPKTRCVD_Pos (15UL)
  #define USBHSCORE_DOEPINT3_STUPPKTRCVD_Msk (0x1UL << USBHSCORE_DOEPINT3_STUPPKTRCVD_Pos)
  #define USBHSCORE_DOEPINT3_STUPPKTRCVD_Min (0x0UL)
  #define USBHSCORE_DOEPINT3_STUPPKTRCVD_Max (0x1UL)
  #define USBHSCORE_DOEPINT3_STUPPKTRCVD_NOT_RCVD (0x0UL)
  #define USBHSCORE_DOEPINT3_STUPPKTRCVD_RCVD (0x1UL)


/* USBHSCORE_DOEPTSIZ3: Device OUT Endpoint Transfer Size Register */
  #define USBHSCORE_DOEPTSIZ3_ResetValue (0x00000000UL)

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DOEPTSIZ3_XFERSIZE_Pos (0UL)
  #define USBHSCORE_DOEPTSIZ3_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DOEPTSIZ3_XFERSIZE_Pos)

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DOEPTSIZ3_PKTCNT_Pos (19UL)
  #define USBHSCORE_DOEPTSIZ3_PKTCNT_Msk (0x3FFUL << USBHSCORE_DOEPTSIZ3_PKTCNT_Pos)

/* RXDPID @Bits 29..30 : RxDPID */
  #define USBHSCORE_DOEPTSIZ3_RXDPID_Pos (29UL)
  #define USBHSCORE_DOEPTSIZ3_RXDPID_Msk (0x3UL << USBHSCORE_DOEPTSIZ3_RXDPID_Pos)
  #define USBHSCORE_DOEPTSIZ3_RXDPID_Min (0x0UL)
  #define USBHSCORE_DOEPTSIZ3_RXDPID_Max (0x3UL)
  #define USBHSCORE_DOEPTSIZ3_RXDPID_DATA0 (0x0UL)
  #define USBHSCORE_DOEPTSIZ3_RXDPID_DATA2PACKET1 (0x1UL)
  #define USBHSCORE_DOEPTSIZ3_RXDPID_DATA1PACKET2 (0x2UL)
  #define USBHSCORE_DOEPTSIZ3_RXDPID_MDATAPACKET3 (0x3UL)


/* USBHSCORE_DOEPDMA3: Device OUT Endpoint DMA Address Register */
  #define USBHSCORE_DOEPDMA3_ResetValue (0x00000000UL)

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA3_DMAADDR_Pos (0UL)
  #define USBHSCORE_DOEPDMA3_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA3_DMAADDR_Pos)


/* USBHSCORE_DOEPCTL4: Device Control OUT Endpoint Control Register */
  #define USBHSCORE_DOEPCTL4_ResetValue (0x00000000UL)

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL4_MPS_Pos (0UL)
  #define USBHSCORE_DOEPCTL4_MPS_Msk (0x7FFUL << USBHSCORE_DOEPCTL4_MPS_Pos)

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL4_USBACTEP_Pos (15UL)
  #define USBHSCORE_DOEPCTL4_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL4_USBACTEP_Pos)
  #define USBHSCORE_DOEPCTL4_USBACTEP_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_USBACTEP_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_USBACTEP_DISABLED (0x0UL)
  #define USBHSCORE_DOEPCTL4_USBACTEP_ENABLED (0x1UL)

/* DPID @Bit 16 : Endpoint Data PID (DPID) */
  #define USBHSCORE_DOEPCTL4_DPID_Pos (16UL)
  #define USBHSCORE_DOEPCTL4_DPID_Msk (0x1UL << USBHSCORE_DOEPCTL4_DPID_Pos)
  #define USBHSCORE_DOEPCTL4_DPID_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_DPID_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_DPID_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL4_DPID_ACTIVE (0x1UL)

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL4_NAKSTS_Pos (17UL)
  #define USBHSCORE_DOEPCTL4_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL4_NAKSTS_Pos)
  #define USBHSCORE_DOEPCTL4_NAKSTS_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_NAKSTS_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_NAKSTS_NONNAK (0x0UL)
  #define USBHSCORE_DOEPCTL4_NAKSTS_NAK (0x1UL)

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL4_EPTYPE_Pos (18UL)
  #define USBHSCORE_DOEPCTL4_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL4_EPTYPE_Pos)
  #define USBHSCORE_DOEPCTL4_EPTYPE_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_EPTYPE_Max (0x3UL)
  #define USBHSCORE_DOEPCTL4_EPTYPE_CONTROL (0x0UL)
  #define USBHSCORE_DOEPCTL4_EPTYPE_ISOCHRONOUS (0x1UL)
  #define USBHSCORE_DOEPCTL4_EPTYPE_BULK (0x2UL)
  #define USBHSCORE_DOEPCTL4_EPTYPE_INTERRUPT (0x3UL)

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DOEPCTL4_STALL_Pos (21UL)
  #define USBHSCORE_DOEPCTL4_STALL_Msk (0x1UL << USBHSCORE_DOEPCTL4_STALL_Pos)
  #define USBHSCORE_DOEPCTL4_STALL_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_STALL_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_STALL_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL4_STALL_ACTIVE (0x1UL)

/* CNAK @Bit 26 : (unspecified) */
  #define USBHSCORE_DOEPCTL4_CNAK_Pos (26UL)
  #define USBHSCORE_DOEPCTL4_CNAK_Msk (0x1UL << USBHSCORE_DOEPCTL4_CNAK_Pos)
  #define USBHSCORE_DOEPCTL4_CNAK_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_CNAK_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_CNAK_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL4_CNAK_ACTIVE (0x1UL)

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DOEPCTL4_SNAK_Pos (27UL)
  #define USBHSCORE_DOEPCTL4_SNAK_Msk (0x1UL << USBHSCORE_DOEPCTL4_SNAK_Pos)
  #define USBHSCORE_DOEPCTL4_SNAK_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_SNAK_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_SNAK_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL4_SNAK_ACTIVE (0x1UL)

