pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SETD0PID @Bit 28 : Set DATA0 PID (SetD0PID) */
  #define USBHSCORE_DOEPCTL4_SETD0PID_Pos (28UL)
  #define USBHSCORE_DOEPCTL4_SETD0PID_Msk (0x1UL << USBHSCORE_DOEPCTL4_SETD0PID_Pos)
  #define USBHSCORE_DOEPCTL4_SETD0PID_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_SETD0PID_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_SETD0PID_DISABLED (0x0UL)
  #define USBHSCORE_DOEPCTL4_SETD0PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA0 or Sets EO_FrNum field to odd
                                                           (micro)Frame*/

/* SETD1PID @Bit 29 : Set DATA1 PID (SetD1PID) */
  #define USBHSCORE_DOEPCTL4_SETD1PID_Pos (29UL)
  #define USBHSCORE_DOEPCTL4_SETD1PID_Msk (0x1UL << USBHSCORE_DOEPCTL4_SETD1PID_Pos)
  #define USBHSCORE_DOEPCTL4_SETD1PID_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_SETD1PID_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_SETD1PID_DISABLED (0x0UL)
  #define USBHSCORE_DOEPCTL4_SETD1PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA1 or Sets EO_FrNum field to odd
                                                           (micro)Frame*/

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DOEPCTL4_EPDIS_Pos (30UL)
  #define USBHSCORE_DOEPCTL4_EPDIS_Msk (0x1UL << USBHSCORE_DOEPCTL4_EPDIS_Pos)
  #define USBHSCORE_DOEPCTL4_EPDIS_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_EPDIS_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_EPDIS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL4_EPDIS_ACTIVE (0x1UL)

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DOEPCTL4_EPENA_Pos (31UL)
  #define USBHSCORE_DOEPCTL4_EPENA_Msk (0x1UL << USBHSCORE_DOEPCTL4_EPENA_Pos)
  #define USBHSCORE_DOEPCTL4_EPENA_Min (0x0UL)
  #define USBHSCORE_DOEPCTL4_EPENA_Max (0x1UL)
  #define USBHSCORE_DOEPCTL4_EPENA_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL4_EPENA_ACTIVE (0x1UL)


/* USBHSCORE_DOEPINT4: Device OUT Endpoint Interrupt Register */
  #define USBHSCORE_DOEPINT4_ResetValue (0x00000000UL)

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DOEPINT4_XFERCOMPL_Pos (0UL)
  #define USBHSCORE_DOEPINT4_XFERCOMPL_Msk (0x1UL << USBHSCORE_DOEPINT4_XFERCOMPL_Pos)
  #define USBHSCORE_DOEPINT4_XFERCOMPL_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_XFERCOMPL_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_XFERCOMPL_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_XFERCOMPL_ACTIVE (0x1UL)

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DOEPINT4_EPDISBLD_Pos (1UL)
  #define USBHSCORE_DOEPINT4_EPDISBLD_Msk (0x1UL << USBHSCORE_DOEPINT4_EPDISBLD_Pos)
  #define USBHSCORE_DOEPINT4_EPDISBLD_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_EPDISBLD_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_EPDISBLD_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_EPDISBLD_ACTIVE (0x1UL)

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DOEPINT4_AHBERR_Pos (2UL)
  #define USBHSCORE_DOEPINT4_AHBERR_Msk (0x1UL << USBHSCORE_DOEPINT4_AHBERR_Pos)
  #define USBHSCORE_DOEPINT4_AHBERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_AHBERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_AHBERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_AHBERR_ACTIVE (0x1UL)

/* SETUP @Bit 3 : SETUP Phase Done (SetUp) */
  #define USBHSCORE_DOEPINT4_SETUP_Pos (3UL)
  #define USBHSCORE_DOEPINT4_SETUP_Msk (0x1UL << USBHSCORE_DOEPINT4_SETUP_Pos)
  #define USBHSCORE_DOEPINT4_SETUP_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_SETUP_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_SETUP_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_SETUP_ACTIVE (0x1UL)

/* OUTTKNEPDIS @Bit 4 : OUT Token Received When Endpoint Disabled (OUTTknEPdis) */
  #define USBHSCORE_DOEPINT4_OUTTKNEPDIS_Pos (4UL)
  #define USBHSCORE_DOEPINT4_OUTTKNEPDIS_Msk (0x1UL << USBHSCORE_DOEPINT4_OUTTKNEPDIS_Pos)
  #define USBHSCORE_DOEPINT4_OUTTKNEPDIS_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_OUTTKNEPDIS_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_OUTTKNEPDIS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_OUTTKNEPDIS_ACTIVE (0x1UL)

/* STSPHSERCVD @Bit 5 : Status Phase Received for Control Write (StsPhseRcvd) */
  #define USBHSCORE_DOEPINT4_STSPHSERCVD_Pos (5UL)
  #define USBHSCORE_DOEPINT4_STSPHSERCVD_Msk (0x1UL << USBHSCORE_DOEPINT4_STSPHSERCVD_Pos)
  #define USBHSCORE_DOEPINT4_STSPHSERCVD_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_STSPHSERCVD_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_STSPHSERCVD_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_STSPHSERCVD_ACTIVE (0x1UL)

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received (Back2BackSETup) */
  #define USBHSCORE_DOEPINT4_BACK2BACKSETUP_Pos (6UL)
  #define USBHSCORE_DOEPINT4_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPINT4_BACK2BACKSETUP_Pos) /*!< Bit mask of BACK2BACKSETUP
                                                                            field.*/
  #define USBHSCORE_DOEPINT4_BACK2BACKSETUP_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_BACK2BACKSETUP_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_BACK2BACKSETUP_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_BACK2BACKSETUP_ACTIVE (0x1UL)

/* OUTPKTERR @Bit 8 : OUT Packet Error (OutPktErr) */
  #define USBHSCORE_DOEPINT4_OUTPKTERR_Pos (8UL)
  #define USBHSCORE_DOEPINT4_OUTPKTERR_Msk (0x1UL << USBHSCORE_DOEPINT4_OUTPKTERR_Pos)
  #define USBHSCORE_DOEPINT4_OUTPKTERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_OUTPKTERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_OUTPKTERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_OUTPKTERR_ACTIVE (0x1UL)

/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DOEPINT4_BNAINTR_Pos (9UL)
  #define USBHSCORE_DOEPINT4_BNAINTR_Msk (0x1UL << USBHSCORE_DOEPINT4_BNAINTR_Pos)
  #define USBHSCORE_DOEPINT4_BNAINTR_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_BNAINTR_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_BNAINTR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_BNAINTR_ACTIVE (0x1UL)

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_Pos (11UL)
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DOEPINT4_PKTDRPSTS_Pos)
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_PKTDRPSTS_ACTIVE (0x1UL)

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DOEPINT4_BBLEERR_Pos (12UL)
  #define USBHSCORE_DOEPINT4_BBLEERR_Msk (0x1UL << USBHSCORE_DOEPINT4_BBLEERR_Pos)
  #define USBHSCORE_DOEPINT4_BBLEERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT4_BBLEERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT4_BBLEERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT4_BBLEERR_ACTIVE (0x1UL)

