pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DOEPINT14_NAKINTRPT_Pos (13UL)
  #define USBHSCORE_DOEPINT14_NAKINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT14_NAKINTRPT_Pos)
  #define USBHSCORE_DOEPINT14_NAKINTRPT_Min (0x0UL)
  #define USBHSCORE_DOEPINT14_NAKINTRPT_Max (0x1UL)
  #define USBHSCORE_DOEPINT14_NAKINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT14_NAKINTRPT_ACTIVE (0x1UL)

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DOEPINT14_NYETINTRPT_Pos (14UL)
  #define USBHSCORE_DOEPINT14_NYETINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT14_NYETINTRPT_Pos)
  #define USBHSCORE_DOEPINT14_NYETINTRPT_Min (0x0UL)
  #define USBHSCORE_DOEPINT14_NYETINTRPT_Max (0x1UL)
  #define USBHSCORE_DOEPINT14_NYETINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT14_NYETINTRPT_ACTIVE (0x1UL)

/* STUPPKTRCVD @Bit 15 : Setup Packet Received */
  #define USBHSCORE_DOEPINT14_STUPPKTRCVD_Pos (15UL)
  #define USBHSCORE_DOEPINT14_STUPPKTRCVD_Msk (0x1UL << USBHSCORE_DOEPINT14_STUPPKTRCVD_Pos) /*!< Bit mask of STUPPKTRCVD
                                                                            field.*/
  #define USBHSCORE_DOEPINT14_STUPPKTRCVD_Min (0x0UL)
  #define USBHSCORE_DOEPINT14_STUPPKTRCVD_Max (0x1UL)
  #define USBHSCORE_DOEPINT14_STUPPKTRCVD_NOT_RCVD (0x0UL)
  #define USBHSCORE_DOEPINT14_STUPPKTRCVD_RCVD (0x1UL)


/* USBHSCORE_DOEPTSIZ14: Device OUT Endpoint Transfer Size Register */
  #define USBHSCORE_DOEPTSIZ14_ResetValue (0x00000000UL)

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DOEPTSIZ14_XFERSIZE_Pos (0UL)
  #define USBHSCORE_DOEPTSIZ14_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DOEPTSIZ14_XFERSIZE_Pos)

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DOEPTSIZ14_PKTCNT_Pos (19UL)
  #define USBHSCORE_DOEPTSIZ14_PKTCNT_Msk (0x3FFUL << USBHSCORE_DOEPTSIZ14_PKTCNT_Pos)

/* RXDPID @Bits 29..30 : RxDPID */
  #define USBHSCORE_DOEPTSIZ14_RXDPID_Pos (29UL)
  #define USBHSCORE_DOEPTSIZ14_RXDPID_Msk (0x3UL << USBHSCORE_DOEPTSIZ14_RXDPID_Pos)
  #define USBHSCORE_DOEPTSIZ14_RXDPID_Min (0x0UL)
  #define USBHSCORE_DOEPTSIZ14_RXDPID_Max (0x3UL)
  #define USBHSCORE_DOEPTSIZ14_RXDPID_DATA0 (0x0UL)
  #define USBHSCORE_DOEPTSIZ14_RXDPID_DATA2PACKET1 (0x1UL)
  #define USBHSCORE_DOEPTSIZ14_RXDPID_DATA1PACKET2 (0x2UL)
  #define USBHSCORE_DOEPTSIZ14_RXDPID_MDATAPACKET3 (0x3UL)


/* USBHSCORE_DOEPDMA14: Device OUT Endpoint DMA Address Register */
  #define USBHSCORE_DOEPDMA14_ResetValue (0x00000000UL)

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA14_DMAADDR_Pos (0UL)
  #define USBHSCORE_DOEPDMA14_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA14_DMAADDR_Pos)


/* USBHSCORE_DOEPCTL15: Device Control OUT Endpoint Control Register */
  #define USBHSCORE_DOEPCTL15_ResetValue (0x00000000UL)

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL15_MPS_Pos (0UL)
  #define USBHSCORE_DOEPCTL15_MPS_Msk (0x7FFUL << USBHSCORE_DOEPCTL15_MPS_Pos)

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL15_USBACTEP_Pos (15UL)
  #define USBHSCORE_DOEPCTL15_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL15_USBACTEP_Pos)
  #define USBHSCORE_DOEPCTL15_USBACTEP_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_USBACTEP_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_USBACTEP_DISABLED (0x0UL)
  #define USBHSCORE_DOEPCTL15_USBACTEP_ENABLED (0x1UL)

/* DPID @Bit 16 : Endpoint Data PID (DPID) */
  #define USBHSCORE_DOEPCTL15_DPID_Pos (16UL)
  #define USBHSCORE_DOEPCTL15_DPID_Msk (0x1UL << USBHSCORE_DOEPCTL15_DPID_Pos)
  #define USBHSCORE_DOEPCTL15_DPID_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_DPID_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_DPID_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL15_DPID_ACTIVE (0x1UL)

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL15_NAKSTS_Pos (17UL)
  #define USBHSCORE_DOEPCTL15_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL15_NAKSTS_Pos)
  #define USBHSCORE_DOEPCTL15_NAKSTS_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_NAKSTS_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_NAKSTS_NONNAK (0x0UL)
  #define USBHSCORE_DOEPCTL15_NAKSTS_NAK (0x1UL)

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL15_EPTYPE_Pos (18UL)
  #define USBHSCORE_DOEPCTL15_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL15_EPTYPE_Pos)
  #define USBHSCORE_DOEPCTL15_EPTYPE_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_EPTYPE_Max (0x3UL)
  #define USBHSCORE_DOEPCTL15_EPTYPE_CONTROL (0x0UL)
  #define USBHSCORE_DOEPCTL15_EPTYPE_ISOCHRONOUS (0x1UL)
  #define USBHSCORE_DOEPCTL15_EPTYPE_BULK (0x2UL)
  #define USBHSCORE_DOEPCTL15_EPTYPE_INTERRUPT (0x3UL)

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DOEPCTL15_STALL_Pos (21UL)
  #define USBHSCORE_DOEPCTL15_STALL_Msk (0x1UL << USBHSCORE_DOEPCTL15_STALL_Pos)
  #define USBHSCORE_DOEPCTL15_STALL_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_STALL_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_STALL_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL15_STALL_ACTIVE (0x1UL)

/* CNAK @Bit 26 : (unspecified) */
  #define USBHSCORE_DOEPCTL15_CNAK_Pos (26UL)
  #define USBHSCORE_DOEPCTL15_CNAK_Msk (0x1UL << USBHSCORE_DOEPCTL15_CNAK_Pos)
  #define USBHSCORE_DOEPCTL15_CNAK_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_CNAK_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_CNAK_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL15_CNAK_ACTIVE (0x1UL)

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DOEPCTL15_SNAK_Pos (27UL)
  #define USBHSCORE_DOEPCTL15_SNAK_Msk (0x1UL << USBHSCORE_DOEPCTL15_SNAK_Pos)
  #define USBHSCORE_DOEPCTL15_SNAK_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_SNAK_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_SNAK_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL15_SNAK_ACTIVE (0x1UL)

/* SETD0PID @Bit 28 : Set DATA0 PID (SetD0PID) */
  #define USBHSCORE_DOEPCTL15_SETD0PID_Pos (28UL)
  #define USBHSCORE_DOEPCTL15_SETD0PID_Msk (0x1UL << USBHSCORE_DOEPCTL15_SETD0PID_Pos)
  #define USBHSCORE_DOEPCTL15_SETD0PID_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_SETD0PID_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_SETD0PID_DISABLED (0x0UL)
  #define USBHSCORE_DOEPCTL15_SETD0PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA0 or Sets EO_FrNum field to odd
                                                            (micro)Frame*/

/* SETD1PID @Bit 29 : Set DATA1 PID (SetD1PID) */
  #define USBHSCORE_DOEPCTL15_SETD1PID_Pos (29UL)
  #define USBHSCORE_DOEPCTL15_SETD1PID_Msk (0x1UL << USBHSCORE_DOEPCTL15_SETD1PID_Pos)
  #define USBHSCORE_DOEPCTL15_SETD1PID_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_SETD1PID_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_SETD1PID_DISABLED (0x0UL)
  #define USBHSCORE_DOEPCTL15_SETD1PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA1 or Sets EO_FrNum field to odd
                                                            (micro)Frame*/

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DOEPCTL15_EPDIS_Pos (30UL)
  #define USBHSCORE_DOEPCTL15_EPDIS_Msk (0x1UL << USBHSCORE_DOEPCTL15_EPDIS_Pos)
  #define USBHSCORE_DOEPCTL15_EPDIS_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_EPDIS_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_EPDIS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL15_EPDIS_ACTIVE (0x1UL)

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DOEPCTL15_EPENA_Pos (31UL)
  #define USBHSCORE_DOEPCTL15_EPENA_Msk (0x1UL << USBHSCORE_DOEPCTL15_EPENA_Pos)
  #define USBHSCORE_DOEPCTL15_EPENA_Min (0x0UL)
  #define USBHSCORE_DOEPCTL15_EPENA_Max (0x1UL)
  #define USBHSCORE_DOEPCTL15_EPENA_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPCTL15_EPENA_ACTIVE (0x1UL)


/* USBHSCORE_DOEPINT15: Device OUT Endpoint Interrupt Register */
  #define USBHSCORE_DOEPINT15_ResetValue (0x00000000UL)

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DOEPINT15_XFERCOMPL_Pos (0UL)
  #define USBHSCORE_DOEPINT15_XFERCOMPL_Msk (0x1UL << USBHSCORE_DOEPINT15_XFERCOMPL_Pos)
  #define USBHSCORE_DOEPINT15_XFERCOMPL_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_XFERCOMPL_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_XFERCOMPL_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_XFERCOMPL_ACTIVE (0x1UL)

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DOEPINT15_EPDISBLD_Pos (1UL)
  #define USBHSCORE_DOEPINT15_EPDISBLD_Msk (0x1UL << USBHSCORE_DOEPINT15_EPDISBLD_Pos)
  #define USBHSCORE_DOEPINT15_EPDISBLD_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_EPDISBLD_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_EPDISBLD_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_EPDISBLD_ACTIVE (0x1UL)

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DOEPINT15_AHBERR_Pos (2UL)
  #define USBHSCORE_DOEPINT15_AHBERR_Msk (0x1UL << USBHSCORE_DOEPINT15_AHBERR_Pos)
  #define USBHSCORE_DOEPINT15_AHBERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_AHBERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_AHBERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_AHBERR_ACTIVE (0x1UL)

/* SETUP @Bit 3 : SETUP Phase Done (SetUp) */
  #define USBHSCORE_DOEPINT15_SETUP_Pos (3UL)
  #define USBHSCORE_DOEPINT15_SETUP_Msk (0x1UL << USBHSCORE_DOEPINT15_SETUP_Pos)
  #define USBHSCORE_DOEPINT15_SETUP_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_SETUP_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_SETUP_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_SETUP_ACTIVE (0x1UL)

/* OUTTKNEPDIS @Bit 4 : OUT Token Received When Endpoint Disabled (OUTTknEPdis) */
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_Pos (4UL)
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_Msk (0x1UL << USBHSCORE_DOEPINT15_OUTTKNEPDIS_Pos) /*!< Bit mask of OUTTKNEPDIS
                                                                            field.*/
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_OUTTKNEPDIS_ACTIVE (0x1UL)

/* STSPHSERCVD @Bit 5 : Status Phase Received for Control Write (StsPhseRcvd) */
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_Pos (5UL)
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_Msk (0x1UL << USBHSCORE_DOEPINT15_STSPHSERCVD_Pos) /*!< Bit mask of STSPHSERCVD
                                                                            field.*/
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_STSPHSERCVD_ACTIVE (0x1UL)

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received (Back2BackSETup) */
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_Pos (6UL)
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPINT15_BACK2BACKSETUP_Pos) /*!< Bit mask of
                                                                            BACK2BACKSETUP field.*/
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_BACK2BACKSETUP_ACTIVE (0x1UL)

/* OUTPKTERR @Bit 8 : OUT Packet Error (OutPktErr) */
  #define USBHSCORE_DOEPINT15_OUTPKTERR_Pos (8UL)
  #define USBHSCORE_DOEPINT15_OUTPKTERR_Msk (0x1UL << USBHSCORE_DOEPINT15_OUTPKTERR_Pos)
  #define USBHSCORE_DOEPINT15_OUTPKTERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_OUTPKTERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_OUTPKTERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_OUTPKTERR_ACTIVE (0x1UL)

