pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* BNAINTR @Bit 9 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_DOEPINT15_BNAINTR_Pos (9UL)
  #define USBHSCORE_DOEPINT15_BNAINTR_Msk (0x1UL << USBHSCORE_DOEPINT15_BNAINTR_Pos)
  #define USBHSCORE_DOEPINT15_BNAINTR_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_BNAINTR_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_BNAINTR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_BNAINTR_ACTIVE (0x1UL)

/* PKTDRPSTS @Bit 11 : Packet Drop Status (PktDrpSts) */
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_Pos (11UL)
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_Msk (0x1UL << USBHSCORE_DOEPINT15_PKTDRPSTS_Pos)
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_PKTDRPSTS_ACTIVE (0x1UL)

/* BBLEERR @Bit 12 : NAK Interrupt (BbleErr) */
  #define USBHSCORE_DOEPINT15_BBLEERR_Pos (12UL)
  #define USBHSCORE_DOEPINT15_BBLEERR_Msk (0x1UL << USBHSCORE_DOEPINT15_BBLEERR_Pos)
  #define USBHSCORE_DOEPINT15_BBLEERR_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_BBLEERR_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_BBLEERR_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_BBLEERR_ACTIVE (0x1UL)

/* NAKINTRPT @Bit 13 : NAK Interrupt (NAKInterrupt) */
  #define USBHSCORE_DOEPINT15_NAKINTRPT_Pos (13UL)
  #define USBHSCORE_DOEPINT15_NAKINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT15_NAKINTRPT_Pos)
  #define USBHSCORE_DOEPINT15_NAKINTRPT_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_NAKINTRPT_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_NAKINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_NAKINTRPT_ACTIVE (0x1UL)

/* NYETINTRPT @Bit 14 : NYET Interrupt (NYETIntrpt) */
  #define USBHSCORE_DOEPINT15_NYETINTRPT_Pos (14UL)
  #define USBHSCORE_DOEPINT15_NYETINTRPT_Msk (0x1UL << USBHSCORE_DOEPINT15_NYETINTRPT_Pos)
  #define USBHSCORE_DOEPINT15_NYETINTRPT_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_NYETINTRPT_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_NYETINTRPT_INACTIVE (0x0UL)
  #define USBHSCORE_DOEPINT15_NYETINTRPT_ACTIVE (0x1UL)

/* STUPPKTRCVD @Bit 15 : Setup Packet Received */
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_Pos (15UL)
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_Msk (0x1UL << USBHSCORE_DOEPINT15_STUPPKTRCVD_Pos) /*!< Bit mask of STUPPKTRCVD
                                                                            field.*/
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_Min (0x0UL)
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_Max (0x1UL)
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_NOT_RCVD (0x0UL)
  #define USBHSCORE_DOEPINT15_STUPPKTRCVD_RCVD (0x1UL)


/* USBHSCORE_DOEPTSIZ15: Device OUT Endpoint Transfer Size Register */
  #define USBHSCORE_DOEPTSIZ15_ResetValue (0x00000000UL)

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DOEPTSIZ15_XFERSIZE_Pos (0UL)
  #define USBHSCORE_DOEPTSIZ15_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DOEPTSIZ15_XFERSIZE_Pos)

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DOEPTSIZ15_PKTCNT_Pos (19UL)
  #define USBHSCORE_DOEPTSIZ15_PKTCNT_Msk (0x3FFUL << USBHSCORE_DOEPTSIZ15_PKTCNT_Pos)

/* RXDPID @Bits 29..30 : RxDPID */
  #define USBHSCORE_DOEPTSIZ15_RXDPID_Pos (29UL)
  #define USBHSCORE_DOEPTSIZ15_RXDPID_Msk (0x3UL << USBHSCORE_DOEPTSIZ15_RXDPID_Pos)
  #define USBHSCORE_DOEPTSIZ15_RXDPID_Min (0x0UL)
  #define USBHSCORE_DOEPTSIZ15_RXDPID_Max (0x3UL)
  #define USBHSCORE_DOEPTSIZ15_RXDPID_DATA0 (0x0UL)
  #define USBHSCORE_DOEPTSIZ15_RXDPID_DATA2PACKET1 (0x1UL)
  #define USBHSCORE_DOEPTSIZ15_RXDPID_DATA1PACKET2 (0x2UL)
  #define USBHSCORE_DOEPTSIZ15_RXDPID_MDATAPACKET3 (0x3UL)


/* USBHSCORE_DOEPDMA15: Device OUT Endpoint DMA Address Register */
  #define USBHSCORE_DOEPDMA15_ResetValue (0x00000000UL)

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DOEPDMA15_DMAADDR_Pos (0UL)
  #define USBHSCORE_DOEPDMA15_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DOEPDMA15_DMAADDR_Pos)


/* USBHSCORE_PCGCCTL: Power and Clock Gating Control Register */
  #define USBHSCORE_PCGCCTL_ResetValue (0x880A0000UL)

/* STOPPCLK @Bit 0 : Stop Pclk (StopPclk) */
  #define USBHSCORE_PCGCCTL_STOPPCLK_Pos (0UL)
  #define USBHSCORE_PCGCCTL_STOPPCLK_Msk (0x1UL << USBHSCORE_PCGCCTL_STOPPCLK_Pos)
  #define USBHSCORE_PCGCCTL_STOPPCLK_Min (0x0UL)
  #define USBHSCORE_PCGCCTL_STOPPCLK_Max (0x1UL)
  #define USBHSCORE_PCGCCTL_STOPPCLK_DISABLED (0x0UL)
  #define USBHSCORE_PCGCCTL_STOPPCLK_ENABLED (0x1UL)

/* GATEHCLK @Bit 1 : Gate Hclk (GateHclk) */
  #define USBHSCORE_PCGCCTL_GATEHCLK_Pos (1UL)
  #define USBHSCORE_PCGCCTL_GATEHCLK_Msk (0x1UL << USBHSCORE_PCGCCTL_GATEHCLK_Pos)
  #define USBHSCORE_PCGCCTL_GATEHCLK_Min (0x0UL)
  #define USBHSCORE_PCGCCTL_GATEHCLK_Max (0x1UL)
  #define USBHSCORE_PCGCCTL_GATEHCLK_DISABLED (0x0UL)
  #define USBHSCORE_PCGCCTL_GATEHCLK_ENABLED (0x1UL) /*!< Sets this bit to gate hclk to modules when the USB is suspended or the
                                                          session is not valid*/

/* RSTPDWNMODULE @Bit 3 : Reset Power-Down Modules (RstPdwnModule) */
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Pos (3UL)
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Msk (0x1UL << USBHSCORE_PCGCCTL_RSTPDWNMODULE_Pos) /*!< Bit mask of RSTPDWNMODULE
                                                                            field.*/
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Min (0x0UL)
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_Max (0x1UL)
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_ON (0x0UL)
  #define USBHSCORE_PCGCCTL_RSTPDWNMODULE_OFF (0x1UL)

/* ENBLL1GATING @Bit 5 : Enable Sleep Clock Gating */
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Pos (5UL)
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Msk (0x1UL << USBHSCORE_PCGCCTL_ENBLL1GATING_Pos)
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Min (0x0UL)
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_Max (0x1UL)
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_DISABLED (0x0UL)
  #define USBHSCORE_PCGCCTL_ENBLL1GATING_ENABLED (0x1UL)

/* PHYSLEEP @Bit 6 : PHY In Sleep */
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Pos (6UL)
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Msk (0x1UL << USBHSCORE_PCGCCTL_PHYSLEEP_Pos)
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Min (0x0UL)
  #define USBHSCORE_PCGCCTL_PHYSLEEP_Max (0x1UL)
  #define USBHSCORE_PCGCCTL_PHYSLEEP_INACTIVE (0x0UL)
  #define USBHSCORE_PCGCCTL_PHYSLEEP_ACTIVE (0x1UL)

/* L1SUSPENDED @Bit 7 : L1 Deep Sleep */
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Pos (7UL)
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Msk (0x1UL << USBHSCORE_PCGCCTL_L1SUSPENDED_Pos)
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Min (0x0UL)
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_Max (0x1UL)
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_INACTIVE (0x0UL)
  #define USBHSCORE_PCGCCTL_L1SUSPENDED_ACTIVE (0x1UL)

/* RESTOREMODE @Bit 9 : Restore Mode (RestoreMode) */
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Pos (9UL)
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Msk (0x1UL << USBHSCORE_PCGCCTL_RESTOREMODE_Pos)
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Min (0x0UL)
  #define USBHSCORE_PCGCCTL_RESTOREMODE_Max (0x1UL)
  #define USBHSCORE_PCGCCTL_RESTOREMODE_DISABLED (0x0UL) /*!< In Host mode,this bit indicates Host-initiated Resume and Reset.
                                                              In Device mode, this bit indicates Device-initiated Remote Wakeup*/
  #define USBHSCORE_PCGCCTL_RESTOREMODE_ENABLED (0x1UL) /*!< In Host mode,this bit indicates Device-initiated Remote Wakeup. In
                                                             Device mode, this bit indicates Host-initiated Resume and Reset*/

