pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ESSREGRESTORED @Bit 13 : Essential Register Values Restored (EssRegRestored) */
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Pos (13UL)
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Msk (0x1UL << USBHSCORE_PCGCCTL_ESSREGRESTORED_Pos) /*!< Bit mask of ESSREGRESTORED
                                                                            field.*/
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Min (0x0UL)
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_Max (0x1UL)
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_NOT_RESTORED (0x0UL)
  #define USBHSCORE_PCGCCTL_ESSREGRESTORED_RESTORED (0x1UL)

/* RESTOREVALUE @Bits 14..31 : Restore Value (RestoreValue) */
  #define USBHSCORE_PCGCCTL_RESTOREVALUE_Pos (14UL)
  #define USBHSCORE_PCGCCTL_RESTOREVALUE_Msk (0x3FFFFUL << USBHSCORE_PCGCCTL_RESTOREVALUE_Pos) /*!< Bit mask of RESTOREVALUE
                                                                            field.*/


/* USBHSCORE_GSTARFXDIS: Global STAR Fix Disable Register */
  #define USBHSCORE_GSTARFXDIS_ResetValue (0x00002200UL)

/* HOSTIGNORESRMTWKUPDIS @Bit 0 : Disable the STAR fix added for Device controller to go back to low power mode when Host
                                  ignores Remote wakeup */

  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Pos (0UL)
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Pos) /*!< Bit mask
                                                                            of HOSTIGNORESRMTWKUPDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Min (0x0UL)
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_Max (0x1UL)
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_ENABLE_FIX (0x0UL) /*!< Device controller goes back into SUSPENDED state
                                                                            when host ignores Remote Wakeup*/
  #define USBHSCORE_GSTARFXDIS_HOSTIGNORESRMTWKUPDIS_DISABLE_FIX (0x1UL) /*!< Device controller waits indefinitely without
                                                                            entering SUSPENDED state when host ignores the
                                                                            Remote Wakeup*/

/* RESUMEFRMCHKBUSDIS @Bit 1 : Disable the STAR fix added for Device controller to detect lineK and move to RESUMING state after
                               the 50us pull-up delay ends */

  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Pos (1UL)
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Pos) /*!< Bit mask of
                                                                            RESUMEFRMCHKBUSDIS field.*/
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Min (0x0UL)
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_Max (0x1UL)
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_ENABLE_FIX (0x0UL)
  #define USBHSCORE_GSTARFXDIS_RESUMEFRMCHKBUSDIS_DISABLE_FIX (0x1UL)

/* IGNORECTLOUTDATA0DIS @Bit 2 : Disable the STAR fix added for Device controller to reject DATA0 for the first Control OUT Data
                                 Phase and Control Status OUT Phase */

  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Pos (2UL)
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Pos) /*!< Bit mask
                                                                            of IGNORECTLOUTDATA0DIS field.*/
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Min (0x0UL)
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_Max (0x1UL)
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_ENABLE_FIX (0x0UL) /*!< Transaction Error reported when host sends DATA0
                                                                            PID*/
  #define USBHSCORE_GSTARFXDIS_IGNORECTLOUTDATA0DIS_DISABLE_FIX (0x1UL) /*!< Transaction Error not reported when host sends
                                                                            DATA0 PID*/

/* SSPLITSTALLNYETERRDIS @Bit 3 : Disable the STAR fix added for Host controller to flag error for SSPLIT STALL/NYET */
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Pos (3UL)
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Pos) /*!< Bit mask
                                                                            of SSPLITSTALLNYETERRDIS field.*/
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Min (0x0UL)
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_Max (0x1UL)
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_ENABLE_FIX (0x0UL) /*!< Transaction Error reported when device sends
                                                                            STALL/NYET for SSPLIT*/
  #define USBHSCORE_GSTARFXDIS_SSPLITSTALLNYETERRDIS_DISABLE_FIX (0x1UL) /*!< Transaction Error not reported when device sends
                                                                            STALL/NYET for SSPLIT*/

/* ACCEPTISOCSPLITDATA1DIS @Bit 4 : Disable the STAR fix added for Host controller to accept DATA1 PID from device for ISOC
                                    Split transfers */

  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Pos (4UL)
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Pos) /*!< Bit
                                                                            mask of ACCEPTISOCSPLITDATA1DIS field.*/
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Min (0x0UL)
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_Max (0x1UL)
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_ENABLE_FIX (0x0UL) /*!< Transaction Error not reported when device sends
                                                                            DATA1 PID for ISOC Split*/
  #define USBHSCORE_GSTARFXDIS_ACCEPTISOCSPLITDATA1DIS_DISABLE_FIX (0x1UL) /*!< Transaction Error reported when device sends
                                                                            DATA1 PID for ISOC Split*/

/* HANDLEFAULTYCABLEDIS @Bit 5 : Disable the STAR fix added for Host controller to handle Faulty cable scenarios */
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Pos (5UL)
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Pos) /*!< Bit mask
                                                                            of HANDLEFAULTYCABLEDIS field.*/
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Min (0x0UL)
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_Max (0x1UL)
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_ENABLE_FIX (0x0UL)
  #define USBHSCORE_GSTARFXDIS_HANDLEFAULTYCABLEDIS_DISABLE_FIX (0x1UL)

/* LSIPGINCRDIS @Bit 6 : Disable the STAR fix added for Host controller LS mode IPG increment from 2 LS bit times to 3 LS bit
                         times */

  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Pos (6UL)
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Pos) /*!< Bit mask of LSIPGINCRDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Min (0x0UL)
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_Max (0x1UL)
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_ENABLE_FIX (0x0UL)
  #define USBHSCORE_GSTARFXDIS_LSIPGINCRDIS_DISABLE_FIX (0x1UL)

/* FSDISCIDLEDIS @Bit 7 : Disable the STAR fix added for Device controller to transition to IDLE state during FS device
                          disconnect */

  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Pos (7UL)
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Pos) /*!< Bit mask of
                                                                            FSDISCIDLEDIS field.*/
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Min (0x0UL)
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_Max (0x1UL)
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_ENABLE_FIX (0x0UL) /*!< Device controller transitions to IDLE state during FS
                                                                     device disconnect*/
  #define USBHSCORE_GSTARFXDIS_FSDISCIDLEDIS_DISABLE_FIX (0x1UL) /*!< Device controller does not transition to IDLE state during
                                                                      FS device disconnect*/

/* CONCURRENTRMTWKUPUSBRESUMEDIS @Bit 8 : Disable the STAR fix added for Device controller to not start Remote Wakeup signalling
                                          when USB resume has already started */

  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Pos (8UL)
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Pos)
                                                                            /*!< Bit mask of CONCURRENTRMTWKUPUSBRESUMEDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Min (0x0UL) /*!< Min enumerator value of
                                                                            CONCURRENTRMTWKUPUSBRESUMEDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_Max (0x1UL) /*!< Max enumerator value of
                                                                            CONCURRENTRMTWKUPUSBRESUMEDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_ENABLE_FIX (0x0UL) /*!< Device controller does not start remote
                                                                            wakeup signalling when host resume has already
                                                                            started*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEDIS_DISABLE_FIX (0x1UL) /*!< Device controller is allowed to start
                                                                            remote wakeup signalling when host resume has
                                                                            already started*/

/* CONCURRENTRMTWKUPUSBRESUMEHIBDIS @Bit 9 : Disable the STAR fix added for Device controller to not hang when Remote Wakeup
                                             signalling clashes with Host resume */

  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Pos (9UL) /*!< Position of CONCURRENTRMTWKUPUSBRESUMEHIBDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Pos)
                                                                            /*!< Bit mask of CONCURRENTRMTWKUPUSBRESUMEHIBDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Min (0x0UL) /*!< Min enumerator value of
                                                                            CONCURRENTRMTWKUPUSBRESUMEHIBDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_Max (0x1UL) /*!< Max enumerator value of
                                                                            CONCURRENTRMTWKUPUSBRESUMEHIBDIS field.*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_ENABLE_FIX (0x0UL) /*!< Device controller does not hang when
                                                                            remote wakeup signalling clashes with host resume
                                                                            during Hibernation exit*/
  #define USBHSCORE_GSTARFXDIS_CONCURRENTRMTWKUPUSBRESUMEHIBDIS_DISABLE_FIX (0x1UL) /*!< Device controller hangs when remote
                                                                            wakeup signalling clashes with host resume during
                                                                            Hibernation exit*/

/* LSIPGCHKAFTERNAKSTALLFORINDIS @Bit 10 : Disable the STAR fix added for Host controller to wait for IPG duration to send next
                                           token after receiving NAK/STALL for previous IN token with FS/LS device */

  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Pos (10UL)
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Msk (0x1UL << USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Pos)
                                                                            /*!< Bit mask of LSIPGCHKAFTERNAKSTALLFORINDIS
                                                                            field.*/
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Min (0x0UL) /*!< Min enumerator value of
                                                                            LSIPGCHKAFTERNAKSTALLFORINDIS field.*/
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_Max (0x1UL) /*!< Max enumerator value of
                                                                            LSIPGCHKAFTERNAKSTALLFORINDIS field.*/
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_ENABLE_FIX (0x0UL) /*!< Host controller checks IPG after NAK/STALL
                                                                            for IN token*/
  #define USBHSCORE_GSTARFXDIS_LSIPGCHKAFTERNAKSTALLFORINDIS_DISABLE_FIX (0x1UL) /*!< Host controller does not check IPG after
                                                                            NAK/STALL for IN token*/

/* PHYIOPXCVRSELTXVLDCORRDIS @Bit 11 : Disable the STAR fix added for Host controller to increase the gap between
                                       utmi_xcvrselect switching and utmi_txvalid assertion in LS/FS mode */

