pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ACCESSTYPE @Bit 30 : Type of access. */
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Pos (30UL)
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Msk (0x1UL << VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Pos) /*!< Bit mask of ACCESSTYPE
                                                                            field.*/
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Min (0x0UL)
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Max (0x1UL)
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Memory (0x0UL)
  #define VDMADESCRIPTOR_CONFIG_ACCESSTYPE_Peripheral (0x1UL)

/* SELECTJOBENABLE @Bit 31 : Enables generation of event EVENTS_SELECTJOBDONE. */
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Pos (31UL)
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Msk (0x1UL << VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Pos) /*!< Bit mask of
                                                                            SELECTJOBENABLE field.*/
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Min (0x0UL)
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Max (0x1UL)
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Disable (0x0UL)
  #define VDMADESCRIPTOR_CONFIG_SELECTJOBENABLE_Enable (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            VPR                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* =================================================== Struct VPR_DEBUGIF ==================================================== */
/**
  * @brief DEBUGIF [VPR_DEBUGIF] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED[4];
  __IOM uint32_t  DATA0;
  __IOM uint32_t  DATA1;
  __IM  uint32_t  RESERVED1[10];
  __IOM uint32_t  DMCONTROL;
  __IM  uint32_t  DMSTATUS;
  __IOM uint32_t  HARTINFO;
  __IOM uint32_t  HALTSUM1;
  __IOM uint32_t  HAWINDOWSEL;
  __IOM uint32_t  HAWINDOW;
  __IOM uint32_t  ABSTRACTCS;
  __OM  uint32_t  ABSTRACTCMD;
  __IOM uint32_t  ABSTRACTAUTO;
  __IOM uint32_t  CONFSTRPTR[4];
  __IOM uint32_t  NEXTDM;
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  PROGBUF[16];
  __IOM uint32_t  AUTHDATA;
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  HALTSUM2;
  __IOM uint32_t  HALTSUM3;
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  SBADDRESS3;
  __IOM uint32_t  SBCS;
  __IOM uint32_t  SBADDRESS0;
  __IOM uint32_t  SBADDRESS1;
  __IOM uint32_t  SBADDRESS2;
  __IOM uint32_t  SBDATA0;
  __IOM uint32_t  SBDATA1;
  __IOM uint32_t  SBDATA2;
  __IOM uint32_t  SBDATA3;
  __IOM uint32_t  HALTSUM0;
} NRF_VPR_DEBUGIF_Type;

/* VPR_DEBUGIF_DATA0: Abstract Data 0. Read/write data for argument 0 */
  #define VPR_DEBUGIF_DATA0_ResetValue (0x00000000UL)

/* DATA0 @Bits 0..31 : Abstract Data 0 */
  #define VPR_DEBUGIF_DATA0_DATA0_Pos (0UL)
  #define VPR_DEBUGIF_DATA0_DATA0_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_DATA0_DATA0_Pos)


/* VPR_DEBUGIF_DATA1: Abstract Data 1. Read/write data for argument 1 */
  #define VPR_DEBUGIF_DATA1_ResetValue (0x00000000UL)

/* DATA1 @Bits 0..31 : Abstract Data 1 */
  #define VPR_DEBUGIF_DATA1_DATA1_Pos (0UL)
  #define VPR_DEBUGIF_DATA1_DATA1_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_DATA1_DATA1_Pos)


/* VPR_DEBUGIF_DMCONTROL: Debug Module Control */
  #define VPR_DEBUGIF_DMCONTROL_ResetValue (0x00000000UL)

/* DMACTIVE @Bit 0 : Reset signal for the debug module. */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos (0UL)
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos)
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Disabled (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled (0x1UL)

/* NDMRESET @Bit 1 : Reset signal output from the debug module to the system. */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos (1UL)
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos)
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Inactive (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Active (0x1UL)

/* CLRRESETHALTREQ @Bit 2 : Clear the halt on reset request. */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos (2UL)
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos) /*!< Bit mask of
                                                                            CLRRESETHALTREQ field.*/
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_NoOperation (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Clear (0x1UL)

/* SETRESETHALTREQ @Bit 3 : Set the halt on reset request. */
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Pos (3UL)
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Pos) /*!< Bit mask of
                                                                            SETRESETHALTREQ field.*/
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_NoOperation (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Clear (0x1UL)

/* HARTSELHI @Bits 6..15 : The high 10 bits of hartsel. */
  #define VPR_DEBUGIF_DMCONTROL_HARTSELHI_Pos (6UL)
  #define VPR_DEBUGIF_DMCONTROL_HARTSELHI_Msk (0x3FFUL << VPR_DEBUGIF_DMCONTROL_HARTSELHI_Pos) /*!< Bit mask of HARTSELHI
                                                                            field.*/

