pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* HARTSELLO @Bits 16..25 : The low 10 bits of hartsel. */
  #define VPR_DEBUGIF_DMCONTROL_HARTSELLO_Pos (16UL)
  #define VPR_DEBUGIF_DMCONTROL_HARTSELLO_Msk (0x3FFUL << VPR_DEBUGIF_DMCONTROL_HARTSELLO_Pos) /*!< Bit mask of HARTSELLO
                                                                            field.*/

/* HASEL @Bit 26 : Definition of currently selected harts. */
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Pos (26UL)
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_HASEL_Pos)
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Single (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Multiple (0x1UL)

/* ACKHAVERESET @Bit 28 : Clear the havereset. */
  #define VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Pos (28UL)
  #define VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Pos) /*!< Bit mask of ACKHAVERESET
                                                                            field.*/
  #define VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_NoOperation (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_ACKHAVERESET_Clear (0x1UL)

/* HARTRESET @Bit 29 : Reset harts. */
  #define VPR_DEBUGIF_DMCONTROL_HARTRESET_Pos (29UL)
  #define VPR_DEBUGIF_DMCONTROL_HARTRESET_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_HARTRESET_Pos)
  #define VPR_DEBUGIF_DMCONTROL_HARTRESET_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_HARTRESET_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_HARTRESET_Deasserted (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_HARTRESET_Asserted (0x1UL)

/* RESUMEREQ @Bit 30 : Resume currently selected harts. */
  #define VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Pos (30UL)
  #define VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Pos)
  #define VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_RESUMEREQ_NoOperation (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_RESUMEREQ_Resumed (0x1UL)

/* HALTREQ @Bit 31 : Halt currently selected harts. */
  #define VPR_DEBUGIF_DMCONTROL_HALTREQ_Pos (31UL)
  #define VPR_DEBUGIF_DMCONTROL_HALTREQ_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_HALTREQ_Pos)
  #define VPR_DEBUGIF_DMCONTROL_HALTREQ_Min (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_HALTREQ_Max (0x1UL)
  #define VPR_DEBUGIF_DMCONTROL_HALTREQ_Clear (0x0UL)
  #define VPR_DEBUGIF_DMCONTROL_HALTREQ_Halt (0x1UL)


/* VPR_DEBUGIF_DMSTATUS: Debug Module Status */
  #define VPR_DEBUGIF_DMSTATUS_ResetValue (0x00400082UL)

/* VERSION @Bits 0..3 : Version of the debug module. */
  #define VPR_DEBUGIF_DMSTATUS_VERSION_Pos (0UL)
  #define VPR_DEBUGIF_DMSTATUS_VERSION_Msk (0xFUL << VPR_DEBUGIF_DMSTATUS_VERSION_Pos)
  #define VPR_DEBUGIF_DMSTATUS_VERSION_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_VERSION_Max (0xFUL)
  #define VPR_DEBUGIF_DMSTATUS_VERSION_NotPresent (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_VERSION_V011 (0x1UL)  /*!< There is a Debug Module and it conforms to version 0.11 of this
                                                          specifcation.*/
  #define VPR_DEBUGIF_DMSTATUS_VERSION_V013 (0x2UL)  /*!< There is a Debug Module and it conforms to version 0.13 of this
                                                          specifcation.*/
  #define VPR_DEBUGIF_DMSTATUS_VERSION_NonConform (0xFUL) /*!< There is a Debug Module but it does not conform to any available
                                                               version of the spec.*/

/* CONFSTRPTRVALID @Bit 4 : Configuration string. */
  #define VPR_DEBUGIF_DMSTATUS_CONFSTRPTRVALID_Pos (4UL)
  #define VPR_DEBUGIF_DMSTATUS_CONFSTRPTRVALID_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_CONFSTRPTRVALID_Pos) /*!< Bit mask of
                                                                            CONFSTRPTRVALID field.*/
  #define VPR_DEBUGIF_DMSTATUS_CONFSTRPTRVALID_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_CONFSTRPTRVALID_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_CONFSTRPTRVALID_NotRelevant (0x0UL) /*!< The confstrptr0..confstrptr3 holds information which is
                                                                        not relevant to the configuration string.*/
  #define VPR_DEBUGIF_DMSTATUS_CONFSTRPTRVALID_Address (0x1UL) /*!< The confstrptr0..confstrptr3 holds the address of the
                                                                    configuration string.*/

/* HASRESETHALTREQ @Bit 5 : Halt-on-reset support status. */
  #define VPR_DEBUGIF_DMSTATUS_HASRESETHALTREQ_Pos (5UL)
  #define VPR_DEBUGIF_DMSTATUS_HASRESETHALTREQ_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_HASRESETHALTREQ_Pos) /*!< Bit mask of
                                                                            HASRESETHALTREQ field.*/
  #define VPR_DEBUGIF_DMSTATUS_HASRESETHALTREQ_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_HASRESETHALTREQ_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_HASRESETHALTREQ_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_HASRESETHALTREQ_Yes (0x1UL)

/* AUTHBUSY @Bit 6 : Authentication busy status. */
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Pos (6UL)
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Pos)
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_AUTHBUSY_Yes (0x1UL)

/* AUTHENTICATED @Bit 7 : Authentication status. */
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Pos (7UL)
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Pos) /*!< Bit mask of
                                                                            AUTHENTICATED field.*/
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_AUTHENTICATED_Yes (0x1UL)

