pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* ANYHALTED @Bit 8 : Any currently selected harts halted status. */
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Pos (8UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYHALTED_Pos)
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYHALTED_Yes (0x1UL)

/* ALLHALTED @Bit 9 : All currently selected harts halted status. */
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Pos (9UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ALLHALTED_Pos)
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLHALTED_Yes (0x1UL)

/* ANYRUNNING @Bit 10 : Any currently selected harts running status. */
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Pos (10UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Pos)
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYRUNNING_Yes (0x1UL)

/* ALLRUNNING @Bit 11 : All currently selected harts running status. */
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Pos (11UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Pos)
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLRUNNING_Yes (0x1UL)

/* ANYUNAVAIL @Bit 12 : Any currently selected harts unavailable status. */
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Pos (12UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Pos)
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYUNAVAIL_Yes (0x1UL)

/* ALLUNAVAIL @Bit 13 : All currently selected harts unavailable status. */
  #define VPR_DEBUGIF_DMSTATUS_ALLUNAVAIL_Pos (13UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLUNAVAIL_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ALLUNAVAIL_Pos)
  #define VPR_DEBUGIF_DMSTATUS_ALLUNAVAIL_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLUNAVAIL_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLUNAVAIL_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLUNAVAIL_Yes (0x1UL)

/* ANYNONEXISTENT @Bit 14 : Any currently selected harts nonexistent status. */
  #define VPR_DEBUGIF_DMSTATUS_ANYNONEXISTENT_Pos (14UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYNONEXISTENT_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYNONEXISTENT_Pos) /*!< Bit mask of
                                                                            ANYNONEXISTENT field.*/
  #define VPR_DEBUGIF_DMSTATUS_ANYNONEXISTENT_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYNONEXISTENT_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYNONEXISTENT_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYNONEXISTENT_Yes (0x1UL)

/* ALLNONEXISTENT @Bit 15 : All currently selected harts nonexistent status. */
  #define VPR_DEBUGIF_DMSTATUS_ALLNONEXISTENT_Pos (15UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLNONEXISTENT_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ALLNONEXISTENT_Pos) /*!< Bit mask of
                                                                            ALLNONEXISTENT field.*/
  #define VPR_DEBUGIF_DMSTATUS_ALLNONEXISTENT_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLNONEXISTENT_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLNONEXISTENT_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLNONEXISTENT_Yes (0x1UL)

/* ANYRESUMEACK @Bit 16 : Any currently selected harts acknowledged last resume request. */
  #define VPR_DEBUGIF_DMSTATUS_ANYRESUMEACK_Pos (16UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYRESUMEACK_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYRESUMEACK_Pos) /*!< Bit mask of ANYRESUMEACK
                                                                            field.*/
  #define VPR_DEBUGIF_DMSTATUS_ANYRESUMEACK_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYRESUMEACK_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYRESUMEACK_No (0x0UL) /*!< None of the currently selected harts acknowledged last resume
                                                            request.*/
  #define VPR_DEBUGIF_DMSTATUS_ANYRESUMEACK_Yes (0x1UL) /*!< Any of the currently selected harts acknowledged last resume
                                                             request.*/

/* ALLRESUMEACK @Bit 17 : All currently selected harts acknowledged last resume */
  #define VPR_DEBUGIF_DMSTATUS_ALLRESUMEACK_Pos (17UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLRESUMEACK_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ALLRESUMEACK_Pos) /*!< Bit mask of ALLRESUMEACK
                                                                            field.*/
  #define VPR_DEBUGIF_DMSTATUS_ALLRESUMEACK_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLRESUMEACK_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLRESUMEACK_No (0x0UL) /*!< Not all of the currently selected harts acknowledged last resume
                                                            request.*/
  #define VPR_DEBUGIF_DMSTATUS_ALLRESUMEACK_Yes (0x1UL) /*!< All of the currently selected harts acknowledged last resume
                                                             request.*/

/* ANYHAVERESET @Bit 18 : Any currently selected harts have been reset and reset is not acknowledged. */
  #define VPR_DEBUGIF_DMSTATUS_ANYHAVERESET_Pos (18UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYHAVERESET_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ANYHAVERESET_Pos) /*!< Bit mask of ANYHAVERESET
                                                                            field.*/
  #define VPR_DEBUGIF_DMSTATUS_ANYHAVERESET_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYHAVERESET_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ANYHAVERESET_No (0x0UL) /*!< None of the currently selected harts have been reset and reset is
                                                            not acknowledget.*/
  #define VPR_DEBUGIF_DMSTATUS_ANYHAVERESET_Yes (0x1UL) /*!< Any of the currently selected harts have been reset and reset is
                                                             not acknowledge.*/

/* ALLHAVERESET @Bit 19 : All currently selected harts have been reset and reset is not acknowledge */
  #define VPR_DEBUGIF_DMSTATUS_ALLHAVERESET_Pos (19UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLHAVERESET_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_ALLHAVERESET_Pos) /*!< Bit mask of ALLHAVERESET
                                                                            field.*/
  #define VPR_DEBUGIF_DMSTATUS_ALLHAVERESET_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLHAVERESET_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_ALLHAVERESET_No (0x0UL) /*!< Not all of the currently selected harts have been reset and reset is
                                                            not acknowledge.*/
  #define VPR_DEBUGIF_DMSTATUS_ALLHAVERESET_Yes (0x1UL) /*!< All of the currently selected harts have been reset and reset is
                                                             not acknowledge.*/

/* IMPEBREAK @Bit 22 : Implicit ebreak instruction at the non-existent word immediately after the Program Buffer. */
  #define VPR_DEBUGIF_DMSTATUS_IMPEBREAK_Pos (22UL)
  #define VPR_DEBUGIF_DMSTATUS_IMPEBREAK_Msk (0x1UL << VPR_DEBUGIF_DMSTATUS_IMPEBREAK_Pos)
  #define VPR_DEBUGIF_DMSTATUS_IMPEBREAK_Min (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_IMPEBREAK_Max (0x1UL)
  #define VPR_DEBUGIF_DMSTATUS_IMPEBREAK_No (0x0UL)
  #define VPR_DEBUGIF_DMSTATUS_IMPEBREAK_Yes (0x1UL)


