pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VPR_DEBUGIF_HARTINFO: Hart Information */
  #define VPR_DEBUGIF_HARTINFO_ResetValue (0x00000000UL)

/* DATAADDR @Bits 0..11 : Data Address */
  #define VPR_DEBUGIF_HARTINFO_DATAADDR_Pos (0UL)
  #define VPR_DEBUGIF_HARTINFO_DATAADDR_Msk (0xFFFUL << VPR_DEBUGIF_HARTINFO_DATAADDR_Pos)
  #define VPR_DEBUGIF_HARTINFO_DATAADDR_Min (0x800UL)
  #define VPR_DEBUGIF_HARTINFO_DATAADDR_Max (0x7FFUL)

/* DATASIZE @Bits 12..15 : Data Size */
  #define VPR_DEBUGIF_HARTINFO_DATASIZE_Pos (12UL)
  #define VPR_DEBUGIF_HARTINFO_DATASIZE_Msk (0xFUL << VPR_DEBUGIF_HARTINFO_DATASIZE_Pos)
  #define VPR_DEBUGIF_HARTINFO_DATASIZE_Min (0x0UL)
  #define VPR_DEBUGIF_HARTINFO_DATASIZE_Max (0xCUL)

/* DATAACCESS @Bit 16 : Data Access */
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Pos (16UL)
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Msk (0x1UL << VPR_DEBUGIF_HARTINFO_DATAACCESS_Pos)
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Min (0x0UL)
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Max (0x1UL)
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_No (0x0UL) /*!< The data registers are shadowed in the hart by CSRs. Each CSR is DXLEN
                                                          bits in size, and corresponds to a single argument.*/
  #define VPR_DEBUGIF_HARTINFO_DATAACCESS_Yes (0x1UL) /*!< The data registers are shadowed in the hart's memory map. Each
                                                           register takes up 4 bytes in the memory map.*/

/* NSCRATCH @Bits 20..23 : Number of dscratch registers */
  #define VPR_DEBUGIF_HARTINFO_NSCRATCH_Pos (20UL)
  #define VPR_DEBUGIF_HARTINFO_NSCRATCH_Msk (0xFUL << VPR_DEBUGIF_HARTINFO_NSCRATCH_Pos)


/* VPR_DEBUGIF_HALTSUM1: Halt Summary 1 */
  #define VPR_DEBUGIF_HALTSUM1_ResetValue (0x00000000UL)

/* HALTSUM1 @Bits 0..31 : Halt Summary 1 */
  #define VPR_DEBUGIF_HALTSUM1_HALTSUM1_Pos (0UL)
  #define VPR_DEBUGIF_HALTSUM1_HALTSUM1_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HALTSUM1_HALTSUM1_Pos) /*!< Bit mask of HALTSUM1
                                                                            field.*/


/* VPR_DEBUGIF_HAWINDOWSEL: Hart Array Window Select */
  #define VPR_DEBUGIF_HAWINDOWSEL_ResetValue (0x00000000UL)

/* HAWINDOWSEL @Bits 0..14 : The high bits of this field may be tied to 0, depending on how large the array mask register is.
                             E.g. on a system with 48 harts only bit 0 of this field may actually be writable. */

  #define VPR_DEBUGIF_HAWINDOWSEL_HAWINDOWSEL_Pos (0UL)
  #define VPR_DEBUGIF_HAWINDOWSEL_HAWINDOWSEL_Msk (0x7FFFUL << VPR_DEBUGIF_HAWINDOWSEL_HAWINDOWSEL_Pos) /*!< Bit mask of
                                                                            HAWINDOWSEL field.*/


/* VPR_DEBUGIF_HAWINDOW: Hart Array Window */
  #define VPR_DEBUGIF_HAWINDOW_ResetValue (0x00000000UL)

/* MASKDATA @Bits 0..31 : Mask data. */
  #define VPR_DEBUGIF_HAWINDOW_MASKDATA_Pos (0UL)
  #define VPR_DEBUGIF_HAWINDOW_MASKDATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HAWINDOW_MASKDATA_Pos) /*!< Bit mask of MASKDATA
                                                                            field.*/


/* VPR_DEBUGIF_ABSTRACTCS: Abstract Control and Status */
  #define VPR_DEBUGIF_ABSTRACTCS_ResetValue (0x01000002UL)

/* DATACOUNT @Bits 0..3 : Number of data registers that are implemented as part of the abstract command interface. Valid sizes
                          are 1..12. */

  #define VPR_DEBUGIF_ABSTRACTCS_DATACOUNT_Pos (0UL)
  #define VPR_DEBUGIF_ABSTRACTCS_DATACOUNT_Msk (0xFUL << VPR_DEBUGIF_ABSTRACTCS_DATACOUNT_Pos) /*!< Bit mask of DATACOUNT
                                                                            field.*/

/* CMDERR @Bits 8..10 : Command error when the abstract command fails. */
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Pos (8UL)
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Msk (0x7UL << VPR_DEBUGIF_ABSTRACTCS_CMDERR_Pos)
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Min (0x0UL)
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Max (0x7UL)
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_NoError (0x0UL)
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Busy (0x1UL) /*!< An abstract command was executing while command, abstractcs, or
                                                          abstractauto was written, or when one of the data or progbuf registers
                                                          was read or written. This status is only written if cmderr contains 0*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_NotSupported (0x2UL) /*!< The requested command is notsupported, regardless of whether
                                                                  the hart is running or not.*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Exception (0x3UL) /*!< An exception occurred while executing the command (e.g. while
                                                               executing theProgram Buffer).*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_HaltResume (0x4UL) /*!< The abstract command couldn't execute because the hart wasn't in
                                                                the required state (running/halted). or unavailable.*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Bus (0x5UL)  /*!< The abstract command failed due to abus error (e.g. alignment, access
                                                          size, or timeout).*/
  #define VPR_DEBUGIF_ABSTRACTCS_CMDERR_Other (0x7UL)

/* BUSY @Bit 12 : Abstract command execution status. */
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Pos (12UL)
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Msk (0x1UL << VPR_DEBUGIF_ABSTRACTCS_BUSY_Pos)
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Min (0x0UL)
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Max (0x1UL)
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_NotBusy (0x0UL)
  #define VPR_DEBUGIF_ABSTRACTCS_BUSY_Busy (0x1UL)   /*!< An abstract command is currently being executed. This bit is set as
                                                          soon as command is written, and is not cleared until that command has
                                                          completed.*/

/* PROGBUFSIZE @Bits 24..28 : Size of the Program Buffer, in 32-bit words. Valid sizes are 0 - 1. */
  #define VPR_DEBUGIF_ABSTRACTCS_PROGBUFSIZE_Pos (24UL)
  #define VPR_DEBUGIF_ABSTRACTCS_PROGBUFSIZE_Msk (0x1FUL << VPR_DEBUGIF_ABSTRACTCS_PROGBUFSIZE_Pos) /*!< Bit mask of PROGBUFSIZE
                                                                            field.*/


/* VPR_DEBUGIF_ABSTRACTCMD: Abstract command */
  #define VPR_DEBUGIF_ABSTRACTCMD_ResetValue (0x00000000UL)

/* CONTROL @Bits 0..23 : This Field is interpreted in a command specific manner, described for each abstract command. */
  #define VPR_DEBUGIF_ABSTRACTCMD_CONTROL_Pos (0UL)
  #define VPR_DEBUGIF_ABSTRACTCMD_CONTROL_Msk (0xFFFFFFUL << VPR_DEBUGIF_ABSTRACTCMD_CONTROL_Pos) /*!< Bit mask of CONTROL
                                                                            field.*/

/* CMDTYPE @Bits 24..31 : The type determines the overall functionality of this abstract command. */
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Pos (24UL)
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Msk (0xFFUL << VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Pos)
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Min (0x0UL)
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_Max (0x2UL)
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_REGACCESS (0x00UL)
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_QUICKACCESS (0x01UL)
  #define VPR_DEBUGIF_ABSTRACTCMD_CMDTYPE_MEMACCESS (0x02UL)


