pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VPR_DEBUGIF_ABSTRACTAUTO: Abstract Command Autoexec */
  #define VPR_DEBUGIF_ABSTRACTAUTO_ResetValue (0x00000000UL)

/* AUTOEXECDATA @Bits 0..11 : When a bit in this field is 1, read or write accesses to the corresponding data word cause the
                              command in command to be executed again. */

  #define VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECDATA_Pos (0UL)
  #define VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECDATA_Msk (0xFFFUL << VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECDATA_Pos) /*!< Bit mask of
                                                                            AUTOEXECDATA field.*/

/* AUTOEXECPROGBUF @Bits 16..31 : When a bit in this field is 1, read or write accesses to the corresponding progbuf word cause
                                  the command in command to be executed again. */

  #define VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECPROGBUF_Pos (16UL)
  #define VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECPROGBUF_Msk (0xFFFFUL << VPR_DEBUGIF_ABSTRACTAUTO_AUTOEXECPROGBUF_Pos) /*!< Bit mask
                                                                            of AUTOEXECPROGBUF field.*/


/* VPR_DEBUGIF_CONFSTRPTR: Configuration String Pointer [n] */
  #define VPR_DEBUGIF_CONFSTRPTR_MaxCount (4UL)
  #define VPR_DEBUGIF_CONFSTRPTR_MaxIndex (3UL)
  #define VPR_DEBUGIF_CONFSTRPTR_MinIndex (0UL)
  #define VPR_DEBUGIF_CONFSTRPTR_ResetValue (0x00000000UL)

/* ADDR @Bits 0..31 : Address */
  #define VPR_DEBUGIF_CONFSTRPTR_ADDR_Pos (0UL)
  #define VPR_DEBUGIF_CONFSTRPTR_ADDR_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_CONFSTRPTR_ADDR_Pos)


/* VPR_DEBUGIF_NEXTDM: Next Debug Module */
  #define VPR_DEBUGIF_NEXTDM_ResetValue (0x00000000UL)

/* ADDR @Bits 0..31 : Address */
  #define VPR_DEBUGIF_NEXTDM_ADDR_Pos (0UL)
  #define VPR_DEBUGIF_NEXTDM_ADDR_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_NEXTDM_ADDR_Pos)


/* VPR_DEBUGIF_PROGBUF: Program Buffer [n] */
  #define VPR_DEBUGIF_PROGBUF_MaxCount (16UL)
  #define VPR_DEBUGIF_PROGBUF_MaxIndex (15UL)
  #define VPR_DEBUGIF_PROGBUF_MinIndex (0UL)
  #define VPR_DEBUGIF_PROGBUF_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Data */
  #define VPR_DEBUGIF_PROGBUF_DATA_Pos (0UL)
  #define VPR_DEBUGIF_PROGBUF_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_PROGBUF_DATA_Pos)


/* VPR_DEBUGIF_AUTHDATA: Authentication Data */
  #define VPR_DEBUGIF_AUTHDATA_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Data */
  #define VPR_DEBUGIF_AUTHDATA_DATA_Pos (0UL)
  #define VPR_DEBUGIF_AUTHDATA_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_AUTHDATA_DATA_Pos)


/* VPR_DEBUGIF_HALTSUM2: Halt Summary 2 */
  #define VPR_DEBUGIF_HALTSUM2_ResetValue (0x00000000UL)

/* HALTSUM2 @Bits 0..31 : Halt Summary 2 */
  #define VPR_DEBUGIF_HALTSUM2_HALTSUM2_Pos (0UL)
  #define VPR_DEBUGIF_HALTSUM2_HALTSUM2_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HALTSUM2_HALTSUM2_Pos) /*!< Bit mask of HALTSUM2
                                                                            field.*/


/* VPR_DEBUGIF_HALTSUM3: Halt Summary 3 */
  #define VPR_DEBUGIF_HALTSUM3_ResetValue (0x00000000UL)

/* HALTSUM3 @Bits 0..31 : Halt Summary 3 */
  #define VPR_DEBUGIF_HALTSUM3_HALTSUM3_Pos (0UL)
  #define VPR_DEBUGIF_HALTSUM3_HALTSUM3_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HALTSUM3_HALTSUM3_Pos) /*!< Bit mask of HALTSUM3
                                                                            field.*/


/* VPR_DEBUGIF_SBADDRESS3: System Bus Addres 127:96 */
  #define VPR_DEBUGIF_SBADDRESS3_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : Accesses bits 127:96 of the physical address in sbaddress (if the system address bus is that wide). */
  #define VPR_DEBUGIF_SBADDRESS3_ADDRESS_Pos (0UL)
  #define VPR_DEBUGIF_SBADDRESS3_ADDRESS_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBADDRESS3_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* VPR_DEBUGIF_SBCS: System Bus Access Control and Status */
  #define VPR_DEBUGIF_SBCS_ResetValue (0x20000000UL)

/* SBACCESS8 @Bit 0 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBACCESS8_Pos (0UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS8_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS8_Pos)
  #define VPR_DEBUGIF_SBCS_SBACCESS8_Min (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS8_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS8_sbaccess8 (0x1UL)

/* SBACCESS16 @Bit 1 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBACCESS16_Pos (1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS16_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS16_Pos)
  #define VPR_DEBUGIF_SBCS_SBACCESS16_Min (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS16_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS16_sbaccess16 (0x1UL)

/* SBACCESS32 @Bit 2 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBACCESS32_Pos (2UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS32_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS32_Pos)
  #define VPR_DEBUGIF_SBCS_SBACCESS32_Min (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS32_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS32_sbaccess32 (0x1UL)

/* SBACCESS64 @Bit 3 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBACCESS64_Pos (3UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS64_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS64_Pos)
  #define VPR_DEBUGIF_SBCS_SBACCESS64_Min (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS64_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS64_sbaccess64 (0x1UL)

/* SBACCESS128 @Bit 4 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBACCESS128_Pos (4UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS128_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS128_Pos)
  #define VPR_DEBUGIF_SBCS_SBACCESS128_Min (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS128_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS128_sbaccess128 (0x1UL)

/* SBASIZE @Bits 5..11 : Width of system bus addresses in bits. (0 indicates there is no bus access support.) */
  #define VPR_DEBUGIF_SBCS_SBASIZE_Pos (5UL)
  #define VPR_DEBUGIF_SBCS_SBASIZE_Msk (0x7FUL << VPR_DEBUGIF_SBCS_SBASIZE_Pos)

/* SBERROR @Bits 12..14 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBERROR_Pos (12UL)
  #define VPR_DEBUGIF_SBCS_SBERROR_Msk (0x7UL << VPR_DEBUGIF_SBCS_SBERROR_Pos)
  #define VPR_DEBUGIF_SBCS_SBERROR_Min (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBERROR_Max (0x7UL)
  #define VPR_DEBUGIF_SBCS_SBERROR_Normal (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBERROR_Timeout (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBERROR_Address (0x2UL)
  #define VPR_DEBUGIF_SBCS_SBERROR_Alignment (0x3UL)
  #define VPR_DEBUGIF_SBCS_SBERROR_Size (0x4UL)
  #define VPR_DEBUGIF_SBCS_SBERROR_Other (0x7UL)

/* SBREADONDATA @Bit 15 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_Pos (15UL)
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBREADONDATA_Pos)
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_Min (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_sbreadondata (0x1UL) /*!< Every read from sbdata0 automatically triggers a system bus
                                                                  read at the (possibly autoincremented) address.*/

/* SBAUTOINCREMENT @Bit 16 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Pos (16UL)
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Pos) /*!< Bit mask of SBAUTOINCREMENT
                                                                            field.*/
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Min (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_sbautoincrement (0x1UL) /*!< sbaddress is incremented by the access size (in bytes)
                                                                        selected in sbaccess after every system bus access.*/

/* SBACCESS @Bits 17..19 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBACCESS_Pos (17UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS_Msk (0x7UL << VPR_DEBUGIF_SBCS_SBACCESS_Pos)
  #define VPR_DEBUGIF_SBCS_SBACCESS_Min (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS_Max (0x4UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS_size8 (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS_size16 (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS_size32 (0x2UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS_size64 (0x3UL)
  #define VPR_DEBUGIF_SBCS_SBACCESS_size128 (0x4UL)

/* SBREADONADDR @Bit 20 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_Pos (20UL)
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBREADONADDR_Pos)
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_Min (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_sbreadonaddr (0x1UL) /*!< Every write to sbaddress0 automatically triggers a system bus
                                                                  read at the new address.*/

/* SBBUSY @Bit 21 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBBUSY_Pos (21UL)
  #define VPR_DEBUGIF_SBCS_SBBUSY_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBBUSY_Pos)
  #define VPR_DEBUGIF_SBCS_SBBUSY_Min (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBBUSY_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBBUSY_notbusy (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBBUSY_busy (0x1UL)

/* SBBUSYERROR @Bit 22 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_Pos (22UL)
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBBUSYERROR_Pos)
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_Min (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_noerror (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_error (0x1UL)

