pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SBVERSION @Bits 29..31 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBVERSION_Pos (29UL)
  #define VPR_DEBUGIF_SBCS_SBVERSION_Msk (0x7UL << VPR_DEBUGIF_SBCS_SBVERSION_Pos)
  #define VPR_DEBUGIF_SBCS_SBVERSION_Min (0x0UL)
  #define VPR_DEBUGIF_SBCS_SBVERSION_Max (0x1UL)
  #define VPR_DEBUGIF_SBCS_SBVERSION_version0 (0x0UL) /*!< The System Bus interface conforms to mainline drafts of thia RISC-V
                                                           External Debug Support spec older than 1 January, 2018.*/
  #define VPR_DEBUGIF_SBCS_SBVERSION_version1 (0x1UL) /*!< The System Bus interface conforms to RISC-V External Debug Support
                                                           version 0.14.0-DRAFT. Other values are reserved for future versions.*/


/* VPR_DEBUGIF_SBADDRESS0: System Bus Addres 31:0 */
  #define VPR_DEBUGIF_SBADDRESS0_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : Accesses bits 31:0 of the physical address in sbaddress. */
  #define VPR_DEBUGIF_SBADDRESS0_ADDRESS_Pos (0UL)
  #define VPR_DEBUGIF_SBADDRESS0_ADDRESS_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBADDRESS0_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* VPR_DEBUGIF_SBADDRESS1: System Bus Addres 63:32 */
  #define VPR_DEBUGIF_SBADDRESS1_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : Accesses bits 63:32 of the physical address in sbaddress (if the system address bus is that wide). */
  #define VPR_DEBUGIF_SBADDRESS1_ADDRESS_Pos (0UL)
  #define VPR_DEBUGIF_SBADDRESS1_ADDRESS_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBADDRESS1_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* VPR_DEBUGIF_SBADDRESS2: System Bus Addres 95:64 */
  #define VPR_DEBUGIF_SBADDRESS2_ResetValue (0x00000000UL)

/* ADDRESS @Bits 0..31 : Accesses bits 95:64 of the physical address in sbaddress (if the system address bus is that wide). */
  #define VPR_DEBUGIF_SBADDRESS2_ADDRESS_Pos (0UL)
  #define VPR_DEBUGIF_SBADDRESS2_ADDRESS_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBADDRESS2_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* VPR_DEBUGIF_SBDATA0: System Bus Data 31:0 */
  #define VPR_DEBUGIF_SBDATA0_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Accesses bits 31:0 of sbdata */
  #define VPR_DEBUGIF_SBDATA0_DATA_Pos (0UL)
  #define VPR_DEBUGIF_SBDATA0_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBDATA0_DATA_Pos)


/* VPR_DEBUGIF_SBDATA1: System Bus Data 63:32 */
  #define VPR_DEBUGIF_SBDATA1_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Accesses bits 63:32 of sbdata (if the system bus is that wide). */
  #define VPR_DEBUGIF_SBDATA1_DATA_Pos (0UL)
  #define VPR_DEBUGIF_SBDATA1_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBDATA1_DATA_Pos)


/* VPR_DEBUGIF_SBDATA2: System Bus Data 95:64 */
  #define VPR_DEBUGIF_SBDATA2_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Accesses bits 95:64 of sbdata (if the system bus is that wide). */
  #define VPR_DEBUGIF_SBDATA2_DATA_Pos (0UL)
  #define VPR_DEBUGIF_SBDATA2_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBDATA2_DATA_Pos)


/* VPR_DEBUGIF_SBDATA3: System Bus Data 127:96 */
  #define VPR_DEBUGIF_SBDATA3_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Accesses bits 127:96 of sbdata (if the system bus is that wide). */
  #define VPR_DEBUGIF_SBDATA3_DATA_Pos (0UL)
  #define VPR_DEBUGIF_SBDATA3_DATA_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBDATA3_DATA_Pos)


/* VPR_DEBUGIF_HALTSUM0: Halt summary 0 */
  #define VPR_DEBUGIF_HALTSUM0_ResetValue (0x00000000UL)

/* HALTSUM0 @Bits 0..31 : Halt summary 0 */
  #define VPR_DEBUGIF_HALTSUM0_HALTSUM0_Pos (0UL)
  #define VPR_DEBUGIF_HALTSUM0_HALTSUM0_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HALTSUM0_HALTSUM0_Pos) /*!< Bit mask of HALTSUM0
                                                                            field.*/


/* ======================================================= Struct VPR ======================================================== */
/**
  * @brief VPR peripheral registers
  */
  typedef struct {
    __OM uint32_t TASKS_TRIGGER[32];
    __IOM uint32_t SUBSCRIBE_TRIGGER[32];
    __IOM uint32_t EVENTS_TRIGGERED[32];
    __IOM uint32_t PUBLISH_TRIGGERED[32];
    __IM uint32_t RESERVED[64];
    __IOM uint32_t INTEN;
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t INTPEND;
    __IM uint32_t RESERVED1[60];
    __IOM NRF_VPR_DEBUGIF_Type DEBUGIF;
    __IM uint32_t RESERVED2[191];
    __IOM uint32_t CPURUN;
    __IM uint32_t RESERVED3;
    __IOM uint32_t INITPC;
  } NRF_VPR_Type;

/* VPR_TASKS_TRIGGER: VPR task [n] register */
  #define VPR_TASKS_TRIGGER_MaxCount (32UL)
  #define VPR_TASKS_TRIGGER_MaxIndex (31UL)
  #define VPR_TASKS_TRIGGER_MinIndex (0UL)
  #define VPR_TASKS_TRIGGER_ResetValue (0x00000000UL)

/* TASKS_TRIGGER @Bit 0 : VPR task [n] register */
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL)
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << VPR_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of TASKS_TRIGGER
                                                                            field.*/
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL)
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL)
  #define VPR_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL)


/* VPR_SUBSCRIBE_TRIGGER: Subscribe configuration for task TASKS_TRIGGER[n] */
  #define VPR_SUBSCRIBE_TRIGGER_MaxCount (32UL)
  #define VPR_SUBSCRIBE_TRIGGER_MaxIndex (31UL)
  #define VPR_SUBSCRIBE_TRIGGER_MinIndex (0UL)
  #define VPR_SUBSCRIBE_TRIGGER_ResetValue (0x00000000UL)

/* EN @Bit 31 : Subscription enable bit */
  #define VPR_SUBSCRIBE_TRIGGER_EN_Pos (31UL)
  #define VPR_SUBSCRIBE_TRIGGER_EN_Msk (0x1UL << VPR_SUBSCRIBE_TRIGGER_EN_Pos)
  #define VPR_SUBSCRIBE_TRIGGER_EN_Min (0x0UL)
  #define VPR_SUBSCRIBE_TRIGGER_EN_Max (0x1UL)
  #define VPR_SUBSCRIBE_TRIGGER_EN_Disabled (0x0UL)
  #define VPR_SUBSCRIBE_TRIGGER_EN_Enabled (0x1UL)


/* VPR_EVENTS_TRIGGERED: VPR event [n] register */
  #define VPR_EVENTS_TRIGGERED_MaxCount (32UL)
  #define VPR_EVENTS_TRIGGERED_MaxIndex (31UL)
  #define VPR_EVENTS_TRIGGERED_MinIndex (0UL)
  #define VPR_EVENTS_TRIGGERED_ResetValue (0x00000000UL)

