pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TRIGGERED12 @Bit 12 : Write '1' to enable interrupt for event TRIGGERED[12] */
  #define VPR_INTENSET_TRIGGERED12_Pos (12UL)
  #define VPR_INTENSET_TRIGGERED12_Msk (0x1UL << VPR_INTENSET_TRIGGERED12_Pos)
  #define VPR_INTENSET_TRIGGERED12_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED12_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED12_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED12_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED12_Enabled (0x1UL)

/* TRIGGERED13 @Bit 13 : Write '1' to enable interrupt for event TRIGGERED[13] */
  #define VPR_INTENSET_TRIGGERED13_Pos (13UL)
  #define VPR_INTENSET_TRIGGERED13_Msk (0x1UL << VPR_INTENSET_TRIGGERED13_Pos)
  #define VPR_INTENSET_TRIGGERED13_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED13_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED13_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED13_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED13_Enabled (0x1UL)

/* TRIGGERED14 @Bit 14 : Write '1' to enable interrupt for event TRIGGERED[14] */
  #define VPR_INTENSET_TRIGGERED14_Pos (14UL)
  #define VPR_INTENSET_TRIGGERED14_Msk (0x1UL << VPR_INTENSET_TRIGGERED14_Pos)
  #define VPR_INTENSET_TRIGGERED14_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED14_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED14_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED14_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED14_Enabled (0x1UL)

/* TRIGGERED15 @Bit 15 : Write '1' to enable interrupt for event TRIGGERED[15] */
  #define VPR_INTENSET_TRIGGERED15_Pos (15UL)
  #define VPR_INTENSET_TRIGGERED15_Msk (0x1UL << VPR_INTENSET_TRIGGERED15_Pos)
  #define VPR_INTENSET_TRIGGERED15_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED15_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED15_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED15_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED15_Enabled (0x1UL)

/* TRIGGERED16 @Bit 16 : Write '1' to enable interrupt for event TRIGGERED[16] */
  #define VPR_INTENSET_TRIGGERED16_Pos (16UL)
  #define VPR_INTENSET_TRIGGERED16_Msk (0x1UL << VPR_INTENSET_TRIGGERED16_Pos)
  #define VPR_INTENSET_TRIGGERED16_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED16_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED16_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED16_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED16_Enabled (0x1UL)

/* TRIGGERED17 @Bit 17 : Write '1' to enable interrupt for event TRIGGERED[17] */
  #define VPR_INTENSET_TRIGGERED17_Pos (17UL)
  #define VPR_INTENSET_TRIGGERED17_Msk (0x1UL << VPR_INTENSET_TRIGGERED17_Pos)
  #define VPR_INTENSET_TRIGGERED17_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED17_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED17_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED17_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED17_Enabled (0x1UL)

/* TRIGGERED18 @Bit 18 : Write '1' to enable interrupt for event TRIGGERED[18] */
  #define VPR_INTENSET_TRIGGERED18_Pos (18UL)
  #define VPR_INTENSET_TRIGGERED18_Msk (0x1UL << VPR_INTENSET_TRIGGERED18_Pos)
  #define VPR_INTENSET_TRIGGERED18_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED18_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED18_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED18_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED18_Enabled (0x1UL)

/* TRIGGERED19 @Bit 19 : Write '1' to enable interrupt for event TRIGGERED[19] */
  #define VPR_INTENSET_TRIGGERED19_Pos (19UL)
  #define VPR_INTENSET_TRIGGERED19_Msk (0x1UL << VPR_INTENSET_TRIGGERED19_Pos)
  #define VPR_INTENSET_TRIGGERED19_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED19_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED19_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED19_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED19_Enabled (0x1UL)

/* TRIGGERED20 @Bit 20 : Write '1' to enable interrupt for event TRIGGERED[20] */
  #define VPR_INTENSET_TRIGGERED20_Pos (20UL)
  #define VPR_INTENSET_TRIGGERED20_Msk (0x1UL << VPR_INTENSET_TRIGGERED20_Pos)
  #define VPR_INTENSET_TRIGGERED20_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED20_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED20_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED20_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED20_Enabled (0x1UL)

/* TRIGGERED21 @Bit 21 : Write '1' to enable interrupt for event TRIGGERED[21] */
  #define VPR_INTENSET_TRIGGERED21_Pos (21UL)
  #define VPR_INTENSET_TRIGGERED21_Msk (0x1UL << VPR_INTENSET_TRIGGERED21_Pos)
  #define VPR_INTENSET_TRIGGERED21_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED21_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED21_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED21_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED21_Enabled (0x1UL)

/* TRIGGERED22 @Bit 22 : Write '1' to enable interrupt for event TRIGGERED[22] */
  #define VPR_INTENSET_TRIGGERED22_Pos (22UL)
  #define VPR_INTENSET_TRIGGERED22_Msk (0x1UL << VPR_INTENSET_TRIGGERED22_Pos)
  #define VPR_INTENSET_TRIGGERED22_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED22_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED22_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED22_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED22_Enabled (0x1UL)

/* TRIGGERED23 @Bit 23 : Write '1' to enable interrupt for event TRIGGERED[23] */
  #define VPR_INTENSET_TRIGGERED23_Pos (23UL)
  #define VPR_INTENSET_TRIGGERED23_Msk (0x1UL << VPR_INTENSET_TRIGGERED23_Pos)
  #define VPR_INTENSET_TRIGGERED23_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED23_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED23_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED23_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED23_Enabled (0x1UL)

/* TRIGGERED24 @Bit 24 : Write '1' to enable interrupt for event TRIGGERED[24] */
  #define VPR_INTENSET_TRIGGERED24_Pos (24UL)
  #define VPR_INTENSET_TRIGGERED24_Msk (0x1UL << VPR_INTENSET_TRIGGERED24_Pos)
  #define VPR_INTENSET_TRIGGERED24_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED24_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED24_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED24_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED24_Enabled (0x1UL)

/* TRIGGERED25 @Bit 25 : Write '1' to enable interrupt for event TRIGGERED[25] */
  #define VPR_INTENSET_TRIGGERED25_Pos (25UL)
  #define VPR_INTENSET_TRIGGERED25_Msk (0x1UL << VPR_INTENSET_TRIGGERED25_Pos)
  #define VPR_INTENSET_TRIGGERED25_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED25_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED25_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED25_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED25_Enabled (0x1UL)

/* TRIGGERED26 @Bit 26 : Write '1' to enable interrupt for event TRIGGERED[26] */
  #define VPR_INTENSET_TRIGGERED26_Pos (26UL)
  #define VPR_INTENSET_TRIGGERED26_Msk (0x1UL << VPR_INTENSET_TRIGGERED26_Pos)
  #define VPR_INTENSET_TRIGGERED26_Min (0x0UL)
  #define VPR_INTENSET_TRIGGERED26_Max (0x1UL)
  #define VPR_INTENSET_TRIGGERED26_Set (0x1UL)
  #define VPR_INTENSET_TRIGGERED26_Disabled (0x0UL)
  #define VPR_INTENSET_TRIGGERED26_Enabled (0x1UL)

