pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VPR_CPURUN: State of the CPU after a core reset */
  #define VPR_CPURUN_ResetValue (0x00000000UL)

/* EN @Bit 0 : Controls CPU running state after a core reset. */
  #define VPR_CPURUN_EN_Pos (0UL)
  #define VPR_CPURUN_EN_Msk (0x1UL << VPR_CPURUN_EN_Pos)
  #define VPR_CPURUN_EN_Min (0x0UL)
  #define VPR_CPURUN_EN_Max (0x1UL)
  #define VPR_CPURUN_EN_Stopped (0x0UL)              /*!< CPU stopped. If this is the CPU state after a core reset, setting this
                                                          bit will change the CPU state to CPU running.*/
  #define VPR_CPURUN_EN_Running (0x1UL)              /*!< CPU running. If this is the CPU state after a core reset, clearing
                                                          this bit will change the CPU state to CPU stopped after a core reset.*/


/* VPR_INITPC: Initial value of the PC at CPU start. */
  #define VPR_INITPC_ResetValue (0x00000000UL)

/* INITPC @Bits 0..31 : Initial value of the PC at CPU start. */
  #define VPR_INITPC_INITPC_Pos (0UL)
  #define VPR_INITPC_INITPC_Msk (0xFFFFFFFFUL << VPR_INITPC_INITPC_Pos)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                          VPRCSR                                          ================ */
/* =========================================================================================================================== */

/**
  * @brief VPR CSR registers
  */
/**
  * @brief  [VPRCSR] (unspecified)
  */

/**
  * @brief  [VPRCSR] (unspecified)
  */

/**
  * @brief MSTATUS [VPRCSR_MSTATUS] Machine Status
  */
  #define VPRCSR_MSTATUS (0x00000300ul)
  #define VPRCSR_MSTATUS_ResetValue (0x00001800UL)

/* MIE @Bit 3 : global interrupt enable for machine privilege mode */
  #define VPRCSR_MSTATUS_MIE_Pos (3UL)
  #define VPRCSR_MSTATUS_MIE_Msk (0x1UL << VPRCSR_MSTATUS_MIE_Pos)
  #define VPRCSR_MSTATUS_MIE_Min (0x0UL)
  #define VPRCSR_MSTATUS_MIE_Max (0x1UL)
  #define VPRCSR_MSTATUS_MIE_Disabled (0x0UL)
  #define VPRCSR_MSTATUS_MIE_Enabled (0x1UL)

/* MPIE @Bit 7 : Exists to support nested traps. Value of the interrupt-enable bit active prior to the trap for machine
                 privilege mode */

  #define VPRCSR_MSTATUS_MPIE_Pos (7UL)
  #define VPRCSR_MSTATUS_MPIE_Msk (0x1UL << VPRCSR_MSTATUS_MPIE_Pos)
  #define VPRCSR_MSTATUS_MPIE_Min (0x0UL)
  #define VPRCSR_MSTATUS_MPIE_Max (0x1UL)
  #define VPRCSR_MSTATUS_MPIE_Disabled (0x0UL)
  #define VPRCSR_MSTATUS_MPIE_Enabled (0x1UL)

/* MPP @Bits 11..12 : Exists to support nested traps. Value of the privlege mode prior to the trap for machine privilege mode */
  #define VPRCSR_MSTATUS_MPP_Pos (11UL)
  #define VPRCSR_MSTATUS_MPP_Msk (0x3UL << VPRCSR_MSTATUS_MPP_Pos)


/**
  * @brief MISA [VPRCSR_MISA] Machine ISA
  */
  #define VPRCSR_MISA (0x00000301ul)
  #define VPRCSR_MISA_ResetValue (0x40001014UL)

/* A @Bit 0 : Atomic extension */
  #define VPRCSR_MISA_A_Pos (0UL)
  #define VPRCSR_MISA_A_Msk (0x1UL << VPRCSR_MISA_A_Pos)
  #define VPRCSR_MISA_A_Min (0x0UL)
  #define VPRCSR_MISA_A_Max (0x1UL)
  #define VPRCSR_MISA_A_Disabled (0x0UL)
  #define VPRCSR_MISA_A_Enabled (0x1UL)

/* B @Bit 1 : Bit-Manipulation extension */
  #define VPRCSR_MISA_B_Pos (1UL)
  #define VPRCSR_MISA_B_Msk (0x1UL << VPRCSR_MISA_B_Pos)
  #define VPRCSR_MISA_B_Min (0x0UL)
  #define VPRCSR_MISA_B_Max (0x1UL)
  #define VPRCSR_MISA_B_Disabled (0x0UL)
  #define VPRCSR_MISA_B_Enabled (0x1UL)

/* C @Bit 2 : Compressed extension */
  #define VPRCSR_MISA_C_Pos (2UL)
  #define VPRCSR_MISA_C_Msk (0x1UL << VPRCSR_MISA_C_Pos)
  #define VPRCSR_MISA_C_Min (0x0UL)
  #define VPRCSR_MISA_C_Max (0x1UL)
  #define VPRCSR_MISA_C_Disabled (0x0UL)
  #define VPRCSR_MISA_C_Enabled (0x1UL)

/* E @Bit 4 : RV32E base ISA */
  #define VPRCSR_MISA_E_Pos (4UL)
  #define VPRCSR_MISA_E_Msk (0x1UL << VPRCSR_MISA_E_Pos)
  #define VPRCSR_MISA_E_Min (0x0UL)
  #define VPRCSR_MISA_E_Max (0x1UL)
  #define VPRCSR_MISA_E_Disabled (0x0UL)
  #define VPRCSR_MISA_E_Enabled (0x1UL)

/* I @Bit 8 : RV32I/64I/128I base ISA */
  #define VPRCSR_MISA_I_Pos (8UL)
  #define VPRCSR_MISA_I_Msk (0x1UL << VPRCSR_MISA_I_Pos)
  #define VPRCSR_MISA_I_Min (0x0UL)
  #define VPRCSR_MISA_I_Max (0x1UL)
  #define VPRCSR_MISA_I_Disabled (0x0UL)
  #define VPRCSR_MISA_I_Enabled (0x1UL)

/* M @Bit 12 : Integer Multiply/Divide extension */
  #define VPRCSR_MISA_M_Pos (12UL)
  #define VPRCSR_MISA_M_Msk (0x1UL << VPRCSR_MISA_M_Pos)
  #define VPRCSR_MISA_M_Min (0x0UL)
  #define VPRCSR_MISA_M_Max (0x1UL)
  #define VPRCSR_MISA_M_Disabled (0x0UL)
  #define VPRCSR_MISA_M_Enabled (0x1UL)

/* N @Bit 13 : User-level interrupts supported */
  #define VPRCSR_MISA_N_Pos (13UL)
  #define VPRCSR_MISA_N_Msk (0x1UL << VPRCSR_MISA_N_Pos)
  #define VPRCSR_MISA_N_Min (0x0UL)
  #define VPRCSR_MISA_N_Max (0x1UL)
  #define VPRCSR_MISA_N_Disabled (0x0UL)
  #define VPRCSR_MISA_N_Enabled (0x1UL)

/* MXL @Bits 30..31 : Machine XLEN */
  #define VPRCSR_MISA_MXL_Pos (30UL)
  #define VPRCSR_MISA_MXL_Msk (0x3UL << VPRCSR_MISA_MXL_Pos)
  #define VPRCSR_MISA_MXL_Min (0x1UL)
  #define VPRCSR_MISA_MXL_Max (0x3UL)
  #define VPRCSR_MISA_MXL_XLEN32 (0x1UL)
  #define VPRCSR_MISA_MXL_XLEN64 (0x2UL)
  #define VPRCSR_MISA_MXL_XLEN128 (0x3UL)


/**
  * @brief MTVEC [VPRCSR_MTVEC] Machine Trap-Vector
  */
  #define VPRCSR_MTVEC (0x00000305ul)
  #define VPRCSR_MTVEC_ResetValue (0x00000003UL)

/* MODE @Bits 0..1 : Mode */
  #define VPRCSR_MTVEC_MODE_Pos (0UL)
  #define VPRCSR_MTVEC_MODE_Msk (0x3UL << VPRCSR_MTVEC_MODE_Pos)
  #define VPRCSR_MTVEC_MODE_Min (0x3UL)
  #define VPRCSR_MTVEC_MODE_Max (0x3UL)
  #define VPRCSR_MTVEC_MODE_CLIC (0x3UL)

/* BASE @Bits 2..31 : Vector base address */
  #define VPRCSR_MTVEC_BASE_Pos (2UL)
  #define VPRCSR_MTVEC_BASE_Msk (0x3FFFFFFFUL << VPRCSR_MTVEC_BASE_Pos)


/**
  * @brief MTVT [VPRCSR_MTVT] Machine Trap Vector Table
  */
  #define VPRCSR_MTVT (0x00000307ul)
  #define VPRCSR_MTVT_ResetValue (0x00000000UL)

/* VAL @Bits 6..31 : Machine Trap Vector Table base address value for CLIC vectored interrupts */
  #define VPRCSR_MTVT_VAL_Pos (6UL)
  #define VPRCSR_MTVT_VAL_Msk (0x3FFFFFFUL << VPRCSR_MTVT_VAL_Pos)


/**
  * @brief MCOUNTINHIBIT [VPRCSR_MCOUNTINHIBIT] Machine Counter-Inhibit
  */
  #define VPRCSR_MCOUNTINHIBIT (0x00000320ul)
  #define VPRCSR_MCOUNTINHIBIT_ResetValue (0x00000005UL)

/* CY @Bit 0 : (unspecified) */
  #define VPRCSR_MCOUNTINHIBIT_CY_Pos (0UL)
  #define VPRCSR_MCOUNTINHIBIT_CY_Msk (0x1UL << VPRCSR_MCOUNTINHIBIT_CY_Pos)
  #define VPRCSR_MCOUNTINHIBIT_CY_Min (0x0UL)
  #define VPRCSR_MCOUNTINHIBIT_CY_Max (0x1UL)
  #define VPRCSR_MCOUNTINHIBIT_CY_INCREMENT (0x0UL)
  #define VPRCSR_MCOUNTINHIBIT_CY_INHIBIT (0x1UL)

/* IR @Bit 2 : (unspecified) */
  #define VPRCSR_MCOUNTINHIBIT_IR_Pos (2UL)
  #define VPRCSR_MCOUNTINHIBIT_IR_Msk (0x1UL << VPRCSR_MCOUNTINHIBIT_IR_Pos)
  #define VPRCSR_MCOUNTINHIBIT_IR_Min (0x0UL)
  #define VPRCSR_MCOUNTINHIBIT_IR_Max (0x1UL)
  #define VPRCSR_MCOUNTINHIBIT_IR_INCREMENT (0x0UL)
  #define VPRCSR_MCOUNTINHIBIT_IR_INHIBIT (0x1UL)


/**
  * @brief MSCRATCH [VPRCSR_MSCRATCH] Machine Scratch
  */
  #define VPRCSR_MSCRATCH (0x00000340ul)
  #define VPRCSR_MSCRATCH_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Machine Scratch value */
  #define VPRCSR_MSCRATCH_VAL_Pos (0UL)
  #define VPRCSR_MSCRATCH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MSCRATCH_VAL_Pos)


/**
  * @brief MEPC [VPRCSR_MEPC] Machine Exception Program Counter
  */
  #define VPRCSR_MEPC (0x00000341ul)
  #define VPRCSR_MEPC_ResetValue (0x00000000UL)

