pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VAL @Bits 0..31 : Machine Exception Program Counter value */
  #define VPRCSR_MEPC_VAL_Pos (0UL)
  #define VPRCSR_MEPC_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MEPC_VAL_Pos)


/**
  * @brief MCAUSE [VPRCSR_MCAUSE] Machine Cause
  */
  #define VPRCSR_MCAUSE (0x00000342ul)
  #define VPRCSR_MCAUSE_ResetValue (0x30000000UL)

/* EXCEPTIONCODE @Bits 0..11 : Exception code */
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_Pos (0UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_Msk (0xFFFUL << VPRCSR_MCAUSE_EXCEPTIONCODE_Pos)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_Min (0x0UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_Max (0x1FUL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_INSTADDRMISALIGN (0x000UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_INSTACCESSFAULT (0x001UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_ILLEGALINST (0x002UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_BKPT (0x003UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_LOADADDRMISALIGN (0x004UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_LOADACCESSFAULT (0x005UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_STOREADDRMISALIGN (0x006UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_STOREACCESSFAULT (0x007UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_ECALLMMODE (0x00BUL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_MISALIGNSTACKING (0x018UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_BUSFAULTSTACKING (0x019UL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_INTVECTORFAULT (0x01AUL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_MISALIGNUNSTACKING (0x01BUL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_BUSFAULTUNSTACKING (0x01CUL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_LOADTIMEOUTFAULT (0x01DUL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_STORETIMEOUTFAULT (0x01EUL)
  #define VPRCSR_MCAUSE_EXCEPTIONCODE_STACKINGEXCFAULT (0x01FUL)

/* MPIL @Bits 16..23 : Previous interrupt level */
  #define VPRCSR_MCAUSE_MPIL_Pos (16UL)
  #define VPRCSR_MCAUSE_MPIL_Msk (0xFFUL << VPRCSR_MCAUSE_MPIL_Pos)

/* MPIE @Bit 27 : Previous interrupt enable, same as MSTATUS.MPIE */
  #define VPRCSR_MCAUSE_MPIE_Pos (27UL)
  #define VPRCSR_MCAUSE_MPIE_Msk (0x1UL << VPRCSR_MCAUSE_MPIE_Pos)

/* MPP @Bits 28..29 : Previous privilege mode, same as MSTATUS.MPP */
  #define VPRCSR_MCAUSE_MPP_Pos (28UL)
  #define VPRCSR_MCAUSE_MPP_Msk (0x3UL << VPRCSR_MCAUSE_MPP_Pos)

/* MINHV @Bit 30 : In hardware vectoring */
  #define VPRCSR_MCAUSE_MINHV_Pos (30UL)
  #define VPRCSR_MCAUSE_MINHV_Msk (0x1UL << VPRCSR_MCAUSE_MINHV_Pos)

/* INTERRUPT @Bit 31 : Interrupt bit */
  #define VPRCSR_MCAUSE_INTERRUPT_Pos (31UL)
  #define VPRCSR_MCAUSE_INTERRUPT_Msk (0x1UL << VPRCSR_MCAUSE_INTERRUPT_Pos)
  #define VPRCSR_MCAUSE_INTERRUPT_Min (0x0UL)
  #define VPRCSR_MCAUSE_INTERRUPT_Max (0x1UL)
  #define VPRCSR_MCAUSE_INTERRUPT_EXCEPTION (0x0UL)
  #define VPRCSR_MCAUSE_INTERRUPT_INTERRUPT (0x1UL)


/**
  * @brief MTVAL [VPRCSR_MTVAL] Machine Trap Value
  */
  #define VPRCSR_MTVAL (0x00000343ul)
  #define VPRCSR_MTVAL_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Machine Trap Value */
  #define VPRCSR_MTVAL_VAL_Pos (0UL)
  #define VPRCSR_MTVAL_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MTVAL_VAL_Pos)


/**
  * @brief MINTSTATUS [VPRCSR_MINTSTATUS] M-mode Interrupt Status
  */
  #define VPRCSR_MINTSTATUS (0x00000346ul)
  #define VPRCSR_MINTSTATUS_ResetValue (0x00000000UL)

/* MIL @Bits 24..31 : M-Mode interrupt level */
  #define VPRCSR_MINTSTATUS_MIL_Pos (24UL)
  #define VPRCSR_MINTSTATUS_MIL_Msk (0xFFUL << VPRCSR_MINTSTATUS_MIL_Pos)


/**
  * @brief MINTTHRESH [VPRCSR_MINTTHRESH] M-mode Interrupt-level Threshold
  */
  #define VPRCSR_MINTTHRESH (0x00000347ul)
  #define VPRCSR_MINTTHRESH_ResetValue (0x00000000UL)

/* TH @Bits 0..7 : M-Mode Interrupt-level Threshold */
  #define VPRCSR_MINTTHRESH_TH_Pos (0UL)
  #define VPRCSR_MINTTHRESH_TH_Msk (0xFFUL << VPRCSR_MINTTHRESH_TH_Pos)
  #define VPRCSR_MINTTHRESH_TH_Min (0x0UL)
  #define VPRCSR_MINTTHRESH_TH_Max (0xFFUL)
  #define VPRCSR_MINTTHRESH_TH_DISABLED (0x00UL)
  #define VPRCSR_MINTTHRESH_TH_THRESHLEVEL0 (0x3FUL)
  #define VPRCSR_MINTTHRESH_TH_THRESHLEVEL1 (0x7FUL)
  #define VPRCSR_MINTTHRESH_TH_THRESHLEVEL2 (0xBFUL)
  #define VPRCSR_MINTTHRESH_TH_THRESHLEVEL3 (0xFFUL)


/**
  * @brief MCLICBASE [VPRCSR_MCLICBASE] Machine CLIC Base
  */
  #define VPRCSR_MCLICBASE (0x00000350ul)
  #define VPRCSR_MCLICBASE_ResetValue (0x00001000UL)

/* VAL @Bits 0..31 : CLIC base address value */
  #define VPRCSR_MCLICBASE_VAL_Pos (0UL)
  #define VPRCSR_MCLICBASE_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MCLICBASE_VAL_Pos)


/**
  * @brief TSELECT [VPRCSR_TSELECT] Trigger Select
  */
  #define VPRCSR_TSELECT (0x000007A0ul)
  #define VPRCSR_TSELECT_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Trigger Select value */
  #define VPRCSR_TSELECT_VAL_Pos (0UL)
  #define VPRCSR_TSELECT_VAL_Msk (0xFFFFFFFFUL << VPRCSR_TSELECT_VAL_Pos)


/**
  * @brief TDATA1 [VPRCSR_TDATA1] Trigger Data 1
  */
  #define VPRCSR_TDATA1 (0x000007A1ul)
  #define VPRCSR_TDATA1_ResetValue (0x00000000UL)

/* DATA @Bits 0..26 : Trigger Specific Data */
  #define VPRCSR_TDATA1_DATA_Pos (0UL)
  #define VPRCSR_TDATA1_DATA_Msk (0x7FFFFFFUL << VPRCSR_TDATA1_DATA_Pos)

/* DMODE @Bit 27 : Debug Mode */
  #define VPRCSR_TDATA1_DMODE_Pos (27UL)
  #define VPRCSR_TDATA1_DMODE_Msk (0x1UL << VPRCSR_TDATA1_DMODE_Pos)
  #define VPRCSR_TDATA1_DMODE_Min (0x0UL)
  #define VPRCSR_TDATA1_DMODE_Max (0x1UL)
  #define VPRCSR_TDATA1_DMODE_BOTH (0x0UL)           /*!< Both Debug and M-mode can write the tdata registers at the selected
                                                          tselect.*/
  #define VPRCSR_TDATA1_DMODE_ONLYDEBUG (0x1UL)      /*!< Only Debug Mode can write the tdata registers at the selected tselect.
                                                          Writes from other modes are ignored.*/

/* TYPE @Bits 28..31 : Type */
  #define VPRCSR_TDATA1_TYPE_Pos (28UL)
  #define VPRCSR_TDATA1_TYPE_Msk (0xFUL << VPRCSR_TDATA1_TYPE_Pos)
  #define VPRCSR_TDATA1_TYPE_Min (0x0UL)
  #define VPRCSR_TDATA1_TYPE_Max (0xFUL)
  #define VPRCSR_TDATA1_TYPE_NOTRIGGER (0x0UL)
  #define VPRCSR_TDATA1_TYPE_MATCH (0x2UL)           /*!< The trigger is an address match trigger. The remaining bits in this
                                                          register act as described in mcontrol*/
  #define VPRCSR_TDATA1_TYPE_REMAP (0xFUL)           /*!< This trigger is a remapping trigger. The remaining bits in this
                                                          register behave as described in remapping functionality*/


/**
  * @brief TDATA2 [VPRCSR_TDATA2] Trigger Data 2
  */
  #define VPRCSR_TDATA2 (0x000007A2ul)
  #define VPRCSR_TDATA2_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Trigger Specific Data */
  #define VPRCSR_TDATA2_DATA_Pos (0UL)
  #define VPRCSR_TDATA2_DATA_Msk (0xFFFFFFFFUL << VPRCSR_TDATA2_DATA_Pos)


/**
  * @brief TDATA3 [VPRCSR_TDATA3] Trigger Data 3
  */
  #define VPRCSR_TDATA3 (0x000007A3ul)
  #define VPRCSR_TDATA3_ResetValue (0x00000000UL)

/* DATA @Bits 0..31 : Trigger Specific Data */
  #define VPRCSR_TDATA3_DATA_Pos (0UL)
  #define VPRCSR_TDATA3_DATA_Msk (0xFFFFFFFFUL << VPRCSR_TDATA3_DATA_Pos)


/**
  * @brief TINFO [VPRCSR_TINFO] Trigger Info
  */
  #define VPRCSR_TINFO (0x000007A4ul)
  #define VPRCSR_TINFO_ResetValue (0x00000000UL)

