pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INFO @Bits 0..15 : Trigger Info value */
  #define VPRCSR_TINFO_INFO_Pos (0UL)
  #define VPRCSR_TINFO_INFO_Msk (0xFFFFUL << VPRCSR_TINFO_INFO_Pos)


/**
  * @brief TCONTROL [VPRCSR_TCONTROL] Trigger Control
  */
  #define VPRCSR_TCONTROL (0x000007A5ul)
  #define VPRCSR_TCONTROL_ResetValue (0x00000000UL)

/* MTE @Bit 3 : Mode Trigger Enable */
  #define VPRCSR_TCONTROL_MTE_Pos (3UL)
  #define VPRCSR_TCONTROL_MTE_Msk (0x1UL << VPRCSR_TCONTROL_MTE_Pos)
  #define VPRCSR_TCONTROL_MTE_Min (0x0UL)
  #define VPRCSR_TCONTROL_MTE_Max (0x1UL)
  #define VPRCSR_TCONTROL_MTE_DONTMATCH (0x0UL)
  #define VPRCSR_TCONTROL_MTE_MATCH (0x1UL)          /*!< Triggers do match/fire while the hart is in M-mode. When a trap into
                                                          M-mode is taken, mte is set to 0. When mret is executed, mte is set to
                                                          the value of mpte*/

/* MPTE @Bit 7 : Mode Previous Trigger Enable */
  #define VPRCSR_TCONTROL_MPTE_Pos (7UL)
  #define VPRCSR_TCONTROL_MPTE_Msk (0x1UL << VPRCSR_TCONTROL_MPTE_Pos)


/**
  * @brief DCSR [VPRCSR_DCSR] Debug Control and Status
  */
  #define VPRCSR_DCSR (0x000007B0ul)
  #define VPRCSR_DCSR_ResetValue (0x40000003UL)

/* PRV @Bits 0..1 : Privilege level */
  #define VPRCSR_DCSR_PRV_Pos (0UL)
  #define VPRCSR_DCSR_PRV_Msk (0x3UL << VPRCSR_DCSR_PRV_Pos)
  #define VPRCSR_DCSR_PRV_Min (0x3UL)
  #define VPRCSR_DCSR_PRV_Max (0x3UL)
  #define VPRCSR_DCSR_PRV_MACHINE (0x3UL)

/* STEP @Bit 2 : Step */
  #define VPRCSR_DCSR_STEP_Pos (2UL)
  #define VPRCSR_DCSR_STEP_Msk (0x1UL << VPRCSR_DCSR_STEP_Pos)

/* CAUSE @Bits 6..8 : Debug Mode enter cause */
  #define VPRCSR_DCSR_CAUSE_Pos (6UL)
  #define VPRCSR_DCSR_CAUSE_Msk (0x7UL << VPRCSR_DCSR_CAUSE_Pos)
  #define VPRCSR_DCSR_CAUSE_Min (0x1UL)
  #define VPRCSR_DCSR_CAUSE_Max (0x5UL)
  #define VPRCSR_DCSR_CAUSE_EBREAK (0x1UL)
  #define VPRCSR_DCSR_CAUSE_TRIGGER (0x2UL)          /*!< The Trigger Module caused a breakpoint exception. (priority 4,
                                                          highest)*/
  #define VPRCSR_DCSR_CAUSE_HALTREQ (0x3UL)          /*!< The debugger requested entry to Debug Mode using haltreq. (priority
                                                          1)*/
  #define VPRCSR_DCSR_CAUSE_STEP (0x4UL)
  #define VPRCSR_DCSR_CAUSE_RESETHALTREQ (0x5UL)     /*!< The hart halted directly out of reset due to resethaltreq. It is also
                                                          acceptable to report 3 when this happens. (priority 2)*/

/* STEPIE @Bit 11 : Step Interrupt Enable */
  #define VPRCSR_DCSR_STEPIE_Pos (11UL)
  #define VPRCSR_DCSR_STEPIE_Msk (0x1UL << VPRCSR_DCSR_STEPIE_Pos)
  #define VPRCSR_DCSR_STEPIE_Min (0x0UL)
  #define VPRCSR_DCSR_STEPIE_Max (0x1UL)
  #define VPRCSR_DCSR_STEPIE_Disabled (0x0UL)
  #define VPRCSR_DCSR_STEPIE_Enabled (0x1UL)         /*!< Interrupts are enabled during single stepping. Implementations may
                                                          hard wire this bit to 0. In that case interrupt behavior can be
                                                          emulated by the debugger.*/

/* EBREAKM @Bit 15 : M-mode ebreak */
  #define VPRCSR_DCSR_EBREAKM_Pos (15UL)
  #define VPRCSR_DCSR_EBREAKM_Msk (0x1UL << VPRCSR_DCSR_EBREAKM_Pos)
  #define VPRCSR_DCSR_EBREAKM_Min (0x0UL)
  #define VPRCSR_DCSR_EBREAKM_Max (0x1UL)
  #define VPRCSR_DCSR_EBREAKM_SPEC (0x0UL)           /*!< ebreak instructions in M-mode behave as described in the Privileged
                                                          Spe*/
  #define VPRCSR_DCSR_EBREAKM_ENTERDBG (0x1UL)

/* XDEBUGVER @Bits 28..31 : External Debug version */
  #define VPRCSR_DCSR_XDEBUGVER_Pos (28UL)
  #define VPRCSR_DCSR_XDEBUGVER_Msk (0xFUL << VPRCSR_DCSR_XDEBUGVER_Pos)
  #define VPRCSR_DCSR_XDEBUGVER_Min (0x4UL)
  #define VPRCSR_DCSR_XDEBUGVER_Max (0x4UL)
  #define VPRCSR_DCSR_XDEBUGVER_STDDBG (0x4UL)


/**
  * @brief DPC [VPRCSR_DPC] Debug PC
  */
  #define VPRCSR_DPC (0x000007B1ul)
  #define VPRCSR_DPC_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Debug PC value */
  #define VPRCSR_DPC_VAL_Pos (0UL)
  #define VPRCSR_DPC_VAL_Msk (0xFFFFFFFFUL << VPRCSR_DPC_VAL_Pos)


/**
  * @brief MCYCLE [VPRCSR_MCYCLE] Machine Cycle Counter
  */
  #define VPRCSR_MCYCLE (0x00000B00ul)
  #define VPRCSR_MCYCLE_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Machine Cycle Counter value */
  #define VPRCSR_MCYCLE_VAL_Pos (0UL)
  #define VPRCSR_MCYCLE_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MCYCLE_VAL_Pos)


/**
  * @brief MINSTRET [VPRCSR_MINSTRET] Machine Instruction Counter
  */
  #define VPRCSR_MINSTRET (0x00000B02ul)
  #define VPRCSR_MINSTRET_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Machine Instruction Counter value */
  #define VPRCSR_MINSTRET_VAL_Pos (0UL)
  #define VPRCSR_MINSTRET_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MINSTRET_VAL_Pos)


/**
  * @brief MCYCLEH [VPRCSR_MCYCLEH] Machine Cycle Counter (Upper part)
  */
  #define VPRCSR_MCYCLEH (0x00000B80ul)
  #define VPRCSR_MCYCLEH_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Machine Cycle Counter value */
  #define VPRCSR_MCYCLEH_VAL_Pos (0UL)
  #define VPRCSR_MCYCLEH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MCYCLEH_VAL_Pos)


/**
  * @brief MINSTRETH [VPRCSR_MINSTRETH] Machine Instruction Counter (Upper part)
  */
  #define VPRCSR_MINSTRETH (0x00000B82ul)
  #define VPRCSR_MINSTRETH_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Machine Instruction Counter (Upper part) value */
  #define VPRCSR_MINSTRETH_VAL_Pos (0UL)
  #define VPRCSR_MINSTRETH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MINSTRETH_VAL_Pos)


/**
  * @brief UCYCLE [VPRCSR_UCYCLE] User Cycle Counter
  */
  #define VPRCSR_UCYCLE (0x00000C00ul)
  #define VPRCSR_UCYCLE_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : User Cycle Counter value */
  #define VPRCSR_UCYCLE_VAL_Pos (0UL)
  #define VPRCSR_UCYCLE_VAL_Msk (0xFFFFFFFFUL << VPRCSR_UCYCLE_VAL_Pos)


/**
  * @brief UINSTRET [VPRCSR_UINSTRET] User Instruction Counter
  */
  #define VPRCSR_UINSTRET (0x00000C02ul)
  #define VPRCSR_UINSTRET_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : User Instruction Counter value */
  #define VPRCSR_UINSTRET_VAL_Pos (0UL)
  #define VPRCSR_UINSTRET_VAL_Msk (0xFFFFFFFFUL << VPRCSR_UINSTRET_VAL_Pos)


/**
  * @brief UCYCLEH [VPRCSR_UCYCLEH] User Cycle Counter (Upper part)
  */
  #define VPRCSR_UCYCLEH (0x00000C80ul)
  #define VPRCSR_UCYCLEH_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : User Cycle Counter value */
  #define VPRCSR_UCYCLEH_VAL_Pos (0UL)
  #define VPRCSR_UCYCLEH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_UCYCLEH_VAL_Pos)


/**
  * @brief UINSTRETH [VPRCSR_UINSTRETH] User Instruction Counter (Upper part)
  */
  #define VPRCSR_UINSTRETH (0x00000C82ul)
  #define VPRCSR_UINSTRETH_ResetValue (0x00000000UL)

