pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* MULDIV @Bits 0..1 : value of MULDIV */
  #define VPRCSR_NORDIC_EXTPARAMS_MULDIV_Pos (0UL)
  #define VPRCSR_NORDIC_EXTPARAMS_MULDIV_Msk (0x3UL << VPRCSR_NORDIC_EXTPARAMS_MULDIV_Pos)

/* DBG @Bit 2 : value of DBG */
  #define VPRCSR_NORDIC_EXTPARAMS_DBG_Pos (2UL)
  #define VPRCSR_NORDIC_EXTPARAMS_DBG_Msk (0x1UL << VPRCSR_NORDIC_EXTPARAMS_DBG_Pos)

/* BKPT @Bits 3..6 : value of BKPT */
  #define VPRCSR_NORDIC_EXTPARAMS_BKPT_Pos (3UL)
  #define VPRCSR_NORDIC_EXTPARAMS_BKPT_Msk (0xFUL << VPRCSR_NORDIC_EXTPARAMS_BKPT_Pos)

/* REMAP @Bit 7 : value of REMAP */
  #define VPRCSR_NORDIC_EXTPARAMS_REMAP_Pos (7UL)
  #define VPRCSR_NORDIC_EXTPARAMS_REMAP_Msk (0x1UL << VPRCSR_NORDIC_EXTPARAMS_REMAP_Pos)


/**
  * @brief RTPERIPHCTRL [VPRCSR_NORDIC_RTPERIPHCTRL] RT peripheral control
  */
  #define VPRCSR_NORDIC_RTPERIPHCTRL (0x000007CCul)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_ResetValue (0x00000000UL)

/* CLOCKPOLARITY @Bit 0 : Clock polarity */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Pos (0UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Msk (0x1UL << VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Pos) /*!< Bit mask of
                                                                            CLOCKPOLARITY field.*/
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Min (0x0UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Max (0x1UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_Low (0x0UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_CLOCKPOLARITY_High (0x1UL)

/* STOPCOUNTERS @Bit 4 : Stop counters CNT0 and CNT1 on OUTB under-run */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Pos (4UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Msk (0x1UL << VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Pos) /*!< Bit mask of
                                                                            STOPCOUNTERS field.*/
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Min (0x0UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Max (0x1UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_NoStop (0x0UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_STOPCOUNTERS_Stop (0x1UL)

/* INSEL @Bit 8 : Input pin selection */
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Pos (8UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Msk (0x1UL << VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Pos)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Min (0x0UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_Max (0x1UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_SamePin (0x0UL)
  #define VPRCSR_NORDIC_RTPERIPHCTRL_INSEL_SeparatePin (0x1UL)


/**
  * @brief CNTMODE0 [VPRCSR_NORDIC_CNTMODE0] CNT0 Mode
  */
  #define VPRCSR_NORDIC_CNTMODE0 (0x000007D0ul)
  #define VPRCSR_NORDIC_CNTMODE0_ResetValue (0x00000000UL)

/* CNTMODE0 @Bits 0..1 : CNT0 Mode */
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Pos (0UL)
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Msk (0x3UL << VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Pos)
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Min (0x0UL)
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_Max (0x3UL)
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_STOP (0x0UL)
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_WRAP (0x1UL)
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_RELOAD (0x2UL)
  #define VPRCSR_NORDIC_CNTMODE0_CNTMODE0_TRIGCOMB (0x3UL) /*!< In Trigger mode CNT0 stops counting at 0. Counting will restart
                                                                when a VIO event happens*/


/**
  * @brief CNTMODE1 [VPRCSR_NORDIC_CNTMODE1] CNT1 Mode
  */
  #define VPRCSR_NORDIC_CNTMODE1 (0x000007D1ul)
  #define VPRCSR_NORDIC_CNTMODE1_ResetValue (0x00000000UL)

/* CNTMODE1 @Bits 0..1 : CNT1 Mode */
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Pos (0UL)
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Msk (0x3UL << VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Pos)
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Min (0x0UL)
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_Max (0x3UL)
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_STOP (0x0UL)
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_WRAP (0x1UL)
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_RELOAD (0x2UL)
  #define VPRCSR_NORDIC_CNTMODE1_CNTMODE1_TRIGCOMB (0x3UL) /*!< In combine mode mode CNT1 acts as an extension of CNT0 (16 most
                                                                significant bits of the 32-bit CNT)*/


/**
  * @brief CNT [VPRCSR_NORDIC_CNT] 32-bit Counter
  */
  #define VPRCSR_NORDIC_CNT (0x000007D2ul)
  #define VPRCSR_NORDIC_CNT_ResetValue (0x00000000UL)

/* CNT0 @Bits 0..15 : 16-bit Counter 0 */
  #define VPRCSR_NORDIC_CNT_CNT0_Pos (0UL)
  #define VPRCSR_NORDIC_CNT_CNT0_Msk (0xFFFFUL << VPRCSR_NORDIC_CNT_CNT0_Pos)

/* CNT1 @Bits 16..31 : 16-bit Counter 1 */
  #define VPRCSR_NORDIC_CNT_CNT1_Pos (16UL)
  #define VPRCSR_NORDIC_CNT_CNT1_Msk (0xFFFFUL << VPRCSR_NORDIC_CNT_CNT1_Pos)


/**
  * @brief CNTTOP [VPRCSR_NORDIC_CNTTOP] Counter Top
  */
  #define VPRCSR_NORDIC_CNTTOP (0x000007D3ul)
  #define VPRCSR_NORDIC_CNTTOP_ResetValue (0x00000000UL)

/* CNT0RELOAD @Bits 0..15 : Reload value for CNT0 */
  #define VPRCSR_NORDIC_CNTTOP_CNT0RELOAD_Pos (0UL)
  #define VPRCSR_NORDIC_CNTTOP_CNT0RELOAD_Msk (0xFFFFUL << VPRCSR_NORDIC_CNTTOP_CNT0RELOAD_Pos) /*!< Bit mask of CNT0RELOAD
                                                                            field.*/

/* CNT1RELOAD @Bits 16..31 : Reload value for CNT1 */
  #define VPRCSR_NORDIC_CNTTOP_CNT1RELOAD_Pos (16UL)
  #define VPRCSR_NORDIC_CNTTOP_CNT1RELOAD_Msk (0xFFFFUL << VPRCSR_NORDIC_CNTTOP_CNT1RELOAD_Pos) /*!< Bit mask of CNT1RELOAD
                                                                            field.*/


/**
  * @brief CNTADD [VPRCSR_NORDIC_CNTADD] CNT Add
  */
  #define VPRCSR_NORDIC_CNTADD (0x000007D4ul)
  #define VPRCSR_NORDIC_CNTADD_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Value added to CNT */
  #define VPRCSR_NORDIC_CNTADD_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_CNTADD_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_CNTADD_VAL_Pos)


/**
  * @brief CNT0 [VPRCSR_NORDIC_CNT0] 16 bit Counter 0
  */
  #define VPRCSR_NORDIC_CNT0 (0x000007D5ul)
  #define VPRCSR_NORDIC_CNT0_ResetValue (0x00000000UL)

