pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VAL @Bits 0..15 : CNT0 value */
  #define VPRCSR_NORDIC_CNT0_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_CNT0_VAL_Msk (0xFFFFUL << VPRCSR_NORDIC_CNT0_VAL_Pos)


/**
  * @brief CNTADD0 [VPRCSR_NORDIC_CNTADD0] CNT0 Add
  */
  #define VPRCSR_NORDIC_CNTADD0 (0x000007D6ul)
  #define VPRCSR_NORDIC_CNTADD0_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Value added to CNT0 */
  #define VPRCSR_NORDIC_CNTADD0_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_CNTADD0_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_CNTADD0_VAL_Pos)


/**
  * @brief CNT1 [VPRCSR_NORDIC_CNT1] 16-bit Counter 1
  */
  #define VPRCSR_NORDIC_CNT1 (0x000007D7ul)
  #define VPRCSR_NORDIC_CNT1_ResetValue (0x00000000UL)

/* VAL @Bits 0..15 : CNT1 value */
  #define VPRCSR_NORDIC_CNT1_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_CNT1_VAL_Msk (0xFFFFUL << VPRCSR_NORDIC_CNT1_VAL_Pos)


/**
  * @brief CNTADD1 [VPRCSR_NORDIC_CNTADD1] CNT1 Add
  */
  #define VPRCSR_NORDIC_CNTADD1 (0x000007D8ul)
  #define VPRCSR_NORDIC_CNTADD1_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : Value added to CNT1 */
  #define VPRCSR_NORDIC_CNTADD1_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_CNTADD1_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_CNTADD1_VAL_Pos)


/**
  * @brief WAIT0 [VPRCSR_NORDIC_WAIT0] Wait 0
  */
  #define VPRCSR_NORDIC_WAIT0 (0x000007DAul)
  #define VPRCSR_NORDIC_WAIT0_ResetValue (0x00000000UL)

/* DATA @Bits 0..15 : Value to write to CNT0 */
  #define VPRCSR_NORDIC_WAIT0_DATA_Pos (0UL)
  #define VPRCSR_NORDIC_WAIT0_DATA_Msk (0xFFFFUL << VPRCSR_NORDIC_WAIT0_DATA_Pos)

/* WRITEDATA @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_Pos (16UL)
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_Msk (0x1UL << VPRCSR_NORDIC_WAIT0_WRITEDATA_Pos)
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_Min (0x0UL)
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_Max (0x1UL)
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_WAIT (0x0UL)
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_WRITE (0x1UL)


/**
  * @brief WAIT1 [VPRCSR_NORDIC_WAIT1] Wait 1
  */
  #define VPRCSR_NORDIC_WAIT1 (0x000007DBul)
  #define VPRCSR_NORDIC_WAIT1_ResetValue (0x00000000UL)

/* DATA @Bits 0..15 : Value to write to CNT1 */
  #define VPRCSR_NORDIC_WAIT1_DATA_Pos (0UL)
  #define VPRCSR_NORDIC_WAIT1_DATA_Msk (0xFFFFUL << VPRCSR_NORDIC_WAIT1_DATA_Pos)

/* WRITEDATA @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_Pos (16UL)
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_Msk (0x1UL << VPRCSR_NORDIC_WAIT1_WRITEDATA_Pos)
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_Min (0x0UL)
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_Max (0x1UL)
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_WAIT (0x0UL)
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_WRITE (0x1UL)


/**
  * @brief WAIT [VPRCSR_NORDIC_WAIT] Wait
  */
  #define VPRCSR_NORDIC_WAIT (0x000007DCul)
  #define VPRCSR_NORDIC_WAIT_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : (unspecified) */
  #define VPRCSR_NORDIC_WAIT_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_WAIT_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_WAIT_VAL_Pos)


/**
  * @brief TASKS [VPRCSR_NORDIC_TASKS] DPPI Tasks
  */
  #define VPRCSR_NORDIC_TASKS (0x000007E0ul)
  #define VPRCSR_NORDIC_TASKS_ResetValue (0x00000000UL)

/* TASKS0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS0_Pos (0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS0_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS0_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS0_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS0_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS0_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS0_Enabled (0x1UL)

/* TASKS1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS1_Pos (1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS1_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS1_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS1_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS1_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS1_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS1_Enabled (0x1UL)

/* TASKS2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS2_Pos (2UL)
  #define VPRCSR_NORDIC_TASKS_TASKS2_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS2_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS2_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS2_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS2_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS2_Enabled (0x1UL)

/* TASKS3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS3_Pos (3UL)
  #define VPRCSR_NORDIC_TASKS_TASKS3_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS3_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS3_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS3_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS3_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS3_Enabled (0x1UL)

/* TASKS4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS4_Pos (4UL)
  #define VPRCSR_NORDIC_TASKS_TASKS4_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS4_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS4_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS4_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS4_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS4_Enabled (0x1UL)

/* TASKS5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS5_Pos (5UL)
  #define VPRCSR_NORDIC_TASKS_TASKS5_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS5_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS5_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS5_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS5_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS5_Enabled (0x1UL)

/* TASKS6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS6_Pos (6UL)
  #define VPRCSR_NORDIC_TASKS_TASKS6_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS6_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS6_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS6_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS6_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS6_Enabled (0x1UL)

/* TASKS7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS7_Pos (7UL)
  #define VPRCSR_NORDIC_TASKS_TASKS7_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS7_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS7_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS7_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS7_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS7_Enabled (0x1UL)

/* TASKS8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS8_Pos (8UL)
  #define VPRCSR_NORDIC_TASKS_TASKS8_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS8_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS8_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS8_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS8_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS8_Enabled (0x1UL)

/* TASKS9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS9_Pos (9UL)
  #define VPRCSR_NORDIC_TASKS_TASKS9_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS9_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS9_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS9_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS9_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS9_Enabled (0x1UL)

