pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS10_Pos (10UL)
  #define VPRCSR_NORDIC_TASKS_TASKS10_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS10_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS10_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS10_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS10_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS10_Enabled (0x1UL)

/* TASKS11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS11_Pos (11UL)
  #define VPRCSR_NORDIC_TASKS_TASKS11_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS11_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS11_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS11_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS11_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS11_Enabled (0x1UL)

/* TASKS12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS12_Pos (12UL)
  #define VPRCSR_NORDIC_TASKS_TASKS12_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS12_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS12_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS12_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS12_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS12_Enabled (0x1UL)

/* TASKS13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS13_Pos (13UL)
  #define VPRCSR_NORDIC_TASKS_TASKS13_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS13_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS13_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS13_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS13_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS13_Enabled (0x1UL)

/* TASKS14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS14_Pos (14UL)
  #define VPRCSR_NORDIC_TASKS_TASKS14_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS14_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS14_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS14_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS14_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS14_Enabled (0x1UL)

/* TASKS15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS15_Pos (15UL)
  #define VPRCSR_NORDIC_TASKS_TASKS15_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS15_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS15_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS15_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS15_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS15_Enabled (0x1UL)

/* TASKS16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS16_Pos (16UL)
  #define VPRCSR_NORDIC_TASKS_TASKS16_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS16_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS16_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS16_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS16_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS16_Enabled (0x1UL)

/* TASKS17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS17_Pos (17UL)
  #define VPRCSR_NORDIC_TASKS_TASKS17_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS17_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS17_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS17_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS17_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS17_Enabled (0x1UL)

/* TASKS18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS18_Pos (18UL)
  #define VPRCSR_NORDIC_TASKS_TASKS18_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS18_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS18_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS18_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS18_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS18_Enabled (0x1UL)

/* TASKS19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS19_Pos (19UL)
  #define VPRCSR_NORDIC_TASKS_TASKS19_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS19_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS19_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS19_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS19_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS19_Enabled (0x1UL)

/* TASKS20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS20_Pos (20UL)
  #define VPRCSR_NORDIC_TASKS_TASKS20_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS20_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS20_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS20_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS20_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS20_Enabled (0x1UL)

/* TASKS21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS21_Pos (21UL)
  #define VPRCSR_NORDIC_TASKS_TASKS21_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS21_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS21_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS21_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS21_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS21_Enabled (0x1UL)

/* TASKS22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS22_Pos (22UL)
  #define VPRCSR_NORDIC_TASKS_TASKS22_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS22_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS22_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS22_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS22_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS22_Enabled (0x1UL)

/* TASKS23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS23_Pos (23UL)
  #define VPRCSR_NORDIC_TASKS_TASKS23_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS23_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS23_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS23_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS23_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS23_Enabled (0x1UL)

/* TASKS24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS24_Pos (24UL)
  #define VPRCSR_NORDIC_TASKS_TASKS24_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS24_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS24_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS24_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS24_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS24_Enabled (0x1UL)

/* TASKS25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS25_Pos (25UL)
  #define VPRCSR_NORDIC_TASKS_TASKS25_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS25_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS25_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS25_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS25_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS25_Enabled (0x1UL)

