pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TASKS26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS26_Pos (26UL)
  #define VPRCSR_NORDIC_TASKS_TASKS26_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS26_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS26_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS26_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS26_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS26_Enabled (0x1UL)

/* TASKS27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS27_Pos (27UL)
  #define VPRCSR_NORDIC_TASKS_TASKS27_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS27_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS27_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS27_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS27_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS27_Enabled (0x1UL)

/* TASKS28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS28_Pos (28UL)
  #define VPRCSR_NORDIC_TASKS_TASKS28_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS28_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS28_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS28_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS28_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS28_Enabled (0x1UL)

/* TASKS29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS29_Pos (29UL)
  #define VPRCSR_NORDIC_TASKS_TASKS29_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS29_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS29_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS29_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS29_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS29_Enabled (0x1UL)

/* TASKS30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS30_Pos (30UL)
  #define VPRCSR_NORDIC_TASKS_TASKS30_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS30_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS30_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS30_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS30_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS30_Enabled (0x1UL)

/* TASKS31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS31_Pos (31UL)
  #define VPRCSR_NORDIC_TASKS_TASKS31_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS31_Pos)
  #define VPRCSR_NORDIC_TASKS_TASKS31_Min (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS31_Max (0x1UL)
  #define VPRCSR_NORDIC_TASKS_TASKS31_Disabled (0x0UL)
  #define VPRCSR_NORDIC_TASKS_TASKS31_Enabled (0x1UL)


/**
  * @brief SUBSCRIBE [VPRCSR_NORDIC_SUBSCRIBE] Enable Task Subscription
  */
  #define VPRCSR_NORDIC_SUBSCRIBE (0x000007E1ul)
  #define VPRCSR_NORDIC_SUBSCRIBE_ResetValue (0x00000000UL)

/* SUBSCRIBE0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE0_Pos (0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE0_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE0_Pos) /*!< Bit mask of SUBSCRIBE0
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE0_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE0_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE0_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE0_Enabled (0x1UL)

/* SUBSCRIBE1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE1_Pos (1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE1_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE1_Pos) /*!< Bit mask of SUBSCRIBE1
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE1_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE1_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE1_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE1_Enabled (0x1UL)

/* SUBSCRIBE2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE2_Pos (2UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE2_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE2_Pos) /*!< Bit mask of SUBSCRIBE2
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE2_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE2_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE2_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE2_Enabled (0x1UL)

/* SUBSCRIBE3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Pos (3UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Pos) /*!< Bit mask of SUBSCRIBE3
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE3_Enabled (0x1UL)

/* SUBSCRIBE4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Pos (4UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Pos) /*!< Bit mask of SUBSCRIBE4
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE4_Enabled (0x1UL)

/* SUBSCRIBE5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Pos (5UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Pos) /*!< Bit mask of SUBSCRIBE5
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE5_Enabled (0x1UL)

/* SUBSCRIBE6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Pos (6UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Pos) /*!< Bit mask of SUBSCRIBE6
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE6_Enabled (0x1UL)

