pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SUBSCRIBE7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Pos (7UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Pos) /*!< Bit mask of SUBSCRIBE7
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE7_Enabled (0x1UL)

/* SUBSCRIBE8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Pos (8UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Pos) /*!< Bit mask of SUBSCRIBE8
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE8_Enabled (0x1UL)

/* SUBSCRIBE9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Pos (9UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Pos) /*!< Bit mask of SUBSCRIBE9
                                                                            field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE9_Enabled (0x1UL)

/* SUBSCRIBE10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Pos (10UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE10 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Enabled (0x1UL)

/* SUBSCRIBE11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Pos (11UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE11 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Enabled (0x1UL)

/* SUBSCRIBE12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Pos (12UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE12 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Enabled (0x1UL)

/* SUBSCRIBE13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Pos (13UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE13 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Enabled (0x1UL)

/* SUBSCRIBE14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Pos (14UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE14 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Enabled (0x1UL)

/* SUBSCRIBE15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Pos (15UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE15 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Enabled (0x1UL)

/* SUBSCRIBE16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Pos (16UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE16 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Enabled (0x1UL)

/* SUBSCRIBE17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Pos (17UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE17 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Enabled (0x1UL)

/* SUBSCRIBE18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Pos (18UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE18 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Enabled (0x1UL)

/* SUBSCRIBE19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Pos (19UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE19 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Enabled (0x1UL)

/* SUBSCRIBE20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Pos (20UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE20 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE20_Enabled (0x1UL)

