pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* SUBSCRIBE21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Pos (21UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE21 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE21_Enabled (0x1UL)

/* SUBSCRIBE22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Pos (22UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE22 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE22_Enabled (0x1UL)

/* SUBSCRIBE23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Pos (23UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE23 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE23_Enabled (0x1UL)

/* SUBSCRIBE24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Pos (24UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE24 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE24_Enabled (0x1UL)

/* SUBSCRIBE25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Pos (25UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE25 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE25_Enabled (0x1UL)

/* SUBSCRIBE26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Pos (26UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE26 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE26_Enabled (0x1UL)

/* SUBSCRIBE27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Pos (27UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE27 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE27_Enabled (0x1UL)

/* SUBSCRIBE28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Pos (28UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE28 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE28_Enabled (0x1UL)

/* SUBSCRIBE29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Pos (29UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE29 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE29_Enabled (0x1UL)

/* SUBSCRIBE30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Pos (30UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE30 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE30_Enabled (0x1UL)

/* SUBSCRIBE31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Pos (31UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE31 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Min (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Max (0x1UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Disabled (0x0UL)
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE31_Enabled (0x1UL)


/**
  * @brief EVENTS [VPRCSR_NORDIC_EVENTS] DPPI Events
  */
  #define VPRCSR_NORDIC_EVENTS (0x000007E2ul)
  #define VPRCSR_NORDIC_EVENTS_ResetValue (0x00000000UL)

/* EVENTS0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Pos (0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS0_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Enabled (0x1UL)

/* EVENTS1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Pos (1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS1_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Enabled (0x1UL)

/* EVENTS2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Pos (2UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS2_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Enabled (0x1UL)

