pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EVENTS3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Pos (3UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS3_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Enabled (0x1UL)

/* EVENTS4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Pos (4UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS4_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Enabled (0x1UL)

/* EVENTS5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Pos (5UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS5_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Enabled (0x1UL)

/* EVENTS6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Pos (6UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS6_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Enabled (0x1UL)

/* EVENTS7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Pos (7UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS7_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Enabled (0x1UL)

/* EVENTS8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Pos (8UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS8_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Enabled (0x1UL)

/* EVENTS9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Pos (9UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS9_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Enabled (0x1UL)

/* EVENTS10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Pos (10UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS10_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Enabled (0x1UL)

/* EVENTS11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Pos (11UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS11_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Enabled (0x1UL)

/* EVENTS12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Pos (12UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS12_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Enabled (0x1UL)

/* EVENTS13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Pos (13UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS13_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Enabled (0x1UL)

/* EVENTS14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Pos (14UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS14_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Enabled (0x1UL)

/* EVENTS15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Pos (15UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS15_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Enabled (0x1UL)

/* EVENTS16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Pos (16UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS16_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Enabled (0x1UL)

/* EVENTS17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Pos (17UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS17_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Enabled (0x1UL)

/* EVENTS18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Pos (18UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS18_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Enabled (0x1UL)

/* EVENTS19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Pos (19UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS19_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Enabled (0x1UL)

/* EVENTS20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Pos (20UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS20_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Enabled (0x1UL)

