pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EVENTS21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Pos (21UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS21_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Enabled (0x1UL)

/* EVENTS22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Pos (22UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS22_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Enabled (0x1UL)

/* EVENTS23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Pos (23UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS23_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Enabled (0x1UL)

/* EVENTS24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Pos (24UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS24_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Enabled (0x1UL)

/* EVENTS25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Pos (25UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS25_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Enabled (0x1UL)

/* EVENTS26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Pos (26UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS26_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS26_Enabled (0x1UL)

/* EVENTS27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Pos (27UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS27_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS27_Enabled (0x1UL)

/* EVENTS28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Pos (28UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS28_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS28_Enabled (0x1UL)

/* EVENTS29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Pos (29UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS29_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS29_Enabled (0x1UL)

/* EVENTS30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Pos (30UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS30_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS30_Enabled (0x1UL)

/* EVENTS31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Pos (31UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS31_Pos)
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTS_EVENTS31_Enabled (0x1UL)


/**
  * @brief PUBLISH [VPRCSR_NORDIC_PUBLISH] Enable Event Publication
  */
  #define VPRCSR_NORDIC_PUBLISH (0x000007E3ul)
  #define VPRCSR_NORDIC_PUBLISH_ResetValue (0x00000000UL)

/* PUBLISH0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH0_Pos (0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH0_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH0_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH0_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH0_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH0_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH0_Enabled (0x1UL)

/* PUBLISH1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH1_Pos (1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH1_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH1_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH1_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH1_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH1_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH1_Enabled (0x1UL)

/* PUBLISH2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Pos (2UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH2_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH2_Enabled (0x1UL)

/* PUBLISH3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Pos (3UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH3_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH3_Enabled (0x1UL)

/* PUBLISH4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Pos (4UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH4_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH4_Enabled (0x1UL)

/* PUBLISH5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Pos (5UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH5_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH5_Enabled (0x1UL)

