pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PUBLISH6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Pos (6UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH6_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH6_Enabled (0x1UL)

/* PUBLISH7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Pos (7UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH7_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH7_Enabled (0x1UL)

/* PUBLISH8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Pos (8UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH8_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH8_Enabled (0x1UL)

/* PUBLISH9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Pos (9UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH9_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH9_Enabled (0x1UL)

/* PUBLISH10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Pos (10UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH10_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH10_Enabled (0x1UL)

/* PUBLISH11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Pos (11UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH11_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH11_Enabled (0x1UL)

/* PUBLISH12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Pos (12UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH12_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH12_Enabled (0x1UL)

/* PUBLISH13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Pos (13UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH13_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH13_Enabled (0x1UL)

/* PUBLISH14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Pos (14UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH14_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH14_Enabled (0x1UL)

/* PUBLISH15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Pos (15UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH15_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH15_Enabled (0x1UL)

/* PUBLISH16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Pos (16UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH16_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH16_Enabled (0x1UL)

/* PUBLISH17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Pos (17UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH17_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH17_Enabled (0x1UL)

/* PUBLISH18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Pos (18UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH18_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH18_Enabled (0x1UL)

/* PUBLISH19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Pos (19UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH19_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH19_Enabled (0x1UL)

/* PUBLISH20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Pos (20UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH20_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH20_Enabled (0x1UL)

/* PUBLISH21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Pos (21UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH21_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH21_Enabled (0x1UL)

/* PUBLISH22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Pos (22UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH22_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH22_Enabled (0x1UL)

