pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PUBLISH23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Pos (23UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH23_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Enabled (0x1UL)

/* PUBLISH24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Pos (24UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH24_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Enabled (0x1UL)

/* PUBLISH25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Pos (25UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH25_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Enabled (0x1UL)

/* PUBLISH26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Pos (26UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH26_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Enabled (0x1UL)

/* PUBLISH27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Pos (27UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH27_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Enabled (0x1UL)

/* PUBLISH28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Pos (28UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH28_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Enabled (0x1UL)

/* PUBLISH29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Pos (29UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH29_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Enabled (0x1UL)

/* PUBLISH30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Pos (30UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH30_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Enabled (0x1UL)

/* PUBLISH31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH31_Pos (31UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH31_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH31_Pos)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH31_Min (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH31_Max (0x1UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH31_Disabled (0x0UL)
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH31_Enabled (0x1UL)


/**
  * @brief INTEN [VPRCSR_NORDIC_INTEN] DPPI Event Interrupt Enable
  */
  #define VPRCSR_NORDIC_INTEN (0x000007E4ul)
  #define VPRCSR_NORDIC_INTEN_ResetValue (0x00000000UL)

/* INTEN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN0_Pos (0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN0_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN0_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN0_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN0_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN0_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN0_Enabled (0x1UL)

/* INTEN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN1_Pos (1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN1_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN1_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN1_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN1_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN1_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN1_Enabled (0x1UL)

/* INTEN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN2_Pos (2UL)
  #define VPRCSR_NORDIC_INTEN_INTEN2_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN2_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN2_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN2_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN2_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN2_Enabled (0x1UL)

/* INTEN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN3_Pos (3UL)
  #define VPRCSR_NORDIC_INTEN_INTEN3_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN3_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN3_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN3_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN3_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN3_Enabled (0x1UL)

/* INTEN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN4_Pos (4UL)
  #define VPRCSR_NORDIC_INTEN_INTEN4_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN4_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN4_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN4_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN4_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN4_Enabled (0x1UL)

/* INTEN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN5_Pos (5UL)
  #define VPRCSR_NORDIC_INTEN_INTEN5_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN5_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN5_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN5_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN5_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN5_Enabled (0x1UL)

