pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INTEN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN6_Pos (6UL)
  #define VPRCSR_NORDIC_INTEN_INTEN6_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN6_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN6_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN6_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN6_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN6_Enabled (0x1UL)

/* INTEN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN7_Pos (7UL)
  #define VPRCSR_NORDIC_INTEN_INTEN7_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN7_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN7_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN7_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN7_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN7_Enabled (0x1UL)

/* INTEN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN8_Pos (8UL)
  #define VPRCSR_NORDIC_INTEN_INTEN8_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN8_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN8_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN8_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN8_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN8_Enabled (0x1UL)

/* INTEN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN9_Pos (9UL)
  #define VPRCSR_NORDIC_INTEN_INTEN9_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN9_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN9_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN9_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN9_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN9_Enabled (0x1UL)

/* INTEN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN10_Pos (10UL)
  #define VPRCSR_NORDIC_INTEN_INTEN10_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN10_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN10_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN10_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN10_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN10_Enabled (0x1UL)

/* INTEN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN11_Pos (11UL)
  #define VPRCSR_NORDIC_INTEN_INTEN11_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN11_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN11_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN11_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN11_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN11_Enabled (0x1UL)

/* INTEN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN12_Pos (12UL)
  #define VPRCSR_NORDIC_INTEN_INTEN12_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN12_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN12_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN12_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN12_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN12_Enabled (0x1UL)

/* INTEN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN13_Pos (13UL)
  #define VPRCSR_NORDIC_INTEN_INTEN13_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN13_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN13_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN13_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN13_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN13_Enabled (0x1UL)

/* INTEN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN14_Pos (14UL)
  #define VPRCSR_NORDIC_INTEN_INTEN14_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN14_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN14_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN14_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN14_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN14_Enabled (0x1UL)

/* INTEN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN15_Pos (15UL)
  #define VPRCSR_NORDIC_INTEN_INTEN15_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN15_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN15_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN15_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN15_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN15_Enabled (0x1UL)

/* INTEN16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN16_Pos (16UL)
  #define VPRCSR_NORDIC_INTEN_INTEN16_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN16_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN16_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN16_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN16_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN16_Enabled (0x1UL)

/* INTEN17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Pos (17UL)
  #define VPRCSR_NORDIC_INTEN_INTEN17_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN17_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN17_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN17_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN17_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN17_Enabled (0x1UL)

/* INTEN18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Pos (18UL)
  #define VPRCSR_NORDIC_INTEN_INTEN18_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN18_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN18_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN18_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN18_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN18_Enabled (0x1UL)

/* INTEN19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Pos (19UL)
  #define VPRCSR_NORDIC_INTEN_INTEN19_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN19_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN19_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN19_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN19_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN19_Enabled (0x1UL)

/* INTEN20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Pos (20UL)
  #define VPRCSR_NORDIC_INTEN_INTEN20_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN20_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN20_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN20_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN20_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN20_Enabled (0x1UL)

/* INTEN21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Pos (21UL)
  #define VPRCSR_NORDIC_INTEN_INTEN21_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN21_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN21_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN21_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN21_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN21_Enabled (0x1UL)

/* INTEN22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Pos (22UL)
  #define VPRCSR_NORDIC_INTEN_INTEN22_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN22_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN22_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN22_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN22_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN22_Enabled (0x1UL)

/* INTEN23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Pos (23UL)
  #define VPRCSR_NORDIC_INTEN_INTEN23_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN23_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN23_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN23_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN23_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN23_Enabled (0x1UL)

/* INTEN24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Pos (24UL)
  #define VPRCSR_NORDIC_INTEN_INTEN24_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN24_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN24_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN24_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN24_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN24_Enabled (0x1UL)

/* INTEN25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Pos (25UL)
  #define VPRCSR_NORDIC_INTEN_INTEN25_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN25_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN25_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN25_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN25_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN25_Enabled (0x1UL)

