pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* INTEN26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Pos (26UL)
  #define VPRCSR_NORDIC_INTEN_INTEN26_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN26_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN26_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN26_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN26_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN26_Enabled (0x1UL)

/* INTEN27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Pos (27UL)
  #define VPRCSR_NORDIC_INTEN_INTEN27_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN27_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN27_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN27_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN27_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN27_Enabled (0x1UL)

/* INTEN28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Pos (28UL)
  #define VPRCSR_NORDIC_INTEN_INTEN28_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN28_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN28_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN28_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN28_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN28_Enabled (0x1UL)

/* INTEN29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Pos (29UL)
  #define VPRCSR_NORDIC_INTEN_INTEN29_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN29_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN29_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN29_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN29_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN29_Enabled (0x1UL)

/* INTEN30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Pos (30UL)
  #define VPRCSR_NORDIC_INTEN_INTEN30_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN30_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN30_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN30_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN30_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN30_Enabled (0x1UL)

/* INTEN31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Pos (31UL)
  #define VPRCSR_NORDIC_INTEN_INTEN31_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN31_Pos)
  #define VPRCSR_NORDIC_INTEN_INTEN31_Min (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN31_Max (0x1UL)
  #define VPRCSR_NORDIC_INTEN_INTEN31_Disabled (0x0UL)
  #define VPRCSR_NORDIC_INTEN_INTEN31_Enabled (0x1UL)


/**
  * @brief EVENTSB [VPRCSR_NORDIC_EVENTSB] Buffered DPPI Events
  */
  #define VPRCSR_NORDIC_EVENTSB (0x000007E5ul)
  #define VPRCSR_NORDIC_EVENTSB_ResetValue (0x00000000UL)

/* EVENTSB0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Pos (0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB0_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Enabled (0x1UL)

/* EVENTSB1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Pos (1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB1_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Enabled (0x1UL)

/* EVENTSB2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Pos (2UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB2_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Enabled (0x1UL)

/* EVENTSB3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Pos (3UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB3_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Enabled (0x1UL)

/* EVENTSB4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB4_Pos (4UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB4_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB4_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB4_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB4_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB4_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB4_Enabled (0x1UL)

/* EVENTSB5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB5_Pos (5UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB5_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB5_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB5_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB5_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB5_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB5_Enabled (0x1UL)

/* EVENTSB6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB6_Pos (6UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB6_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB6_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB6_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB6_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB6_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB6_Enabled (0x1UL)

/* EVENTSB7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB7_Pos (7UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB7_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB7_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB7_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB7_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB7_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB7_Enabled (0x1UL)

/* EVENTSB8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB8_Pos (8UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB8_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB8_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB8_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB8_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB8_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB8_Enabled (0x1UL)

/* EVENTSB9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB9_Pos (9UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB9_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB9_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB9_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB9_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB9_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB9_Enabled (0x1UL)

/* EVENTSB10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB10_Pos (10UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB10_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB10_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB10_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB10_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB10_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB10_Enabled (0x1UL)

/* EVENTSB11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB11_Pos (11UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB11_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB11_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB11_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB11_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB11_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB11_Enabled (0x1UL)

/* EVENTSB12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB12_Pos (12UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB12_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB12_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB12_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB12_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB12_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB12_Enabled (0x1UL)

