pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EVENTSB13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB13_Pos (13UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB13_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB13_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB13_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB13_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB13_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB13_Enabled (0x1UL)

/* EVENTSB14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB14_Pos (14UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB14_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB14_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB14_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB14_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB14_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB14_Enabled (0x1UL)

/* EVENTSB15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB15_Pos (15UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB15_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB15_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB15_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB15_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB15_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB15_Enabled (0x1UL)

/* EVENTSB16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB16_Pos (16UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB16_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB16_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB16_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB16_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB16_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB16_Enabled (0x1UL)

/* EVENTSB17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB17_Pos (17UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB17_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB17_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB17_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB17_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB17_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB17_Enabled (0x1UL)

/* EVENTSB18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB18_Pos (18UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB18_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB18_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB18_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB18_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB18_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB18_Enabled (0x1UL)

/* EVENTSB19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB19_Pos (19UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB19_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB19_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB19_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB19_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB19_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB19_Enabled (0x1UL)

/* EVENTSB20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB20_Pos (20UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB20_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB20_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB20_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB20_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB20_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB20_Enabled (0x1UL)

/* EVENTSB21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB21_Pos (21UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB21_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB21_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB21_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB21_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB21_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB21_Enabled (0x1UL)

/* EVENTSB22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB22_Pos (22UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB22_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB22_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB22_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB22_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB22_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB22_Enabled (0x1UL)

/* EVENTSB23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB23_Pos (23UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB23_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB23_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB23_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB23_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB23_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB23_Enabled (0x1UL)

/* EVENTSB24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB24_Pos (24UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB24_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB24_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB24_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB24_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB24_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB24_Enabled (0x1UL)

/* EVENTSB25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB25_Pos (25UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB25_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB25_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB25_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB25_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB25_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB25_Enabled (0x1UL)

/* EVENTSB26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB26_Pos (26UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB26_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB26_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB26_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB26_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB26_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB26_Enabled (0x1UL)

/* EVENTSB27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB27_Pos (27UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB27_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB27_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB27_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB27_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB27_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB27_Enabled (0x1UL)

