pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* EVENTSB28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB28_Pos (28UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB28_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB28_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB28_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB28_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB28_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB28_Enabled (0x1UL)

/* EVENTSB29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB29_Pos (29UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB29_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB29_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB29_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB29_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB29_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB29_Enabled (0x1UL)

/* EVENTSB30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Pos (30UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB30_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB30_Enabled (0x1UL)

/* EVENTSB31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Pos (31UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB31_Pos)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Disabled (0x0UL)
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB31_Enabled (0x1UL)


/**
  * @brief EVENTSBS [VPRCSR_NORDIC_EVENTSBS] EVENTSB Dirty Status
  */
  #define VPRCSR_NORDIC_EVENTSBS (0x000007E6ul)
  #define VPRCSR_NORDIC_EVENTSBS_ResetValue (0x00000000UL)

/* EVENTSB @Bits 0..31 : Write to EVENTSB (if not dirty) */
  #define VPRCSR_NORDIC_EVENTSBS_EVENTSB_Pos (0UL)
  #define VPRCSR_NORDIC_EVENTSBS_EVENTSB_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_EVENTSBS_EVENTSB_Pos) /*!< Bit mask of EVENTSB
                                                                            field.*/

/* DIRTYBIT @Bit 0 : Read EVENTSB Dirty status */
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Pos (0UL)
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Msk (0x1UL << VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Pos)
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Min (0x0UL)
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_Max (0x1UL)
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_CLEAN (0x0UL)
  #define VPRCSR_NORDIC_EVENTSBS_DIRTYBIT_DIRTY (0x1UL)


/**
  * @brief OUT [VPRCSR_NORDIC_OUT] GPIO Output value. Real Time Peripherals VIO.
  */
  #define VPRCSR_NORDIC_OUT (0x00000BC0ul)
  #define VPRCSR_NORDIC_OUT_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN0_Pos (0UL)
  #define VPRCSR_NORDIC_OUT_PIN0_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN0_Pos)
  #define VPRCSR_NORDIC_OUT_PIN0_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN0_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN0_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN0_HIGH (0x1UL)

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN1_Pos (1UL)
  #define VPRCSR_NORDIC_OUT_PIN1_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN1_Pos)
  #define VPRCSR_NORDIC_OUT_PIN1_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN1_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN1_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN1_HIGH (0x1UL)

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN2_Pos (2UL)
  #define VPRCSR_NORDIC_OUT_PIN2_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN2_Pos)
  #define VPRCSR_NORDIC_OUT_PIN2_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN2_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN2_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN2_HIGH (0x1UL)

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN3_Pos (3UL)
  #define VPRCSR_NORDIC_OUT_PIN3_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN3_Pos)
  #define VPRCSR_NORDIC_OUT_PIN3_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN3_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN3_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN3_HIGH (0x1UL)

/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN4_Pos (4UL)
  #define VPRCSR_NORDIC_OUT_PIN4_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN4_Pos)
  #define VPRCSR_NORDIC_OUT_PIN4_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN4_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN4_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN4_HIGH (0x1UL)

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN5_Pos (5UL)
  #define VPRCSR_NORDIC_OUT_PIN5_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN5_Pos)
  #define VPRCSR_NORDIC_OUT_PIN5_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN5_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN5_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN5_HIGH (0x1UL)

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN6_Pos (6UL)
  #define VPRCSR_NORDIC_OUT_PIN6_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN6_Pos)
  #define VPRCSR_NORDIC_OUT_PIN6_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN6_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN6_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN6_HIGH (0x1UL)

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN7_Pos (7UL)
  #define VPRCSR_NORDIC_OUT_PIN7_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN7_Pos)
  #define VPRCSR_NORDIC_OUT_PIN7_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN7_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN7_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN7_HIGH (0x1UL)

/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN8_Pos (8UL)
  #define VPRCSR_NORDIC_OUT_PIN8_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN8_Pos)
  #define VPRCSR_NORDIC_OUT_PIN8_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN8_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN8_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN8_HIGH (0x1UL)

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_OUT_PIN9_Pos (9UL)
  #define VPRCSR_NORDIC_OUT_PIN9_Msk (0x1UL << VPRCSR_NORDIC_OUT_PIN9_Pos)
  #define VPRCSR_NORDIC_OUT_PIN9_Min (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN9_Max (0x1UL)
  #define VPRCSR_NORDIC_OUT_PIN9_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUT_PIN9_HIGH (0x1UL)

