pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN21_Pos (21UL)
  #define VPRCSR_NORDIC_OUTB_PIN21_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN21_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN21_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN21_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN21_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN21_HIGH (0x1UL)

/* PIN22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN22_Pos (22UL)
  #define VPRCSR_NORDIC_OUTB_PIN22_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN22_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN22_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN22_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN22_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN22_HIGH (0x1UL)

/* PIN23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN23_Pos (23UL)
  #define VPRCSR_NORDIC_OUTB_PIN23_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN23_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN23_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN23_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN23_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN23_HIGH (0x1UL)

/* PIN24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN24_Pos (24UL)
  #define VPRCSR_NORDIC_OUTB_PIN24_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN24_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN24_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN24_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN24_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN24_HIGH (0x1UL)

/* PIN25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN25_Pos (25UL)
  #define VPRCSR_NORDIC_OUTB_PIN25_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN25_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN25_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN25_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN25_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN25_HIGH (0x1UL)

/* PIN26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN26_Pos (26UL)
  #define VPRCSR_NORDIC_OUTB_PIN26_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN26_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN26_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN26_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN26_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN26_HIGH (0x1UL)

/* PIN27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN27_Pos (27UL)
  #define VPRCSR_NORDIC_OUTB_PIN27_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN27_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN27_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN27_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN27_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN27_HIGH (0x1UL)

/* PIN28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN28_Pos (28UL)
  #define VPRCSR_NORDIC_OUTB_PIN28_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN28_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN28_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN28_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN28_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN28_HIGH (0x1UL)

/* PIN29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN29_Pos (29UL)
  #define VPRCSR_NORDIC_OUTB_PIN29_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN29_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN29_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN29_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN29_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN29_HIGH (0x1UL)

/* PIN30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN30_Pos (30UL)
  #define VPRCSR_NORDIC_OUTB_PIN30_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN30_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN30_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN30_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN30_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN30_HIGH (0x1UL)

/* PIN31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN31_Pos (31UL)
  #define VPRCSR_NORDIC_OUTB_PIN31_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN31_Pos)
  #define VPRCSR_NORDIC_OUTB_PIN31_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN31_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTB_PIN31_LOW (0x0UL)
  #define VPRCSR_NORDIC_OUTB_PIN31_HIGH (0x1UL)


/**
  * @brief DIRB [VPRCSR_NORDIC_DIRB] Buffered GPIO pin Direction
  */
  #define VPRCSR_NORDIC_DIRB (0x00000BC5ul)
  #define VPRCSR_NORDIC_DIRB_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN0_Pos (0UL)
  #define VPRCSR_NORDIC_DIRB_PIN0_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN0_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN0_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN0_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN0_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN0_OUTPUT (0x1UL)

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN1_Pos (1UL)
  #define VPRCSR_NORDIC_DIRB_PIN1_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN1_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN1_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN1_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN1_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN1_OUTPUT (0x1UL)

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN2_Pos (2UL)
  #define VPRCSR_NORDIC_DIRB_PIN2_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN2_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN2_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN2_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN2_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN2_OUTPUT (0x1UL)

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN3_Pos (3UL)
  #define VPRCSR_NORDIC_DIRB_PIN3_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN3_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN3_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN3_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN3_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN3_OUTPUT (0x1UL)

/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN4_Pos (4UL)
  #define VPRCSR_NORDIC_DIRB_PIN4_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN4_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN4_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN4_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN4_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN4_OUTPUT (0x1UL)

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN5_Pos (5UL)
  #define VPRCSR_NORDIC_DIRB_PIN5_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN5_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN5_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN5_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN5_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN5_OUTPUT (0x1UL)

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN6_Pos (6UL)
  #define VPRCSR_NORDIC_DIRB_PIN6_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN6_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN6_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN6_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN6_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN6_OUTPUT (0x1UL)

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN7_Pos (7UL)
  #define VPRCSR_NORDIC_DIRB_PIN7_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN7_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN7_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN7_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN7_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN7_OUTPUT (0x1UL)

