pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN8_Pos (8UL)
  #define VPRCSR_NORDIC_DIRB_PIN8_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN8_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN8_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN8_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN8_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN8_OUTPUT (0x1UL)

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN9_Pos (9UL)
  #define VPRCSR_NORDIC_DIRB_PIN9_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN9_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN9_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN9_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN9_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN9_OUTPUT (0x1UL)

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN10_Pos (10UL)
  #define VPRCSR_NORDIC_DIRB_PIN10_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN10_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN10_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN10_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN10_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN10_OUTPUT (0x1UL)

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN11_Pos (11UL)
  #define VPRCSR_NORDIC_DIRB_PIN11_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN11_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN11_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN11_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN11_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN11_OUTPUT (0x1UL)

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN12_Pos (12UL)
  #define VPRCSR_NORDIC_DIRB_PIN12_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN12_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN12_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN12_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN12_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN12_OUTPUT (0x1UL)

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN13_Pos (13UL)
  #define VPRCSR_NORDIC_DIRB_PIN13_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN13_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN13_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN13_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN13_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN13_OUTPUT (0x1UL)

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN14_Pos (14UL)
  #define VPRCSR_NORDIC_DIRB_PIN14_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN14_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN14_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN14_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN14_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN14_OUTPUT (0x1UL)

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN15_Pos (15UL)
  #define VPRCSR_NORDIC_DIRB_PIN15_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN15_Pos)
  #define VPRCSR_NORDIC_DIRB_PIN15_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN15_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRB_PIN15_INPUT (0x0UL)
  #define VPRCSR_NORDIC_DIRB_PIN15_OUTPUT (0x1UL)


/**
  * @brief DIROUT [VPRCSR_NORDIC_DIROUT] DIR and OUT concatenation
  */
  #define VPRCSR_NORDIC_DIROUT (0x00000BC6ul)
  #define VPRCSR_NORDIC_DIROUT_ResetValue (0x00000000UL)

/* OUT @Bits 0..15 : GPIO Output */
  #define VPRCSR_NORDIC_DIROUT_OUT_Pos (0UL)
  #define VPRCSR_NORDIC_DIROUT_OUT_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUT_OUT_Pos)

/* DIR @Bits 16..31 : GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUT_DIR_Pos (16UL)
  #define VPRCSR_NORDIC_DIROUT_DIR_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUT_DIR_Pos)


/**
  * @brief DIROUTB [VPRCSR_NORDIC_DIROUTB] Concatenation of DIRB and OUTB
  */
  #define VPRCSR_NORDIC_DIROUTB (0x00000BC7ul)
  #define VPRCSR_NORDIC_DIROUTB_ResetValue (0x00000000UL)

/* OUTB @Bits 0..15 : Buffered GPIO Output */
  #define VPRCSR_NORDIC_DIROUTB_OUTB_Pos (0UL)
  #define VPRCSR_NORDIC_DIROUTB_OUTB_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUTB_OUTB_Pos)

/* DIRB @Bits 16..31 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB_Pos (16UL)
  #define VPRCSR_NORDIC_DIROUTB_DIRB_Msk (0xFFFFUL << VPRCSR_NORDIC_DIROUTB_DIRB_Pos)


/**
  * @brief OUTBRB [VPRCSR_NORDIC_OUTBRB] Byte reversed register OUTB
  */
  #define VPRCSR_NORDIC_OUTBRB (0x00000BC8ul)
  #define VPRCSR_NORDIC_OUTBRB_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBRB_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_OUTBRB_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_OUTBRB_VAL_Pos)
  #define VPRCSR_NORDIC_OUTBRB_VAL_Min (0x00000000UL)
  #define VPRCSR_NORDIC_OUTBRB_VAL_Max (0xFFFFFFFFUL)


/**
  * @brief OUTBRW [VPRCSR_NORDIC_OUTBRW] Word reversed register OUTB
  */
  #define VPRCSR_NORDIC_OUTBRW (0x00000BC9ul)
  #define VPRCSR_NORDIC_OUTBRW_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBRW_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_OUTBRW_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_OUTBRW_VAL_Pos)
  #define VPRCSR_NORDIC_OUTBRW_VAL_Min (0x00000000UL)
  #define VPRCSR_NORDIC_OUTBRW_VAL_Max (0xFFFFFFFFUL)


/**
  * @brief INBRB [VPRCSR_NORDIC_INBRB] Byte reversed register INB
  */
  #define VPRCSR_NORDIC_INBRB (0x00000BCAul)
  #define VPRCSR_NORDIC_INBRB_ResetValue (0x00000000UL)

/* VAL @Bits 0..31 : (unspecified) */
  #define VPRCSR_NORDIC_INBRB_VAL_Pos (0UL)
  #define VPRCSR_NORDIC_INBRB_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_INBRB_VAL_Pos)
  #define VPRCSR_NORDIC_INBRB_VAL_Min (0x00000000UL)
  #define VPRCSR_NORDIC_INBRB_VAL_Max (0xFFFFFFFFUL)


/**
  * @brief SHIFTCTRLB [VPRCSR_NORDIC_SHIFTCTRLB] Buffered IO shift control
  */
  #define VPRCSR_NORDIC_SHIFTCTRLB (0x00000BCBul)
  #define VPRCSR_NORDIC_SHIFTCTRLB_ResetValue (0x00000000UL)

/* Field group SHIFTCNTB : (unspecified) */
/* VALUE @Bits 0..5 : Alias to SHIFTCNTB.VALUE register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Pos (0UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Min (0x00UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Max (0x20UL)

/* End field group SHIFTCNTB. */

/* Field group OUTMODEB : (unspecified) */
/* MODE @Bits 8..10 : Alias to OUTMODEB.MODE register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Pos (8UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Msk (0x7UL << VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Pos) /*!< Bit mask of
                                                                            MODE field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Min (0x0UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Max (0x4UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_NoShifting (0x0UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_OutBBuf (0x2UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_OutBBufToggleClk (0x4UL) /*!< Only OUTB used for buffering, auto-toggle clock
                                                                            line*/

/* FRAMEWIDTH @Bits 12..16 : Alias to OUTMODEB.FRAMEWIDTH register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Pos (12UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Msk (0x1FUL << VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Pos) /*!<
                                                                            Bit mask of FRAMEWIDTH field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Min (0x00UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Max (0x10UL)

