pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* End field group OUTMODEB. */

/* Field group INMODEB : (unspecified) */
/* MODE @Bits 20..21 : Alias to INMODEB.MODE register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Pos (20UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Msk (0x3UL << VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Pos) /*!< Bit mask of MODE
                                                                            field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Min (0x0UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Max (0x2UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_CONTINUOUS (0x0UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_EVENT (0x1UL)
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_SHIFT (0x2UL)

/* End field group INMODEB. */


/**
  * @brief SHIFTCNTIN [VPRCSR_NORDIC_SHIFTCNTIN] Number of frames to be shifted from INB before new data is required
  */
  #define VPRCSR_NORDIC_SHIFTCNTIN (0x00000BCDul)
  #define VPRCSR_NORDIC_SHIFTCNTIN_ResetValue (0x00000000UL)

/* VALUE @Bits 0..5 : Value */
  #define VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Pos (0UL)
  #define VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Pos)
  #define VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Min (0x00UL)
  #define VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Max (0x3FUL)


/**
  * @brief SHIFTCNTOUT [VPRCSR_NORDIC_SHIFTCNTOUT] Number of frames to be shifted to OUTB before new data is required
  */
  #define VPRCSR_NORDIC_SHIFTCNTOUT (0x00000BCEul)
  #define VPRCSR_NORDIC_SHIFTCNTOUT_ResetValue (0x00000000UL)

/* VALUE @Bits 0..5 : Value */
  #define VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Pos (0UL)
  #define VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Pos)
  #define VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Min (0x00UL)
  #define VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Max (0x3FUL)


/**
  * @brief SHIFTCNTB [VPRCSR_NORDIC_SHIFTCNTB] Buffered SHIFTCNTOUT register
  */
  #define VPRCSR_NORDIC_SHIFTCNTB (0x00000BCFul)
  #define VPRCSR_NORDIC_SHIFTCNTB_ResetValue (0x00000000UL)

/* VALUE @Bits 0..5 : Value */
  #define VPRCSR_NORDIC_SHIFTCNTB_VALUE_Pos (0UL)
  #define VPRCSR_NORDIC_SHIFTCNTB_VALUE_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTB_VALUE_Pos)
  #define VPRCSR_NORDIC_SHIFTCNTB_VALUE_Min (0x00UL)
  #define VPRCSR_NORDIC_SHIFTCNTB_VALUE_Max (0x20UL)


/**
  * @brief OUTTGL [VPRCSR_NORDIC_OUTTGL] GPIO Output Toggle
  */
  #define VPRCSR_NORDIC_OUTTGL (0x00000BD0ul)
  #define VPRCSR_NORDIC_OUTTGL_ResetValue (0x00000000UL)

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Pos (0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN0_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN0_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN0_TOGGLE (0x1UL)

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Pos (1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN1_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN1_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN1_TOGGLE (0x1UL)

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Pos (2UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN2_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN2_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN2_TOGGLE (0x1UL)

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Pos (3UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN3_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN3_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN3_TOGGLE (0x1UL)

/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN4_Pos (4UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN4_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN4_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN4_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN4_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN4_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN4_TOGGLE (0x1UL)

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN5_Pos (5UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN5_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN5_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN5_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN5_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN5_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN5_TOGGLE (0x1UL)

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN6_Pos (6UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN6_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN6_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN6_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN6_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN6_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN6_TOGGLE (0x1UL)

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN7_Pos (7UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN7_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN7_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN7_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN7_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN7_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN7_TOGGLE (0x1UL)

/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN8_Pos (8UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN8_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN8_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN8_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN8_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN8_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN8_TOGGLE (0x1UL)

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN9_Pos (9UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN9_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN9_Pos)
  #define VPRCSR_NORDIC_OUTTGL_PIN9_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN9_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN9_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTTGL_PIN9_TOGGLE (0x1UL)

