pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_Pos (10UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN10_Pos)
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_TOGGLE (0x1UL)

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_Pos (11UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN11_Pos)
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_TOGGLE (0x1UL)

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_Pos (12UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN12_Pos)
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_TOGGLE (0x1UL)

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_Pos (13UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN13_Pos)
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_TOGGLE (0x1UL)

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_Pos (14UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN14_Pos)
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_TOGGLE (0x1UL)

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_Pos (15UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN15_Pos)
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_TOGGLE (0x1UL)


/**
  * @brief DIROUTTGL [VPRCSR_NORDIC_DIROUTTGL] DIROUT Toggle
  */
  #define VPRCSR_NORDIC_DIROUTTGL (0x00000BD4ul)
  #define VPRCSR_NORDIC_DIROUTTGL_ResetValue (0x00000000UL)

/* OUT0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_Pos (0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT0_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_TOGGLE (0x1UL)

/* OUT1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_Pos (1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT1_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT1_TOGGLE (0x1UL)

/* OUT2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_Pos (2UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT2_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT2_TOGGLE (0x1UL)

/* OUT3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_Pos (3UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT3_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT3_TOGGLE (0x1UL)

/* OUT4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_Pos (4UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT4_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT4_TOGGLE (0x1UL)

/* OUT5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_Pos (5UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT5_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT5_TOGGLE (0x1UL)

/* OUT6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_Pos (6UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT6_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT6_TOGGLE (0x1UL)

/* OUT7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_Pos (7UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT7_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT7_TOGGLE (0x1UL)

/* OUT8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_Pos (8UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT8_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT8_TOGGLE (0x1UL)

/* OUT9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_Pos (9UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT9_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT9_TOGGLE (0x1UL)

/* OUT10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_Pos (10UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT10_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT10_TOGGLE (0x1UL)

