pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* OUT11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_Pos (11UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT11_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT11_TOGGLE (0x1UL)

/* OUT12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_Pos (12UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT12_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT12_TOGGLE (0x1UL)

/* OUT13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_Pos (13UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT13_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT13_TOGGLE (0x1UL)

/* OUT14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_Pos (14UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT14_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT14_TOGGLE (0x1UL)

/* OUT15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_Pos (15UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT15_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_OUT15_TOGGLE (0x1UL)

/* DIR0 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_Pos (16UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR0_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR0_TOGGLE (0x1UL)

/* DIR1 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_Pos (17UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR1_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR1_TOGGLE (0x1UL)

/* DIR2 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_Pos (18UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR2_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR2_TOGGLE (0x1UL)

/* DIR3 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_Pos (19UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR3_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR3_TOGGLE (0x1UL)

/* DIR4 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_Pos (20UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR4_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR4_TOGGLE (0x1UL)

/* DIR5 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_Pos (21UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR5_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR5_TOGGLE (0x1UL)

/* DIR6 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_Pos (22UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR6_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR6_TOGGLE (0x1UL)

/* DIR7 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_Pos (23UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR7_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR7_TOGGLE (0x1UL)

/* DIR8 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_Pos (24UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR8_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR8_TOGGLE (0x1UL)

/* DIR9 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_Pos (25UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR9_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR9_TOGGLE (0x1UL)

/* DIR10 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_Pos (26UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR10_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR10_TOGGLE (0x1UL)

/* DIR11 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_Pos (27UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR11_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR11_TOGGLE (0x1UL)

/* DIR12 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_Pos (28UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR12_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR12_TOGGLE (0x1UL)

