pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DIR13 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_Pos (29UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR13_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_TOGGLE (0x1UL)

/* DIR14 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_Pos (30UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR14_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_TOGGLE (0x1UL)

/* DIR15 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_Pos (31UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR15_Pos)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_TOGGLE (0x1UL)


/**
  * @brief DIROUTBTGL [VPRCSR_NORDIC_DIROUTBTGL] DIROUTB Toggle
  */
  #define VPRCSR_NORDIC_DIROUTBTGL (0x00000BD5ul)
  #define VPRCSR_NORDIC_DIROUTBTGL_ResetValue (0x00000000UL)

/* OUTB0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Pos (0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_TOGGLE (0x1UL)

/* OUTB1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Pos (1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_TOGGLE (0x1UL)

/* OUTB2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Pos (2UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_TOGGLE (0x1UL)

/* OUTB3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Pos (3UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_TOGGLE (0x1UL)

/* OUTB4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Pos (4UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_TOGGLE (0x1UL)

/* OUTB5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Pos (5UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_TOGGLE (0x1UL)

/* OUTB6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB6_Pos (6UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB6_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB6_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB6_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB6_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB6_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB6_TOGGLE (0x1UL)

/* OUTB7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB7_Pos (7UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB7_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB7_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB7_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB7_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB7_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB7_TOGGLE (0x1UL)

/* OUTB8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB8_Pos (8UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB8_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB8_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB8_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB8_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB8_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB8_TOGGLE (0x1UL)

/* OUTB9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB9_Pos (9UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB9_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB9_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB9_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB9_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB9_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB9_TOGGLE (0x1UL)

/* OUTB10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB10_Pos (10UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB10_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB10_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB10_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB10_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB10_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB10_TOGGLE (0x1UL)

/* OUTB11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB11_Pos (11UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB11_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB11_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB11_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB11_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB11_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB11_TOGGLE (0x1UL)

/* OUTB12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB12_Pos (12UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB12_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB12_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB12_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB12_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB12_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB12_TOGGLE (0x1UL)

/* OUTB13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB13_Pos (13UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB13_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB13_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB13_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB13_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB13_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB13_TOGGLE (0x1UL)

/* OUTB14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB14_Pos (14UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB14_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB14_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB14_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB14_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB14_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB14_TOGGLE (0x1UL)

/* OUTB15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB15_Pos (15UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB15_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB15_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB15_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB15_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB15_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB15_TOGGLE (0x1UL)

