pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* DIRB0 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB0_Pos (16UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB0_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB0_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB0_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB0_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB0_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB0_TOGGLE (0x1UL)

/* DIRB1 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB1_Pos (17UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB1_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB1_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB1_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB1_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB1_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB1_TOGGLE (0x1UL)

/* DIRB2 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB2_Pos (18UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB2_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB2_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB2_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB2_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB2_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB2_TOGGLE (0x1UL)

/* DIRB3 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB3_Pos (19UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB3_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB3_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB3_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB3_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB3_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB3_TOGGLE (0x1UL)

/* DIRB4 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB4_Pos (20UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB4_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB4_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB4_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB4_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB4_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB4_TOGGLE (0x1UL)

/* DIRB5 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB5_Pos (21UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB5_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB5_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB5_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB5_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB5_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB5_TOGGLE (0x1UL)

/* DIRB6 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB6_Pos (22UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB6_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB6_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB6_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB6_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB6_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB6_TOGGLE (0x1UL)

/* DIRB7 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB7_Pos (23UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB7_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB7_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB7_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB7_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB7_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB7_TOGGLE (0x1UL)

/* DIRB8 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB8_Pos (24UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB8_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB8_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB8_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB8_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB8_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB8_TOGGLE (0x1UL)

/* DIRB9 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Pos (25UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB9_TOGGLE (0x1UL)

/* DIRB10 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Pos (26UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB10_TOGGLE (0x1UL)

/* DIRB11 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Pos (27UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB11_TOGGLE (0x1UL)

/* DIRB12 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Pos (28UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB12_TOGGLE (0x1UL)

/* DIRB13 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Pos (29UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB13_TOGGLE (0x1UL)

/* DIRB14 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Pos (30UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB14_TOGGLE (0x1UL)

/* DIRB15 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Pos (31UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Pos)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Min (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_Max (0x1UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_DIROUTBTGL_DIRB15_TOGGLE (0x1UL)


/**
  * @brief OUTBS [VPRCSR_NORDIC_OUTBS] Buffered GPIO Output Dirty Status
  */
  #define VPRCSR_NORDIC_OUTBS (0x00000BD8ul)
  #define VPRCSR_NORDIC_OUTBS_ResetValue (0x00000000UL)

/* OUTB @Bits 0..31 : Write to OUTB (if not dirty) */
  #define VPRCSR_NORDIC_OUTBS_OUTB_Pos (0UL)
  #define VPRCSR_NORDIC_OUTBS_OUTB_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_OUTBS_OUTB_Pos)

/* DIRTYBIT @Bit 0 : Read Buffer Dirty status */
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_Pos (0UL)
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_Msk (0x1UL << VPRCSR_NORDIC_OUTBS_DIRTYBIT_Pos)
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_CLEAN (0x0UL)
  #define VPRCSR_NORDIC_OUTBS_DIRTYBIT_DIRTY (0x1UL)


/**
  * @brief DIRBS [VPRCSR_NORDIC_DIRBS] Buffered GPIO pin Direction Dirty Status
  */
  #define VPRCSR_NORDIC_DIRBS (0x00000BD9ul)
  #define VPRCSR_NORDIC_DIRBS_ResetValue (0x00000000UL)

/* DIRB @Bits 0..31 : Write to DIRB (if not dirty) */
  #define VPRCSR_NORDIC_DIRBS_DIRB_Pos (0UL)
  #define VPRCSR_NORDIC_DIRBS_DIRB_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_DIRBS_DIRB_Pos)

/* DIRTYBIT @Bit 0 : Read Buffer Dirty status */
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_Pos (0UL)
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_Msk (0x1UL << VPRCSR_NORDIC_DIRBS_DIRTYBIT_Pos)
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_Min (0x0UL)
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_Max (0x1UL)
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_CLEAN (0x0UL)
  #define VPRCSR_NORDIC_DIRBS_DIRTYBIT_DIRTY (0x1UL)


/**
  * @brief DIROUTBS [VPRCSR_NORDIC_DIROUTBS] Combination of DIRB and OUTB Dirty Status
  */
  #define VPRCSR_NORDIC_DIROUTBS (0x00000BDAul)
  #define VPRCSR_NORDIC_DIROUTBS_ResetValue (0x00000000UL)

