pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* OUTB1 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB1_Pos (17UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB1_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB1_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB1_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB1_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB1_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB1_TOGGLE (0x1UL)

/* OUTB2 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB2_Pos (18UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB2_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB2_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB2_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB2_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB2_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB2_TOGGLE (0x1UL)

/* OUTB3 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB3_Pos (19UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB3_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB3_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB3_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB3_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB3_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB3_TOGGLE (0x1UL)

/* OUTB4 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB4_Pos (20UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB4_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB4_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB4_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB4_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB4_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB4_TOGGLE (0x1UL)

/* OUTB5 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB5_Pos (21UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB5_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB5_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB5_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB5_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB5_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB5_TOGGLE (0x1UL)

/* OUTB6 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB6_Pos (22UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB6_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB6_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB6_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB6_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB6_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB6_TOGGLE (0x1UL)

/* OUTB7 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB7_Pos (23UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB7_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB7_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB7_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB7_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB7_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB7_TOGGLE (0x1UL)

/* OUTB8 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB8_Pos (24UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB8_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB8_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB8_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB8_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB8_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB8_TOGGLE (0x1UL)

/* OUTB9 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB9_Pos (25UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB9_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB9_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB9_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB9_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB9_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB9_TOGGLE (0x1UL)

/* OUTB10 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB10_Pos (26UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB10_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB10_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB10_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB10_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB10_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB10_TOGGLE (0x1UL)

/* OUTB11 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB11_Pos (27UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB11_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB11_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB11_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB11_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB11_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB11_TOGGLE (0x1UL)

/* OUTB12 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB12_Pos (28UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB12_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB12_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB12_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB12_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB12_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB12_TOGGLE (0x1UL)

/* OUTB13 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_Pos (29UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB13_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB13_TOGGLE (0x1UL)

/* OUTB14 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_Pos (30UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB14_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB14_TOGGLE (0x1UL)

/* OUTB15 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_Pos (31UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_Msk (0x1UL << VPRCSR_NORDIC_OUTBDTGL_OUTB15_Pos)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_UNCHANGED (0x0UL)
  #define VPRCSR_NORDIC_OUTBDTGL_OUTB15_TOGGLE (0x1UL)


/**
  * @brief OUTBDS [VPRCSR_NORDIC_OUTBDS] OUTBD Dirty Status
  */
  #define VPRCSR_NORDIC_OUTBDS (0x00000BE2ul)
  #define VPRCSR_NORDIC_OUTBDS_ResetValue (0x00000000UL)

/* OUTBD @Bits 0..31 : Write to OUTBD register (if not dirty) */
  #define VPRCSR_NORDIC_OUTBDS_OUTBD_Pos (0UL)
  #define VPRCSR_NORDIC_OUTBDS_OUTBD_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_OUTBDS_OUTBD_Pos)

/* DIRTYBIT @Bit 0 : Read OUTB and OUT parallel write Dirty status */
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Pos (0UL)
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Msk (0x1UL << VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Pos)
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_CLEAN (0x0UL)
  #define VPRCSR_NORDIC_OUTBDS_DIRTYBIT_DIRTY (0x1UL)


/**
  * @brief OUTMODE [VPRCSR_NORDIC_OUTMODE] Serial output mode
  */
  #define VPRCSR_NORDIC_OUTMODE (0x00000BE3ul)
  #define VPRCSR_NORDIC_OUTMODE_ResetValue (0x00000000UL)

/* MODE @Bits 0..2 : Mode */
  #define VPRCSR_NORDIC_OUTMODE_MODE_Pos (0UL)
  #define VPRCSR_NORDIC_OUTMODE_MODE_Msk (0x7UL << VPRCSR_NORDIC_OUTMODE_MODE_Pos)
  #define VPRCSR_NORDIC_OUTMODE_MODE_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTMODE_MODE_Max (0x4UL)
  #define VPRCSR_NORDIC_OUTMODE_MODE_NoShifting (0x0UL)
  #define VPRCSR_NORDIC_OUTMODE_MODE_OutBBuf (0x2UL)
  #define VPRCSR_NORDIC_OUTMODE_MODE_OutBBufToggleClk (0x4UL)

/* SHIFTMODE @Bit 0 : Shift mode */
  #define VPRCSR_NORDIC_OUTMODE_SHIFTMODE_Pos (0UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFTMODE_Msk (0x1UL << VPRCSR_NORDIC_OUTMODE_SHIFTMODE_Pos)
  #define VPRCSR_NORDIC_OUTMODE_SHIFTMODE_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFTMODE_Max (0x1UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFTMODE_Disabled (0x0UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFTMODE_Enabled (0x1UL)

/* FRAMEWIDTH @Bits 16..20 : Frame width in bits */
  #define VPRCSR_NORDIC_OUTMODE_FRAMEWIDTH_Pos (16UL)
  #define VPRCSR_NORDIC_OUTMODE_FRAMEWIDTH_Msk (0x1FUL << VPRCSR_NORDIC_OUTMODE_FRAMEWIDTH_Pos) /*!< Bit mask of FRAMEWIDTH
                                                                            field.*/
  #define VPRCSR_NORDIC_OUTMODE_FRAMEWIDTH_Min (0x00UL)
  #define VPRCSR_NORDIC_OUTMODE_FRAMEWIDTH_Max (0x10UL)

/* SHIFSIZE @Bits 16..19 : Shift size. Only applies if Shift mode is enabled */
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_Pos (16UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_Msk (0xFUL << VPRCSR_NORDIC_OUTMODE_SHIFSIZE_Pos)
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_Max (0x4UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_SHIFT1 (0x0UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_SHIFT2 (0x1UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_SHIFT4 (0x2UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_SHIFT8 (0x3UL)
  #define VPRCSR_NORDIC_OUTMODE_SHIFSIZE_SHIFT16 (0x4UL)


/**
  * @brief OUTMODEB [VPRCSR_NORDIC_OUTMODEB] Buffered OUTMODE register
  */
  #define VPRCSR_NORDIC_OUTMODEB (0x00000BE4ul)
  #define VPRCSR_NORDIC_OUTMODEB_ResetValue (0x00000000UL)

/* MODE @Bits 0..2 : Mode */
  #define VPRCSR_NORDIC_OUTMODEB_MODE_Pos (0UL)
  #define VPRCSR_NORDIC_OUTMODEB_MODE_Msk (0x7UL << VPRCSR_NORDIC_OUTMODEB_MODE_Pos)
  #define VPRCSR_NORDIC_OUTMODEB_MODE_Min (0x0UL)
  #define VPRCSR_NORDIC_OUTMODEB_MODE_Max (0x4UL)
  #define VPRCSR_NORDIC_OUTMODEB_MODE_NoShifting (0x0UL)
  #define VPRCSR_NORDIC_OUTMODEB_MODE_OutBBuf (0x2UL)
  #define VPRCSR_NORDIC_OUTMODEB_MODE_OutBBufToggleClk (0x4UL)

/* FRAMEWIDTH @Bits 16..20 : Frame width in bits */
  #define VPRCSR_NORDIC_OUTMODEB_FRAMEWIDTH_Pos (16UL)
  #define VPRCSR_NORDIC_OUTMODEB_FRAMEWIDTH_Msk (0x1FUL << VPRCSR_NORDIC_OUTMODEB_FRAMEWIDTH_Pos) /*!< Bit mask of FRAMEWIDTH
                                                                            field.*/
  #define VPRCSR_NORDIC_OUTMODEB_FRAMEWIDTH_Min (0x00UL)
  #define VPRCSR_NORDIC_OUTMODEB_FRAMEWIDTH_Max (0x10UL)


/**
  * @brief INMODEB [VPRCSR_NORDIC_INMODEB] Buffered INMODE register
  */
  #define VPRCSR_NORDIC_INMODEB (0x00000BE5ul)
  #define VPRCSR_NORDIC_INMODEB_ResetValue (0x00000000UL)

/* MODE @Bits 0..1 : Input Mode */
  #define VPRCSR_NORDIC_INMODEB_MODE_Pos (0UL)
  #define VPRCSR_NORDIC_INMODEB_MODE_Msk (0x3UL << VPRCSR_NORDIC_INMODEB_MODE_Pos)
  #define VPRCSR_NORDIC_INMODEB_MODE_Min (0x0UL)
  #define VPRCSR_NORDIC_INMODEB_MODE_Max (0x2UL)
  #define VPRCSR_NORDIC_INMODEB_MODE_CONTINUOUS (0x0UL)
  #define VPRCSR_NORDIC_INMODEB_MODE_EVENT (0x1UL)
  #define VPRCSR_NORDIC_INMODEB_MODE_SHIFT (0x2UL)


/**
  * @brief INB [VPRCSR_NORDIC_INB] Buffered GPIO input
  */
  #define VPRCSR_NORDIC_INB (0x00000BE6ul)
  #define VPRCSR_NORDIC_INB_ResetValue (0x00000000UL)

