pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN0_Pos (0UL)
  #define VPRCSR_NORDIC_INB_PIN0_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN0_Pos)
  #define VPRCSR_NORDIC_INB_PIN0_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN0_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN0_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN0_HIGH (0x1UL)

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN1_Pos (1UL)
  #define VPRCSR_NORDIC_INB_PIN1_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN1_Pos)
  #define VPRCSR_NORDIC_INB_PIN1_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN1_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN1_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN1_HIGH (0x1UL)

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN2_Pos (2UL)
  #define VPRCSR_NORDIC_INB_PIN2_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN2_Pos)
  #define VPRCSR_NORDIC_INB_PIN2_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN2_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN2_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN2_HIGH (0x1UL)

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN3_Pos (3UL)
  #define VPRCSR_NORDIC_INB_PIN3_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN3_Pos)
  #define VPRCSR_NORDIC_INB_PIN3_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN3_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN3_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN3_HIGH (0x1UL)

/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN4_Pos (4UL)
  #define VPRCSR_NORDIC_INB_PIN4_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN4_Pos)
  #define VPRCSR_NORDIC_INB_PIN4_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN4_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN4_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN4_HIGH (0x1UL)

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN5_Pos (5UL)
  #define VPRCSR_NORDIC_INB_PIN5_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN5_Pos)
  #define VPRCSR_NORDIC_INB_PIN5_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN5_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN5_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN5_HIGH (0x1UL)

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN6_Pos (6UL)
  #define VPRCSR_NORDIC_INB_PIN6_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN6_Pos)
  #define VPRCSR_NORDIC_INB_PIN6_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN6_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN6_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN6_HIGH (0x1UL)

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN7_Pos (7UL)
  #define VPRCSR_NORDIC_INB_PIN7_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN7_Pos)
  #define VPRCSR_NORDIC_INB_PIN7_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN7_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN7_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN7_HIGH (0x1UL)

/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN8_Pos (8UL)
  #define VPRCSR_NORDIC_INB_PIN8_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN8_Pos)
  #define VPRCSR_NORDIC_INB_PIN8_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN8_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN8_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN8_HIGH (0x1UL)

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN9_Pos (9UL)
  #define VPRCSR_NORDIC_INB_PIN9_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN9_Pos)
  #define VPRCSR_NORDIC_INB_PIN9_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN9_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN9_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN9_HIGH (0x1UL)

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN10_Pos (10UL)
  #define VPRCSR_NORDIC_INB_PIN10_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN10_Pos)
  #define VPRCSR_NORDIC_INB_PIN10_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN10_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN10_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN10_HIGH (0x1UL)

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN11_Pos (11UL)
  #define VPRCSR_NORDIC_INB_PIN11_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN11_Pos)
  #define VPRCSR_NORDIC_INB_PIN11_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN11_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN11_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN11_HIGH (0x1UL)

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN12_Pos (12UL)
  #define VPRCSR_NORDIC_INB_PIN12_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN12_Pos)
  #define VPRCSR_NORDIC_INB_PIN12_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN12_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN12_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN12_HIGH (0x1UL)

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN13_Pos (13UL)
  #define VPRCSR_NORDIC_INB_PIN13_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN13_Pos)
  #define VPRCSR_NORDIC_INB_PIN13_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN13_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN13_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN13_HIGH (0x1UL)

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN14_Pos (14UL)
  #define VPRCSR_NORDIC_INB_PIN14_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN14_Pos)
  #define VPRCSR_NORDIC_INB_PIN14_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN14_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN14_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN14_HIGH (0x1UL)

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_INB_PIN15_Pos (15UL)
  #define VPRCSR_NORDIC_INB_PIN15_Msk (0x1UL << VPRCSR_NORDIC_INB_PIN15_Pos)
  #define VPRCSR_NORDIC_INB_PIN15_Min (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN15_Max (0x1UL)
  #define VPRCSR_NORDIC_INB_PIN15_LOW (0x0UL)
  #define VPRCSR_NORDIC_INB_PIN15_HIGH (0x1UL)




/* =========================================================================================================================== */
/* ================                                         VPRPUBLIC                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct VPRPUBLIC ===================================================== */
/**
  * @brief VPR peripheral registers
  */
  typedef struct {
    __OM uint32_t TASKS_TRIGGER[32];
  } NRF_VPRPUBLIC_Type;

