pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* VPRPUBLIC_TASKS_TRIGGER: VPR task [n] register */
  #define VPRPUBLIC_TASKS_TRIGGER_MaxCount (32UL)
  #define VPRPUBLIC_TASKS_TRIGGER_MaxIndex (31UL)
  #define VPRPUBLIC_TASKS_TRIGGER_MinIndex (0UL)
  #define VPRPUBLIC_TASKS_TRIGGER_ResetValue (0x00000000UL)

/* TASKS_TRIGGER @Bit 0 : VPR task [n] register */
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Pos (0UL)
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Msk (0x1UL << VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Pos) /*!< Bit mask of
                                                                            TASKS_TRIGGER field.*/
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Min (0x1UL)
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Max (0x1UL)
  #define VPRPUBLIC_TASKS_TRIGGER_TASKS_TRIGGER_Trigger (0x1UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           VTIM                                           ================ */
/* =========================================================================================================================== */

/**
  * @brief VTIM CSR registers
  */


/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct WDT ======================================================== */
/**
  * @brief Watchdog Timer
  */
  typedef struct {
    __OM uint32_t TASKS_START;
    __OM uint32_t TASKS_STOP;
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;
    __IOM uint32_t SUBSCRIBE_STOP;
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_TIMEOUT;
    __IOM uint32_t EVENTS_STOPPED;
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_TIMEOUT;
    __IOM uint32_t PUBLISH_STOPPED;
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTENSET;
    __IOM uint32_t INTENCLR;
    __IM uint32_t RESERVED4[6];
    __IOM uint32_t NMIENSET;
    __IOM uint32_t NMIENCLR;
    __IM uint32_t RESERVED5[53];
    __IM uint32_t RUNSTATUS;
    __IM uint32_t REQSTATUS;
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t CRV;
    __IOM uint32_t RREN;
    __IOM uint32_t CONFIG;
    __IM uint32_t RESERVED7[4];
    __OM uint32_t TSEN;
    __IM uint32_t RESERVED8[55];
    __OM uint32_t RR[8];
  } NRF_WDT_Type;

/* WDT_TASKS_START: Start WDT */
  #define WDT_TASKS_START_ResetValue (0x00000000UL)

/* TASKS_START @Bit 0 : Start WDT */
  #define WDT_TASKS_START_TASKS_START_Pos (0UL)
  #define WDT_TASKS_START_TASKS_START_Msk (0x1UL << WDT_TASKS_START_TASKS_START_Pos)
  #define WDT_TASKS_START_TASKS_START_Min (0x1UL)
  #define WDT_TASKS_START_TASKS_START_Max (0x1UL)
  #define WDT_TASKS_START_TASKS_START_Trigger (0x1UL)


/* WDT_TASKS_STOP: Stop WDT */
  #define WDT_TASKS_STOP_ResetValue (0x00000000UL)

/* TASKS_STOP @Bit 0 : Stop WDT */
  #define WDT_TASKS_STOP_TASKS_STOP_Pos (0UL)
  #define WDT_TASKS_STOP_TASKS_STOP_Msk (0x1UL << WDT_TASKS_STOP_TASKS_STOP_Pos)
  #define WDT_TASKS_STOP_TASKS_STOP_Min (0x1UL)
  #define WDT_TASKS_STOP_TASKS_STOP_Max (0x1UL)
  #define WDT_TASKS_STOP_TASKS_STOP_Trigger (0x1UL)


/* WDT_SUBSCRIBE_START: Subscribe configuration for task START */
  #define WDT_SUBSCRIBE_START_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define WDT_SUBSCRIBE_START_CHIDX_Pos (0UL)
  #define WDT_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << WDT_SUBSCRIBE_START_CHIDX_Pos)
  #define WDT_SUBSCRIBE_START_CHIDX_Min (0x00UL)
  #define WDT_SUBSCRIBE_START_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define WDT_SUBSCRIBE_START_EN_Pos (31UL)
  #define WDT_SUBSCRIBE_START_EN_Msk (0x1UL << WDT_SUBSCRIBE_START_EN_Pos)
  #define WDT_SUBSCRIBE_START_EN_Min (0x0UL)
  #define WDT_SUBSCRIBE_START_EN_Max (0x1UL)
  #define WDT_SUBSCRIBE_START_EN_Disabled (0x0UL)
  #define WDT_SUBSCRIBE_START_EN_Enabled (0x1UL)


/* WDT_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define WDT_SUBSCRIBE_STOP_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define WDT_SUBSCRIBE_STOP_CHIDX_Pos (0UL)
  #define WDT_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << WDT_SUBSCRIBE_STOP_CHIDX_Pos)
  #define WDT_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)
  #define WDT_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define WDT_SUBSCRIBE_STOP_EN_Pos (31UL)
  #define WDT_SUBSCRIBE_STOP_EN_Msk (0x1UL << WDT_SUBSCRIBE_STOP_EN_Pos)
  #define WDT_SUBSCRIBE_STOP_EN_Min (0x0UL)
  #define WDT_SUBSCRIBE_STOP_EN_Max (0x1UL)
  #define WDT_SUBSCRIBE_STOP_EN_Disabled (0x0UL)
  #define WDT_SUBSCRIBE_STOP_EN_Enabled (0x1UL)


/* WDT_EVENTS_TIMEOUT: Watchdog timeout */
  #define WDT_EVENTS_TIMEOUT_ResetValue (0x00000000UL)

/* EVENTS_TIMEOUT @Bit 0 : Watchdog timeout */
  #define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Pos (0UL)
  #define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Msk (0x1UL << WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Pos) /*!< Bit mask of EVENTS_TIMEOUT
                                                                            field.*/
  #define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Min (0x0UL)
  #define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Max (0x1UL)
  #define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_NotGenerated (0x0UL)
  #define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Generated (0x1UL)


/* WDT_EVENTS_STOPPED: Watchdog stopped */
  #define WDT_EVENTS_STOPPED_ResetValue (0x00000000UL)

/* EVENTS_STOPPED @Bit 0 : Watchdog stopped */
  #define WDT_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL)
  #define WDT_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << WDT_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/
  #define WDT_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL)
  #define WDT_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL)
  #define WDT_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL)
  #define WDT_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL)


/* WDT_PUBLISH_TIMEOUT: Publish configuration for event TIMEOUT */
  #define WDT_PUBLISH_TIMEOUT_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event TIMEOUT will publish to */
  #define WDT_PUBLISH_TIMEOUT_CHIDX_Pos (0UL)
  #define WDT_PUBLISH_TIMEOUT_CHIDX_Msk (0xFFUL << WDT_PUBLISH_TIMEOUT_CHIDX_Pos)
  #define WDT_PUBLISH_TIMEOUT_CHIDX_Min (0x00UL)
  #define WDT_PUBLISH_TIMEOUT_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define WDT_PUBLISH_TIMEOUT_EN_Pos (31UL)
  #define WDT_PUBLISH_TIMEOUT_EN_Msk (0x1UL << WDT_PUBLISH_TIMEOUT_EN_Pos)
  #define WDT_PUBLISH_TIMEOUT_EN_Min (0x0UL)
  #define WDT_PUBLISH_TIMEOUT_EN_Max (0x1UL)
  #define WDT_PUBLISH_TIMEOUT_EN_Disabled (0x0UL)
  #define WDT_PUBLISH_TIMEOUT_EN_Enabled (0x1UL)


/* WDT_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define WDT_PUBLISH_STOPPED_ResetValue (0x00000000UL)

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define WDT_PUBLISH_STOPPED_CHIDX_Pos (0UL)
  #define WDT_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << WDT_PUBLISH_STOPPED_CHIDX_Pos)
  #define WDT_PUBLISH_STOPPED_CHIDX_Min (0x00UL)
  #define WDT_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)

/* EN @Bit 31 : (unspecified) */
  #define WDT_PUBLISH_STOPPED_EN_Pos (31UL)
  #define WDT_PUBLISH_STOPPED_EN_Msk (0x1UL << WDT_PUBLISH_STOPPED_EN_Pos)
  #define WDT_PUBLISH_STOPPED_EN_Min (0x0UL)
  #define WDT_PUBLISH_STOPPED_EN_Max (0x1UL)
  #define WDT_PUBLISH_STOPPED_EN_Disabled (0x0UL)
  #define WDT_PUBLISH_STOPPED_EN_Enabled (0x1UL)


/* WDT_INTENSET: Enable interrupt */
  #define WDT_INTENSET_ResetValue (0x00000000UL)

