pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* TIMEOUT @Bit 0 : Write '1' to enable interrupt for event TIMEOUT */
  #define WDT_INTENSET_TIMEOUT_Pos (0UL)
  #define WDT_INTENSET_TIMEOUT_Msk (0x1UL << WDT_INTENSET_TIMEOUT_Pos)
  #define WDT_INTENSET_TIMEOUT_Min (0x0UL)
  #define WDT_INTENSET_TIMEOUT_Max (0x1UL)
  #define WDT_INTENSET_TIMEOUT_Set (0x1UL)
  #define WDT_INTENSET_TIMEOUT_Disabled (0x0UL)
  #define WDT_INTENSET_TIMEOUT_Enabled (0x1UL)

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define WDT_INTENSET_STOPPED_Pos (1UL)
  #define WDT_INTENSET_STOPPED_Msk (0x1UL << WDT_INTENSET_STOPPED_Pos)
  #define WDT_INTENSET_STOPPED_Min (0x0UL)
  #define WDT_INTENSET_STOPPED_Max (0x1UL)
  #define WDT_INTENSET_STOPPED_Set (0x1UL)
  #define WDT_INTENSET_STOPPED_Disabled (0x0UL)
  #define WDT_INTENSET_STOPPED_Enabled (0x1UL)


/* WDT_INTENCLR: Disable interrupt */
  #define WDT_INTENCLR_ResetValue (0x00000000UL)

/* TIMEOUT @Bit 0 : Write '1' to disable interrupt for event TIMEOUT */
  #define WDT_INTENCLR_TIMEOUT_Pos (0UL)
  #define WDT_INTENCLR_TIMEOUT_Msk (0x1UL << WDT_INTENCLR_TIMEOUT_Pos)
  #define WDT_INTENCLR_TIMEOUT_Min (0x0UL)
  #define WDT_INTENCLR_TIMEOUT_Max (0x1UL)
  #define WDT_INTENCLR_TIMEOUT_Clear (0x1UL)
  #define WDT_INTENCLR_TIMEOUT_Disabled (0x0UL)
  #define WDT_INTENCLR_TIMEOUT_Enabled (0x1UL)

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define WDT_INTENCLR_STOPPED_Pos (1UL)
  #define WDT_INTENCLR_STOPPED_Msk (0x1UL << WDT_INTENCLR_STOPPED_Pos)
  #define WDT_INTENCLR_STOPPED_Min (0x0UL)
  #define WDT_INTENCLR_STOPPED_Max (0x1UL)
  #define WDT_INTENCLR_STOPPED_Clear (0x1UL)
  #define WDT_INTENCLR_STOPPED_Disabled (0x0UL)
  #define WDT_INTENCLR_STOPPED_Enabled (0x1UL)


/* WDT_NMIENSET: Enable interrupt */
  #define WDT_NMIENSET_ResetValue (0x00000000UL)

/* TIMEOUT @Bit 0 : Write '1' to enable interrupt for event TIMEOUT */
  #define WDT_NMIENSET_TIMEOUT_Pos (0UL)
  #define WDT_NMIENSET_TIMEOUT_Msk (0x1UL << WDT_NMIENSET_TIMEOUT_Pos)
  #define WDT_NMIENSET_TIMEOUT_Min (0x0UL)
  #define WDT_NMIENSET_TIMEOUT_Max (0x1UL)
  #define WDT_NMIENSET_TIMEOUT_Set (0x1UL)
  #define WDT_NMIENSET_TIMEOUT_Disabled (0x0UL)
  #define WDT_NMIENSET_TIMEOUT_Enabled (0x1UL)

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define WDT_NMIENSET_STOPPED_Pos (1UL)
  #define WDT_NMIENSET_STOPPED_Msk (0x1UL << WDT_NMIENSET_STOPPED_Pos)
  #define WDT_NMIENSET_STOPPED_Min (0x0UL)
  #define WDT_NMIENSET_STOPPED_Max (0x1UL)
  #define WDT_NMIENSET_STOPPED_Set (0x1UL)
  #define WDT_NMIENSET_STOPPED_Disabled (0x0UL)
  #define WDT_NMIENSET_STOPPED_Enabled (0x1UL)


/* WDT_NMIENCLR: Disable interrupt */
  #define WDT_NMIENCLR_ResetValue (0x00000000UL)

/* TIMEOUT @Bit 0 : Write '1' to disable interrupt for event TIMEOUT */
  #define WDT_NMIENCLR_TIMEOUT_Pos (0UL)
  #define WDT_NMIENCLR_TIMEOUT_Msk (0x1UL << WDT_NMIENCLR_TIMEOUT_Pos)
  #define WDT_NMIENCLR_TIMEOUT_Min (0x0UL)
  #define WDT_NMIENCLR_TIMEOUT_Max (0x1UL)
  #define WDT_NMIENCLR_TIMEOUT_Clear (0x1UL)
  #define WDT_NMIENCLR_TIMEOUT_Disabled (0x0UL)
  #define WDT_NMIENCLR_TIMEOUT_Enabled (0x1UL)

/* STOPPED @Bit 1 : Write '1' to disable interrupt for event STOPPED */
  #define WDT_NMIENCLR_STOPPED_Pos (1UL)
  #define WDT_NMIENCLR_STOPPED_Msk (0x1UL << WDT_NMIENCLR_STOPPED_Pos)
  #define WDT_NMIENCLR_STOPPED_Min (0x0UL)
  #define WDT_NMIENCLR_STOPPED_Max (0x1UL)
  #define WDT_NMIENCLR_STOPPED_Clear (0x1UL)
  #define WDT_NMIENCLR_STOPPED_Disabled (0x0UL)
  #define WDT_NMIENCLR_STOPPED_Enabled (0x1UL)


/* WDT_RUNSTATUS: Run status */
  #define WDT_RUNSTATUS_ResetValue (0x00000000UL)

/* RUNSTATUSWDT @Bit 0 : Indicates whether or not WDT is running */
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Pos (0UL)
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Msk (0x1UL << WDT_RUNSTATUS_RUNSTATUSWDT_Pos)
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Min (0x0UL)
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Max (0x1UL)
  #define WDT_RUNSTATUS_RUNSTATUSWDT_NotRunning (0x0UL)
  #define WDT_RUNSTATUS_RUNSTATUSWDT_Running (0x1UL)


/* WDT_REQSTATUS: Request status */
  #define WDT_REQSTATUS_ResetValue (0x00000001UL)

/* RR0 @Bit 0 : Request status for RR[0] register */
  #define WDT_REQSTATUS_RR0_Pos (0UL)
  #define WDT_REQSTATUS_RR0_Msk (0x1UL << WDT_REQSTATUS_RR0_Pos)
  #define WDT_REQSTATUS_RR0_Min (0x0UL)
  #define WDT_REQSTATUS_RR0_Max (0x1UL)
  #define WDT_REQSTATUS_RR0_DisabledOrRequested (0x0UL)
  #define WDT_REQSTATUS_RR0_EnabledAndUnrequested (0x1UL)

/* RR1 @Bit 1 : Request status for RR[1] register */
  #define WDT_REQSTATUS_RR1_Pos (1UL)
  #define WDT_REQSTATUS_RR1_Msk (0x1UL << WDT_REQSTATUS_RR1_Pos)
  #define WDT_REQSTATUS_RR1_Min (0x0UL)
  #define WDT_REQSTATUS_RR1_Max (0x1UL)
  #define WDT_REQSTATUS_RR1_DisabledOrRequested (0x0UL)
  #define WDT_REQSTATUS_RR1_EnabledAndUnrequested (0x1UL)

/* RR2 @Bit 2 : Request status for RR[2] register */
  #define WDT_REQSTATUS_RR2_Pos (2UL)
  #define WDT_REQSTATUS_RR2_Msk (0x1UL << WDT_REQSTATUS_RR2_Pos)
  #define WDT_REQSTATUS_RR2_Min (0x0UL)
  #define WDT_REQSTATUS_RR2_Max (0x1UL)
  #define WDT_REQSTATUS_RR2_DisabledOrRequested (0x0UL)
  #define WDT_REQSTATUS_RR2_EnabledAndUnrequested (0x1UL)

/* RR3 @Bit 3 : Request status for RR[3] register */
  #define WDT_REQSTATUS_RR3_Pos (3UL)
  #define WDT_REQSTATUS_RR3_Msk (0x1UL << WDT_REQSTATUS_RR3_Pos)
  #define WDT_REQSTATUS_RR3_Min (0x0UL)
  #define WDT_REQSTATUS_RR3_Max (0x1UL)
  #define WDT_REQSTATUS_RR3_DisabledOrRequested (0x0UL)
  #define WDT_REQSTATUS_RR3_EnabledAndUnrequested (0x1UL)

/* RR4 @Bit 4 : Request status for RR[4] register */
  #define WDT_REQSTATUS_RR4_Pos (4UL)
  #define WDT_REQSTATUS_RR4_Msk (0x1UL << WDT_REQSTATUS_RR4_Pos)
  #define WDT_REQSTATUS_RR4_Min (0x0UL)
  #define WDT_REQSTATUS_RR4_Max (0x1UL)
  #define WDT_REQSTATUS_RR4_DisabledOrRequested (0x0UL)
  #define WDT_REQSTATUS_RR4_EnabledAndUnrequested (0x1UL)

/* RR5 @Bit 5 : Request status for RR[5] register */
  #define WDT_REQSTATUS_RR5_Pos (5UL)
  #define WDT_REQSTATUS_RR5_Msk (0x1UL << WDT_REQSTATUS_RR5_Pos)
  #define WDT_REQSTATUS_RR5_Min (0x0UL)
  #define WDT_REQSTATUS_RR5_Max (0x1UL)
  #define WDT_REQSTATUS_RR5_DisabledOrRequested (0x0UL)
  #define WDT_REQSTATUS_RR5_EnabledAndUnrequested (0x1UL)

/* RR6 @Bit 6 : Request status for RR[6] register */
  #define WDT_REQSTATUS_RR6_Pos (6UL)
  #define WDT_REQSTATUS_RR6_Msk (0x1UL << WDT_REQSTATUS_RR6_Pos)
  #define WDT_REQSTATUS_RR6_Min (0x0UL)
  #define WDT_REQSTATUS_RR6_Max (0x1UL)
  #define WDT_REQSTATUS_RR6_DisabledOrRequested (0x0UL)
  #define WDT_REQSTATUS_RR6_EnabledAndUnrequested (0x1UL)

/* RR7 @Bit 7 : Request status for RR[7] register */
  #define WDT_REQSTATUS_RR7_Pos (7UL)
  #define WDT_REQSTATUS_RR7_Msk (0x1UL << WDT_REQSTATUS_RR7_Pos)
  #define WDT_REQSTATUS_RR7_Min (0x0UL)
  #define WDT_REQSTATUS_RR7_Max (0x1UL)
  #define WDT_REQSTATUS_RR7_DisabledOrRequested (0x0UL)
  #define WDT_REQSTATUS_RR7_EnabledAndUnrequested (0x1UL)


/* WDT_CRV: Counter reload value */
  #define WDT_CRV_ResetValue (0xFFFFFFFFUL)

/* CRV @Bits 0..31 : Counter reload value in number of cycles of the 32.768 kHz clock */
  #define WDT_CRV_CRV_Pos (0UL)
  #define WDT_CRV_CRV_Msk (0xFFFFFFFFUL << WDT_CRV_CRV_Pos)
  #define WDT_CRV_CRV_Min (0x0000000FUL)
  #define WDT_CRV_CRV_Max (0xFFFFFFFFUL)


/* WDT_RREN: Enable register for reload request registers */
  #define WDT_RREN_ResetValue (0x00000001UL)

/* RR0 @Bit 0 : Enable or disable RR[0] register */
  #define WDT_RREN_RR0_Pos (0UL)
  #define WDT_RREN_RR0_Msk (0x1UL << WDT_RREN_RR0_Pos)
  #define WDT_RREN_RR0_Min (0x0UL)
  #define WDT_RREN_RR0_Max (0x1UL)
  #define WDT_RREN_RR0_Disabled (0x0UL)
  #define WDT_RREN_RR0_Enabled (0x1UL)

/* RR1 @Bit 1 : Enable or disable RR[1] register */
  #define WDT_RREN_RR1_Pos (1UL)
  #define WDT_RREN_RR1_Msk (0x1UL << WDT_RREN_RR1_Pos)
  #define WDT_RREN_RR1_Min (0x0UL)
  #define WDT_RREN_RR1_Max (0x1UL)
  #define WDT_RREN_RR1_Disabled (0x0UL)
  #define WDT_RREN_RR1_Enabled (0x1UL)

/* RR2 @Bit 2 : Enable or disable RR[2] register */
  #define WDT_RREN_RR2_Pos (2UL)
  #define WDT_RREN_RR2_Msk (0x1UL << WDT_RREN_RR2_Pos)
  #define WDT_RREN_RR2_Min (0x0UL)
  #define WDT_RREN_RR2_Max (0x1UL)
  #define WDT_RREN_RR2_Disabled (0x0UL)
  #define WDT_RREN_RR2_Enabled (0x1UL)

/* RR3 @Bit 3 : Enable or disable RR[3] register */
  #define WDT_RREN_RR3_Pos (3UL)
  #define WDT_RREN_RR3_Msk (0x1UL << WDT_RREN_RR3_Pos)
  #define WDT_RREN_RR3_Min (0x0UL)
  #define WDT_RREN_RR3_Max (0x1UL)
  #define WDT_RREN_RR3_Disabled (0x0UL)
  #define WDT_RREN_RR3_Enabled (0x1UL)

/* RR4 @Bit 4 : Enable or disable RR[4] register */
  #define WDT_RREN_RR4_Pos (4UL)
  #define WDT_RREN_RR4_Msk (0x1UL << WDT_RREN_RR4_Pos)
  #define WDT_RREN_RR4_Min (0x0UL)
  #define WDT_RREN_RR4_Max (0x1UL)
  #define WDT_RREN_RR4_Disabled (0x0UL)
  #define WDT_RREN_RR4_Enabled (0x1UL)

/* RR5 @Bit 5 : Enable or disable RR[5] register */
  #define WDT_RREN_RR5_Pos (5UL)
  #define WDT_RREN_RR5_Msk (0x1UL << WDT_RREN_RR5_Pos)
  #define WDT_RREN_RR5_Min (0x0UL)
  #define WDT_RREN_RR5_Max (0x1UL)
  #define WDT_RREN_RR5_Disabled (0x0UL)
  #define WDT_RREN_RR5_Enabled (0x1UL)

