pennam/ArduinoCore-zephyr/variants/arduino_nicla_sense_me_nrf52832/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_types.h
/* RR6 @Bit 6 : Enable or disable RR[6] register */
  #define WDT_RREN_RR6_Pos (6UL)
  #define WDT_RREN_RR6_Msk (0x1UL << WDT_RREN_RR6_Pos)
  #define WDT_RREN_RR6_Min (0x0UL)
  #define WDT_RREN_RR6_Max (0x1UL)
  #define WDT_RREN_RR6_Disabled (0x0UL)
  #define WDT_RREN_RR6_Enabled (0x1UL)

/* RR7 @Bit 7 : Enable or disable RR[7] register */
  #define WDT_RREN_RR7_Pos (7UL)
  #define WDT_RREN_RR7_Msk (0x1UL << WDT_RREN_RR7_Pos)
  #define WDT_RREN_RR7_Min (0x0UL)
  #define WDT_RREN_RR7_Max (0x1UL)
  #define WDT_RREN_RR7_Disabled (0x0UL)
  #define WDT_RREN_RR7_Enabled (0x1UL)


/* WDT_CONFIG: Configuration register */
  #define WDT_CONFIG_ResetValue (0x00000001UL)

/* SLEEP @Bit 0 : Configure WDT to either be paused, or kept running, while the CPU is sleeping */
  #define WDT_CONFIG_SLEEP_Pos (0UL)
  #define WDT_CONFIG_SLEEP_Msk (0x1UL << WDT_CONFIG_SLEEP_Pos)
  #define WDT_CONFIG_SLEEP_Min (0x0UL)
  #define WDT_CONFIG_SLEEP_Max (0x1UL)
  #define WDT_CONFIG_SLEEP_Pause (0x0UL)
  #define WDT_CONFIG_SLEEP_Run (0x1UL)

/* HALT @Bit 3 : Configure WDT to either be paused, or kept running, while the CPU is halted by the debugger */
  #define WDT_CONFIG_HALT_Pos (3UL)
  #define WDT_CONFIG_HALT_Msk (0x1UL << WDT_CONFIG_HALT_Pos)
  #define WDT_CONFIG_HALT_Min (0x0UL)
  #define WDT_CONFIG_HALT_Max (0x1UL)
  #define WDT_CONFIG_HALT_Pause (0x0UL)
  #define WDT_CONFIG_HALT_Run (0x1UL)

/* STOPEN @Bit 6 : Allow stopping WDT */
  #define WDT_CONFIG_STOPEN_Pos (6UL)
  #define WDT_CONFIG_STOPEN_Msk (0x1UL << WDT_CONFIG_STOPEN_Pos)
  #define WDT_CONFIG_STOPEN_Min (0x0UL)
  #define WDT_CONFIG_STOPEN_Max (0x1UL)
  #define WDT_CONFIG_STOPEN_Disable (0x0UL)
  #define WDT_CONFIG_STOPEN_Enable (0x1UL)


/* WDT_TSEN: Task stop enable */
  #define WDT_TSEN_ResetValue (0x00000000UL)

/* TSEN @Bits 0..31 : Allow stopping WDT */
  #define WDT_TSEN_TSEN_Pos (0UL)
  #define WDT_TSEN_TSEN_Msk (0xFFFFFFFFUL << WDT_TSEN_TSEN_Pos)
  #define WDT_TSEN_TSEN_Min (0x6E524635UL)
  #define WDT_TSEN_TSEN_Max (0x6E524635UL)
  #define WDT_TSEN_TSEN_Enable (0x6E524635UL)


/* WDT_RR: Reload request n */
  #define WDT_RR_MaxCount (8UL)
  #define WDT_RR_MaxIndex (7UL)
  #define WDT_RR_MinIndex (0UL)
  #define WDT_RR_ResetValue (0x00000000UL)

/* RR @Bits 0..31 : Reload request register */
  #define WDT_RR_RR_Pos (0UL)
  #define WDT_RR_RR_Msk (0xFFFFFFFFUL << WDT_RR_RR_Pos)
  #define WDT_RR_RR_Min (0x6E524635UL)
  #define WDT_RR_RR_Max (0x6E524635UL)
  #define WDT_RR_RR_Reload (0x6E524635UL)


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF9230_ENGB_TYPES_H */

